
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.СделкиСКлиентами") Тогда
		ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка; 
		ЭтотОбъект.ID_DEAL=ДанныеЗаполнения.Ссылка.ID;
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Партнер) Тогда 
			Партнер = ДанныеЗаполнения.Партнер;
			ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(ДанныеЗаполнения.Партнер, Контрагент);
		Иначе
			Партнер = ДанныеЗаполнения.Наименование;
		КонецЕсли;	              
		ЭтотОбъект.ВыполненныеРаботы.Загрузить(ДанныеЗаполнения.Ссылка.Товары.Выгрузить());
		ЭтотОбъект.Комментарий=ДанныеЗаполнения.Ссылка.Комментарий;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		//Асист KS
		//ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка.Сделка;
		ЭтотОбъект.ДокументОснование = ДанныеЗаполнения.Ссылка;
		//Асист KS
		ЭтотОбъект.ВидРаботы=Справочники.ВидыРаботСервиса.ПодготовкаТехники;
		ЭтотОбъект.Техника.Загрузить(ДанныеЗаполнения.Ссылка.Товары.Выгрузить());
	КонецЕсли;
	
	Менеджер = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры
