
&НаСервере
Процедура СохранитьНаСервере()
	Для Каждого Стр из ВыданныеДокументы Цикл
		Если Стр.Количество>0 И Стр.Выдать = Истина Тогда
		Запись = РегистрыСведений.ДокументыВыданныеКлиенту.СоздатьМенеджерЗаписи();
		Запись.Реализация = РеализацияТоваровУслуг;
		Запись.ВыданныйДокумент = Стр.Документ;
		Запись.Количество = Стр.Количество;
		Запись.Записать();
		иначе 
		НаборЗаписей = РегистрыСведений.ДокументыВыданныеКлиенту.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Реализация.Установить(РеализацияТоваровУслуг);
		НаборЗаписей.Отбор.ВыданныйДокумент.Установить(Стр.Документ);
		НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РеализацияТоваровУслуг = Параметры.РеализацияТоваровУслуг;
	ЗаполнитьТаблицуДокументов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДокументов()
	
	ЭтаФорма.ВыданныеДокументы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДокументыДляВыдачиКлиенту.Ссылка КАК Документ,
	               |	ЕСТЬNULL(ДокументыВыданныеКлиенту.Количество, 1) КАК Количество,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ДокументыВыданныеКлиенту.Количество, 0) > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК Выдать
	               |ИЗ
	               |	Справочник.ДокументыДляВыдачиКлиенту КАК ДокументыДляВыдачиКлиенту
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыВыданныеКлиенту КАК ДокументыВыданныеКлиенту
	               |		ПО (ДокументыВыданныеКлиенту.ВыданныйДокумент = ДокументыДляВыдачиКлиенту.Ссылка)
	               |			И (ДокументыВыданныеКлиенту.Реализация = &Реализация)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДокументыДляВыдачиКлиенту.Наименование" 
	;
	
	Запрос.УстановитьПараметр("Реализация", РеализацияТоваровУслуг);
	
	ЭтаФорма.ВыданныеДокументы.Загрузить(Запрос.Выполнить().Выгрузить());
	
	//Для каждого СтрокаТаблицы Из ЭтаФорма.ВыданныеДокументы Цикл
	//		СтрокаТаблицы.СпособФормирования = Перечисления.СпособыФормированияСегментов.ПериодическиОбновлять;
	//КонецЦикла;
		
		
	
КонецПроцедуры // ЗаполнитьТаблицуСегментов()

&НаСервере
Процедура УдалитьНаСервере()
ВыделенныеСтроки = Элементы.ВыданныеДокументы.ВыделенныеСтроки;
Если ВыделенныеСтроки = Неопределено Тогда
	Возврат;
КонецЕсли;
	
Если ВыделенныеСтроки.Количество() = 0 Тогда
	Возврат;
КонецЕсли;
	НаборЗаписей = РегистрыСведений.ДокументыВыданныеКлиенту.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Реализация.Установить(РеализацияТоваровУслуг);
	НаборЗаписей.Отбор.ВыданныйДокумент.Установить(ВыделенныеСтроки.Документ);
	НаборЗаписей.Записать();
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	УдалитьНаСервере();
КонецПроцедуры
