// Определяет записываются ли при отложенном формировании движений.
// 
// Параметры:
//  Документ - ДокументОбъект -
// 
// Возвращаемое значение:
//  Булево
Функция ДвиженияЗаписываютсяПриВыполненииОперации(Документ) Экспорт

	Возврат Документ <> Неопределено 
		И Документ.ДополнительныеСвойства.Свойство(ИмяПризнакаВыполненияОперации());
	
КонецФункции


// Имя признака выполнения операции.
// 
// Возвращаемое значение:
//  Строка -  Имя признака выполнения операции
Функция ИмяПризнакаВыполненияОперации() Экспорт
	Возврат "ОтложенноеФормированиеДвиженийВНА";
КонецФункции

