Функция ИспользуетсяУправлениеВНА_2_4(Период) Экспорт

	ИспользуетсяУправлениеВНА_2_4 = Истина;
	
	//++ Локализация
	
	ДатаНачалаУчета = ДатаНачалаУчетаВнеоборотныхАктивов2_4();
	
	ИспользуетсяУправлениеВНА_2_4 = 
		(Период >= ДатаНачалаУчета
			ИЛИ Период = '000101010000' 
				И ТекущаяДатаСеанса() >= ДатаНачалаУчета);
					
	//-- Локализация

	Возврат ИспользуетсяУправлениеВНА_2_4;
	
КонецФункции          

// Возвращает дату начала учета внеоборотных активов версии 2.4.
// 
// Возвращаемое значение:
//  Дата - Дата начала учета.
//
Функция ДатаНачалаУчетаВнеоборотныхАктивов2_4() Экспорт

	ДатаНачалаУчета = '000101010000';
	
	//++ Локализация
	ДатаНачалаУчета = Константы.ДатаНачалаУчетаВнеоборотныхАктивов2_4.Получить();
	//-- Локализация
	
	Возврат ДатаНачалаУчета;
	
КонецФункции
 
