
&ИзменениеИКонтроль("ВыполнитьКомандуПечати")
Процедура асп_ВыполнитьКомандуПечати(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ВладелецФормы, ПараметрыПечати)

#Удаление
	Если Не ПроверитьКоличествоПереданныхОбъектов(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;

	ИмяПараметра = "СтандартныеПодсистемы.Печать.ВыполнитьКомандуПечати";
	СписокПереданныхПараметров = ПараметрыПриложения[ИмяПараметра];

	Если СписокПереданныхПараметров = Неопределено Тогда
		СписокПереданныхПараметров = Новый Массив;
		ПараметрыПриложения[ИмяПараметра] = СписокПереданныхПараметров;
	КонецЕсли;

	ПараметрыОткрытия = УправлениеПечатьюСлужебныйКлиент.ПараметрыОткрытияФормыПечати();
	ПараметрыОткрытия.ИмяМенеджераПечати = ИмяМенеджераПечати;
	ПараметрыОткрытия.ИменаМакетов = ИменаМакетов;
	ПараметрыОткрытия.ПараметрКоманды = МассивОбъектов;
	ПараметрыОткрытия.ПараметрыПечати = ПараметрыПечати;
	ПараметрыОткрытия.ВладелецФормы = ВладелецФормы;

	СписокПереданныхПараметров.Добавить(ПараметрыОткрытия);

	ПодключитьОбработчикОжидания("ПродолжитьВыполнениеКомандыПечатиСПереданнымиПараметрами", 0.1, Истина);
#КонецУдаления
#Вставка
Если НЕ ПроверитьКоличествоПереданныхОбъектов(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;
	//Если  ИмяМенеджераПечати = "Документ.РеализацияТоваровУслуг" 
	//		И  ИменаМакетов = "Накладная"
	//		И ?(ПараметрыПечати.Свойство("ВыводитьКомплектующие"), ПараметрыПечати.ВыводитьКомплектующие, Ложь) Тогда
	//	ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати");
	//	ПараметрыОткрытия.ИмяМенеджераПечати = ИмяМенеджераПечати;
	//	ПараметрыОткрытия.ИменаМакетов		 = ИменаМакетов;
	//	ПараметрыОткрытия.ПараметрКоманды	 = МассивОбъектов;
	//	ПараметрыОткрытия.ПараметрыПечати	 = ПараметрыПечати;
	//	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, Строка(Новый УникальныйИдентификатор));
	//Иначе
		ПараметрыОткрытия = УправлениеПечатьюСлужебныйКлиент.ПараметрыОткрытияФормыПечати();
		ПараметрыОткрытия.ИмяМенеджераПечати = ИмяМенеджераПечати;
		ПараметрыОткрытия.ИменаМакетов		 = ИменаМакетов;
		ПараметрыОткрытия.ПараметрКоманды	 = МассивОбъектов;
		ПараметрыОткрытия.ПараметрыПечати	 = ПараметрыПечати;
		
		Если ОбщегоНазначенияКлиент.ИнформационнаяБазаФайловая() Тогда
			ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ВладелецФормы, Строка(Новый УникальныйИдентификатор));
			Возврат;
		КонецЕсли;
		
		Если ВладелецФормы = Неопределено Тогда
			ПараметрыОткрытия.УникальныйИдентификаторХранилища = Новый УникальныйИдентификатор;
		Иначе  
			Если ТипЗнч(ВладелецФормы) = Тип("ПараметрыВыполненияКоманды") Тогда
				ПараметрыОткрытия.УникальныйИдентификаторХранилища = ВладелецФормы.Источник.УникальныйИдентификатор;
			Иначе
				ПараметрыОткрытия.УникальныйИдентификаторХранилища = ВладелецФормы.УникальныйИдентификатор;
			КонецЕсли;
		КонецЕсли;
		
		ДлительнаяОперация = УправлениеПечатьюВызовСервера.НачатьФормированиеПечатныхФорм(ПараметрыОткрытия); 
		Если ТипЗнч(ВладелецФормы) = Тип("ПараметрыВыполненияКоманды") Тогда
			ПараметрыОткрытия.ВладелецФормы = ВладелецФормы.Источник;
		Иначе
			ПараметрыОткрытия.ВладелецФормы = ВладелецФормы;
		КонецЕсли;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ОткрытьФормуПечатьДокументов", УправлениеПечатьюСлужебныйКлиент, ПараметрыОткрытия); 
		Если ТипЗнч(ВладелецФормы) = Тип("ПараметрыВыполненияКоманды") Тогда
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, УправлениеПечатьюСлужебныйКлиент.ПараметрыОжидания(ВладелецФормы.Источник));
		Иначе
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, УправлениеПечатьюСлужебныйКлиент.ПараметрыОжидания(ВладелецФормы));
		КонецЕсли;
	//КонецЕсли;
#КонецВставки

КонецПроцедуры
