&НаСервереБезКонтекста
Функция УжеЕсть(лСсылка,лИсходныйДокумент)
	Если лИсходныйДокумент<>Неопределено тогда
		Если не лИсходныйДокумент.Пустая() тогда
			Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДатаМобайл_ДокументыТСД.Ссылка
			|ИЗ
			|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
			|ГДЕ
			|	ДатаМобайл_ДокументыТСД.ИсходныйДокумент = &ИсходныйДокумент
			|	И ДатаМобайл_ДокументыТСД.Ссылка <> &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",лСсылка);
			Запрос.УстановитьПараметр("ИсходныйДокумент",лИсходныйДокумент);
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Возврат Ложь;
КонецФункции

&НаСервереБезКонтекста
Функция ПомеченНаУдаление(лИсходныйДокумент)
	Если лИсходныйДокумент<>Неопределено тогда
		Если не лИсходныйДокумент.Пустая() тогда
			Если лИсходныйДокумент.ПометкаУдаления тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	// убрать записи с пустыми терминалами
	Проверять = Истина;
	Пока Проверять Цикл
		ПустыеТСД = Объект.СписокТерминалов.НайтиСтроки(Новый Структура("ТСД", ПредопределенноеЗначение("ПланОбмена.ДатаМобайл_СписокТСД.ПустаяСсылка")));
		Проверять = (НЕ ПустыеТСД.Количество() = 0);
		
		Для каждого стрТСД из ПустыеТСД Цикл
			Объект.СписокТерминалов.Удалить(стрТСД);	
		КонецЦикла;
	КонецЦикла;
	
	Если УжеЕсть(Объект.Ссылка,Объект.ИсходныйДокумент) тогда
		Если Не ПараметрыЗаписи.Свойство("ВопросЗадан") Тогда
			Отказ = Истина;
			Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершение", ЭтаФорма, ПараметрыЗаписи);
			ТекстВопроса = "Для документа "+Объект.ИсходныйДокумент+" уже создан документ ТСД. Продолжить?";
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
		КонецЕсли;
	КонецЕсли;
	
	Если ПомеченНаУдаление(Объект.ИсходныйДокумент) тогда
		Если Не ПараметрыЗаписи.Свойство("ВопросЗаданУдаление") Тогда
			Отказ = Истина;
			Оповещение = Новый ОписаниеОповещения("ПоказатьВопросУдалениеЗавершение", ЭтаФорма, ПараметрыЗаписи);
			ТекстВопроса = "Документ "+Объект.ИсходныйДокумент+" помечен на удаление. Продолжить?";
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
		КонецЕсли;
	КонецЕсли;

	//Запрос в ЦРПТ приёмка
	Попытка
		ПроверкаКлючаИЗапросВСервис();	
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросЗавершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("ВопросЗадан", Истина);
		
		Если Записать(ПараметрыЗаписи) Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросУдалениеЗавершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("ВопросЗаданУдаление", Истина);
		
		Если Записать(ПараметрыЗаписи) Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаКлючаИЗапросВСервис()
	
	СсылкаНаДокВСервис 	= Объект.ИсходныйДокумент;
	Шаблон 				= Объект.Шаблон;
	ЭтоТабак 			= Ложь;
	
	Если СсылкаНаДокВСервис.Пустая() Или Не ПроверитьТребуетсяВыгрузкаМарок(Объект.ИсходныйДокумент, Объект.Шаблон) Или Не ТребуетсяЗапросВЦРПТ(Шаблон) Тогда
		Возврат;	
	КонецЕсли; 
	
	ВидМаркируемойПродукцииДокументаМассив 	= ДатаМобайл_Маркировка.ПолучитьВидПродукцииИСДокумента(СсылкаНаДокВСервис);
	ВидМаркируемойПродукцииДокумента 		= ВидМаркируемойПродукцииДокументаМассив[0];
	
	Если ВидМаркируемойПродукцииДокумента = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Организация = ПолучитьОрганизациюПоДокументу(СсылкаНаДокВСервис);
	
	Если ТребуетсяОбновлениеКлючаСессии(Организация, ЭтоТабак, ВидМаркируемойПродукцииДокумента) Тогда
		
		Модуь_ИнтерфейсАвторизацииИСМПКлиент = ОбщийМодуль("ИнтерфейсАвторизацииИСМПКлиент");
		Модуь_ИнтерфейсМОТПКлиентСервер = ?(ЭтоТабак, ОбщийМодуль("ИнтерфейсМОТПКлиентСервер"), ОбщийМодуль("ИнтерфейсИСМПКлиентСервер"));
		
		Модуь_ИнтерфейсАвторизацииИСМПКлиент.ЗапроситьКлючСессии(Модуь_ИнтерфейсМОТПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
		
		Сообщить("Не получилось обновить ключ сессии. Проверьте настройки подключения к ИС.", СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОбщийМодуль(Имя) Экспорт
	
	Модуль = Вычислить(Имя);
	
#Если Не ВебКлиент Тогда
	
	// В веб-клиенте не проверяется
	// т.к. при обращении к модулям с вызовом сервера типа такого модуля в веб-клиенте не существует.
	
	Если Имя <> "СтроковыеФункцииКлиентСервер" тогда
		Модуль_СтроковыеФункцииКлиентСервер = ОбщийМодуль("СтроковыеФункцииКлиентСервер");
	КонецЕсли;
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		Если Имя <> "СтроковыеФункцииКлиентСервер" тогда
			ВызватьИсключение Модуль_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Общий модуль ""%1"" не найден.'"), 
			Имя);
		Иначе
			ВызватьИсключение НСтр("ru = 'Неизвестное имя общего модуля - СтроковыеФункцииКлиентСервер. Обратитесь к разработчикам программы.'");			
		КонецЕсли;	
	КонецЕсли;
	
#КонецЕсли
	
	Возврат Модуль;
	
КонецФункции

&НаСервере
Функция ПолучитьОрганизациюПоДокументу(СсылкаНаДокВСервис)
	
	Организация = Неопределено;
	
	Попытка
		Организация = СсылкаНаДокВСервис.Организация;	
	Исключение
	КонецПопытки;
	
	Возврат Организация;
	
КонецФункции
 
&НаСервере
Функция ТребуетсяОбновлениеКлючаСессии(Организация, ЭтоТабак, ВидМаркируемойПродукцииДокумента)
	
	ТребуетсяОбновлениеКлючаСессии = Истина;
	
	Модуь_ИнтерфейсАвторизацииИСМПВызовСервера = ДатаМобайл_Маркировка.ОбщийМодуль("ИнтерфейсАвторизацииИСМПВызовСервера");
	Модуь_ИнтерфейсИСМПКлиентСервер = ДатаМобайл_Маркировка.ОбщийМодуль("ИнтерфейсИСМПКлиентСервер");
	Модуь_ИнтерфейсМОТПКлиентСервер = ДатаМобайл_Маркировка.ОбщийМодуль("ИнтерфейсМОТПКлиентСервер");
	
	Если Модуь_ИнтерфейсАвторизацииИСМПВызовСервера = Неопределено Тогда
		Сообщить("Конфигурация 1С не поддерживает работу с Маркировкой", 
		СтатусСообщения.ОченьВажное);
		Возврат ТребуетсяОбновлениеКлючаСессии;
	КонецЕсли;
	
	//Табак
	Если ДатаМобайл_Маркировка.ЭтоТабакПоВидыПродукцииИС(ВидМаркируемойПродукцииДокумента) Тогда		
		ТребуетсяОбновлениеКлючаСессии = Модуь_ИнтерфейсАвторизацииИСМПВызовСервера.ТребуетсяОбновлениеКлючаСессии(
		Модуь_ИнтерфейсМОТПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
		ЭтоТабак = Истина;
	Иначе
		ТребуетсяОбновлениеКлючаСессии = Модуь_ИнтерфейсАвторизацииИСМПВызовСервера.ТребуетсяОбновлениеКлючаСессии(
		Модуь_ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));	
	КонецЕсли;
	
	Возврат ТребуетсяОбновлениеКлючаСессии;
	
КонецФункции
 
&НаСервере
Функция ТребуетсяЗапросВЦРПТ(Шаблон)
	
	Если Шаблон.МаркировкаЗапросВЦРПТ И Шаблон.ИспользоватьМаркировку Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьТребуетсяВыгрузкаМарок(ИсходныйДокумент, Шаблон)

	ВидДокумента = Шаблон.ВидДокумента;
	
	Если ВидДокумента = "ПриобретениеТоваровУслуг" 
		или ВидДокумента = "ПриемкаТоваровИСМП" Тогда
		
		Возврат Истина;

	ИначеЕсли ВидДокумента = "ВозвратТоваровОтКлиента"	Тогда
		
		МаркиУказаныПоставщиком = Ложь;

		Если ИсходныйДокумент.ШтрихкодыУпаковок.Количество()>0 Тогда
			МаркиУказаныПоставщиком = Истина;
		КонецЕсли;
		
		Если МаркиУказаныПоставщиком тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
		
	ИначеЕсли ВидДокумента = "УведомлениеОПриемкеМДЛП" Тогда
		ПрямойАкцепт = Ложь;
		Попытка 
			Если ИсходныйДокумент.СхемаАкцептования = Перечисления.СхемыАкцептованияМДЛП.ПрямойПорядок тогда
				ПрямойАкцепт = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Если ПрямойАкцепт тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ()


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоГрупповойШаблон(Объект.Шаблон) тогда
		Элементы.СписокТерминалов.Видимость = Истина;
		Элементы.СписокТерминаловКоманднаяПанель.Видимость = Истина;
		Элементы.ТСД.Видимость = Ложь;
		
		Если ЗначениеЗаполнено(Объект.ТСД) Тогда
			Объект.ТСД = Неопределено;
		КонецЕсли;
	Иначе
		Элементы.СписокТерминалов.Видимость = Ложь;
		Элементы.СписокТерминаловКоманднаяПанель.Видимость = Ложь;
		Элементы.ТСД.Видимость = Истина;	
	КонецЕсли;	
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоГрупповойШаблон(лШаблон)
	Возврат лШаблон.ГрупповаяРабота;
КонецФункции
