
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КатегорияПодакцизногоТовара = Параметры.КатегорияПодакцизногоТовара;
	ТолькоПросмотр = Параметры.ТолькоПросмотр;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"КатегорияПодакцизногоТовара",
		КатегорияПодакцизногоТовара,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ЗначениеЗаполнено(КатегорияПодакцизногоТовара),,);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(ПолучитьПериод(ВыбраннаяСтрока));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	Оповестить("Удалить_СтавкаПодакцизнойКатегории",, КатегорияПодакцизногоТовара);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	КатегорияПодакцизногоТовара = Элемент.ТекущиеДанные.КатегорияПодакцизногоТовара;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьПериод(КлючЗаписи)
	
	Если ЗначениеЗаполнено(КлючЗаписи) Тогда
		Период = КлючЗаписи.Период;
	Иначе
		Период = Неопределено;
	КонецЕсли;
	
	Возврат Период;
	
КонецФункции

#КонецОбласти
