Функция ТекстЗапросаЗаказовКОбеспечению() Экспорт
	//ASP_Crow 04.05.2026 000029567 В расширение
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Т.Ссылка                        КАК Заказ,
	|	Т.КодСтроки                     КАК КодСтроки,
	|	Т.НомерСтроки                   КАК НомерСтроки,
	|	0                               КАК НомерСтрокиПродукция,
	|	НЕОПРЕДЕЛЕНО                    КАК Продукция,
	|	НЕОПРЕДЕЛЕНО                    КАК Этап,
	|	0                               КАК ЭтапПорядок,
	|	
	|	Т.Номенклатура                  КАК Номенклатура,
	|	Т.Характеристика                КАК Характеристика,
	|	ТаблицаДокумента.Склад          КАК Склад,
	|	
	|	ТаблицаДокумента.Назначение     КАК Назначение,
	|	
	|	ТаблицаДокумента.Подразделение  КАК Подразделение,
	|	
	|	Т.ВариантОбеспечения            КАК ВариантОбеспечения,
	|	Т.ДатаОтгрузки                  КАК ДатаОтгрузки,
	|	Т.Упаковка                      КАК Упаковка,
	|	
	|	Т.Количество                    КАК Количество,
	|	
	|	ТаблицаДокумента.ЖелаемаяДатаОтгрузки КАК ЖелаемаяДатаОтгрузки,
	|	ТаблицаДокумента.НеОтгружатьЧастями   КАК НеОтгружатьЧастями,
	|	ТаблицаДокумента.Дата                 КАК Дата,
	|	НЕОПРЕДЕЛЕНО                          КАК Партнер,
	|	ТаблицаДокумента.Ответственный        КАК Менеджер,
	|	ТаблицаДокумента.Статус               КАК Статус,
	|	&ИспользоватьСтатусыЗаказовНаВнутреннееПотребление КАК СтатусИспользуется
	|ИЗ
	|	Документ.ЗаказНаВнутреннееПотребление.Товары КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВнутреннееПотребление КАК ТаблицаДокумента
	|		ПО Т.Ссылка = ТаблицаДокумента.Ссылка
	|
	|ГДЕ
	|	Т.Ссылка В (&Заказы)
	|	И ТаблицаДокумента.Проведен
	|	И Т.Отменено = ЛОЖЬ
	|	И ТаблицаДокумента.ПометкаУдаления = ЛОЖЬ
	|	И Т.ВариантОбеспечения В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.УдалитьОбособленно),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.РезервироватьПоМереПоступления)
	|	)";
	
	Возврат ТекстЗапроса;
	
КонецФункции


