
//+++ {{ ASP 31.08.2020 000008181 }}
Процедура ASP_ОбработатьПриобретениеТоваровУслуг() Экспорт
	
	ASP_ПараметрыНаКлиенте = ПараметрыПриложения["ASP_Доработки"];
	Если ASP_ПараметрыНаКлиенте = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ASP_ПараметрыНаКлиенте) <> Тип("Структура")
	 Или Не ASP_ПараметрыНаКлиенте.Свойство("ПриобретениеТоваровУслугКОбработке") Тогда
		Возврат;
	КонецЕсли;
	//ASP_Lebedev_000020594_08/09/2023 Параметры ожидания для отключения окна ожидания для длительной операции
	Форма = ASP_ПараметрыНаКлиенте.Форма;
	ПарОж = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПарОж.ВыводитьОкноОжидания = Ложь;
	//ASP_Lebedev_000020594_08/09/2023
	ПриобретениеТоваровУслугКОбработке = ASP_ПараметрыНаКлиенте.ПриобретениеТоваровУслугКОбработке;
	
	Результат = ASP_ВызовСервера.ASP_ОбработатьПриобретениеТоваровУслуг(ПриобретениеТоваровУслугКОбработке);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьПриобретениеТоваровУслугЗавершение", ASP_Клиент);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Результат, ОповещениеОЗавершении,ПарОж);
	
КонецПроцедуры

Процедура ОбработатьПриобретениеТоваровУслугЗавершение(Результат, ДопПараметры) Экспорт
	
	ТекстПредупреждения = Неопределено;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Если Результат.Свойство("Статус") И Результат.Статус = "Выполнено" Тогда
			ВозвращенныйРезультат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			Если ТипЗнч(ВозвращенныйРезультат) <> Тип("Структура") Тогда
				Возврат;
			КонецЕсли;
			
			Если ВозвращенныйРезультат.Свойство("ИмяУведомления") Тогда
				Если ВозвращенныйРезультат.ИмяУведомления = "УжеСозданНаОснованииЗаказНаПеремещение" Тогда
					ПоказатьОповещениеПользователя("Пропущено", , "Обработка Приобретения уже выполнена ранее");
				ИначеЕсли ВозвращенныйРезультат.ИмяУведомления = "НетЗаказовПоставщикам" Тогда
					//
				ИначеЕсли ВозвращенныйРезультат.ИмяУведомления = "ПроверкаВыполнена" Тогда
					ПоказатьОповещениеПользователя("Проверено", , "доп. действие не требуется.");
				КонецЕсли;
			КонецЕсли;
			
			Если ВозвращенныйРезультат.Свойство("Уведомления") Тогда
				ОбщаяФорма = ПолучитьФорму("ОбщаяФорма.асп_ФормаУведомлений");
				ОбщаяФорма.Заголовок = "Результат обработки документа " + Строка(ВозвращенныйРезультат.ПриобретениеТоваровУслуг);
				ОбщаяФорма.Уведомления = ВозвращенныйРезультат.Уведомления;
				ОбщаяФорма.Открыть();
			КонецЕсли;
			
			Возврат;
		ИначеЕсли Результат.Свойство("КраткоеПредставлениеОшибки") И ТипЗнч(Результат.КраткоеПредставлениеОшибки) = Тип("Строка") Тогда
			ТекстПредупреждения = Результат.КраткоеПредставлениеОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ТекстПредупреждения) <> Тип("Строка") Тогда
		ТекстПредупреждения = "Произошла неизвестная ошибка. Вероятно, обработка была отменена. Подробности в журнале регистрации";
	КонецЕсли;
	
	ТекстПредупреждения = "Обработка Приобретения прервана
			|" + ТекстПредупреждения;
	
	
	ПоказатьПредупреждение( , ТекстПредупреждения);
	
	ОповеститьОбИзменении(Тип("ДокументСсылка.ЗаказНаПеремещение"));
	
КонецПроцедуры
//--- {{ ASP 31.08.2020 000008181 }}

//+++ {{ ASP 10.09.2020 000008403 }}
Процедура ПослеЗаписиИзФормы(Форма, ПараметрыЗаписи) Экспорт
	
	Объект = Форма.Объект;
	
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		
		//++ASP_Crow 24.05.2024 000023121 Проверим на "Товары в пути" если эта схема, то данный механизм должен работать у постулпения товаров на скл
		ТоварыВПути = ASP_ВызовСервера.ПроверкаПриобретенияНаТоварыВПути(Объект.Ссылка);
		Если ТоварыВПути тогда
			Возврат
		КонецЕсли;
		//--ASP_Crow 24.05.2024 000023121
		
		//+++ {{ ASP 31.08.2020 000008181 }}
		Если ТипЗнч(ПараметрыЗаписи) = Тип("Структура")
		 И ПараметрыЗаписи.Свойство("РежимЗаписи")
		 И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ASP_ПараметрыНаКлиенте = ПараметрыПриложения["ASP_Доработки"];
			Если ASP_ПараметрыНаКлиенте = Неопределено Тогда
				ПараметрыПриложения.Вставить("ASP_Доработки", Новый Структура);
				ASP_ПараметрыНаКлиенте = ПараметрыПриложения["ASP_Доработки"];
			КонецЕсли;
			ASP_ПараметрыНаКлиенте.Вставить("ПриобретениеТоваровУслугКОбработке", Объект.Ссылка);
			ASP_ПараметрыНаКлиенте.Вставить("Форма", Форма); //ASP_Lebedev_000020594_08/09/2023 Нужно для параметров ожидания

			ПодключитьОбработчикОжидания("ASP_ОбработатьПриобретениеТоваровУслугГлоб", 0.1, Истина);
		КонецЕсли;
		//--- {{ ASP 31.08.2020 000008181 }}
			
	ИначеЕсли ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровНаСклад") тогда
		//++ASP_Crow 30.01.2024 000023121 поступление товарво на ск
		Если ТипЗнч(ПараметрыЗаписи) = Тип("Структура")
		 И ПараметрыЗаписи.Свойство("РежимЗаписи")
		 И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ASP_ПараметрыНаКлиенте = ПараметрыПриложения["ASP_Доработки"];
			Если ASP_ПараметрыНаКлиенте = Неопределено Тогда
				ПараметрыПриложения.Вставить("ASP_Доработки", Новый Структура);
				ASP_ПараметрыНаКлиенте = ПараметрыПриложения["ASP_Доработки"];
			КонецЕсли;
			ASP_ПараметрыНаКлиенте.Вставить("ПоступлениеТоваровНаСкладКОбработке", Объект.Ссылка);
			ASP_ПараметрыНаКлиенте.Вставить("Форма", Форма); //ASP_Lebedev_000020594_08/09/2023 Нужно для параметров ожидания

			ПодключитьОбработчикОжидания("ASP_ОбработатьПоступлениеТоваровУслугГлоб", 0.1, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


Процедура УстановитьТекущуюСтрокуСписка(ИмяСобытия, Параметр, Источник, Список) Экспорт

	Если Источник = "ПодключаемоеОборудование" Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Данные = МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
			
			Состояние(НСтр("ru = 'Выполняется поиск документа по штрихкоду...'"));
			ДанныеПоШтрихКоду = ASP_ВызовСервера.ДанныеПоШтрихКодуПечатнойФормы(Данные.Штрихкод);
			
			Если ЗначениеЗаполнено(ДанныеПоШтрихКоду) Тогда
				Если ЗначениеЗаполнено(ДанныеПоШтрихКоду.КлючЗаписи) Тогда
					Список.ТекущаяСтрока = ДанныеПоШтрихКоду.КлючЗаписи;
				КонецЕсли;
			Иначе
				ШтрихкодированиеПечатныхФормКлиент.ОбъектНеНайден(Данные.Штрихкод);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#Область ПоступлениеТоваровНаСклад

Процедура ASP_ОбработатьПоступлениеТоваровНаСклад() Экспорт

	ASP_ПараметрыНаКлиенте = ПараметрыПриложения["ASP_Доработки"];
	Если ASP_ПараметрыНаКлиенте = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ASP_ПараметрыНаКлиенте) <> Тип("Структура")
	 Или Не ASP_ПараметрыНаКлиенте.Свойство("ПоступлениеТоваровНаСкладКОбработке") Тогда
		Возврат;
	КонецЕсли;
	//ASP_Lebedev_000020594_08/09/2023 Параметры ожидания для отключения окна ожидания для длительной операции
	Форма = ASP_ПараметрыНаКлиенте.Форма;
	ПарОж = ДлительныеОперацииКлиент.ПараметрыОжидания(Форма);
	ПарОж.ВыводитьОкноОжидания = Ложь;
	//ASP_Lebedev_000020594_08/09/2023
	ПоступлениеТоваровНаСкладКОбработке = ASP_ПараметрыНаКлиенте.ПоступлениеТоваровНаСкладКОбработке;
	
	Результат = ASP_ВызовСервера.ASP_ОбработатьПоступлениеТоваровНаСклад(ПоступлениеТоваровНаСкладКОбработке);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьПоступлениеТоваровНаСкладЗавершение", ASP_Клиент);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Результат, ОповещениеОЗавершении,ПарОж);	

КонецПроцедуры

Процедура ОбработатьПоступлениеТоваровНаСкладЗавершение(Результат, ДопПараметры) Экспорт
	
	ТекстПредупреждения = Неопределено;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Если Результат.Свойство("Статус") И Результат.Статус = "Выполнено" Тогда
			ВозвращенныйРезультат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
			Если ТипЗнч(ВозвращенныйРезультат) <> Тип("Структура") Тогда
				Возврат;
			КонецЕсли;
			
			Если ВозвращенныйРезультат.Свойство("ИмяУведомления") Тогда
				Если ВозвращенныйРезультат.ИмяУведомления = "УжеСозданНаОснованииЗаказНаПеремещение" Тогда
					ПоказатьОповещениеПользователя("Пропущено", , "Обработка Приобретения уже выполнена ранее");
				ИначеЕсли ВозвращенныйРезультат.ИмяУведомления = "НетЗаказовПоставщикам" Тогда
					//
				ИначеЕсли ВозвращенныйРезультат.ИмяУведомления = "ПроверкаВыполнена" Тогда
					ПоказатьОповещениеПользователя("Проверено", , "доп. действие не требуется.");
				КонецЕсли;
			КонецЕсли;
			
			Если ВозвращенныйРезультат.Свойство("Уведомления") Тогда
				ОбщаяФорма = ПолучитьФорму("ОбщаяФорма.асп_ФормаУведомлений");
				ОбщаяФорма.Заголовок = "Результат обработки документа " + Строка(ВозвращенныйРезультат.ПоступлениеТоваров);
				ОбщаяФорма.Уведомления = ВозвращенныйРезультат.Уведомления;
				ОбщаяФорма.Открыть();
			КонецЕсли;
			
			Возврат;
		ИначеЕсли Результат.Свойство("КраткоеПредставлениеОшибки") И ТипЗнч(Результат.КраткоеПредставлениеОшибки) = Тип("Строка") Тогда
			ТекстПредупреждения = Результат.КраткоеПредставлениеОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ТекстПредупреждения) <> Тип("Строка") Тогда
		ТекстПредупреждения = "Произошла неизвестная ошибка. Вероятно, обработка была отменена. Подробности в журнале регистрации";
	КонецЕсли;
	
	ТекстПредупреждения = "Обработка Приобретения прервана
			|" + ТекстПредупреждения;
	
	
	ПоказатьПредупреждение( , ТекстПредупреждения);
	
	ОповеститьОбИзменении(Тип("ДокументСсылка.ЗаказНаПеремещение"));
	
КонецПроцедуры
//--ASP_Crow 30.05.2024

#КонецОбласти
