
&ИзменениеИКонтроль("ЗапросРаспределенияБезУчетаПриоритетовТаблицыТоваровНаТаблицуОстатков")
Функция асп_ЗапросРаспределенияБезУчетаПриоритетовТаблицыТоваровНаТаблицуОстатков(МенеджерВременныхТаблиц, ДополнительныеСвойства, ПараметрыЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = УчетПодакцизныхТоваров.ТекстЗапросаВтПодакцизныеТовары("ТаблицаТоваров")
	+ ОбщегоНазначения.РазделительПакетаЗапросов() +
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаТоваров.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(АналитикаКомиссионера.КлючАналитики, ТаблицаТоваров.АналитикаУчетаНоменклатуры) КАК АналитикаОстатков,
	|	ЕСТЬNULL(АналитикаКомиссионера.Номенклатура, ТаблицаТоваров.АналитикаУчетаНоменклатуры.Номенклатура) КАК НоменклатураОстатков,
	|	ЕСТЬNULL(АналитикаКомиссионера.Характеристика, ТаблицаТоваров.АналитикаУчетаНоменклатуры.Характеристика) КАК ХарактеристикаОстатков,
	|	ЕСТЬNULL(АналитикаКомиссионера.Серия, ТаблицаТоваров.АналитикаУчетаНоменклатуры.Серия) КАК СерияОстатков,
	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ВтПодакцизныеТовары.ПодакцизныйТовар, ЛОЖЬ) КАК ПодакцизныйТовар,
	|	СпрНоменклатура.ВестиУчетПоГТД КАК ВестиУчетПоГТД,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ПрослеживаемыйТовар
	|				И &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				И НАЧАЛОПЕРИОДА(ТаблицаДанныхДокумента.Дата, МЕСЯЦ) >= &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПрослеживаемыйТовар,
	|	ЕСТЬNULL(АналитикаКомиссионера.МестоХранения, ТаблицаТоваров.АналитикаУчетаНоменклатуры.МестоХранения) КАК СкладОстатков,
	|	ЕСТЬNULL(АналитикаКомиссионера.Назначение, ТаблицаТоваров.АналитикаУчетаНоменклатуры.Назначение) КАК НазначениеОстатков,
	|	ЕСТЬNULL(АналитикаКомиссионера.СтатьяКалькуляции, ТаблицаТоваров.АналитикаУчетаНоменклатуры.СтатьяКалькуляции) КАК СтатьяКалькуляцииОстатков,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ТаблицаНоменклатуры.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.Серия КАК Серия,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
	|	&ТекстПоляТаблицаТоваровНоменклатураПартнера_ КАК НоменклатураПартнера,
	|	ТаблицаТоваров.ПодбиратьВидыЗапасов КАК ПодбиратьВидыЗапасов,
	|	ТаблицаТоваров.НомерГТД КАК НомерГТД,
	|	ТаблицаТоваров.ВидЦены КАК ВидЦены,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.Назначение КАК Назначение,
	|	ВЫБОР
	|		КОГДА &ТекстПоляТаблицаТоваровДокументРеализации_ В(&ПустыеЗначенияДокументаРеализации)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ &ТекстПоляТаблицаТоваровДокументРеализации_
	|	КОНЕЦ КАК ДокументРеализации,
	|	ВЫБОР
	|		КОГДА &ТекстПоляТаблицаТоваровДокументОприходования_ В(&ПустыеЗначенияДокументаОприходования)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ &ТекстПоляТаблицаТоваровДокументОприходования_
	|	КОНЕЦ КАК ДокументОприходования,
	|	&ТекстПоляТаблицаТоваровПериод_ КАК Период,
	|	ТаблицаДанныхДокумента.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	МАКСИМУМ(ТаблицаТоваров.СтавкаНДС) КАК СтавкаНДС,
	|	СУММА(ТаблицаТоваров.Количество) КАК Количество,
	|	&ТекстПоляТаблицаТоваровКоличествоПоРНПТ_ КАК КоличествоПоРНПТ,
	|	СУММА(ТаблицаТоваров.СуммаСНДС) КАК СуммаСНДС,
	|	СУММА(ТаблицаТоваров.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ТаблицаТоваров.СуммаВознаграждения) КАК СуммаВознаграждения,
	|	СУММА(ТаблицаТоваров.СуммаНДСВознаграждения) КАК СуммаНДСВознаграждения
	#Вставка 
	// 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации 
	// ASP_Crow 27.01.2025 000025949 Исправление т.к. НоменклатураНабора не везде прописана
	|	,&ТекстКорректировки01
	#КонецВставки
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ИСТИНА
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТаблицаНоменклатуры
	|		ПО ТаблицаТоваров.Номенклатура = ТаблицаНоменклатуры.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаКомиссионера
	|		ПО ТаблицаТоваров.Номенклатура = АналитикаКомиссионера.Номенклатура
	|			И ТаблицаТоваров.Характеристика = АналитикаКомиссионера.Характеристика
	|			И ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) = АналитикаКомиссионера.Назначение
	|			И ТаблицаДанныхДокумента.Партнер = АналитикаКомиссионера.МестоХранения
	|			И ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) = АналитикаКомиссионера.Серия
	|			И АналитикаКомиссионера.СтатьяКалькуляции = &ПустоеЗначениеСтатьиКалькуляции
	|			И (ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	//++ Устарело_Переработка24
	|				ИЛИ ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика)
	//-- Устарело_Переработка24
	|				ИЛИ ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика2_5))
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПодакцизныеТовары КАК ВтПодакцизныеТовары
	|		ПО СпрНоменклатура.Ссылка = ВтПодакцизныеТовары.Номенклатура
	|
	|ГДЕ
	|	ТаблицаНоменклатуры.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
	|											ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара),
	|											ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры,
	|	ЕСТЬNULL(АналитикаКомиссионера.КлючАналитики, ТаблицаТоваров.АналитикаУчетаНоменклатуры),
	|	СпрНоменклатура.ЕдиницаИзмерения,
	|	ЕСТЬNULL(ВтПодакцизныеТовары.ПодакцизныйТовар, ЛОЖЬ),
	|	СпрНоменклатура.ВестиУчетПоГТД,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ПрослеживаемыйТовар
	|				И &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				И НАЧАЛОПЕРИОДА(ТаблицаДанныхДокумента.Дата, МЕСЯЦ) >= &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЕСТЬNULL(АналитикаКомиссионера.Номенклатура, ТаблицаТоваров.АналитикаУчетаНоменклатуры.Номенклатура),
	|	ЕСТЬNULL(АналитикаКомиссионера.Характеристика, ТаблицаТоваров.АналитикаУчетаНоменклатуры.Характеристика),
	|	ЕСТЬNULL(АналитикаКомиссионера.Серия, ТаблицаТоваров.АналитикаУчетаНоменклатуры.Серия),
	|	ЕСТЬNULL(АналитикаКомиссионера.МестоХранения, ТаблицаТоваров.АналитикаУчетаНоменклатуры.МестоХранения),
	|	ЕСТЬNULL(АналитикаКомиссионера.Назначение, ТаблицаТоваров.АналитикаУчетаНоменклатуры.Назначение),
	|	ЕСТЬNULL(АналитикаКомиссионера.СтатьяКалькуляции, ТаблицаТоваров.АналитикаУчетаНоменклатуры.СтатьяКалькуляции),
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ТаблицаНоменклатуры.ТипНоменклатуры,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.Характеристика,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.Серия,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.МестоХранения,
	|	&ТекстПоляТаблицаТоваровНоменклатураПартнера_,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.Назначение,
	|	ВЫБОР 
	|		КОГДА &ТекстПоляТаблицаТоваровДокументРеализации_ В(&ПустыеЗначенияДокументаРеализации)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ &ТекстПоляТаблицаТоваровДокументРеализации_
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ТекстПоляТаблицаТоваровДокументОприходования_ В(&ПустыеЗначенияДокументаОприходования)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ &ТекстПоляТаблицаТоваровДокументОприходования_
	|	КОНЕЦ,
	|	&ТекстПоляТаблицаТоваровПериод_,
	|	ТаблицаДанныхДокумента.ХозяйственнаяОперация,
	|	ТаблицаТоваров.ПодбиратьВидыЗапасов,
	|	ТаблицаТоваров.НомерГТД,
	|	ТаблицаТоваров.ВидЦены
	#Вставка 
	// 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации
	// ASP_Crow 27.01.2025 000025949 Исправление т.к. НоменклатураНабора не везде прописана
	|	,&ТекстКорректировки02
	#КонецВставки
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокумента.Организация КАК Организация,
	|	ТаблицаДанныхДокумента.Дата КАК Период,
	|	ТаблицаДанныхДокумента.Партнер КАК Партнер,
	|	ТаблицаДанныхДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДанныхДокумента.Соглашение КАК Соглашение,
	|	ТаблицаДанныхДокумента.Договор КАК Договор,
	|	ТаблицаДанныхДокумента.Валюта КАК Валюта,
	|	ТаблицаДанныхДокумента.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ТаблицаДанныхДокумента.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТаблицаДанныхДокумента.ТипЗапасов КАК ТипЗапасов
	|ИЗ
	|	ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ВидыЗапасовПоУмолчанию.ВладелецТовара КАК ВладелецТовара,
	|	ВЫБОР
	|		КОГДА ВидыЗапасовПоУмолчанию.ТипЗапасов ЕСТЬ NULL
	|				И ТаблицаДокумента.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Работа)
	|		ИНАЧЕ ВидыЗапасовПоУмолчанию.ТипЗапасов
	|	КОНЕЦ КАК ТипЗапасов,
	|	ВидыЗапасовПоУмолчанию.Контрагент КАК Контрагент,
	|	ВидыЗапасовПоУмолчанию.Договор КАК Договор,
	|	ТаблицаДокумента.Склад КАК Склад,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаДокумента.Характеристика КАК Характеристика,
	|	ТаблицаДокумента.Серия КАК Серия,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.КоличествоПоРНПТ КАК ЧИСЛО(23, 11)) КАК КоличествоПоРНПТ,
	|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
	|	ТаблицаДокумента.ВидЦены КАК ВидЦены,
	|	ТаблицаДокумента.ДокументРеализации КАК ДокументРеализации,
	|	ТаблицаДокумента.ДокументОприходования КАК ДокументОприходования,
	|	ТаблицаДокумента.Период КАК Период,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьГруппыФинУчета
	|				ИЛИ ТаблицаДокумента.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(СправочникНоменклатура.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка))
	|	КОНЕЦ КАК ГруппаФинансовогоУчета
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРеквизитовВидовЗапасовПоУмолчанию КАК ВидыЗапасовПоУмолчанию
	|		ПО ВидыЗапасовПоУмолчанию.НомерСтроки = ТаблицаДокумента.НомерСтроки
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТаблицаДокумента.Номенклатура = СправочникНоменклатура.Ссылка
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаВидыЗапасов.НомерСтроки) КАК НомерСтроки,
	|	ЕСТЬNULL(АналитикаКомиссионера.КлючАналитики, ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры) КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
	#Вставка
	// 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации
	// ASP_Crow 27.01.2025 000025949 Исправление т.к. НоменклатураНабора не везде прописана
	|	&ТекстКорректировки03	
	#КонецВставки
	|	ТаблицаВидыЗапасов.ВидЗапасовПолучателя КАК ВидЗапасовПолучателя,
	|	ЕСТЬNULL(АналитикаОтгрузки.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК СерияОтгрузки,
	|	ТаблицаВидыЗапасов.СкладОтгрузки КАК СкладОтгрузки,
	|	ТаблицаВидыЗапасов.НомерГТД КАК НомерГТД,
	|	ТаблицаВидыЗапасов.ВидыЗапасовУказаныВручную КАК ВидыЗапасовУказаныВручную,
	|	СУММА(ТаблицаВидыЗапасов.Количество) КАК Количество,
	|	&ТекстПоляТаблицаВидыЗапасовКоличествоПоРНПТ_ КАК КоличествоПоРНПТ,
	|	&ТекстПоляТаблицаВидыЗапасовСуммаНДС_ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА СУММА(ТаблицаВидыЗапасов.Количество) > 0
	|			ТОГДА 1
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК Знак,
	|	ТаблицаВидыЗапасов.ДокументРеализации КАК ДокументРеализации,
	|	ТаблицаВидыЗапасов.ДокументОприходования КАК ДокументОприходования,
	|	&ТекстПоляТаблицаВидыЗапасовАналитикаУчетаНоменклатурыОтгрузки_ КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	&ТекстПоляТаблицаВидыЗапасовПериод_ КАК Период
	|ПОМЕСТИТЬ ВтВидыЗапасовСводно
	|ИЗ
	|	ТаблицаВидыЗапасов КАК ТаблицаВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ИСТИНА
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаОтгрузки
	|		ПО &ТекстПоляТаблицаВидыЗапасовАналитикаУчетаНоменклатурыОтгрузки_ = АналитикаОтгрузки.Ссылка
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаКомиссионера
	|		ПО ТаблицаВидыЗапасов.Номенклатура = АналитикаКомиссионера.Номенклатура
	|			И ТаблицаВидыЗапасов.Характеристика = АналитикаКомиссионера.Характеристика
	|			И ТаблицаДанныхДокумента.Партнер = АналитикаКомиссионера.МестоХранения
	|			И ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры.Назначение = АналитикаКомиссионера.Назначение
	|			И АналитикаКомиссионера.СтатьяКалькуляции = &ПустоеЗначениеСтатьиКалькуляции
	|			И ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) = АналитикаКомиссионера.Серия
	|			И ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(АналитикаКомиссионера.КлючАналитики, ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры),
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	#Вставка 
	// 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации
	// ASP_Crow 27.01.2025 000025949 Исправление т.к. НоменклатураНабора не везде прописана
	|	&ТекстКорректировки04
	#КонецВставки
	|	ТаблицаВидыЗапасов.ВидЗапасовПолучателя,
	|	ЕСТЬNULL(АналитикаОтгрузки.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)),
	|	ТаблицаВидыЗапасов.СкладОтгрузки,
	|	ТаблицаВидыЗапасов.НомерГТД,
	|	ТаблицаВидыЗапасов.ВидыЗапасовУказаныВручную,
	|	ТаблицаВидыЗапасов.ДокументРеализации,
	|	ТаблицаВидыЗапасов.ДокументОприходования,
	|	&ТекстПоляТаблицаВидыЗапасовАналитикаУчетаНоменклатурыОтгрузки_,
	|	&ТекстПоляТаблицаВидыЗапасовПериод_
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры,
	|	ВидЗапасов,
	|	ВидЗапасовПолучателя,
	|	НомерГТД
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	// Сгруппируем остатки. Для каждой сгруппированной строки
	// определим использование данного остатка в текущем документе.
	// Необходимо для правильного получения СуммыСНДС из документа,
	// а не усредненной из остатков.
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВтОстаткиБезГруппировки.ОстаткиДокумента) КАК ОстаткиДокумента,
	|
	|	ВтОстаткиБезГруппировки.Организация КАК Организация,
	|	ВтОстаткиБезГруппировки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ВтОстаткиБезГруппировки.Номенклатура КАК Номенклатура,
	|	ВтОстаткиБезГруппировки.Характеристика КАК Характеристика,
	|	ВтОстаткиБезГруппировки.Серия КАК Серия,
	|	ВтОстаткиБезГруппировки.СерияОтгрузки КАК СерияОтгрузки,
	|	ВтОстаткиБезГруппировки.Склад КАК Склад,
	|	ВтОстаткиБезГруппировки.Назначение КАК Назначение,
	|	ВтОстаткиБезГруппировки.НазначениеОтгрузки КАК НазначениеОтгрузки,
	|	ВтОстаткиБезГруппировки.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ВтОстаткиБезГруппировки.СкладОтгрузки КАК СкладОтгрузки,
	|
	#Вставка 
	// 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации
	// ASP_Crow 27.01.2025 000025949 Исправление т.к. НоменклатураНабора не везде прописана
	|   &ТекстКорректировки05
	#КонецВставки
	|	ВтОстаткиБезГруппировки.ВидЗапасов КАК ВидЗапасов,
	|	ВтОстаткиБезГруппировки.ВидЗапасовПолучателя КАК ВидЗапасовПолучателя,
	|	ВтОстаткиБезГруппировки.ВидЗапасовОтгрузки КАК ВидЗапасовОтгрузки,
	|	ВтОстаткиБезГруппировки.КорВидЗапасов КАК КорВидЗапасов,
	|	ВтОстаткиБезГруппировки.НомерГТД КАК НомерГТД,
	|	ВтОстаткиБезГруппировки.ДатаПоступления КАК ДатаПоступления,
	|
	|	МАКСИМУМ(ВтОстаткиБезГруппировки.КоличествоОстатокВсего) КАК КоличествоОстатокВсего,
	|	СУММА(ВтОстаткиБезГруппировки.КоличествоОстаток) КАК КоличествоОстаток,
	|	МАКСИМУМ(ВтОстаткиБезГруппировки.КоличествоПоРНПТОстатокВсего) КАК КоличествоПоРНПТОстатокВсего,
	|	СУММА(ВтОстаткиБезГруппировки.СуммаОстаток) КАК СуммаОстаток,
	|	МАКСИМУМ(ВтОстаткиБезГруппировки.СуммаНДСОстаток) КАК СуммаНДСОстаток,
	|
	|	ВтОстаткиБезГруппировки.ДокументРеализации КАК ДокументРеализации,
	|	ВтОстаткиБезГруппировки.ДокументОприходования КАК ДокументОприходования,
	|	ВтОстаткиБезГруппировки.Период КАК Период,
	|	ВтОстаткиБезГруппировки.ПорядокИспользованияСерии КАК ПорядокИспользованияСерии,
	|	ВтОстаткиБезГруппировки.ПорядокИспользованияСклада КАК ПорядокИспользованияСклада
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ
	|	(ВЫБРАТЬ // ОСТАТКИ, УКАЗАННЫЕ В ДОКУМЕНТЕ
	|		ИСТИНА КАК ОстаткиДокумента,
	|		
	|		Остатки.Организация КАК Организация,
	|		ВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Ключи.Номенклатура КАК Номенклатура,
	|		Ключи.Характеристика КАК Характеристика,
	|		Ключи.Серия КАК Серия,
	|		ВидыЗапасов.СерияОтгрузки КАК СерияОтгрузки,
	|		Ключи.МестоХранения КАК Склад,
	|		Ключи.Назначение КАК Назначение,
	|		Остатки.Назначение КАК НазначениеОтгрузки,
	|		Ключи.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|		ВидыЗапасов.СкладОтгрузки КАК СкладОтгрузки,
	|		
	|		ВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
	|		ВидыЗапасов.ВидЗапасовПолучателя КАК ВидЗапасовПолучателя,
	|		Остатки.ВидЗапасовОтгрузки КАК ВидЗапасовОтгрузки,
	|		Остатки.КорВидЗапасов КАК КорВидЗапасов,
	|		ВидыЗапасов.НомерГТД КАК НомерГТД,
	|		Остатки.ДатаПоступления КАК ДатаПоступления,
	|		
	#Вставка 
	// 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации 
	// ASP_Crow 27.01.2025 000025949 Исправление т.к. НоменклатураНабора не везде прописана
	|		&ТекстКорректировки06
	#КонецВставки
	|		ВидыЗапасов.Количество КАК КоличествоОстатокВсего,
	|		ВЫБОР
	|			КОГДА ВидыЗапасов.ВидыЗапасовУказаныВручную
	|					И (НЕ &ПерезаполнитьВидыЗапасов
	|						ИЛИ &ПроводитьБезКонтроляОстатковТоваровОрганизаций)
	|				ТОГДА ВидыЗапасов.Количество
	|			КОГДА ВидыЗапасов.Знак * Остатки.КоличествоОстаток > ВидыЗапасов.Знак * ВидыЗапасов.Количество
	|				ТОГДА ВидыЗапасов.Количество
	|			ИНАЧЕ Остатки.КоличествоОстаток
	|		КОНЕЦ КАК КоличествоОстаток,
	|		ВидыЗапасов.КоличествоПоРНПТ КАК КоличествоПоРНПТОстатокВсего,
	|	
	|		ВЫБОР
	|			КОГДА (ВидыЗапасов.Знак * Остатки.КоличествоОстаток > ВидыЗапасов.Знак * ВидыЗапасов.Количество)
	|					И Остатки.КоличествоОстаток <> 0
	|				ТОГДА ВидыЗапасов.Количество * Остатки.СуммаОстаток / Остатки.КоличествоОстаток
	|			ИНАЧЕ Остатки.СуммаОстаток
	|		КОНЕЦ КАК СуммаОстаток,
	|		ВидыЗапасов.СуммаНДС КАК СуммаНДСОстаток,
	|		ВидыЗапасов.ДокументРеализации КАК ДокументРеализации,
	|		ВидыЗапасов.ДокументОприходования КАК ДокументОприходования,
	|		ВидыЗапасов.Период КАК Период,
	|		ВЫБОР
	|			КОГДА Остатки.Серия = АналитикаОстатков.Серия
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПорядокИспользованияСерии,
	|		ВЫБОР
	|			КОГДА Остатки.СкладОтгрузки = АналитикаОстатков.МестоХранения
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПорядокИспользованияСклада
	|	ИЗ
	|		ВтВидыЗапасовСводно КАК ВидыЗапасов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|			ПО ВидыЗапасов.АналитикаУчетаНоменклатуры = Ключи.Ссылка
	|			
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК Остатки
	|			ПО Остатки.АналитикаУчетаНоменклатуры = ВидыЗапасов.АналитикаУчетаНоменклатуры
	#Вставка 
	// 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации    
	// ASP_Crow 27.01.2025 000025949 Исправление т.к. НоменклатураНабора не везде прописана
	|				&ТекстКорректировки07
	#КонецВставки
	|				И Остатки.ВидЗапасов = ВидыЗапасов.ВидЗапасов
	|				И (Остатки.Серия = ВидыЗапасов.СерияОтгрузки
	|					ИЛИ ВидыЗапасов.СерияОтгрузки В(ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка), НЕОПРЕДЕЛЕНО))
	|				И (Остатки.СкладОтгрузки = ВидыЗапасов.СкладОтгрузки
	|					ИЛИ ВидыЗапасов.СкладОтгрузки В(ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), НЕОПРЕДЕЛЕНО))
	|				И Остатки.НомерГТД = ВидыЗапасов.НомерГТД
	|				И Остатки.ДокументРеализации = ВидыЗапасов.ДокументРеализации
	|				И Остатки.ДокументОприходования = ВидыЗапасов.ДокументОприходования
	|				И (ВидыЗапасов.Период = ДАТАВРЕМЯ(1,1,1)
	|					ИЛИ ВидыЗапасов.Период = Остатки.ДатаПоступления)
	|			
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК РеквизитыВидаЗапасов
	|			ПО ВидыЗапасов.ВидЗапасов = РеквизитыВидаЗапасов.Ссылка
	|			
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаОстатков
	|			ПО Остатки.АналитикаУчетаНоменклатуры = АналитикаОстатков.Ссылка
	|	
	|	ГДЕ
	|		НЕ Остатки.ВидЗапасов ЕСТЬ NULL
	|		ИЛИ (ВидыЗапасов.ВидыЗапасовУказаныВручную
	|			И (НЕ &ПерезаполнитьВидыЗапасов
	|				ИЛИ &ПроводитьБезКонтроляОстатковТоваровОрганизаций))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ // ОСТАТКИ, НЕ УКАЗАННЫЕ В ДОКУМЕНТЕ
	|		ЛОЖЬ КАК ОстаткиДокумента,
	|		
	|		Остатки.Организация КАК Организация,
	|		Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Ключи.Номенклатура,
	|		Ключи.Характеристика,
	|		Ключи.Серия,
	|		Остатки.Серия,
	|		Ключи.МестоХранения,
	|		Ключи.Назначение,
	|		Остатки.Назначение,
	|		Ключи.СтатьяКалькуляции,
	|		Остатки.СкладОтгрузки КАК СкладОтгрузки,
	|		
	|		Остатки.ВидЗапасов КАК ВидЗапасов,
	|		Остатки.ВидЗапасовПолучателя КАК ВидЗапасовПолучателя,
	|		Остатки.ВидЗапасовОтгрузки КАК ВидЗапасовОтгрузки,
	|		Остатки.КорВидЗапасов КАК КорВидЗапасов,
	|		Остатки.НомерГТД КАК НомерГТД,
	|		Остатки.ДатаПоступления КАК ДатаПоступления,
	|		
	#Вставка 
	// 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации
	// ASP_Crow 27.01.2025 000025949 Исправление т.к. НоменклатураНабора не везде прописана
	|		&ТекстКорректировки08
	#КонецВставки
	|		Остатки.КоличествоОстаток КАК КоличествоОстатокВсего,
	|		Остатки.КоличествоОстаток - ЕСТЬNULL(ВидыЗапасов.Количество, 0) КАК КоличествоОстаток,
	|		&ТекстПоляТаблицаОстатковКоличествоПоРНПТОстаток_ КАК КоличествоПоРНПТОстатокВсего,
	|		ВЫБОР
	|			КОГДА Остатки.КоличествоОстаток <> 0
	|				ТОГДА Остатки.СуммаОстаток - (ЕСТЬNULL(ВидыЗапасов.Количество, 0) * Остатки.СуммаОстаток / Остатки.КоличествоОстаток)
	|			КОГДА ЕСТЬNULL(ВидыЗапасов.Количество, 0) = 0
	|				ТОГДА Остатки.СуммаОстаток
	|			ИНАЧЕ 0 // Сумма остатка подобралась в строках с видом запасов
	|		КОНЕЦ КАК СуммаОстаток,
	|		&ТекстПоляТаблицаОстатковСуммаНДСОстаток_ КАК СуммаНДСОстаток,
	|		ВЫБОР
	|			КОГДА Остатки.ДокументРеализации В (&ПустыеЗначенияДокументаРеализации)
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ Остатки.ДокументРеализации
	|		КОНЕЦ КАК ДокументРеализации,
	|		ВЫБОР
	|			КОГДА Остатки.ДокументОприходования В (&ПустыеЗначенияДокументаОприходования)
	|				ТОГДА НЕОПРЕДЕЛЕНО
	|			ИНАЧЕ Остатки.ДокументОприходования
	|		КОНЕЦ КАК ДокументОприходования,
	|		ВидыЗапасов.Период,
	|		ВЫБОР
	|			КОГДА Остатки.Серия = Ключи.Серия
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА Остатки.СкладОтгрузки = Ключи.МестоХранения
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ТаблицаОстатков КАК Остатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|			ПО Остатки.АналитикаУчетаНоменклатуры = Ключи.Ссылка
	|			
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВтВидыЗапасовСводно КАК ВидыЗапасов
	|			ПО Остатки.АналитикаУчетаНоменклатуры = ВидыЗапасов.АналитикаУчетаНоменклатуры
	#Вставка 
	// 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации 
	// ASP_Crow 27.01.2025 000025949 Исправление т.к. НоменклатураНабора не везде прописана
	|				&ТекстКорректировки09
	#КонецВставки
	|				И Остатки.ВидЗапасов = ВидыЗапасов.ВидЗапасов
	|				И (Остатки.Серия = ВидыЗапасов.СерияОтгрузки
	|					ИЛИ ВидыЗапасов.СерияОтгрузки В(ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка), НЕОПРЕДЕЛЕНО))
	|				И (Остатки.СкладОтгрузки = ВидыЗапасов.СкладОтгрузки
	|					ИЛИ ВидыЗапасов.СкладОтгрузки В(ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), НЕОПРЕДЕЛЕНО))
	|				И Остатки.НомерГТД = ВидыЗапасов.НомерГТД
	|				И Остатки.ДокументРеализации = ВидыЗапасов.ДокументРеализации
	|				И Остатки.ДокументОприходования = ВидыЗапасов.ДокументОприходования
	|				И (ВидыЗапасов.Период = ДАТАВРЕМЯ(1,1,1)
	|					ИЛИ ВидыЗапасов.Период = Остатки.ДатаПоступления)
	|	
	|	ГДЕ
	|		ВЫБОР
	|			КОГДА ВидыЗапасов.Количество ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			КОГДА ВидыЗапасов.Количество = 0
	|				ТОГДА НЕ ВидыЗапасов.НомерСтроки = 99999
	|			КОГДА ВидыЗапасов.Знак * ВидыЗапасов.Количество > 0
	|				ТОГДА ВидыЗапасов.Знак * Остатки.КоличествоОстаток - ВидыЗапасов.Знак * ВидыЗапасов.Количество > 0
	|			ИНАЧЕ ВидыЗапасов.Знак * Остатки.КоличествоОстаток - ВидыЗапасов.Знак * ВидыЗапасов.Количество < 0
	|		КОНЕЦ
	|	
	|	) КАК ВтОстаткиБезГруппировки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтОстаткиБезГруппировки.Организация,
	|	ВтОстаткиБезГруппировки.АналитикаУчетаНоменклатуры,
	|	ВтОстаткиБезГруппировки.Номенклатура,
	|	ВтОстаткиБезГруппировки.Характеристика,
	|	ВтОстаткиБезГруппировки.Серия,
	|	ВтОстаткиБезГруппировки.СерияОтгрузки,
	|	ВтОстаткиБезГруппировки.Склад,
	|	ВтОстаткиБезГруппировки.Назначение,
	|	ВтОстаткиБезГруппировки.НазначениеОтгрузки,
	|	ВтОстаткиБезГруппировки.СтатьяКалькуляции,
	|	ВтОстаткиБезГруппировки.СкладОтгрузки,
	|
	#Вставка 
	// 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации
	// ASP_Crow 27.01.2025 000025949 Исправление т.к. НоменклатураНабора не везде прописана
	|   &ТекстКорректировки10 
	#КонецВставки
	|	ВтОстаткиБезГруппировки.ВидЗапасов,
	|	ВтОстаткиБезГруппировки.ВидЗапасовПолучателя,
	|	ВтОстаткиБезГруппировки.ВидЗапасовОтгрузки,
	|	ВтОстаткиБезГруппировки.КорВидЗапасов,
	|	ВтОстаткиБезГруппировки.НомерГТД,
	|	ВтОстаткиБезГруппировки.ДатаПоступления,
	|	ВтОстаткиБезГруппировки.ДокументРеализации,
	|	ВтОстаткиБезГруппировки.ДокументОприходования,
	|	ВтОстаткиБезГруппировки.Период,
	|	ВтОстаткиБезГруппировки.ПорядокИспользованияСерии,
	|	ВтОстаткиБезГруппировки.ПорядокИспользованияСклада
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Склад КАК Склад,
	|	ЕСТЬNULL(КлючиТоваров.Назначение, НЕОПРЕДЕЛЕНО) КАК Назначение,
	|	ТаблицаДокумента.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьГруппыФинУчета
	|				ИЛИ ТаблицаДокумента.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаДокумента.Номенклатура КАК Справочник.Номенклатура).ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка))
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаДокумента.Номенклатура КАК Справочник.Номенклатура).КодТНВЭД.СырьевойТовар, ЛОЖЬ) КАК СырьевойТовар,
	|	ТаблицаДокумента.ПодакцизныйТовар КАК ПодакцизныйТовар,
	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаДокумента.Характеристика КАК Характеристика,
	|	ТаблицаДокумента.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ТаблицаДокумента.Серия КАК Серия,
	|	ТаблицаДокумента.Количество КАК Количество,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.КоличествоПоРНПТ КАК ЧИСЛО(23, 11)) КАК КоличествоПоРНПТ,
	|	ТаблицаДокумента.СуммаСНДС КАК СуммаСНДС,
	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
	|	ТаблицаДокумента.СуммаВознаграждения КАК СуммаВознаграждения,
	|	ТаблицаДокумента.СуммаНДСВознаграждения КАК СуммаНДСВознаграждения,
	|	ТаблицаДанныхДокумента.Дата КАК ДатаДокумента,
	|	ТаблицаДанныхДокумента.Валюта КАК Валюта,
	|
	|	ЕСТЬNULL(Остатки.ВидЗапасов, НЕОПРЕДЕЛЕНО) КАК ВидЗапасов,
	|	ЕСТЬNULL(Остатки.ВидЗапасовПолучателя, НЕОПРЕДЕЛЕНО) КАК ВидЗапасовПолучателя,
	|	ЕСТЬNULL(Остатки.ВидЗапасовОтгрузки, НЕОПРЕДЕЛЕНО) КАК ВидЗапасовОтгрузки,
	#Вставка
	// 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации 
	// ASP_Crow 27.01.2025 000025949 Исправление т.к. НоменклатураНабора не везде прописана
	|   &ТекстКорректировки11
	#КонецВставки
	|	ЕСТЬNULL(Остатки.КорВидЗапасов, ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)) КАК КорВидЗапасов,
	|	ЕСТЬNULL(РеквизитыВидаЗапасовОтгрузки.РеализацияЗапасовДругойОрганизации, ЛОЖЬ) КАК ОтгрузкаЗапасовДругойОрганизации,
	|	ЕСТЬNULL(Остатки.НомерГТД, НЕОПРЕДЕЛЕНО) КАК НомерГТД,
	|	ВЫБОР
	|		КОГДА &КонтролироватьНомераГТД = ЛОЖЬ
	|				ИЛИ НЕ ТаблицаДокумента.ВестиУчетПоГТД
	// Отключаем проверку для давальцев версии 2.4.
	|				ИЛИ (ЕСТЬNULL(РеквизитыВидаЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка)) В (
	|							ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца),
	|							ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца))
	|					И НЕ ЕСТЬNULL(РеквизитыВидаЗапасов.Договор.ТипДоговора, ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.ПустаяСсылка)) =
	|						ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СДавальцем2_5))
	|			ТОГДА ЛОЖЬ
	// Включается проверка для списания расхождений поступлений приобретения.
	|		КОГДА &КонтролироватьНомераГТД = ИСТИНА
	|				И ТаблицаДокумента.ВестиУчетПоГТД
	|				И (Остатки.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|					ИЛИ Остатки.НомерГТД ЕСТЬ NULL)
	|			ТОГДА ИСТИНА
	|		КОГДА (ТаблицаДокумента.ПрослеживаемыйТовар
	|					ИЛИ (ТаблицаДокумента.ВестиУчетПоГТД
	|						И &ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД))
	|				И (Остатки.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|					ИЛИ Остатки.НомерГТД ЕСТЬ NULL)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеУказанНомерГТД,
	|	ТаблицаДокумента.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|
	|	ЕСТЬNULL(Остатки.ДатаПоступления, ДАТАВРЕМЯ(2399, 1, 1)) КАК ДатаПоступления,
	|	ЕСТЬNULL(Остатки.СкладОтгрузки, НЕОПРЕДЕЛЕНО) КАК СкладОтгрузки,
	|
	|	ЕСТЬNULL(Остатки.КоличествоОстатокВсего, 0) КАК КоличествоОстатокВсего,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(Остатки.КоличествоПоРНПТОстатокВсего, 0) КАК КоличествоПоРНПТОстатокВсего,
	|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ЕСТЬNULL(Остатки.СуммаНДСОстаток, 0) КАК СуммаНДСОстаток,
	|	ЕСТЬNULL(АналитикаОтгрузки.КлючАналитики, ТаблицаДокумента.АналитикаУчетаНоменклатуры) КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомитенту))
	|				И ТаблицаДокумента.ДокументРеализации <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ТаблицаДокумента.ДокументРеализации
	|		ИНАЧЕ ЕСТЬNULL(Остатки.ДокументРеализации, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ КАК ДокументРеализации,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера),
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОтчетКомитенту))
	|				И ТаблицаДокумента.ДокументОприходования <> НЕОПРЕДЕЛЕНО
	|			ТОГДА ТаблицаДокумента.ДокументОприходования
	|		ИНАЧЕ ЕСТЬNULL(Остатки.ДокументОприходования, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ КАК ДокументОприходования,
	|	ТаблицаДокумента.Период КАК Период,
	|	ЕСТЬNULL(Остатки.ПорядокИспользованияСерии, -1) КАК ПорядокИспользованияСерии,
	|	ЕСТЬNULL(Остатки.ПорядокИспользованияСклада, -1) КАК ПорядокИспользованияСклада
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ИСТИНА
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстатки КАК Остатки
	|		ПО ТаблицаДокумента.НоменклатураОстатков = Остатки.Номенклатура
	#Вставка 
	// 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации
	// ASP_Crow 27.01.2025 000025949 Исправление т.к. НоменклатураНабора не везде прописана
	|			&ТекстКорректировки12
	#КонецВставки
	|			И ТаблицаДокумента.ХарактеристикаОстатков = Остатки.Характеристика
	|			И ТаблицаДокумента.СерияОстатков = Остатки.Серия
	|			И ТаблицаДокумента.СкладОстатков = Остатки.Склад
	|			И (ТаблицаДокумента.Назначение = Остатки.Назначение
	|				ИЛИ ТаблицаДанныхДокумента.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера),
	|																	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента),
	//++ Устарело_Переработка24
	|																	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика),
	//-- Устарело_Переработка24
	|																	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика2_5),
	|																	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы)))
	|			И ТаблицаДокумента.СтатьяКалькуляцииОстатков = &ПустоеЗначениеСтатьиКалькуляции
	|			И (ТаблицаДокумента.ДокументРеализации = Остатки.ДокументРеализации
	|				ИЛИ ТаблицаДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера))
	|			И (ТаблицаДокумента.ДокументОприходования = Остатки.ДокументОприходования
	|				ИЛИ ТаблицаДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера))
	|			И (ТаблицаДокумента.НомерГТД = Остатки.НомерГТД
	|				ИЛИ ТаблицаДокумента.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|				ИЛИ Остатки.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
	|				ИЛИ &БезОтбораПоНомерамГТД)
	|			И (ТаблицаДокумента.Период = ДАТАВРЕМЯ(1,1,1)
	|				ИЛИ ТаблицаДокумента.Период <= Остатки.ДатаПоступления)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Остатки.АналитикаУчетаНоменклатуры
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтгрузки
	|		ПО АналитикаОтгрузки.Номенклатура = Ключи.Номенклатура
	|			И АналитикаОтгрузки.Характеристика = Ключи.Характеристика
	|			И АналитикаОтгрузки.Серия = Остатки.СерияОтгрузки
	|			И АналитикаОтгрузки.МестоХранения = Остатки.СкладОтгрузки
	|			И АналитикаОтгрузки.Назначение = Остатки.НазначениеОтгрузки
	|			И АналитикаОтгрузки.СтатьяКалькуляции = Ключи.СтатьяКалькуляции
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПоступленияТоваровОрганизаций КАК ДатыПоступления
	|		ПО ДатыПоступления.ВидЗапасов = Остатки.ВидЗапасов
	|			И ДатыПоступления.Номенклатура = Ключи.Номенклатура
	|			И ДатыПоступления.Характеристика = Ключи.Характеристика
	|			И ДатыПоступления.Серия = Ключи.Серия
	|			И ДатыПоступления.Назначение = Ключи.Назначение
	|			И ДатыПоступления.НомерГТД = Остатки.НомерГТД
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиТоваров
	|		ПО КлючиТоваров.Ссылка = ТаблицаДокумента.АналитикаУчетаНоменклатуры
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК РеквизитыВидаЗапасов
	|		ПО РеквизитыВидаЗапасов.Ссылка = Остатки.ВидЗапасов
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК РеквизитыВидаЗапасовОтгрузки
	|		ПО РеквизитыВидаЗапасовОтгрузки.Ссылка = Остатки.ВидЗапасовОтгрузки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	ОстаткиДокумента УБЫВ,
	|	Период,
	|	ТаблицаДокумента.НомерГТД = Остатки.НомерГТД УБЫВ,
	|	ДатаПоступления,
	|	ДатыПоступления.ДатаПоступления,
	|	ПорядокИспользованияСерии УБЫВ,
	|	ПорядокИспользованияСклада УБЫВ
	|
	|ИТОГИ
	|	МАКСИМУМ(Количество),
	|	МАКСИМУМ(КоличествоПоРНПТ),
	|	МАКСИМУМ(СуммаСНДС),
	|	МАКСИМУМ(СтавкаНДС),
	|	МАКСИМУМ(СуммаНДС),
	|	МАКСИМУМ(СуммаВознаграждения),
	|	МАКСИМУМ(СуммаНДСВознаграждения),
	|	СУММА(КоличествоОстаток),
	|	МАКСИМУМ(ТипНоменклатуры),
	|	МАКСИМУМ(ПодакцизныйТовар)
	|ПО
	|	НомерСтроки";
	
	ОбщегоНазначенияУТ.ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
																Запрос.Текст,
																"&ТекстПоляТаблицаТоваровКоличествоПоРНПТ_",
																"ТаблицаТоваров",
																"КоличествоПоРНПТ",
																"СУММА(ВЫРАЗИТЬ(ТаблицаТоваров.КоличествоПоРНПТ КАК ЧИСЛО(23, 11)))",
																"0");
	
	ОбщегоНазначенияУТ.ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
																Запрос.Текст,
																"&ТекстПоляТаблицаТоваровДокументРеализации_",
																"ТаблицаТоваров",
																"ДокументРеализации",
																"ТаблицаТоваров.ДокументРеализации",
																"НЕОПРЕДЕЛЕНО");
	
	ОбщегоНазначенияУТ.ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
																Запрос.Текст,
																"&ТекстПоляТаблицаТоваровДокументОприходования_",
																"ТаблицаТоваров",
																"ДокументОприходования",
																"ТаблицаТоваров.ДокументОприходования",
																"НЕОПРЕДЕЛЕНО");
	
	ОбщегоНазначенияУТ.ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
																Запрос.Текст,
																"&ТекстПоляТаблицаТоваровПериод_",
																"ТаблицаТоваров",
																"Период",
																"ТаблицаТоваров.Период",
																"ДАТАВРЕМЯ(1,1,1)");
	
	ОбщегоНазначенияУТ.ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
																Запрос.Текст,
																"&ТекстПоляТаблицаВидыЗапасовАналитикаУчетаНоменклатурыОтгрузки_",
																"ТаблицаВидыЗапасов",
																"АналитикаУчетаНоменклатурыОтгрузки",
																"ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки",
																"ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)");
	
	ОбщегоНазначенияУТ.ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
																Запрос.Текст,
																"&ТекстПоляТаблицаВидыЗапасовПериод_",
																"ТаблицаВидыЗапасов",
																"Период",
																"ТаблицаВидыЗапасов.Период",
																"ДАТАВРЕМЯ(1,1,1)");
	
	ОбщегоНазначенияУТ.ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
																Запрос.Текст,
																"&ТекстПоляТаблицаВидыЗапасовКоличествоПоРНПТ_",
																"ТаблицаВидыЗапасов",
																"КоличествоПоРНПТ",
																"СУММА(ВЫРАЗИТЬ(ТаблицаВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11)))",
																"0");
	
	ОбщегоНазначенияУТ.ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
																Запрос.Текст,
																"&ТекстПоляТаблицаВидыЗапасовСуммаНДС_",
																"ТаблицаВидыЗапасов",
																"СуммаНДС",
																"СУММА(ТаблицаВидыЗапасов.СуммаНДС)",
																"0");
	
	ОбщегоНазначенияУТ.ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
																Запрос.Текст,
																"&ТекстПоляТаблицаОстатковКоличествоПоРНПТОстаток_",
																"ТаблицаОстатков",
																"КоличествоПоРНПТОстаток",
																"ВЫРАЗИТЬ(Остатки.КоличествоПоРНПТОстаток КАК ЧИСЛО(23, 11))",
																"0");
	
	ОбщегоНазначенияУТ.ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
																Запрос.Текст,
																"&ТекстПоляТаблицаОстатковСуммаНДСОстаток_",
																"ТаблицаОстатков",
																"СуммаНДСОстаток",
																"Остатки.СуммаНДСОстаток",
																"0");

	ОбщегоНазначенияУТ.ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
																Запрос.Текст,
																"&ТекстПоляТаблицаТоваровНоменклатураПартнера_",
																"ТаблицаТоваров",
																"НоменклатураПартнера",
																"ТаблицаТоваров.НоменклатураПартнера",
																"ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)");
	
	КонтролироватьНомераГТД = ?(ДополнительныеСвойства.Свойство("КонтролироватьНомераГТД"),
								ДополнительныеСвойства.КонтролироватьНомераГТД,
								Неопределено);
	
	ПустыеЗначенияДокументаРеализации = Новый Массив;
	ПустыеЗначенияДокументаРеализации.Добавить(Документы.РеализацияТоваровУслуг.ПустаяСсылка());
	ПустыеЗначенияДокументаРеализации.Добавить(Документы.ПередачаТоваровМеждуОрганизациями.ПустаяСсылка());
	ПустыеЗначенияДокументаРеализации.Добавить(Документы.ОтчетОРозничныхПродажах.ПустаяСсылка());
	ПустыеЗначенияДокументаРеализации.Добавить(Неопределено);
	
	ПустыеЗначенияДокументаПоступления = Новый Массив;
	ПустыеЗначенияДокументаПоступления.Добавить(Документы.ПриобретениеТоваровУслуг.ПустаяСсылка());
	ПустыеЗначенияДокументаПоступления.Добавить(Неопределено);
	
	ПроводитьБезКонтроляОстатковТоваровОрганизаций = ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций 
														Или Не Константы.КонтролироватьОстаткиТоваровОрганизаций.Получить();
	
	Запрос.УстановитьПараметр("ФормироватьВидыЗапасовПоСделкам",
								ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоСделкам"));
	Запрос.УстановитьПараметр("ИспользоватьГруппыФинУчета",
								ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета"));
	Запрос.УстановитьПараметр("ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД",
								ПолучитьФункциональнуюОпцию("ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД"));
	Запрос.УстановитьПараметр("БезОтбораПоНомерамГТД", ПараметрыЗаполнения.БезОтбораПоНомерамГТД);
	Запрос.УстановитьПараметр("КонтролироватьНомераГТД", КонтролироватьНомераГТД);
	Запрос.УстановитьПараметр("ПустыеЗначенияДокументаРеализации", ПустыеЗначенияДокументаРеализации);
	Запрос.УстановитьПараметр("ПустыеЗначенияДокументаОприходования", ПустыеЗначенияДокументаПоступления);
	Запрос.УстановитьПараметр("ПроводитьБезКонтроляОстатковТоваровОрганизаций",
								ПроводитьБезКонтроляОстатковТоваровОрганизаций);
	#Удаление
	Запрос.УстановитьПараметр("ПустоеЗначениеСтатьиКалькуляции", "");
	#КонецУдаления
	
	#Вставка 
	//++ASP_Crow 27.01.2025 000025949 Замены текстов по корректировке 
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстКорректировки01", ?(ПараметрыЗаполнения.ТипДок = Тип("ДокументОбъект.КорректировкаРеализации"),
	"ВЫБОР КОГДА &Корректировка = Истина ТОГДА ТаблицаТоваров.НоменклатураНабора ИНАЧЕ ИСТИНА КОНЕЦ КАК НоменклатураНабора", "ИСТИНА КАК НоменклатураНабора"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстКорректировки02", ?(ПараметрыЗаполнения.ТипДок = Тип("ДокументОбъект.КорректировкаРеализации"),
	"ВЫБОР КОГДА &Корректировка = Истина ТОГДА ТаблицаТоваров.НоменклатураНабора ИНАЧЕ ИСТИНА КОНЕЦ", "ИСТИНА"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстКорректировки03", ?(ПараметрыЗаполнения.ТипДок = Тип("ДокументОбъект.КорректировкаРеализации"),
	"ВЫБОР КОГДА &Корректировка = Истина ТОГДА ТаблицаВидыЗапасов.НоменклатураНабора ИНАЧЕ ИСТИНА КОНЕЦ Как НоменклатураНабора,", "ИСТИНА как НоменклатураНабора,"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстКорректировки04", ?(ПараметрыЗаполнения.ТипДок = Тип("ДокументОбъект.КорректировкаРеализации"),
	"ВЫБОР КОГДА &Корректировка = Истина ТОГДА ТаблицаВидыЗапасов.НоменклатураНабора ИНАЧЕ ИСТИНА КОНЕЦ,", "ИСТИНА,"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстКорректировки05", ?(ПараметрыЗаполнения.ТипДок = Тип("ДокументОбъект.КорректировкаРеализации"),
	"ВтОстаткиБезГруппировки.НоменклатураНабора Как НоменклатураНабора,", "ИСТИНА,"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстКорректировки06", ?(ПараметрыЗаполнения.ТипДок = Тип("ДокументОбъект.КорректировкаРеализации"),
	"isnull(ВидыЗапасов.НоменклатураНабора, Истина) Как НоменклатураНабора,", "ИСТИНА КАК НоменклатураНабора,"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстКорректировки07", ?(ПараметрыЗаполнения.ТипДок = Тип("ДокументОбъект.КорректировкаРеализации"),
	"И Выбор когда &Корректировка Тогда Остатки.НоменклатураНабора = ВидыЗапасов.НоменклатураНабора Иначе Истина Конец", "И ИСТИНА"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстКорректировки08", ?(ПараметрыЗаполнения.ТипДок = Тип("ДокументОбъект.КорректировкаРеализации"),
	"isnull(Остатки.НоменклатураНабора, Истина) Как НоменклатураНабора,", "ИСТИНА как НоменклатураНабора,"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстКорректировки09", ?(ПараметрыЗаполнения.ТипДок = Тип("ДокументОбъект.КорректировкаРеализации"),
	"И Выбор Когда &Корректировка Тогда Остатки.НоменклатураНабора = ВидыЗапасов.НоменклатураНабора Иначе Истина Конец", "И ИСТИНА"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстКорректировки10", ?(ПараметрыЗаполнения.ТипДок = Тип("ДокументОбъект.КорректировкаРеализации"),
	"ВтОстаткиБезГруппировки.НоменклатураНабора,", "ИСТИНА,"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстКорректировки11", ?(ПараметрыЗаполнения.ТипДок = Тип("ДокументОбъект.КорректировкаРеализации"),
	"ТаблицаДокумента.НоменклатураНабора Как НоменклатураНабора,", "ИСТИНА Как НоменклатураНабора,"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстКорректировки12", ?(ПараметрыЗаполнения.ТипДок = Тип("ДокументОбъект.КорректировкаРеализации"),
	"И Выбор Когда &Корректировка Тогда ТаблицаДокумента.НоменклатураНабора = Остатки.НоменклатураНабора Иначе Истина Конец ", "И ИСТИНА"));
	//--ASP_Crow 27.01.2025 000025949
	
	
	Запрос.УстановитьПараметр("ПустоеЗначениеСтатьиКалькуляции", Справочники.СтатьиКалькуляции.ПустаяСсылка());
	// 000025702 АСП Лебедев 16/01/24 Доработка заполнения запасов по корректировке реализации
	Запрос.УстановитьПараметр("Корректировка", ПараметрыЗаполнения.ТипДок = Тип("ДокументОбъект.КорректировкаРеализации"));
	#КонецВставки
	УчетПрослеживаемыхТоваровЛокализация.УстановитьПараметрыИспользованияУчетаПрослеживаемыхТоваров(Запрос);
	
	ПроверитьНеобходимостьПерезаполненияВидовЗапасовДокумента(ДополнительныеСвойства, Запрос);
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Возврат Запрос;
	
КонецФункции

&ИзменениеИКонтроль("ТаблицаОстатковРеализованныхТоваров")
Процедура асп_ТаблицаОстатковРеализованныхТоваров(ДокументОбъект, МенеджерВременныхТаблиц, ПараметрыЗаполненияВидовЗапасов)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	#Удаление
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации КАК ДокументРеализации,
	|	ТаблицаТоваров.СпособОпределенияСебестоимости КАК СпособОпределенияСебестоимости,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры) КАК АналитикаУчетаНоменклатуры,
	|	&ТекстПоляТаблицаТоваровНоменклатураПартнера_ КАК НоменклатураПартнера	
	|ПОМЕСТИТЬ СгруппированнаяТаблицаТоваров
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации КАК Ссылка,
	|	КлючиАналитикиУчетаНоменклатуры.КлючАналитики КАК АналитикаУчетаНоменклатуры
	|ПОМЕСТИТЬ ТаблицаТоваровСКлючамиПоВсемСкладам
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|		ПО ТаблицаТоваров.Номенклатура = КлючиАналитикиУчетаНоменклатуры.Номенклатура
	|			И ТаблицаТоваров.Характеристика = КлючиАналитикиУчетаНоменклатуры.Характеристика
	|			И (&ЭтоВозврат
	|				ИЛИ (НЕ &ЭтоВозврат
	|					И ТаблицаТоваров.Серия = КлючиАналитикиУчетаНоменклатуры.Серия))
	|ГДЕ
	|	ТаблицаТоваров.СпособОпределенияСебестоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.Ссылка КАК ДокументРеализации,
	|	ТЧВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД КАК НомерГТД,
	|	ТЧВидыЗапасов.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ПОМЕСТИТЬ РеализованныеТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка.Проведен
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	ТЧВидыЗапасов.Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	0 КАК СуммаНДС
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	(ТЧВидыЗапасов.Ссылка, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.ДокументРеализации,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	-ТЧВидыЗапасов.Количество,
	|	0 КАК КоличествоПоРНПТ,
	|	0 КАК СуммаНДС
	|ИЗ
	|	Документ.ОтчетОРозничныхВозвратах.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И (ТЧВидыЗапасов.ДокументРеализации, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка.ДокументОснование,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ТЧВидыЗапасов.КорВидЗапасов КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|							ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|						ТОГДА 0
	|					ИНАЧЕ ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|				КОНЕЦ
	|			ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И НЕ &КорректировкаРеализацииПослеПереходаПраваСобственности
	|	И (ТЧВидыЗапасов.Ссылка.ДокументОснование, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.КорАналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка.ДокументОснование,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ТЧВидыЗапасов.КорВидЗапасов КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|							ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|						ТОГДА 0
	|					ИНАЧЕ ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|				КОНЕЦ
	|			ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И &КорректировкаРеализацииПослеПереходаПраваСобственности
	|	И (ТЧВидыЗапасов.Ссылка.ДокументОснование, ТЧВидыЗапасов.КорАналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка.ДокументОснование,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ТЧВидыЗапасов.КорВидЗапасов КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА -ТЧВидыЗапасов.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|							ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|						ТОГДА 0
	|					ИНАЧЕ -ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|				КОНЕЦ
	|			ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА -ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК ТЧВидыЗапасов
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И НЕ &КорректировкаРеализацииПослеПереходаПраваСобственности
	|	И (ТЧВидыЗапасов.Ссылка.ДокументОснование, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.КорАналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка.ДокументОснование,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ТЧВидыЗапасов.КорВидЗапасов КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА -ТЧВидыЗапасов.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|							ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|						ТОГДА 0
	|					ИНАЧЕ -ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|				КОНЕЦ
	|			ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА -ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК ТЧВидыЗапасов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ТЧВидыЗапасов.Ссылка.ДокументОснование = РеализацияТоваровУслуг.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И &КорректировкаРеализацииПослеПереходаПраваСобственности
	|	И (ТЧВидыЗапасов.Ссылка.ДокументОснование, ТЧВидыЗапасов.КорАналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.Ссылка.ДокументОснование,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовКорректировкаВыручки КАК ТЧВидыЗапасов
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка.ДокументОснование, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.ДокументРеализации,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	-ТЧВидыЗапасов.Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ -ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	0 КАК СуммаНДС
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.ДокументРеализации, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.Ссылка КАК ДокументРеализации,
	|	ТЧВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД КАК НомерГТД,
	|	ТЧВидыЗапасов.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ИЗ
	|	Документ.АктВыполненныхРабот.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И РеестрДокументов.Проведен
	|			И НЕ РеестрДокументов.ДополнительнаяЗапись
	|
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка.Проведен
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов, ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатурыОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.ДокументРеализации					КАК ДокументРеализации,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатурыОтгрузки	КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	КлючиАналитики.Номенклатура							КАК Номенклатура,
	|	КлючиАналитики.Характеристика						КАК Характеристика,
	|	КлючиАналитики.Назначение							КАК Назначение,
	|	КлючиАналитики.Серия								КАК Серия,
	|	КлючиАналитики.МестоХранения						КАК МестоХранения,
	|	ТаблицаТоваров.ВидЗапасов							КАК ВидЗапасов,
	|	ТаблицаТоваров.КорВидЗапасов						КАК КорВидЗапасов,
	|	ТаблицаТоваров.НомерГТД								КАК НомерГТД,
	|	СУММА(ТаблицаТоваров.Количество)					КАК Количество,
	|	СУММА(ТаблицаТоваров.КоличествоПоРНПТ)				КАК КоличествоПоРНПТ,
	|	СУММА(ТаблицаТоваров.СуммаНДС)						КАК СуммаНДС
	|ПОМЕСТИТЬ РеализованныеТоварыСгруппированная
	|ИЗ
	|	РеализованныеТовары КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатурыОтгрузки = КлючиАналитики.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.ДокументРеализации,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатурыОтгрузки,
	|	КлючиАналитики.Номенклатура,
	|	КлючиАналитики.Характеристика,
	|	КлючиАналитики.Назначение,
	|	КлючиАналитики.Серия,
	|	КлючиАналитики.МестоХранения,
	|	ТаблицаТоваров.ВидЗапасов,
	|	ТаблицаТоваров.КорВидЗапасов,
	|	ТаблицаТоваров.НомерГТД
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаТоваров.Количество) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации				КАК ДокументРеализации,
	|	ТаблицаТоваров.СпособОпределенияСебестоимости	КАК СпособОпределенияСебестоимости,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
	|	КлючиАналитики.Номенклатура						КАК Номенклатура,
	|	КлючиАналитики.Характеристика					КАК Характеристика,
	|	КлючиАналитики.Назначение						КАК Назначение,
	|	КлючиАналитики.Серия							КАК Серия,
	|	КлючиАналитики.МестоХранения					КАК МестоХранения,
	|	РеализованныеТовары.Серия						КАК СерияДляСоединения,
	|	ТаблицаТоваров.НоменклатураПартнера				КАК НоменклатураПартнера
	|ПОМЕСТИТЬ ТаблицаТоваровДляСоединения
	|ИЗ
	|	СгруппированнаяТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеализованныеТоварыСгруппированная КАК РеализованныеТовары
	|		ПО КлючиАналитики.Номенклатура = РеализованныеТовары.Номенклатура
	|			И КлючиАналитики.Характеристика = РеализованныеТовары.Характеристика
	|			И (КлючиАналитики.Серия = РеализованныеТовары.Серия
	|				ИЛИ КлючиАналитики.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	|ГДЕ
	|	&ЭтоВозврат
	|	И НЕ РеализованныеТовары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации				КАК ДокументРеализации,
	|	ТаблицаТоваров.СпособОпределенияСебестоимости	КАК СпособОпределенияСебестоимости,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
	|	КлючиАналитики.Номенклатура						КАК Номенклатура,
	|	КлючиАналитики.Характеристика					КАК Характеристика,
	|	КлючиАналитики.Назначение						КАК Назначение,
	|	КлючиАналитики.Серия							КАК Серия,
	|	КлючиАналитики.МестоХранения					КАК МестоХранения,
	|	РеализованныеТовары.Серия						КАК СерияДляСоединения,
	|	ТаблицаТоваров.НоменклатураПартнера				КАК НоменклатураПартнера
	|ИЗ
	|	СгруппированнаяТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеализованныеТоварыСгруппированная КАК РеализованныеТовары
	|		ПО КлючиАналитики.Номенклатура = РеализованныеТовары.Номенклатура
	|			И КлючиАналитики.Характеристика = РеализованныеТовары.Характеристика
	|			И (КлючиАналитики.Серия = РеализованныеТовары.Серия
	|				ИЛИ НЕ КлючиАналитики.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	|ГДЕ
	|	&ЭтоВозврат
	|	И РеализованныеТовары.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации				КАК ДокументРеализации,
	|	ТаблицаТоваров.СпособОпределенияСебестоимости	КАК СпособОпределенияСебестоимости,
	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
	|	КлючиАналитики.Номенклатура						КАК Номенклатура,
	|	КлючиАналитики.Характеристика					КАК Характеристика,
	|	КлючиАналитики.Назначение						КАК Назначение,
	|	КлючиАналитики.Серия							КАК Серия,
	|	КлючиАналитики.МестоХранения					КАК МестоХранения,
	|	КлючиАналитики.Серия							КАК СерияДляСоединения,
	|	ТаблицаТоваров.НоменклатураПартнера				КАК НоменклатураПартнера
	|ИЗ
	|	СгруппированнаяТаблицаТоваров КАК ТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитики
	|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры = КлючиАналитики.Ссылка
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеализованныеТоварыСгруппированная КАК РеализованныеТовары
	|		ПО КлючиАналитики.Номенклатура = РеализованныеТовары.Номенклатура
	|			И КлючиАналитики.Характеристика = РеализованныеТовары.Характеристика
	|			И КлючиАналитики.Серия = РеализованныеТовары.Серия
	|ГДЕ
	|	НЕ &ЭтоВозврат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокумента.Организация КАК Организация,
	|	ТаблицаДанныхДокумента.Склад КАК Склад,
	|	СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	РеализованныеТовары.Номенклатура КАК Номенклатура,
	|	РеализованныеТовары.Характеристика КАК Характеристика,
	|	РеализованныеТовары.Серия КАК Серия,
	|	РеализованныеТовары.МестоХранения КАК СкладОтгрузки,
	|	РеализованныеТовары.Назначение КАК Назначение,
	|	РеализованныеТовары.ДокументРеализации КАК ДокументРеализации,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОприходования,
	|	СгруппированнаяТаблицаТоваров.НоменклатураПартнера КАК НоменклатураПартнера,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА РеализованныеТовары.ВидЗапасов.ВидЗапасовВладельца
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасовВладельца,
	|	РеализованныеТовары.ВидЗапасов КАК ВидЗапасовОтгрузки,
	|	РеализованныеТовары.КорВидЗапасов КАК КорВидЗапасов,
	|	РеализованныеТовары.НомерГТД КАК НомерГТД,
	|	ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка) КАК Сделка,
	|	НЕОПРЕДЕЛЕНО КАК ВидЗапасовПолучателя,
	|	НЕОПРЕДЕЛЕНО КАК ДатаПоступления,
	|	СУММА(РеализованныеТовары.Количество) КАК КоличествоОстаток,
	|	СУММА(ВЫРАЗИТЬ(РеализованныеТовары.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))) КАК КоличествоПоРНПТОстаток,
	|	0 КАК СуммаОстаток,
	|	СУММА(РеализованныеТовары.СуммаНДС) КАК СуммаНДСОстаток
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	РеализованныеТоварыСгруппированная КАК РеализованныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваровДляСоединения КАК СгруппированнаяТаблицаТоваров
	|		ПО РеализованныеТовары.Номенклатура = СгруппированнаяТаблицаТоваров.Номенклатура
	|			И РеализованныеТовары.Характеристика = СгруппированнаяТаблицаТоваров.Характеристика
	|			И РеализованныеТовары.Серия = СгруппированнаяТаблицаТоваров.СерияДляСоединения
	|			И ВЫБОР
	|				КОГДА &ЭтоКорректировкаРеализации
	|					ТОГДА РеализованныеТовары.МестоХранения = СгруппированнаяТаблицаТоваров.МестоХранения
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|			И РеализованныеТовары.ДокументРеализации = СгруппированнаяТаблицаТоваров.ДокументРеализации
	|			И (
	|				(&ЭтоКорректировкаРеализации
	|					И РеализованныеТовары.Назначение = СгруппированнаяТаблицаТоваров.Назначение)
	|				ИЛИ
	|				(НЕ &ЭтоКорректировкаРеализации
	|					И (РеализованныеТовары.Назначение = СгруппированнаяТаблицаТоваров.Назначение
	|						ИЛИ СгруппированнаяТаблицаТоваров.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|						ИЛИ РеализованныеТовары.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)))
	|				)
	|			И (СгруппированнаяТаблицаТоваров.СпособОпределенияСебестоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанныхДокумента.Склад,
	|	РеализованныеТовары.Номенклатура,
	|	РеализованныеТовары.Серия,
	|	СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры,
	|	РеализованныеТовары.Назначение,
	|	РеализованныеТовары.МестоХранения,
	|	РеализованныеТовары.НомерГТД,
	|	ТаблицаДанныхДокумента.Организация,
	|	РеализованныеТовары.ДокументРеализации,
	|	СгруппированнаяТаблицаТоваров.НоменклатураПартнера,
	|	РеализованныеТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА РеализованныеТовары.ВидЗапасов.ВидЗапасовВладельца
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ,
	|	РеализованныеТовары.ВидЗапасов,
	|	РеализованныеТовары.КорВидЗапасов
	|
	|ИМЕЮЩИЕ
	|	СУММА(РеализованныеТовары.Количество) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокумента.Организация,
	|	ТаблицаДанныхДокумента.Склад,
	|	СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Номенклатура,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Характеристика,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Серия,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.МестоХранения,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Назначение,
	|	ТаблицаВидыЗапасов.ДокументРеализации,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОприходования,
	|	СгруппированнаяТаблицаТоваров.НоменклатураПартнера,
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	|	ТаблицаВидыЗапасов.КорВидЗапасов,
	|	ТаблицаВидыЗапасов.НомерГТД,
	|	ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаВидыЗапасов.Количество,
	|	ВЫРАЗИТЬ(ТаблицаВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11)),
	|	0,
	|	ТаблицаВидыЗапасов.СуммаНДС
	|ИЗ
	|	СгруппированнаяТаблицаТоваров КАК СгруппированнаяТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВидыЗапасов КАК ТаблицаВидыЗапасов
	|		ПО СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры = ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры
	|			И СгруппированнаяТаблицаТоваров.СпособОпределенияСебестоимости <> ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи)
	|			И ТаблицаВидыЗапасов.СпособОпределенияСебестоимости <> ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РеализованныеТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СгруппированнаяТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаТоваровСКлючамиПоВсемСкладам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РеализованныеТоварыСгруппированная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаТоваровДляСоединения";
	#КонецУдаления
	
	#Вставка
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации КАК ДокументРеализации,
	|	ТаблицаТоваров.СпособОпределенияСебестоимости КАК СпособОпределенияСебестоимости,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры) КАК АналитикаУчетаНоменклатуры,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации = ИСТИНА
	|			ТОГДА ТаблицаТоваров.НоменклатураНабора
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НоменклатураНабора,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации = ИСТИНА
	|			ТОГДА ТаблицаТоваров.НомерГТД
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НомерГТД,
	|	&ТекстПоляТаблицаТоваровНоменклатураПартнера_ КАК НоменклатураПартнера
	|ПОМЕСТИТЬ СгруппированнаяТаблицаТоваров
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.ДокументРеализации КАК Ссылка,
	|	КлючиАналитикиУчетаНоменклатуры.КлючАналитики КАК АналитикаУчетаНоменклатуры
	|ПОМЕСТИТЬ ТаблицаТоваровСКлючамиПоВсемСкладам
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|		ПО ТаблицаТоваров.Номенклатура = КлючиАналитикиУчетаНоменклатуры.Номенклатура
	|			И ТаблицаТоваров.Характеристика = КлючиАналитикиУчетаНоменклатуры.Характеристика
	|			И ТаблицаТоваров.Серия = КлючиАналитикиУчетаНоменклатуры.Серия
	|ГДЕ
	|	ТаблицаТоваров.СпособОпределенияСебестоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.АналитикаУчетаНаборов КАК АналитикаУчетаНаборовОтгрузки,
	|	ТЧВидыЗапасов.Ссылка КАК ДокументРеализации,
	|	ТЧВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка) КАК КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД КАК НомерГТД,
	|	ТЧВидыЗапасов.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|	КОНЕЦ КАК КоличествоПоРНПТ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаНДС
	|ПОМЕСТИТЬ РеализованныеТовары
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И (РеестрДокументов.Проведен)
	|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка.Проведен
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов,
	|				ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.АналитикаУчетаНаборов,
	|	ТЧВидыЗапасов.Ссылка,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка),
	|	ТЧВидыЗапасов.НомерГТД,
	|	ТЧВидыЗапасов.Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|	КОНЕЦ,
	|	0
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И (РеестрДокументов.Проведен)
	|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	|ГДЕ
	|	(ТЧВидыЗапасов.Ссылка, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов,
	|				ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.АналитикаУчетаНаборов,
	|	ТЧВидыЗапасов.Ссылка,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка),
	|	ТЧВидыЗапасов.НомерГТД,
	|	-ТЧВидыЗапасов.Количество,
	|	0,
	|	0
	|ИЗ
	|	Документ.ОтчетОРозничныхВозвратах.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|ГДЕ
	|	(ТЧВидыЗапасов.Ссылка, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтРозничногоПокупателя)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов,
	|				ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.АналитикаУчетаНаборов,
	|	ТЧВидыЗапасов.Ссылка.ДокументОснование,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ТЧВидыЗапасов.КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|							ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|						ТОГДА 0
	|					ИНАЧЕ ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК ТЧВидыЗапасов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ТЧВидыЗапасов.Ссылка.ДокументОснование = РеализацияТоваровУслуг.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И (РеестрДокументов.Проведен)
	|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка.ДокументОснование, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов,
	|				ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.АналитикаУчетаНаборов,
	|	ТЧВидыЗапасов.Ссылка.ДокументОснование,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ТЧВидыЗапасов.КорВидЗапасов,
	|	ТЧВидыЗапасов.НомерГТД,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА -ТЧВидыЗапасов.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ТЧВидыЗапасов.НаДоходыРасходы
	|				ИЛИ &ЭтоКорректировкаРеализации
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|							ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|						ТОГДА 0
	|					ИНАЧЕ -(ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11)))
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА -ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК ТЧВидыЗапасов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ТЧВидыЗапасов.Ссылка.ДокументОснование = РеализацияТоваровУслуг.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И (РеестрДокументов.Проведен)
	|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка.ДокументОснование, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов,
	|				ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатуры,
	|	ТЧВидыЗапасов.АналитикаУчетаНаборов,
	|	ТЧВидыЗапасов.Ссылка.ДокументОснование,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка),
	|	ТЧВидыЗапасов.НомерГТД,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ЭтоКорректировкаРеализации
	|			ТОГДА ТЧВидыЗапасов.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.КорректировкаРеализации.ВидыЗапасовКорректировкаВыручки КАК ТЧВидыЗапасов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ТЧВидыЗапасов.Ссылка.ДокументОснование = РеализацияТоваровУслуг.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И (РеестрДокументов.Проведен)
	|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка.ДокументОснование, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов,
	|				ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки,
	|	ТЧВидыЗапасов.АналитикаУчетаНаборов,
	|	ТЧВидыЗапасов.ДокументРеализации,
	|	ТЧВидыЗапасов.ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка),
	|	ТЧВидыЗапасов.НомерГТД,
	|	-ТЧВидыЗапасов.Количество,
	|	ВЫБОР
	|		КОГДА НЕ &ИспользоватьУчетПрослеживаемыхИмпортныхТоваров
	|				ИЛИ НАЧАЛОПЕРИОДА(ТЧВидыЗапасов.Ссылка.Дата, МЕСЯЦ) < &ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров
	|			ТОГДА 0
	|		ИНАЧЕ -(ВЫРАЗИТЬ(ТЧВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11)))
	|	КОНЕЦ,
	|	0
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента.ВидыЗапасов КАК ТЧВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО ТЧВидыЗапасов.Ссылка.Организация = ТаблицаДанныхДокумента.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТЧВидыЗапасов.Ссылка = РеестрДокументов.СторнируемыйДокумент
	|			И (РеестрДокументов.Проведен)
	|			И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	|ГДЕ
	|	ТЧВидыЗапасов.Ссылка <> &Ссылка
	|	И РеестрДокументов.Ссылка ЕСТЬ NULL
	|	И (ТЧВидыЗапасов.Ссылка.ДокументРеализации, ТЧВидыЗапасов.АналитикаУчетаНоменклатуры) В
	|			(ВЫБРАТЬ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.Ссылка,
	|				ТаблицаТоваровСКлючамиПоВсемСкладам.АналитикаУчетаНоменклатуры
	|			ИЗ
	|				ТаблицаТоваровСКлючамиПоВсемСкладам)
	|	И ТЧВидыЗапасов.Ссылка.Проведен
	|	И ТЧВидыЗапасов.Ссылка.Дата <= КОНЕЦПЕРИОДА(ТаблицаДанныхДокумента.Дата, ДЕНЬ)
	|	И (ТЧВидыЗапасов.ВидЗапасов, ИСТИНА) В
	|			(ВЫБРАТЬ
	|				ДоступныеВидыЗапасов.ВидЗапасов,
	|				ИСТИНА
	|			ИЗ
	|				ДоступныеВидыЗапасов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатурыОтгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокумента.Организация КАК Организация,
	|	ТаблицаДанныхДокумента.Склад КАК Склад,
	|	СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Номенклатура КАК Номенклатура,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Характеристика КАК Характеристика,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Серия КАК Серия,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.МестоХранения КАК СкладОтгрузки,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Назначение КАК Назначение,
	|	РеализованныеТовары.ДокументРеализации КАК ДокументРеализации,
	|	СгруппированнаяТаблицаТоваров.НоменклатураПартнера КАК НоменклатураПартнера,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОприходования,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА РеализованныеТовары.ВидЗапасов.ВидЗапасовВладельца
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ КАК ВидЗапасовВладельца,
	|	РеализованныеТовары.ВидЗапасов КАК ВидЗапасовОтгрузки,
	|	РеализованныеТовары.КорВидЗапасов КАК КорВидЗапасов,
	|	РеализованныеТовары.НомерГТД КАК НомерГТД,
	|	ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка) КАК Сделка,
	|	НЕОПРЕДЕЛЕНО КАК ВидЗапасовПолучателя,
	|	НЕОПРЕДЕЛЕНО КАК ДатаПоступления,
	|	СУММА(РеализованныеТовары.Количество) КАК КоличествоОстаток,
	|	СУММА(ВЫРАЗИТЬ(РеализованныеТовары.КоличествоПоРНПТ КАК ЧИСЛО(23, 11))) КАК КоличествоПоРНПТОстаток,
	|	0 КАК СуммаОстаток,
	|	СУММА(РеализованныеТовары.СуммаНДС) КАК СуммаНДСОстаток,
	|	1 КАК тест,
	|	ЕСТЬNULL(СгруппированнаяТаблицаТоваров.НоменклатураНабора, ИСТИНА) КАК НоменклатураНабора
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	РеализованныеТовары КАК РеализованныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СгруппированнаяТаблицаТоваров КАК СгруппированнаяТаблицаТоваров
	|		ПО РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Номенклатура = СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры.Номенклатура
	|			И РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Характеристика = СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры.Характеристика
	|			И РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Серия = СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры.Серия
	|			И (ВЫБОР
	|				КОГДА &ЭтоКорректировкаРеализации
	|					ТОГДА РеализованныеТовары.НомерГТД = СгруппированнаяТаблицаТоваров.НомерГТД
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА &ЭтоКорректировкаРеализации
	|					ТОГДА РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.МестоХранения = СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры.МестоХранения
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И РеализованныеТовары.ДокументРеализации = СгруппированнаяТаблицаТоваров.ДокументРеализации
	|			И (&ЭтоКорректировкаРеализации
	|					И РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Назначение = СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры.Назначение
	|				ИЛИ НЕ &ЭтоКорректировкаРеализации
	|					И (РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Назначение = СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры.Назначение
	|						ИЛИ СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|						ИЛИ РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)))
	|			И (СгруппированнаяТаблицаТоваров.СпособОпределенияСебестоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи))
	|			И (ВЫБОР
	|				КОГДА &ЭтоКорректировкаРеализации
	|					ТОГДА РеализованныеТовары.АналитикаУчетаНаборовОтгрузки.НоменклатураНабора = СгруппированнаяТаблицаТоваров.НоменклатураНабора
	|							ИЛИ (РеализованныеТовары.АналитикаУчетаНаборовОтгрузки = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|								ИЛИ РеализованныеТовары.АналитикаУчетаНаборовОтгрузки = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНаборов.ПустаяСсылка))
	|								И СгруппированнаяТаблицаТоваров.НоменклатураНабора = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДанныхДокумента.Склад,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Номенклатура,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Серия,
	|	СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Назначение,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.МестоХранения,
	|	РеализованныеТовары.НомерГТД,
	|	ТаблицаДанныхДокумента.Организация,
	|	РеализованныеТовары.ДокументРеализации,
	|	СгруппированнаяТаблицаТоваров.НоменклатураПартнера,
	|	РеализованныеТовары.АналитикаУчетаНоменклатурыОтгрузки.Характеристика,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализованныеТовары.ВидЗапасов.РеализацияЗапасовДругойОрганизации
	|			ТОГДА РеализованныеТовары.ВидЗапасов.ВидЗапасовВладельца
	|		ИНАЧЕ РеализованныеТовары.ВидЗапасов
	|	КОНЕЦ,
	|	РеализованныеТовары.ВидЗапасов,
	|	РеализованныеТовары.КорВидЗапасов,
	|	ЕСТЬNULL(СгруппированнаяТаблицаТоваров.НоменклатураНабора, ИСТИНА)
	|
	|ИМЕЮЩИЕ
	|	СУММА(РеализованныеТовары.Количество) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДанныхДокумента.Организация,
	|	ТаблицаДанныхДокумента.Склад,
	|	СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Номенклатура,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Характеристика,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Серия,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.МестоХранения,
	|	ТаблицаВидыЗапасов.АналитикаУчетаНоменклатурыОтгрузки.Назначение,
	|	ТаблицаВидыЗапасов.ДокументРеализации,
	|	СгруппированнаяТаблицаТоваров.НоменклатураПартнера,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	|	ТаблицаВидыЗапасов.ВидЗапасов,
	|	ТаблицаВидыЗапасов.КорВидЗапасов,
	|	ТаблицаВидыЗапасов.НомерГТД,
	|	ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаВидыЗапасов.Количество,
	|	ВЫРАЗИТЬ(ТаблицаВидыЗапасов.КоличествоПоРНПТ КАК ЧИСЛО(23, 11)),
	|	0,
	|	ТаблицаВидыЗапасов.СуммаНДС,
	|	2,
	|	ЕСТЬNULL(СгруппированнаяТаблицаТоваров.НоменклатураНабора, ИСТИНА)
	|ИЗ
	|	СгруппированнаяТаблицаТоваров КАК СгруппированнаяТаблицаТоваров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаВидыЗапасов КАК ТаблицаВидыЗапасов
	|		ПО СгруппированнаяТаблицаТоваров.АналитикаУчетаНоменклатуры = ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры
	|			И (СгруппированнаяТаблицаТоваров.СпособОпределенияСебестоимости <> ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи))
	|			И (ТаблицаВидыЗапасов.СпособОпределенияСебестоимости <> ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимостиВозврата.ИзДокументаПродажи))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РеализованныеТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СгруппированнаяТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаТоваровСКлючамиПоВсемСкладам";
	
	#КонецВставки
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	Запрос.УстановитьПараметр("ЭтоВозврат",
								ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ВозвратТоваровОтКлиента"));
	Запрос.УстановитьПараметр("ЭтоКорректировкаРеализации",
								ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КорректировкаРеализации"));
	Запрос.УстановитьПараметр("КорректировкаРеализацииПослеПереходаПраваСобственности",
								ПараметрыЗаполненияВидовЗапасов.КорректировкаРеализацииПослеПереходаПраваСобственности);
	
	УчетПрослеживаемыхТоваровЛокализация.УстановитьПараметрыИспользованияУчетаПрослеживаемыхТоваров(Запрос);
	
	ОбщегоНазначенияУТ.ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
																Запрос.Текст,
																"&ТекстПоляТаблицаТоваровНоменклатураПартнера_",
																"ТаблицаТоваров",
																"НоменклатураПартнера",
																"ТаблицаТоваров.НоменклатураПартнера",
																"ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка)");
	
	Запрос.Выполнить();
	
КонецПроцедуры




//ASP Ямаева 12.01.2021
//&вместо("ЗапросРаспределенияБезУчетаПриоритетовТаблицыТоваровНаТаблицуОстатков")
//Функция ASP_ЗапросРаспределенияБезУчетаПриоритетовТаблицыТоваровНаТаблицуОстатков(МенеджерВременныхТаблиц,
//																				ДополнительныеСвойства,
//																				ПараметрыЗаполнения)
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	МАКСИМУМ(ТаблицаТоваров.НомерСтроки) КАК НомерСтроки,
//	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	ЕСТЬNULL(АналитикаКомиссионера.КлючАналитики, ТаблицаТоваров.АналитикаУчетаНоменклатуры) КАК АналитикаОстатков,
//	|	ЕСТЬNULL(АналитикаКомиссионера.Номенклатура, ТаблицаТоваров.АналитикаУчетаНоменклатуры.Номенклатура) КАК НоменклатураОстатков,
//	|	ЕСТЬNULL(АналитикаКомиссионера.Характеристика, ТаблицаТоваров.АналитикаУчетаНоменклатуры.Характеристика) КАК ХарактеристикаОстатков,
//	|	ЕСТЬNULL(АналитикаКомиссионера.Серия, ТаблицаТоваров.АналитикаУчетаНоменклатуры.Серия) КАК СерияОстатков,
//	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//	|	СпрНоменклатура.ПодакцизныйТовар КАК ЭтоПодакцизныйТовар,
//	|	СпрНоменклатура.ВестиУчетПоГТД КАК ВестиУчетПоГТД,
//	|	ЕСТЬNULL(АналитикаКомиссионера.МестоХранения, ТаблицаТоваров.АналитикаУчетаНоменклатуры.МестоХранения) КАК СкладОстатков,
//	|	ЕСТЬNULL(АналитикаКомиссионера.Назначение, ТаблицаТоваров.АналитикаУчетаНоменклатуры.Назначение) КАК НазначениеОстатков,
//	|	ЕСТЬNULL(АналитикаКомиссионера.СтатьяКалькуляции, ТаблицаТоваров.АналитикаУчетаНоменклатуры.СтатьяКалькуляции) КАК СтатьяКалькуляцииОстатков,
//	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
//	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
//	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.Серия КАК Серия,
//	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
//	|	ТаблицаТоваров.ПодбиратьВидыЗапасов КАК ПодбиратьВидыЗапасов,
//	|	ТаблицаТоваров.НомерГТД КАК НомерГТД,
//	|	ТаблицаТоваров.ВидЦены КАК ВидЦены,
//	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.Назначение КАК Назначение,
//	|	ВЫБОР
//	|		КОГДА &ТекстПоляТаблицаТоваровДокументРеализации_ В(&ПустыеЗначенияДокументаРеализации)
//	|			ТОГДА НЕОПРЕДЕЛЕНО
//	|		ИНАЧЕ &ТекстПоляТаблицаТоваровДокументРеализации_
//	|	КОНЕЦ КАК ДокументРеализации,
//	|	&ТекстПоляТаблицаТоваровПериод_ КАК Период,
//	|	ТаблицаДанныхДокумента.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	МАКСИМУМ(ТаблицаТоваров.СтавкаНДС) КАК СтавкаНДС,
//	|	СУММА(ТаблицаТоваров.Количество) КАК Количество,
//	|	&ТекстПоляТаблицаТоваровКоличествоПоРНПТ_ КАК КоличествоПоРНПТ,
//	|	СУММА(ТаблицаТоваров.СуммаСНДС) КАК СуммаСНДС,
//	|	СУММА(ТаблицаТоваров.СуммаНДС) КАК СуммаНДС,
//	|	СУММА(ТаблицаТоваров.СуммаВознаграждения) КАК СуммаВознаграждения,
//	|	СУММА(ТаблицаТоваров.СуммаНДСВознаграждения) КАК СуммаНДСВознаграждения
//	|ПОМЕСТИТЬ ТаблицаДокумента
//	|ИЗ
//	|	ТаблицаТоваров КАК ТаблицаТоваров
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
//	|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
//	|		
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
//	|		ПО ИСТИНА
//	|		
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаКомиссионера
//	|		ПО ТаблицаТоваров.Номенклатура = АналитикаКомиссионера.Номенклатура
//	|			И ТаблицаТоваров.Характеристика = АналитикаКомиссионера.Характеристика
//	|			И ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) = АналитикаКомиссионера.Назначение
//	|			И ТаблицаДанныхДокумента.Партнер = АналитикаКомиссионера.МестоХранения
//	|			И ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) = АналитикаКомиссионера.Серия
//	|			И АналитикаКомиссионера.СтатьяКалькуляции = &ПустоеЗначениеСтатьиКалькуляции
//	|			И (ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
//	|				ИЛИ ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика))
//	|
//	|ГДЕ
//	|	ТаблицаТоваров.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),
//	|													ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры,
//	|	ЕСТЬNULL(АналитикаКомиссионера.КлючАналитики, ТаблицаТоваров.АналитикаУчетаНоменклатуры),
//	|	СпрНоменклатура.ЕдиницаИзмерения,
//	|	СпрНоменклатура.ПодакцизныйТовар,
//	|	СпрНоменклатура.ВестиУчетПоГТД,
//	|	ЕСТЬNULL(АналитикаКомиссионера.Номенклатура, ТаблицаТоваров.АналитикаУчетаНоменклатуры.Номенклатура),
//	|	ЕСТЬNULL(АналитикаКомиссионера.Характеристика, ТаблицаТоваров.АналитикаУчетаНоменклатуры.Характеристика),
//	|	ЕСТЬNULL(АналитикаКомиссионера.Серия, ТаблицаТоваров.АналитикаУчетаНоменклатуры.Серия),
//	|	ЕСТЬNULL(АналитикаКомиссионера.МестоХранения, ТаблицаТоваров.АналитикаУчетаНоменклатуры.МестоХранения),
//	|	ЕСТЬNULL(АналитикаКомиссионера.Назначение, ТаблицаТоваров.АналитикаУчетаНоменклатуры.Назначение),
//	|	ЕСТЬNULL(АналитикаКомиссионера.СтатьяКалькуляции, ТаблицаТоваров.АналитикаУчетаНоменклатуры.СтатьяКалькуляции),
//	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.Номенклатура,
//	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.Характеристика,
//	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.Серия,
//	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.МестоХранения,
//	|	ТаблицаТоваров.АналитикаУчетаНоменклатуры.Назначение,
//	|	ВЫБОР 
//	|		КОГДА &ТекстПоляТаблицаТоваровДокументРеализации_ В(&ПустыеЗначенияДокументаРеализации)
//	|			ТОГДА НЕОПРЕДЕЛЕНО
//	|		ИНАЧЕ &ТекстПоляТаблицаТоваровДокументРеализации_
//	|	КОНЕЦ,
//	|	&ТекстПоляТаблицаТоваровПериод_,
//	|	ТаблицаДанныхДокумента.ХозяйственнаяОперация,
//	|	ТаблицаТоваров.ПодбиратьВидыЗапасов,
//	|	ТаблицаТоваров.НомерГТД,
//	|	ТаблицаТоваров.ВидЦены
//	|;
//	|
//	|/////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаДанныхДокумента.Организация КАК Организация,
//	|	ТаблицаДанныхДокумента.Дата КАК Период,
//	|	ТаблицаДанныхДокумента.Партнер КАК Партнер,
//	|	ТаблицаДанныхДокумента.Контрагент КАК Контрагент,
//	|	ТаблицаДанныхДокумента.Соглашение КАК Соглашение,
//	|	ТаблицаДанныхДокумента.Договор КАК Договор,
//	|	ТаблицаДанныхДокумента.Валюта КАК Валюта,
//	|	ТаблицаДанныхДокумента.НалогообложениеНДС КАК НалогообложениеНДС,
//	|	ТаблицаДанныхДокумента.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	ТаблицаДанныхДокумента.ТипЗапасов КАК ТипЗапасов
//	|ИЗ
//	|	ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
//	|;
//	|
//	|/////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
//	|	ВидыЗапасовПоУмолчанию.ВладелецТовара КАК ВладелецТовара,
//	|	ВидыЗапасовПоУмолчанию.ТипЗапасов КАК ТипЗапасов,
//	|	ВидыЗапасовПоУмолчанию.Контрагент КАК Контрагент,
//	|	ВидыЗапасовПоУмолчанию.Договор КАК Договор,
//	|	ТаблицаДокумента.Склад КАК Склад,
//	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
//	|	ТаблицаДокумента.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//	|	ТаблицаДокумента.Характеристика КАК Характеристика,
//	|	ТаблицаДокумента.Серия КАК Серия,
//	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
//	|	ТаблицаДокумента.Количество КАК Количество,
//	|	ТаблицаДокумента.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
//	|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
//	|	ТаблицаДокумента.ВидЦены КАК ВидЦены,
//	|	ТаблицаДокумента.ДокументРеализации КАК ДокументРеализации,
//	|	ТаблицаДокумента.Период КАК Период,
//	|	ВЫБОР
//	|		КОГДА &ИспользоватьГруппыФинУчета
//	|			ТОГДА ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаДокумента.АналитикаУчетаНоменклатуры КАК Справочник.КлючиАналитикиУчетаНоменклатуры).Номенклатура.ГруппаФинансовогоУчета, ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка))
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
//	|	КОНЕЦ КАК ГруппаФинансовогоУчета
//	|ИЗ
//	|	ТаблицаДокумента КАК ТаблицаДокумента
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРеквизитовВидовЗапасовПоУмолчанию КАК ВидыЗапасовПоУмолчанию
//	|		ПО ВидыЗапасовПоУмолчанию.НомерСтроки = ТаблицаДокумента.НомерСтроки
//	|;
//	|
//	|/////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	МАКСИМУМ(ТаблицаВидыЗапасов.НомерСтроки) КАК НомерСтроки,
//	|	ЕСТЬNULL(АналитикаКомиссионера.КлючАналитики, ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры) КАК АналитикаУчетаНоменклатуры,
//	|	ТаблицаВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
//	|	ТаблицаВидыЗапасов.ВидЗапасовПолучателя КАК ВидЗапасовПолучателя,
//	|	ТаблицаВидыЗапасов.СкладОтгрузки КАК СкладОтгрузки,
//	|	ТаблицаВидыЗапасов.НомерГТД КАК НомерГТД,
//	|	ТаблицаВидыЗапасов.ВидыЗапасовУказаныВручную КАК ВидыЗапасовУказаныВручную,
//	|	СУММА(ТаблицаВидыЗапасов.Количество) КАК Количество,
//	|	&ТекстПоляТаблицаВидыЗапасовКоличествоПоРНПТ_ КАК КоличествоПоРНПТ,
//	|	&ТекстПоляТаблицаВидыЗапасовСуммаНДС_ КАК СуммаНДС,
//	|	ВЫБОР
//	|		КОГДА СУММА(ТаблицаВидыЗапасов.Количество) > 0
//	|			ТОГДА 1
//	|		ИНАЧЕ -1
//	|	КОНЕЦ КАК Знак,
//	|	ТаблицаВидыЗапасов.ДокументРеализации КАК ДокументРеализации,
//	|	&ТекстПоляТаблицаВидыЗапасовПериод_ КАК Период
//	|ПОМЕСТИТЬ ВтВидыЗапасовСводно
//	|ИЗ
//	|	ТаблицаВидыЗапасов КАК ТаблицаВидыЗапасов
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
//	|		ПО ИСТИНА
//	|		
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаКомиссионера
//	|		ПО ТаблицаВидыЗапасов.Номенклатура = АналитикаКомиссионера.Номенклатура
//	|			И ТаблицаВидыЗапасов.Характеристика = АналитикаКомиссионера.Характеристика
//	|			И ТаблицаДанныхДокумента.Партнер = АналитикаКомиссионера.МестоХранения
//	|			И ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры.Назначение = АналитикаКомиссионера.Назначение
//	|			И АналитикаКомиссионера.СтатьяКалькуляции = &ПустоеЗначениеСтатьиКалькуляции
//	|			И ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) = АналитикаКомиссионера.Серия
//	|			И ТаблицаДанныхДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ЕСТЬNULL(АналитикаКомиссионера.КлючАналитики, ТаблицаВидыЗапасов.АналитикаУчетаНоменклатуры),
//	|	ТаблицаВидыЗапасов.ВидЗапасов,
//	|	ТаблицаВидыЗапасов.ВидЗапасовПолучателя,
//	|	ТаблицаВидыЗапасов.СкладОтгрузки,
//	|	ТаблицаВидыЗапасов.НомерГТД,
//	|	ТаблицаВидыЗапасов.ВидыЗапасовУказаныВручную,
//	|	ТаблицаВидыЗапасов.ДокументРеализации,
//	|	&ТекстПоляТаблицаВидыЗапасовПериод_
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	АналитикаУчетаНоменклатуры,
//	|	ВидЗапасов,
//	|	ВидЗапасовПолучателя,
//	|	НомерГТД
//	|;
//	|
//	|/////////////////////////////////////////////////////////////////////////////
//	// Сгруппируем остатки. Для каждой сгруппированной строки
//	// определим использование данного остатка в текущем документе.
//	// Необходимо для правильного получения СуммыСНДС из документа,
//	// а не усредненной из остатков.
//	|ВЫБРАТЬ
//	|	МАКСИМУМ(ВтОстаткиБезГруппировки.ОстаткиДокумента) КАК ОстаткиДокумента,
//	|
//	|	ВтОстаткиБезГруппировки.Организация КАК Организация,
//	|	ВтОстаткиБезГруппировки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	ВтОстаткиБезГруппировки.Номенклатура КАК Номенклатура,
//	|	ВтОстаткиБезГруппировки.Характеристика КАК Характеристика,
//	|	ВтОстаткиБезГруппировки.Серия КАК Серия,
//	|	ВтОстаткиБезГруппировки.Склад КАК Склад,
//	|	ВтОстаткиБезГруппировки.Назначение КАК Назначение,
//	|	ВтОстаткиБезГруппировки.НазначениеОтгрузки КАК НазначениеОтгрузки,
//	|	ВтОстаткиБезГруппировки.СтатьяКалькуляции КАК СтатьяКалькуляции,
//	|	ВтОстаткиБезГруппировки.СкладОтгрузки КАК СкладОтгрузки,
//	|	ВтОстаткиБезГруппировки.КорВидЗапасов КАК КорВидЗапасов,
//	|	ВтОстаткиБезГруппировки.ВидЗапасов КАК ВидЗапасов,
//	|	ВтОстаткиБезГруппировки.ВидЗапасовПолучателя КАК ВидЗапасовПолучателя,
//	|	ВтОстаткиБезГруппировки.ВидЗапасовОтгрузки КАК ВидЗапасовОтгрузки,
//	|	ВтОстаткиБезГруппировки.НомерГТД КАК НомерГТД,
//	|	ВтОстаткиБезГруппировки.ДатаПоступления КАК ДатаПоступления,
//	|
//	|	МАКСИМУМ(ВтОстаткиБезГруппировки.КоличествоОстатокВсего) КАК КоличествоОстатокВсего,
//	|	СУММА(ВтОстаткиБезГруппировки.КоличествоОстаток) КАК КоличествоОстаток,
//	|	МАКСИМУМ(ВтОстаткиБезГруппировки.КоличествоПоРНПТОстатокВсего) КАК КоличествоПоРНПТОстатокВсего,
//	|	СУММА(ВтОстаткиБезГруппировки.СуммаОстаток) КАК СуммаОстаток,
//	|	МАКСИМУМ(ВтОстаткиБезГруппировки.СуммаНДСОстаток) КАК СуммаНДСОстаток,
//	|
//	|	ВтОстаткиБезГруппировки.ДокументРеализации КАК ДокументРеализации,
//	|	ВтОстаткиБезГруппировки.Период КАК Период
//	|ПОМЕСТИТЬ ВтОстатки
//	|ИЗ
//	|	(ВЫБРАТЬ // ОСТАТКИ, УКАЗАННЫЕ В ДОКУМЕНТЕ
//	|		ИСТИНА КАК ОстаткиДокумента,
//	|		
//	|		Остатки.Организация КАК Организация,
//	|		ВидыЗапасов.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|		Ключи.Номенклатура КАК Номенклатура,
//	|		Ключи.Характеристика КАК Характеристика,
//	|		Ключи.Серия КАК Серия,
//	|		Ключи.МестоХранения КАК Склад,
//	|		Ключи.Назначение КАК Назначение,
//	|		Остатки.Назначение КАК НазначениеОтгрузки,
//	|		Ключи.СтатьяКалькуляции КАК СтатьяКалькуляции,
//	|		ВидыЗапасов.СкладОтгрузки КАК СкладОтгрузки,
//	|		Остатки.КорВидЗапасов КАК КорВидЗапасов,		
//	|		ВидыЗапасов.ВидЗапасов КАК ВидЗапасов,
//	|		ВидыЗапасов.ВидЗапасовПолучателя КАК ВидЗапасовПолучателя,
//	|		Остатки.ВидЗапасовОтгрузки КАК ВидЗапасовОтгрузки,
//	|		ВидыЗапасов.НомерГТД КАК НомерГТД,
//	|		Остатки.ДатаПоступления КАК ДатаПоступления,
//	|		
//	|		ВидыЗапасов.Количество КАК КоличествоОстатокВсего,
//	|		ВЫБОР
//	|			КОГДА ВидыЗапасов.ВидыЗапасовУказаныВручную
//	|					И (НЕ &ПерезаполнитьВидыЗапасов
//	|						ИЛИ &ПроводитьБезКонтроляОстатковТоваровОрганизаций)
//	|				ТОГДА ВидыЗапасов.Количество
//	|			КОГДА ВидыЗапасов.Знак * Остатки.КоличествоОстаток > ВидыЗапасов.Знак * ВидыЗапасов.Количество
//	|				ТОГДА ВидыЗапасов.Количество
//	|			ИНАЧЕ Остатки.КоличествоОстаток
//	|		КОНЕЦ КАК КоличествоОстаток,
//	|		ВидыЗапасов.КоличествоПоРНПТ КАК КоличествоПоРНПТОстатокВсего,
//	|	
//	|		ВЫБОР
//	|			КОГДА (ВидыЗапасов.Знак * Остатки.КоличествоОстаток > ВидыЗапасов.Знак * ВидыЗапасов.Количество)
//	|					И Остатки.КоличествоОстаток <> 0
//	|				ТОГДА ВидыЗапасов.Количество * Остатки.СуммаОстаток / Остатки.КоличествоОстаток
//	|			ИНАЧЕ Остатки.СуммаОстаток
//	|		КОНЕЦ КАК СуммаОстаток,
//	|		ВидыЗапасов.ДокументРеализации КАК ДокументРеализации,
//	|		ВидыЗапасов.СуммаНДС КАК СуммаНДСОстаток,
//	|		ВидыЗапасов.Период КАК Период
//	|	ИЗ
//	|		ВтВидыЗапасовСводно КАК ВидыЗапасов
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК РеквизитыДокумента
//	|			ПО ИСТИНА
//	|			
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
//	|			ПО ВидыЗапасов.АналитикаУчетаНоменклатуры = Ключи.Ссылка
//	|			
//	|			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК Остатки
//	|			ПО Остатки.АналитикаУчетаНоменклатуры = ВидыЗапасов.АналитикаУчетаНоменклатуры
//	|				И Остатки.ВидЗапасов = ВидыЗапасов.ВидЗапасов
//	|				И (Остатки.СкладОтгрузки = ВидыЗапасов.СкладОтгрузки
//	|					ИЛИ ВидыЗапасов.СкладОтгрузки В(ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), НЕОПРЕДЕЛЕНО))
//	|				И Остатки.НомерГТД = ВидыЗапасов.НомерГТД
//	|				И Остатки.ДокументРеализации = ВидыЗапасов.ДокументРеализации
//	|				И (ВидыЗапасов.Период = ДАТАВРЕМЯ(1,1,1)
//	|					ИЛИ ВидыЗапасов.Период = Остатки.ДатаПоступления)
//	|			
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК РеквизитыВидаЗапасов
//	|			ПО ВидыЗапасов.ВидЗапасов = РеквизитыВидаЗапасов.Ссылка
//	|	
//	|	ГДЕ
//	|		НЕ Остатки.ВидЗапасов ЕСТЬ NULL
//	|		ИЛИ (ВидыЗапасов.ВидыЗапасовУказаныВручную
//	|			И (НЕ &ПерезаполнитьВидыЗапасов
//	|				ИЛИ &ПроводитьБезКонтроляОстатковТоваровОрганизаций))
//	|	
//	|	ОБЪЕДИНИТЬ ВСЕ
//	|	
//	|	ВЫБРАТЬ // ОСТАТКИ, НЕ УКАЗАННЫЕ В ДОКУМЕНТЕ
//	|		ЛОЖЬ КАК ОстаткиДокумента,
//	|		
//	|		Остатки.Организация КАК Организация,
//	|		Остатки.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|		Ключи.Номенклатура,
//	|		Ключи.Характеристика,
//	|		Ключи.Серия,
//	|		Ключи.МестоХранения,
//	|		Ключи.Назначение,
//	|		Остатки.Назначение,
//	|		Ключи.СтатьяКалькуляции,
//	|		Остатки.СкладОтгрузки КАК СкладОтгрузки,
//	|		Остатки.КорВидЗапасов КАК КорВидЗапасов,		
//	|		Остатки.ВидЗапасов КАК ВидЗапасов,
//	|		Остатки.ВидЗапасовПолучателя КАК ВидЗапасовПолучателя,
//	|		Остатки.ВидЗапасовОтгрузки КАК ВидЗапасовОтгрузки,
//	|		Остатки.НомерГТД КАК НомерГТД,
//	|		Остатки.ДатаПоступления КАК ДатаПоступления,
//	//|		&ТекстПоляТаблицаОстатковСуммаНДСОстаток_ КАК СуммаНДСОстаток,
//	|		Остатки.КоличествоОстаток КАК КоличествоОстатокВсего,
//	|		Остатки.КоличествоОстаток - ЕСТЬNULL(ВидыЗапасов.Количество, 0) КАК КоличествоОстаток,
//	|		&ТекстПоляТаблицаОстатковКоличествоПоРНПТОстаток_ КАК КоличествоПоРНПТОстатокВсего,
//	|		ВЫБОР
//	|			КОГДА Остатки.КоличествоОстаток <> 0
//	|				ТОГДА Остатки.СуммаОстаток - (ЕСТЬNULL(ВидыЗапасов.Количество, 0) * Остатки.СуммаОстаток / Остатки.КоличествоОстаток)
//	|			КОГДА ЕСТЬNULL(ВидыЗапасов.Количество, 0) = 0
//	|				ТОГДА Остатки.СуммаОстаток
//	|			ИНАЧЕ 0 // Сумма остатка подобралась в строках с видом запасов
//	|		КОНЕЦ КАК СуммаОстаток,
//	|		ВЫБОР
//	|			КОГДА Остатки.ДокументРеализации В (&ПустыеЗначенияДокументаРеализации)
//	|				ТОГДА НЕОПРЕДЕЛЕНО
//	|			ИНАЧЕ Остатки.ДокументРеализации
//	|		КОНЕЦ КАК ДокументРеализации,
//	|		&ТекстПоляТаблицаОстатковСуммаНДСОстаток_ КАК СуммаНДСОстаток,
//	|		ВидыЗапасов.Период
//	|	ИЗ
//	|		ТаблицаОстатков КАК Остатки
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК РеквизитыДокумента
//	|			ПО ИСТИНА
//	|			
//	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
//	|			ПО Остатки.АналитикаУчетаНоменклатуры = Ключи.Ссылка
//	|			
//	|			ЛЕВОЕ СОЕДИНЕНИЕ ВтВидыЗапасовСводно КАК ВидыЗапасов
//	|			ПО Остатки.АналитикаУчетаНоменклатуры = ВидыЗапасов.АналитикаУчетаНоменклатуры
//	|				И Остатки.ВидЗапасов = ВидыЗапасов.ВидЗапасов
//	|				И (Остатки.СкладОтгрузки = ВидыЗапасов.СкладОтгрузки
//	|					ИЛИ ВидыЗапасов.СкладОтгрузки В(ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка), НЕОПРЕДЕЛЕНО))
//	|				И Остатки.НомерГТД = ВидыЗапасов.НомерГТД
//	|				И Остатки.ДокументРеализации = ВидыЗапасов.ДокументРеализации
//	|				И (ВидыЗапасов.Период = ДАТАВРЕМЯ(1,1,1)
//	|					ИЛИ ВидыЗапасов.Период = Остатки.ДатаПоступления)
//	|	
//	|	ГДЕ
//	|		ВЫБОР
//	|			КОГДА ВидыЗапасов.Количество ЕСТЬ NULL
//	|				ТОГДА ИСТИНА
//	|			КОГДА ВидыЗапасов.Количество = 0
//	|				ТОГДА НЕ ВидыЗапасов.НомерСтроки = 99999
//	|			КОГДА ВидыЗапасов.Знак * ВидыЗапасов.Количество > 0
//	|				ТОГДА ВидыЗапасов.Знак * Остатки.КоличествоОстаток - ВидыЗапасов.Знак * ВидыЗапасов.Количество > 0
//	|			ИНАЧЕ ВидыЗапасов.Знак * Остатки.КоличествоОстаток - ВидыЗапасов.Знак * ВидыЗапасов.Количество < 0
//	|		КОНЕЦ
//	|	
//	|	) КАК ВтОстаткиБезГруппировки
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВтОстаткиБезГруппировки.Организация,
//	|	ВтОстаткиБезГруппировки.АналитикаУчетаНоменклатуры,
//	|	ВтОстаткиБезГруппировки.Номенклатура,
//	|	ВтОстаткиБезГруппировки.Характеристика,
//	|	ВтОстаткиБезГруппировки.Серия,
//	|	ВтОстаткиБезГруппировки.Склад,
//	|	ВтОстаткиБезГруппировки.Назначение,
//	|	ВтОстаткиБезГруппировки.НазначениеОтгрузки,
//	|	ВтОстаткиБезГруппировки.СтатьяКалькуляции,
//	|	ВтОстаткиБезГруппировки.СкладОтгрузки,
//	|	ВтОстаткиБезГруппировки.КорВидЗапасов,
//	|	ВтОстаткиБезГруппировки.ВидЗапасов,
//	|	ВтОстаткиБезГруппировки.ВидЗапасовПолучателя,
//	|	ВтОстаткиБезГруппировки.ВидЗапасовОтгрузки,
//	|	ВтОстаткиБезГруппировки.НомерГТД,
//	|	ВтОстаткиБезГруппировки.ДатаПоступления,
//	|	ВтОстаткиБезГруппировки.ДокументРеализации,
//	|	ВтОстаткиБезГруппировки.Период
//	|;
//	|
//	|/////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
//	|	ТаблицаДокумента.Склад КАК Склад,
//	|	ЕСТЬNULL(КлючиТоваров.Назначение, Неопределено) КАК Назначение,
//	|	ТаблицаДокумента.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
//	|	ВЫРАЗИТЬ(ТаблицаДокумента.Номенклатура КАК Справочник.Номенклатура).ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
//	|	ЕСТЬNULL(ВЫРАЗИТЬ(ТаблицаДокумента.Номенклатура КАК Справочник.Номенклатура).КодТНВЭД.СырьевойТовар, ЛОЖЬ) КАК СырьевойТовар,
//	|	ТаблицаДокумента.ЭтоПодакцизныйТовар КАК ЭтоПодакцизныйТовар,
//	|	ТаблицаДокумента.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//	|	ТаблицаДокумента.Характеристика КАК Характеристика,
//	|	ТаблицаДокумента.Количество КАК Количество,
//	|	ТаблицаДокумента.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
//	|	ТаблицаДокумента.СуммаСНДС КАК СуммаСНДС,
//	|	ТаблицаДокумента.СтавкаНДС КАК СтавкаНДС,
//	|	ТаблицаДокумента.СуммаНДС КАК СуммаНДС,
//	|	ТаблицаДокумента.СуммаВознаграждения КАК СуммаВознаграждения,
//	|	ТаблицаДокумента.СуммаНДСВознаграждения КАК СуммаНДСВознаграждения,
//	|	ТаблицаДанныхДокумента.Дата КАК ДатаДокумента,
//	|	ТаблицаДанныхДокумента.Валюта КАК Валюта,
//	|	ЕСТЬNULL(Остатки.ВидЗапасов, Неопределено) КАК ВидЗапасов,
//	|	ЕСТЬNULL(Остатки.ВидЗапасовПолучателя, Неопределено) КАК ВидЗапасовПолучателя,
//	|	ЕСТЬNULL(Остатки.ВидЗапасовОтгрузки, Неопределено) КАК ВидЗапасовОтгрузки,
//	|	ЕСТЬNULL(РеквизитыВидаЗапасовОтгрузки.РеализацияЗапасовДругойОрганизации, ЛОЖЬ) КАК ОтгрузкаЗапасовДругойОрганизации,
//	|	ЕСТЬNULL(Остатки.НомерГТД, Неопределено) КАК НомерГТД,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ВестиУчетПоГТД
//	|				И &ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД
//	|				И (Остатки.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка) ИЛИ Остатки.НомерГТД ЕСТЬ NULL)
//	|				И НЕ (ЕСТЬNULL(РеквизитыВидаЗапасов.ТипЗапасов, ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка)) В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца),
//	|																													ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)))
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК НеУказанНомерГТД,
//	|
//	|	ЕСТЬNULL(Остатки.ДатаПоступления, ДАТАВРЕМЯ(2399, 1, 1)) КАК ДатаПоступления,
//	|	ЕСТЬNULL(Остатки.СкладОтгрузки, Неопределено) КАК СкладОтгрузки,
//	|	ЕСТЬNULL(Остатки.КорВидЗапасов, ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)) КАК  КорВидЗапасов,
//	|	ЕСТЬNULL(Остатки.КоличествоОстатокВсего, 0) КАК КоличествоОстатокВсего,
//	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
//	|	ЕСТЬNULL(Остатки.КоличествоПоРНПТОстатокВсего, 0) КАК КоличествоПоРНПТОстатокВсего,
//	|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК СуммаОстаток,
//	|	ЕСТЬNULL(АналитикаОтгрузки.КлючАналитики, ТаблицаДокумента.АналитикаУчетаНоменклатуры) КАК АналитикаУчетаНоменклатурыОтгрузки,
//	|	ВЫБОР
//	|		КОГДА ТаблицаДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера)
//	|				И ТаблицаДокумента.ДокументРеализации <> НЕОПРЕДЕЛЕНО
//	|			ТОГДА ТаблицаДокумента.ДокументРеализации
//	|		ИНАЧЕ ЕСТЬNULL(Остатки.ДокументРеализации, Неопределено)
//	|	КОНЕЦ КАК ДокументРеализации,  
//	|	ЕСТЬNULL(Остатки.СуммаНДСОстаток, 0) КАК СуммаНДСОстаток,
//	|	ТаблицаДокумента.Период КАК Период
//	|ИЗ
//	|	ТаблицаДокумента КАК ТаблицаДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДанныхДокумента КАК ТаблицаДанныхДокумента
//	|		ПО ИСТИНА
//	|		
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстатки КАК Остатки
//	|		ПО ТаблицаДокумента.НоменклатураОстатков = Остатки.Номенклатура
//	|			И ТаблицаДокумента.ХарактеристикаОстатков = Остатки.Характеристика
//	|			И ТаблицаДокумента.СерияОстатков = Остатки.Серия
//	|			И ТаблицаДокумента.СкладОстатков = Остатки.Склад
//	|			И (ТаблицаДокумента.Назначение = Остатки.Назначение
//	|				ИЛИ ТаблицаДанныхДокумента.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера),
//	|																	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента),
//	|																	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика),
//	|																	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноСписанияНаРасходы)))
//	|			И ТаблицаДокумента.СтатьяКалькуляцииОстатков = &ПустоеЗначениеСтатьиКалькуляции
//	|			И (ТаблицаДокумента.ДокументРеализации = Остатки.ДокументРеализации
//	|				ИЛИ ТаблицаДокумента.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтКомиссионера))
//	|			И (ТаблицаДокумента.НомерГТД = Остатки.НомерГТД
//	|				ИЛИ ТаблицаДокумента.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
//	|				ИЛИ Остатки.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
//	|				ИЛИ &БезОтбораПоНомерамГТД)
//	|			И (ТаблицаДокумента.Период = ДАТАВРЕМЯ(1,1,1)
//	|				ИЛИ ТаблицаДокумента.Период <= Остатки.ДатаПоступления)
//	|		
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
//	|		ПО Ключи.Ссылка = Остатки.АналитикаУчетаНоменклатуры
//	|		
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаОтгрузки
//	|		ПО АналитикаОтгрузки.Номенклатура = Ключи.Номенклатура
//	|			И АналитикаОтгрузки.Характеристика = Ключи.Характеристика
//	|			И АналитикаОтгрузки.Серия = Ключи.Серия
//	|			И АналитикаОтгрузки.МестоХранения = Остатки.СкладОтгрузки
//	|			И АналитикаОтгрузки.Назначение = Остатки.НазначениеОтгрузки
//	|			И АналитикаОтгрузки.СтатьяКалькуляции = Ключи.СтатьяКалькуляции
//	|		
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыПоступленияТоваровОрганизаций КАК ДатыПоступления
//	|		ПО ДатыПоступления.ВидЗапасов = Остатки.ВидЗапасов
//	|			И ДатыПоступления.Номенклатура = Ключи.Номенклатура
//	|			И ДатыПоступления.Характеристика = Ключи.Характеристика
//	|			И ДатыПоступления.Серия = Ключи.Серия
//	|			И ДатыПоступления.Назначение = Ключи.Назначение
//	|			И ДатыПоступления.НомерГТД = Остатки.НомерГТД
//	|		
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиТоваров
//	|		ПО КлючиТоваров.Ссылка = ТаблицаДокумента.АналитикаУчетаНоменклатуры
//	|		
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК РеквизитыВидаЗапасов
//	|		ПО РеквизитыВидаЗапасов.Ссылка = Остатки.ВидЗапасов
//	|		
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК РеквизитыВидаЗапасовОтгрузки
//	|		ПО РеквизитыВидаЗапасовОтгрузки.Ссылка = Остатки.ВидЗапасовОтгрузки
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	НомерСтроки,
//	|	ОстаткиДокумента УБЫВ,
//	|	Период,
//	|	ТаблицаДокумента.НомерГТД = Остатки.НомерГТД УБЫВ,
//	|	ДатаПоступления,
//	|	ДатыПоступления.ДатаПоступления
//	|
//	|ИТОГИ
//	|	МАКСИМУМ(Количество),
//	|	МАКСИМУМ(КоличествоПоРНПТ),
//	|	МАКСИМУМ(КоличествоПоРНПТОстатокВсего),
//	|	МАКСИМУМ(СуммаСНДС),
//	|	МАКСИМУМ(СтавкаНДС),
//	|	МАКСИМУМ(СуммаНДС),
//	|	МАКСИМУМ(СуммаВознаграждения),
//	|	МАКСИМУМ(СуммаНДСВознаграждения),
//	|	СУММА(КоличествоОстаток)
//	|ПО
//	|	НомерСтроки";
//	
//	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
//												Запрос.Текст,
//												"ТаблицаТоваров",
//												"КоличествоПоРНПТ",
//												"СУММА(ТаблицаТоваров.КоличествоПоРНПТ)",
//												"0");
//	
//	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
//												Запрос.Текст,
//												"ТаблицаТоваров",
//												"ДокументРеализации",
//												"ТаблицаТоваров.ДокументРеализации",
//												"НЕОПРЕДЕЛЕНО");                 
//												
//	ОбщегоНазначенияУТ.ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
//																Запрос.Текст,
//																"&ТекстПоляТаблицаОстатковСуммаНДСОстаток_",
//																"ТаблицаОстатков",
//																"СуммаНДСОстаток",
//																"Остатки.СуммаНДСОстаток",
//																"0");

//	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
//												Запрос.Текст,
//												"ТаблицаТоваров",
//												"Период",
//												"ТаблицаТоваров.Период",
//												"ДАТАВРЕМЯ(1,1,1)");
//											
//	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
//												Запрос.Текст,
//												"ТаблицаВидыЗапасов",
//												"Период",
//												"ТаблицаВидыЗапасов.Период",
//												"ДАТАВРЕМЯ(1,1,1)");
//	
//	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
//												Запрос.Текст,
//												"ТаблицаВидыЗапасов",
//												"КоличествоПоРНПТ",
//												"СУММА(ТаблицаВидыЗапасов.КоличествоПоРНПТ)",
//												"0");
//	
//	ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
//												Запрос.Текст,
//												"ТаблицаОстатков",
//												"КоличествоПоРНПТОстаток",
//												"Остатки.КоличествоПоРНПТОстаток",
//												"0");
//	ОбщегоНазначенияУТ.ЗаменитьОтсутствующиеПоляВтВТекстеЗапроса(МенеджерВременныхТаблиц,
//																Запрос.Текст,
//																"&ТекстПоляТаблицаВидыЗапасовСуммаНДС_",
//																"ТаблицаВидыЗапасов",
//																"СуммаНДС",
//																"СУММА(ТаблицаВидыЗапасов.СуммаНДС)",
//																"0");
//	ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД = ?(ДополнительныеСвойства.Свойство("КонтролироватьНомераГТД"),
//																	ДополнительныеСвойства.КонтролироватьНомераГТД,
//																	ПолучитьФункциональнуюОпцию("ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД"));
//	
//	ПроводитьБезКонтроляОстатковТоваровОрганизаций = ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций 
//														Или Не Константы.КонтролироватьОстаткиТоваровОрганизаций.Получить();
//	
//	Запрос.УстановитьПараметр("ФормироватьВидыЗапасовПоСделкам",
//								ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоСделкам"));
//	Запрос.УстановитьПараметр("ИспользоватьГруппыФинУчета",
//								ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета"));
//	Запрос.УстановитьПараметр("ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД",
//								ЗапретитьОформлениеОперацийСИмпортнымиТоварамиБезНомеровГТД);
//	Запрос.УстановитьПараметр("БезОтбораПоНомерамГТД", ПараметрыЗаполнения.БезОтбораПоНомерамГТД);
//	Запрос.УстановитьПараметр("ПустыеЗначенияДокументаРеализации", Новый Массив);
//	
//	Запрос.Параметры.ПустыеЗначенияДокументаРеализации.Добавить(Документы.РеализацияТоваровУслуг.ПустаяСсылка());
//	Запрос.Параметры.ПустыеЗначенияДокументаРеализации.Добавить(Документы.ПередачаТоваровМеждуОрганизациями.ПустаяСсылка());
//	Запрос.Параметры.ПустыеЗначенияДокументаРеализации.Добавить(Документы.ОтчетОРозничныхПродажах.ПустаяСсылка());
//	Запрос.Параметры.ПустыеЗначенияДокументаРеализации.Добавить(Неопределено);
//	
//	Запрос.УстановитьПараметр("ПроводитьБезКонтроляОстатковТоваровОрганизаций",
//								ПроводитьБезКонтроляОстатковТоваровОрганизаций);
//	
//	Запрос.УстановитьПараметр("ПустоеЗначениеСтатьиКалькуляции", Справочники.СтатьиКалькуляции.ПустаяСсылка()); //ASP Ямаева 12.01.2022
//	
//	УчетПрослеживаемыхТоваровЛокализация.УстановитьПараметрыИспользованияУчетаПрослеживаемыхТоваров(Запрос);
//	
//	ПроверитьНеобходимостьПерезаполненияВидовЗапасовДокумента(ДополнительныеСвойства, Запрос);
//	
//	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
//	
//	Возврат Запрос;
//	
//КонецФункции
