
&ИзменениеИКонтроль("ПересчитатьТаблицуВВалютыУчета")
Процедура асп_ПересчитатьТаблицуВВалютыУчета(МенеджерВременныхТаблиц)
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОбъектыРасчетов.НалогообложениеНДС,
	|	                                Неопределено) КАК НалогообложениеНДС,
	|	ЕСТЬNULL(ОбъектыРасчетов.ОплатаВВалюте, Ложь) КАК ОплатаВВалюте,
	|	ТаблицаТоваров.ИсточникДанных,
	|	ТаблицаТоваров.РаспределятьОбщуюСумму КАК РаспределятьОбщуюСумму,
	|	ТаблицаТоваров.Регистратор КАК Регистратор,
	|	ТаблицаТоваров.Период КАК Период,
	|	ТаблицаТоваров.Организация КАК Организация,
	|	ТаблицаТоваров.Валюта КАК Валюта,
	|	ТаблицаТоваров.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаТоваров.ПериодБазыНДС КАК ПериодБазыНДС,
	|	ТаблицаТоваров.ДатаКурса КАК ДатаКурса,
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаТоваров.СуммаБезНДС КАК СуммаБезНДС,
	|	ТаблицаТоваров.СтавкаНДС КАК СтавкаНДС,
	|	ТаблицаТоваров.СуммаНДС КАК СуммаНДС,
	|	ТаблицаТоваров.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ТаблицаТоваров.СуммаНДСВзаиморасчетов КАК СуммаНДСВзаиморасчетов,
	#Удаление
	|	ТаблицаТоваров.СуммаБезНДСРегл КАК СуммаБезНДСРегл,
	|	ТаблицаТоваров.СуммаБезНДСУпр КАК СуммаБезНДСУпр,
	|	ТаблицаТоваров.СуммаНДСРегл КАК СуммаНДСРегл,
	|	ТаблицаТоваров.СуммаНДСУпр КАК СуммаНДСУпр,
	#КонецУдаления
	#Вставка
	|	ТаблицаТоваров.СуммаБезНДСРегл КАК СуммаБезНДСРегл,
	|	ТаблицаТоваров.СуммаБезНДСУпр КАК СуммаБезНДСУпр,
	|	ТаблицаТоваров.СуммаНДСРегл КАК СуммаНДСРегл,
	|	ТаблицаТоваров.СуммаНДСУпр КАК СуммаНДСУпр,
	#КонецВставки
	|	ТаблицаТоваров.ОтражаетсяВРасчетах КАК ОтражаетсяВРасчетах,
	|	ТаблицаТоваров.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ТаблицаТоваров.ПересчитыватьПоДаннымРасчетов КАК ПересчитыватьПоДаннымРасчетов,
	|	ТаблицаТоваров.НеПересчитыватьСуммыНДС КАК НеПересчитыватьСуммыНДС,
	|	ТаблицаТоваров.Договор КАК Договор,
	|	ТаблицаТоваров.ВариантКурсаДоговора КАК ВариантКурсаДоговора,
	|	ВЫБОР
	|		КОГДА (ТаблицаТоваров.СуммаБезНДС + ТаблицаТоваров.СуммаНДС) < 0
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Знак
	|ИЗ
	|	ДанныеДокументаПредварительная КАК ТаблицаТоваров
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО ТаблицаТоваров.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаТоваров.НомерСтроки,
	|	ТаблицаТоваров.СуммаБезНДС
	|
	|ИТОГИ
	|	СУММА(СуммаБезНДС),
	|	СУММА(СуммаНДС),
	|	СУММА(СуммаБезНДСРегл),
	|	СУММА(СуммаБезНДСУпр),
	|	СУММА(СуммаНДСРегл),
	|	СУММА(СуммаНДСУпр),
	|	МАКСИМУМ(ПериодБазыНДС),
	|	МАКСИМУМ(НеПересчитыватьСуммыНДС)
	|ПО
	|	Регистратор,
	|	Валюта,
	|	Организация,
	|	ДатаКурса,
	|	Договор,
	|	ВариантКурсаДоговора,
	|	ВалютаВзаиморасчетов,
	|	РаспределятьОбщуюСумму,
	|	ИсточникДанных,
	|	Знак
	|";
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	НаборЗаписейСуммыДокументов = РегистрыСведений.СуммыДокументовВВалютахУчета.СоздатьНаборЗаписей();
	СуммыДокументовВВалютахУчета = НаборЗаписейСуммыДокументов.Выгрузить(); // ТаблицаЗначений -
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		Если СуммыДокументовВВалютахУчета.Колонки.Найти(Колонка.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если Колонка.ТипЗначения <> Новый ОписаниеТипов("Неопределено") Тогда
			ОписаниеТиповКолонки = Колонка.ТипЗначения;
		Иначе
			ОписаниеТиповКолонки = ОбщегоНазначения.ОписаниеТипаВсеСсылки();
		КонецЕсли;
		СуммыДокументовВВалютахУчета.Колонки.Добавить(Колонка.Имя, ОписаниеТиповКолонки);
	КонецЦикла;
	СуммыДокументовВВалютахУчета.Колонки.Удалить("Активность");
	СуммыДокументовВВалютахУчета.Колонки.Удалить("МоментВремени");
	
	КэшКурсовВалют = РаботаСКурсамиВалютУТ.ИнициализироватьКэшКурсовВалют();
	КэшКурсовВалютДоговора = РаботаСКурсамиВалютУТ.ИнициализироватьКэшКурсовВалютДоговоров();
	
	ВыборкаПоДокументу = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоДокументу.Следующий() Цикл
		
		ВыборкаПоВалюте = ВыборкаПоДокументу.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоВалюте.Следующий() Цикл
			
			ВыборкаПоОрганизации = ВыборкаПоВалюте.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоОрганизации.Следующий() Цикл
				
				ВыборкаПоДате = ВыборкаПоОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоДате.Следующий() Цикл
					
					ВыборкаПоДоговору = ВыборкаПоДате.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПоДоговору.Следующий() Цикл
						
						ВыборкаПоКурсуВалютыДоговора = ВыборкаПоДоговору.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаПоКурсуВалютыДоговора.Следующий() Цикл
							
							ВыборкаПоВалютеВзаиморасчетов = ВыборкаПоКурсуВалютыДоговора.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ВыборкаПоВалютеВзаиморасчетов.Следующий() Цикл
								
								ВыборкаПоТипуПересчета = ВыборкаПоВалютеВзаиморасчетов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Пока ВыборкаПоТипуПересчета.Следующий() Цикл
									
									ВыборкаПоИсточникуДанных = ВыборкаПоТипуПересчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									Если ВыборкаПоТипуПересчета.РаспределятьОбщуюСумму Тогда
										#Область РаспределятьОбщуюСумму
										Пока ВыборкаПоИсточникуДанных.Следующий() Цикл
											ВыборкаЗнак = ВыборкаПоИсточникуДанных.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
											Пока ВыборкаЗнак.Следующий() Цикл
												Если ВыборкаЗнак.СуммаБезНДС + ВыборкаЗнак.СуммаНДС <> 0 Тогда
													ПересчитатьТаблицуВВалютыУчетРаспределениемОбщейСуммы(ВыборкаЗнак, СуммыДокументовВВалютахУчета, КэшКурсовВалют, КэшКурсовВалютДоговора);
												Иначе
													ПересчитатьТаблицуВВалютыУчетаПострочно(ВыборкаЗнак, СуммыДокументовВВалютахУчета, КэшКурсовВалют, КэшКурсовВалютДоговора);
												КонецЕсли
											КонецЦикла;
										КонецЦикла;
										#КонецОбласти
									Иначе
										#Область ПересчетПоКурсу
										Пока ВыборкаПоИсточникуДанных.Следующий() Цикл
											ВыборкаЗнак = ВыборкаПоИсточникуДанных.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
											Пока ВыборкаЗнак.Следующий() Цикл
												ПересчитатьТаблицуВВалютыУчетаПострочно(ВыборкаЗнак, СуммыДокументовВВалютахУчета, КэшКурсовВалют, КэшКурсовВалютДоговора);
											КонецЦикла;
										КонецЦикла;
										#КонецОбласти
									КонецЕсли;
								КонецЦикла;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	// Поместим результат во временную таблицу
	МассивПолейВыборки = Новый Массив;
	Для Каждого Колонка Из СуммыДокументовВВалютахУчета.Колонки Цикл
		МассивПолейВыборки.Добавить(Колонка.Имя);
	КонецЦикла;
	ТекстПолейВыборки = СтрСоединить(МассивПолейВыборки, ",");
	
	ТекстЗапроса = "
	|УНИЧТОЖИТЬ ДанныеДокументаПредварительная
	|;
	|ВЫБРАТЬ
	|	&ПоляВыборки
	|ПОМЕСТИТЬ СуммыДокументовВВалютахУчета
	|ИЗ 
	|	&Таблица КАК Таблица
	|ИНДЕКСИРОВАТЬ ПО
	|		Регистратор,
	|		ИдентификаторСтроки,
	|		Период";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВыборки", ТекстПолейВыборки);
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Таблица", СуммыДокументовВВалютахУчета);
	
	Запрос.Выполнить();
	
КонецПроцедуры

&ИзменениеИКонтроль("СформироватьПоДаннымДокумента")
Процедура асп_СформироватьПоДаннымДокумента(Запрос, ТекстыЗапроса, Регистры, ТекстЗапросаДанныхДокументов, НеПересчитыватьСуммыНДС)

	ИмяРегистра = Метаданные.РегистрыСведений.СуммыДокументовВВалютахУчета.Имя;
	Если Регистры <> Неопределено И НЕ ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;

	Если Запрос.МенеджерВременныхТаблиц = Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	КонецЕсли;

	Если ПроведениеДокументов.ЕстьТаблицаЗапроса("ВтСуммыДокументовВВалютахУчета", ТекстыЗапроса) 
		ИЛИ Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("ВтСуммыДокументовВВалютахУчета") <> Неопределено Тогда
		Возврат;
	КонецЕсли;

	МассивСтрок = Новый Массив();

	ВалютаУправленческогоУчета = ЗначениеНастроекПовтИсп.ВалютаУправленческогоУчета();
	Если Не ЗначениеЗаполнено(ВалютаУправленческогоУчета) Тогда
		МассивСтрок.Добавить(НСтр("ru = 'Не заполнена валюта управленческого учета'"));
	КонецЕсли;

	Если МассивСтрок.Количество() > 0 Тогда
		МассивСтрок.Добавить(НСтр("ru = 'Для настройки необходимо перейти в раздел ""НСИ и администрирование""-""Предприятие""-""Валюты"".'"));
		ВызватьИсключение СтрСоединить(МассивСтрок, Символы.ПС);
	КонецЕсли;

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.ИсточникДанных              КАК ИсточникДанных,
	|	ДанныеДокумента.РаспределятьОбщуюСумму      КАК РаспределятьОбщуюСумму,
	|	ДанныеДокумента.Ссылка                      КАК Регистратор,
	|	ДанныеДокумента.Дата                        КАК Период,
	|	ДанныеДокумента.Организация                 КАК Организация,
	|	ДанныеДокумента.ВалютаДокумента             КАК Валюта,
	|	ВЫБОР
	|		КОГДА ДанныеДокумента.ВалютаВзаиморасчетов = НЕОПРЕДЕЛЕНО
	|			ТОГДА ЕСТЬNULL(ОбъектыРасчетов.ВалютаВзаиморасчетов, НЕОПРЕДЕЛЕНО) 
	|		ИНАЧЕ ДанныеДокумента.ВалютаВзаиморасчетов 
	|	КОНЕЦ                                       КАК ВалютаВзаиморасчетов,
	|	&ТекстПоляПериодБазыНДС                     КАК ПериодБазыНДС,
	|	ДанныеДокумента.ДатаКурса                   КАК ДатаКурса,
	|
	|	ДанныеДокумента.НомерСтроки                 КАК НомерСтроки,
	|	ДанныеДокумента.ИдентификаторСтроки         КАК ИдентификаторСтроки,
	|	ДанныеДокумента.СуммаБезНДС                 КАК СуммаБезНДС,
	|	ДанныеДокумента.СтавкаНДС                   КАК СтавкаНДС,
	|	ДанныеДокумента.СуммаНДС                    КАК СуммаНДС,
	|	ДанныеДокумента.СуммаВзаиморасчетов         КАК СуммаВзаиморасчетов,
	|	ДанныеДокумента.СуммаНДСВзаиморасчетов      КАК СуммаНДСВзаиморасчетов,
#Удаление
	|	ДанныеДокумента.СуммаБезНДСРегл             КАК СуммаБезНДСРегл,
	|	ДанныеДокумента.СуммаБезНДСУпр              КАК СуммаБезНДСУпр,
	|	&ТекстПоляСуммаНДСРегл КАК СуммаНДСРегл,
	|	&ТекстПоляСуммаНДСУпр КАК СуммаНДСУпр,
#КонецУдаления
#Вставка
	|	ДанныеДокумента.СуммаБезНДС             КАК СуммаБезНДСРегл,
	|	ДанныеДокумента.СуммаБезНДС              КАК СуммаБезНДСУпр,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДСРегл,
	|	ДанныеДокумента.СуммаНДС КАК СуммаНДСУпр,
#КонецВставки
	|	
	|	ДанныеДокумента.ОтражаетсяВРасчетах КАК ОтражаетсяВРасчетах,
	|	ДанныеДокумента.ОбъектРасчетов      КАК ОбъектРасчетов,
	|	ДанныеДокумента.ПересчитыватьПоДаннымРасчетов КАК ПересчитыватьПоДаннымРасчетов,
	|	&НеПересчитыватьСуммыНДС КАК НеПересчитыватьСуммыНДС,
	|	ЕСТЬNULL(ОбъектыРасчетов.Договор, НЕОПРЕДЕЛЕНО) КАК Договор,
	|	ЕСТЬNULL(
	|		ОбъектыРасчетов.Договор.ВариантКурсаДоговора, 
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыКурсаДоговора.Переменный)) КАК ВариантКурсаДоговора
	|	
	|ПОМЕСТИТЬ ДанныеДокументаПредварительная
	|ИЗ
	|	&ТекстЗапросаДанныхДокументов КАК ДанныеДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (ДанныеДокумента.ОбъектРасчетов = ОбъектыРасчетов.Ссылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	ИдентификаторСтроки
	|";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаДанныхДокументов", "(" + ТекстЗапросаДанныхДокументов + ")");

	Если НеПересчитыватьСуммыНДС Тогда

		ТекстПоляСуммаНДСРегл = "ДанныеДокумента.СуммаНДСРегл";
		ТекстПоляСуммаНДСУпр = "ДанныеДокумента.СуммаНДСУпр";
		ТекстПоляПериодБазыНДС = "ДАТАВРЕМЯ(1, 1, 1)";

	Иначе

		ТекстПоляСуммаНДСРегл = "0";
		ТекстПоляСуммаНДСУпр = "0";
		ТекстПоляПериодБазыНДС = "ДанныеДокумента.ПериодБазыНДС";

	КонецЕсли;

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	"&ТекстПоляСуммаНДСРегл",
	ТекстПоляСуммаНДСРегл);

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	"&ТекстПоляСуммаНДСУпр",
	ТекстПоляСуммаНДСУпр);

	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
	"&ТекстПоляПериодБазыНДС",
	ТекстПоляПериодБазыНДС);

	ЗапросИнициализации = Новый Запрос;
	ЗапросИнициализации.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросИнициализации.УстановитьПараметр("ВалютаУправленческогоУчета", ВалютаУправленческогоУчета);
	ЗапросИнициализации.УстановитьПараметр("НеПересчитыватьСуммыНДС", НеПересчитыватьСуммыНДС);
	Для каждого Параметр Из Запрос.Параметры Цикл
		ЗапросИнициализации.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	ЗапросИнициализации.Текст = ТекстЗапроса;
	ЗапросИнициализации.Выполнить();

	ПересчитатьТаблицуВВалютыУчета(ЗапросИнициализации.МенеджерВременныхТаблиц);

	ЗапросИнициализации.Текст =
	"ВЫБРАТЬ
	|	ДанныеДокументов.ИсточникДанных                          КАК ИсточникДанных,
	|	ДанныеДокументов.РаспределятьОбщуюСумму                  КАК РаспределятьОбщуюСумму,
	|	ДанныеДокументов.Регистратор                             КАК Ссылка,
	|	ДанныеДокументов.Период                                  КАК Дата,
	|	ДанныеДокументов.Организация                             КАК Организация,
	|	ДанныеДокументов.Валюта                                  КАК ВалютаДокумента,
	|	ДанныеДокументов.ВалютаВзаиморасчетов                    КАК ВалютаВзаиморасчетов,
	|	ДанныеДокументов.ПериодБазыНДС                           КАК ПериодБазыНДС,
	|
	|	ДанныеДокументов.ИдентификаторСтроки                     КАК ИдентификаторСтроки,
	|	ДанныеДокументов.НомерСтроки                             КАК НомерСтроки,
	|	ДанныеДокументов.СтавкаНДС                               КАК СтавкаНДС,
	|	ДанныеДокументов.СуммаБезНДС + ДанныеДокументов.СуммаНДС КАК СуммаСНДС,
	|	ДанныеДокументов.СуммаНДС                                КАК СуммаНДС,
	|	ДанныеДокументов.СуммаБезНДС                             КАК СуммаБезНДС,
	|	ДанныеДокументов.СуммаВзаиморасчетов                     КАК СуммаВзаиморасчетов,
	|	ДанныеДокументов.СуммаНДСВзаиморасчетов                  КАК СуммаНДСВзаиморасчетов,
	|	
	|	ДанныеДокументов.ОтражаетсяВРасчетах КАК ОтражаетсяВРасчетах,
	|	ДанныеДокументов.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ДанныеДокументов.ПересчитыватьПоДаннымРасчетов КАК ПересчитыватьПоДаннымРасчетов,
	|	ДанныеДокументов.НеПересчитыватьСуммыНДС КАК НеПересчитыватьСуммыНДС,
	|	
	|	ЕСТЬNULL(Суммы.СуммаБезНДСУпр + Суммы.СуммаНДСУпр,
	|		ВЫБОР
	|			КОГДА ДанныеДокументов.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета 
	|			      И ДанныеДокументов.Валюта <> ДанныеДокументов.ВалютаВзаиморасчетов
	|				ТОГДА ДанныеДокументов.СуммаВзаиморасчетов
	|			ИНАЧЕ ДанныеДокументов.СуммаБезНДСУпр + ДанныеДокументов.СуммаНДСУпр
	|		КОНЕЦ) КАК СуммаСНДСУпр,
	|
	|	ЕСТЬNULL(Суммы.СуммаБезНДСУпр,
	|		ВЫБОР 
	|			КОГДА ДанныеДокументов.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
	|			      И ДанныеДокументов.Валюта <> ДанныеДокументов.ВалютаВзаиморасчетов
	|			      И ДанныеДокументов.СуммаНДСВзаиморасчетов <> 0
	|				ТОГДА ДанныеДокументов.СуммаВзаиморасчетов - ДанныеДокументов.СуммаНДСВзаиморасчетов
	|			ИНАЧЕ ДанныеДокументов.СуммаБезНДСУпр
	|		КОНЕЦ) КАК СуммаБезНДСУпр,
	|
	|	ЕСТЬNULL(Суммы.СуммаНДСУпр,
	|		ВЫБОР
	|			КОГДА ДанныеДокументов.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета 
	|			      И ДанныеДокументов.Валюта <> ДанныеДокументов.ВалютаВзаиморасчетов
	|			      И ДанныеДокументов.СуммаНДСВзаиморасчетов <> 0
	|				ТОГДА ДанныеДокументов.СуммаНДСВзаиморасчетов
	|			ИНАЧЕ ДанныеДокументов.СуммаНДСУпр
	|		КОНЕЦ) КАК СуммаНДСУпр,
	|
	|	ЕСТЬNULL(Суммы.СуммаБезНДСРегл,
	|		ВЫБОР
	|			КОГДА ДанныеДокументов.ВалютаВзаиморасчетов = Организации.ВалютаРегламентированногоУчета
	|			      И ДанныеДокументов.Валюта <> ДанныеДокументов.ВалютаВзаиморасчетов
	|			      И ДанныеДокументов.СуммаНДСВзаиморасчетов <> 0
	|				ТОГДА ДанныеДокументов.СуммаВзаиморасчетов - ДанныеДокументов.СуммаНДСВзаиморасчетов
	|			ИНАЧЕ ДанныеДокументов.СуммаБезНДСРегл 
	|		КОНЕЦ 
	|	) КАК СуммаБезНДСРегл,
	|
	|	ЕСТЬNULL(Суммы.СуммаНДСРегл, 
	|		ВЫБОР
	|			КОГДА ДанныеДокументов.ВалютаВзаиморасчетов = Организации.ВалютаРегламентированногоУчета 
	|			      И ДанныеДокументов.Валюта <> ДанныеДокументов.ВалютаВзаиморасчетов
	|			      И ДанныеДокументов.СуммаНДСВзаиморасчетов <> 0
	|				ТОГДА ДанныеДокументов.СуммаНДСВзаиморасчетов
	|			ИНАЧЕ ДанныеДокументов.СуммаНДСРегл
	|		КОНЕЦ
	|	) КАК СуммаНДСРегл,
	|
	|	ЕСТЬNULL(Суммы.СуммаБезНДСРегл + Суммы.СуммаНДСРегл,
	|		ВЫБОР
	|			КОГДА ДанныеДокументов.ВалютаВзаиморасчетов = Организации.ВалютаРегламентированногоУчета
	|			      И ДанныеДокументов.Валюта <> ДанныеДокументов.ВалютаВзаиморасчетов
	|			      И ДанныеДокументов.СуммаВзаиморасчетов <> 0
	|				ТОГДА ДанныеДокументов.СуммаВзаиморасчетов
	|			ИНАЧЕ ДанныеДокументов.СуммаБезНДСРегл + ДанныеДокументов.СуммаНДСРегл
	|		КОНЕЦ
	|	) КАК СуммаСНДСРегл,
	|
	|	ВЫБОР
	|		КОГДА ДанныеДокументов.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|			И ВЫРАЗИТЬ(ДанныеДокументов.Регистратор КАК Документ.РеализацияТоваровУслуг).ХозяйственнаяОперация =
	|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереходПраваСобственности)
	|				ИЛИ ДанныеДокументов.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|					И ВЫРАЗИТЬ(ДанныеДокументов.Регистратор КАК Документ.КорректировкаРеализации).ХозяйственнаяОперация =
	|						ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереходПраваСобственности)
	|			ТОГДА 0
	|		ИНАЧЕ
	|			ЕСТЬNULL(Суммы.БазаНДСРегл,
	|				ВЫБОР
	|					КОГДА ДанныеДокументов.СтавкаНДС В (ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
	|						ТОГДА 0
	|					КОГДА ДанныеДокументов.ВалютаВзаиморасчетов = Организации.ВалютаРегламентированногоУчета
	|					      И ДанныеДокументов.Валюта <> ДанныеДокументов.ВалютаВзаиморасчетов
	|					      И ДанныеДокументов.СуммаНДСВзаиморасчетов <> 0
	|					ТОГДА ДанныеДокументов.СуммаВзаиморасчетов - ДанныеДокументов.СуммаНДСВзаиморасчетов
	|					ИНАЧЕ ДанныеДокументов.БазаНДСРегл
	|				КОНЕЦ 
	|			)
	|	КОНЕЦ КАК БазаНДСРегл,
	|
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Суммы.СуммаПриведенная, 0) = 0
	|			ТОГДА ДанныеДокументов.СуммаВзаиморасчетов - ДанныеДокументов.СуммаНДСВзаиморасчетов
	|		ИНАЧЕ Суммы.СуммаПриведенная
	|	КОНЕЦ КАК СуммаПриведенная,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Суммы.СуммаПриведеннаяРегл, 0) = 0
	|			ТОГДА ЕСТЬNULL(Суммы.СуммаБезНДСРегл,
	|					ВЫБОР
	|						КОГДА ДанныеДокументов.ВалютаВзаиморасчетов = Организации.ВалютаРегламентированногоУчета
	|						      И ДанныеДокументов.Валюта <> ДанныеДокументов.ВалютаВзаиморасчетов
	|						      И ДанныеДокументов.СуммаНДСВзаиморасчетов <> 0
	|							ТОГДА ДанныеДокументов.СуммаВзаиморасчетов - ДанныеДокументов.СуммаНДСВзаиморасчетов
	|						ИНАЧЕ ДанныеДокументов.СуммаБезНДСРегл 
	|					КОНЕЦ)
	|		ИНАЧЕ Суммы.СуммаПриведеннаяРегл
	|	КОНЕЦ КАК СуммаПриведеннаяРегл,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Суммы.СуммаПриведеннаяУпр, 0) = 0
	|			ТОГДА ЕСТЬNULL(Суммы.СуммаБезНДСУпр,
	|					ВЫБОР 
	|						КОГДА ДанныеДокументов.ВалютаВзаиморасчетов = &ВалютаУправленческогоУчета
	|						      И ДанныеДокументов.Валюта <> ДанныеДокументов.ВалютаВзаиморасчетов
	|						      И ДанныеДокументов.СуммаНДСВзаиморасчетов <> 0
	|							ТОГДА ДанныеДокументов.СуммаВзаиморасчетов - ДанныеДокументов.СуммаНДСВзаиморасчетов
	|						ИНАЧЕ ДанныеДокументов.СуммаБезНДСУпр
	|					КОНЕЦ)
	|		ИНАЧЕ Суммы.СуммаПриведеннаяУпр
	|	КОНЕЦ КАК СуммаПриведеннаяУпр,
	|	ВЫБОР
	|		КОГДА Суммы.Регистратор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИзРегистра
	|
	|ПОМЕСТИТЬ ВтСуммыДокументовВВалютахУчета
	|ИЗ
	|	СуммыДокументовВВалютахУчета КАК ДанныеДокументов
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО Организации.Ссылка = ДанныеДокументов.Организация
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.СуммыДокументовВВалютахУчета КАК Суммы
	|	ПО
	|		ДанныеДокументов.Регистратор = Суммы.Регистратор
	|		И ДанныеДокументов.Период = Суммы.Период
	|		И ДанныеДокументов.ИдентификаторСтроки = Суммы.ИдентификаторСтроки
	|		И ДанныеДокументов.ВалютаВзаиморасчетов = Суммы.ВалютаВзаиморасчетов
	|		И ДанныеДокументов.Валюта = Суммы.Валюта
	|		И ДанныеДокументов.СтавкаНДС = Суммы.СтавкаНДС
	|		И ДанныеДокументов.СуммаВзаиморасчетов = Суммы.СуммаВзаиморасчетов
	|		И ДанныеДокументов.СуммаБезНДС = Суммы.СуммаБезНДС
	|		И ДанныеДокументов.СуммаНДС = Суммы.СуммаНДС
	|		И ДанныеДокументов.Валюта = Суммы.Валюта
	|		И ДанныеДокументов.ВалютаВзаиморасчетов = Суммы.ВалютаВзаиморасчетов
	|		И ДанныеДокументов.ПериодБазыНДС = Суммы.ПериодБазыНДС
	|		И ДанныеДокументов.ОтражаетсяВРасчетах = Суммы.ОтражаетсяВРасчетах
	|		И ДанныеДокументов.ОбъектРасчетов = Суммы.ОбъектРасчетов
	|		И ДанныеДокументов.ПересчитыватьПоДаннымРасчетов = Суммы.ПересчитыватьПоДаннымРасчетов
	|		И ДанныеДокументов.НеПересчитыватьСуммыНДС = Суммы.НеПересчитыватьСуммыНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ИдентификаторСтроки
	|;
	|
	|//////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммыДокументовВВалютахУчета
	|";
	УстановитьПривилегированныйРежим(Истина);
	ЗапросИнициализации.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);

	Если ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда

		Если НЕ Запрос.Параметры.Свойство("ВалютаУправленческогоУчета") Тогда
			Запрос.УстановитьПараметр("ВалютаУправленческогоУчета",     ВалютаУправленческогоУчета);
		КонецЕсли;

		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Суммы.Ссылка КАК Регистратор,
		|	Суммы.Дата КАК Период,
		|	
		|	Суммы.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	
		|	Суммы.СуммаБезНДС КАК СуммаБезНДС,
		|	Суммы.СуммаНДС  КАК СуммаНДС,
		|	
		|	Суммы.СуммаБезНДСРегл КАК СуммаБезНДСРегл,
		|	Суммы.БазаНДСРегл КАК БазаНДСРегл,
		|	Суммы.СуммаНДСРегл КАК СуммаНДСРегл,
		|	Суммы.СуммаБезНДСУпр КАК СуммаБезНДСУпр,
		|	Суммы.СуммаНДСУпр КАК СуммаНДСУпр,
		|	Суммы.СуммаВзаиморасчетов  КАК СуммаВзаиморасчетов,
		|	Суммы.СуммаНДСВзаиморасчетов  КАК СуммаНДСВзаиморасчетов,
		|	
		|	Суммы.ВалютаДокумента КАК Валюта,
		|	Суммы.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	Суммы.СтавкаНДС КАК СтавкаНДС,
		|	
		|	Суммы.ПериодБазыНДС КАК ПериодБазыНДС,
		|
		|	Суммы.ОтражаетсяВРасчетах КАК ОтражаетсяВРасчетах,
		|	ВЫБОР
		|		КОГДА НЕ Суммы.ОтражаетсяВРасчетах
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ Суммы.ОбъектРасчетов
		|	КОНЕЦ КАК ОбъектРасчетов,
		|	(Суммы.ОтражаетсяВРасчетах И Суммы.ПересчитыватьПоДаннымРасчетов) КАК ПересчитыватьПоДаннымРасчетов,
		|	Суммы.НеПересчитыватьСуммыНДС КАК НеПересчитыватьСуммыНДС,
		|	ВЫБОР
		|		КОГДА (Суммы.ОтражаетсяВРасчетах И Суммы.ПересчитыватьПоДаннымРасчетов)
		|			ТОГДА ЕСТЬNULL(Суммы.ОбъектРасчетов.ТипРасчетов, НЕОПРЕДЕЛЕНО)
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ТипРасчетов,
		|	Суммы.СуммаПриведенная КАК СуммаПриведенная,
		|	Суммы.СуммаПриведеннаяУпр КАК СуммаПриведеннаяУпр,
		|	Суммы.СуммаПриведеннаяРегл КАК СуммаПриведеннаяРегл
		|
		|ИЗ
		|	ВтСуммыДокументовВВалютахУчета КАК Суммы
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
		|	ПО
		|		Суммы.ОбъектРасчетов = ОбъектыРасчетов.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Суммы.ИсточникДанных,
		|	Суммы.НомерСтроки";

		ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

	КонецЕсли;

КонецПроцедуры
