
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	//ТабличныйДокумент = Новый ТабличныйДокумент;
	//ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаВывоз";
	Макет = Документы.ЗаявкаНаВывоз.ПолучитьМакет("Макет");
	ОбластьШапка = Макет.ПолучитьОбласть("ЗаголовокПеремещение");
	ОбластьШапка.Параметры.ТекстЗаголовка =  Ссылка[0];
	ОбластьШапка.Параметры.Партнер =  Ссылка[0].Партнер;
	ОбластьШапка.Параметры.КудаЕдет =	Ссылка[0].КудаЕдет;
	
//	ОбластьШапка.Параметры.СкладОтправитель = "";
//	ОбластьШапка.Параметры.СкладПолучатель =	"";
		
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаВывозДокументы.Документ КАК Документ,
	|	ЗаявкаНаВывозДокументы.Документ.ЗаказКлиента КАК ДокументЗаказКлиента
	|ИЗ
	|	Документ.ЗаявкаНаВывоз.Документы КАК ЗаявкаНаВывозДокументы
	|ГДЕ
	|	ЗаявкаНаВывозДокументы.Ссылка В(&Ссылка)";
	Запрос1.Параметры.Вставить("Ссылка", Ссылка);
	//Выборка = Запрос.Выполнить().Выбрать();
	ДокументыОтгрузки = Запрос1.Выполнить().Выгрузить().ВыгрузитьКолонку("Документ");
	ЗаказыКлиентов = Запрос1.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументЗаказКлиента");
	текст = "";
	ОтгрузкаБезДокументов="";
	Для каждого Стр из ЗаказыКлиентов Цикл
		Если Стр.НомерЦикла>0 Тогда
			Текст= Текст + Стр.Номер + строка( " по циклу - ") + строка(Стр.НомерЦикла) + "; ";
		Иначе 
	        Текст= Текст + Стр.Номер + "; ";
		КонецЕсли;
		Если Стр.ОтгрузкаБезДокументов=Истина Тогда ОтгрузкаБезДокументов="Отгрузка без документов"; 
		КонецЕсли;
	КонецЦикла;
			
	ОбластьШапка.Параметры.ТекстЗаголовка =  Ссылка[0];
	ОбластьШапка.Параметры.ЗаказыКлиентов =  Текст;

	ТабДок.Вывести(ОбластьШапка);
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");

	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	ОбластьПодСтроки = Макет.ПолучитьОбласть("ПодСтрока");	
	
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ТоварыКОтгрузке.КОтгрузке) КАК Количество,
		|	ТоварыКОтгрузке.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(НоменклатурыВПаллете.Количество, 0) КАК Впаллете,
		|	ЕСТЬNULL(ТоварыКОтгрузке.Номенклатура.ВесЧислитель, 0) КАК ВесЧислитель,
		|	ЕСТЬNULL(ТоварыКОтгрузке.Номенклатура.ВесЗнаменатель, 1) КАК ВесЗнаменатель
		|ИЗ
		|	РегистрНакопления.ТоварыКОтгрузке КАК ТоварыКОтгрузке
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатурыВПаллете КАК НоменклатурыВПаллете
		|		ПО ТоварыКОтгрузке.Номенклатура = НоменклатурыВПаллете.Номенклатура
		|ГДЕ
		|	ТоварыКОтгрузке.Регистратор В(&ДокументОтгрузки)
		|	И ТоварыКОтгрузке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКОтгрузке.Номенклатура,
		|	ЕСТЬNULL(НоменклатурыВПаллете.Количество, 0),
		|	ЕСТЬNULL(ТоварыКОтгрузке.Номенклатура.ВесЧислитель, 0),
		|	ЕСТЬNULL(ТоварыКОтгрузке.Номенклатура.ВесЗнаменатель, 1)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыКОтгрузке.Номенклатура.ГруппаАналитическогоУчета,
		|	ТоварыКОтгрузке.Номенклатура.Наименование";
	
	Запрос.УстановитьПараметр("ДокументОтгрузки", ДокументыОтгрузки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Порядок = 0;
	ВесТовара = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВесТовара = ВесТовара + ВыборкаДетальныеЗаписи.ВесЧислитель/?(ВыборкаДетальныеЗаписи.ВесЗнаменатель>0,ВыборкаДетальныеЗаписи.ВесЗнаменатель,1)*ВыборкаДетальныеЗаписи.Количество;
		Порядок = Порядок + 1;
		Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		ОбластьСтроки.Параметры.НомерСтроки = Порядок;
		ОбластьСтроки.Параметры.Артикул = ВыборкаДетальныеЗаписи.Номенклатура.Артикул;
		ОбластьСтроки.Параметры.Товар = ВыборкаДетальныеЗаписи.Номенклатура;
		ОбластьСтроки.Параметры.Количество = ВыборкаДетальныеЗаписи.Количество;
		Если ВыборкаДетальныеЗаписи.ВПаллете > 0 Тогда 
		ОбластьСтроки.Параметры.ПМ = Цел(ВыборкаДетальныеЗаписи.Количество/ВыборкаДетальныеЗаписи.Впаллете);
		ОбластьСтроки.Параметры.ШТ = ВыборкаДетальныеЗаписи.Количество - Цел(ВыборкаДетальныеЗаписи.Количество/ВыборкаДетальныеЗаписи.ВПаллете)*ВыборкаДетальныеЗаписи.ВПаллете;
		Иначе
		ОбластьСтроки.Параметры.ПМ = "";
		ОбластьСтроки.Параметры.ШТ = ВыборкаДетальныеЗаписи.Количество;
		КонецЕсли;
		ОбластьСтроки.Параметры.ПредставлениеБазовойЕдиницыИзмерения = ВыборкаДетальныеЗаписи.Номенклатура.ЕдиницаИзмерения; 
		ТабДок.Вывести(ОбластьСтроки);
		
		Запрос2 = Новый Запрос;
		Запрос2.Текст = 
		"ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Количество,
		|	ВариантыКомплектацииНоменклатуры.Владелец,
		|	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
		|ГДЕ
		|	ВариантыКомплектацииНоменклатуры.Основной = &Основной
		|	И ВариантыКомплектацииНоменклатуры.Владелец = &Владелец";
	
		Запрос2.УстановитьПараметр("Основной", Истина);
		Запрос2.УстановитьПараметр("Владелец", Номенклатура);

	
			РезультатЗапроса2 = Запрос2.Выполнить();
			
			ВыборкаДетальныеЗаписи2 = РезультатЗапроса2.Выбрать();
			Индекс = 0;
			Пока ВыборкаДетальныеЗаписи2.Следующий() Цикл
				Если Индекс = 0 Тогда
				ОбластьПредСтроки = Макет.ПолучитьОбласть("ПредСтрока");
				ТабДок.Вывести(ОбластьПредСтроки);	
				Индекс = Индекс + 1;
				КонецЕсли;
			    ОбластьПодСтроки.Параметры.НомерСтроки = ВыборкаДетальныеЗаписи2.НомерСтроки;
				//ОбластьПодСтроки.Параметры.Артикул = ВыборкаДетальныеЗаписи.Номенклатура.Артикул;
				ОбластьПодСтроки.Параметры.Товар = ВыборкаДетальныеЗаписи2.Номенклатура;
				ОбластьПодСтроки.Параметры.Количество = ВыборкаДетальныеЗаписи2.Количество*ВыборкаДетальныеЗаписи.Количество;
				ОбластьПодСтроки.Параметры.ПредставлениеБазовойЕдиницыИзмерения = ВыборкаДетальныеЗаписи.Номенклатура.ЕдиницаИзмерения;
				ТабДок.Вывести(ОбластьПодСтроки);

		
		
			КонецЦикла;
	
	КонецЦикла;
	
	Ответственный = "";
	Комментарий = "";
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.ОтгрузкаБезДокументов=ОтгрузкаБезДокументов;
	ОбластьПодвал.Параметры.Ответственный = Ссылка[0].Ответственный;
	ОбластьПодвал.Параметры.Комментарий = Ссылка[0].Комментарий;
	ОбластьПодвал.Параметры.Вес = Ссылка[0].Вес;
	ОбластьПодвал.Параметры.ВесТовара = ВесТовара;
	//выводим подвал в табличный документ
	ТабДок.Вывести(ОбластьПодвал);

	//Для каждого Стр из МассивОбъектов Цикл
	//Ответственный = Ответственный + Стр.Ответственный + "; ";
	//Комментарий = Комментарий + Стр.Комментарий + "; ";
	//КонецЦикла;

	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	//ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	//ОбластьДокументыШапка = Макет.ПолучитьОбласть("ДокументыШапка");
	//ОбластьДокументы = Макет.ПолучитьОбласть("Документы");
	//ТабДок.Очистить();

	//ВставлятьРазделительСтраниц = Ложь;
	//Пока Выборка.Следующий() Цикл
	//	Если ВставлятьРазделительСтраниц Тогда
	//		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;

	//	ТабДок.Вывести(ОбластьЗаголовок);

	//	ТабДок.Вывести(ОбластьДокументыШапка);
	//	ВыборкаДокументы = Выборка.Документы.Выбрать();
	//	Пока ВыборкаДокументы.Следующий() Цикл
	//		ОбластьДокументы.Параметры.Заполнить(ВыборкаДокументы);
	//		ТабДок.Вывести(ОбластьДокументы, ВыборкаДокументы.Уровень());
	//	КонецЦикла;

	//	ВставлятьРазделительСтраниц = Истина;
	//КонецЦикла;
	//}}
КонецПроцедуры

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Обработчик = "УправлениеПечатьюУТКлиент.ПечатьКомплектаДокументовСНастройкой";
	КомандаПечати.МенеджерПечати = "";
	КомандаПечати.Идентификатор = "КомплектДокументовСНастройкой";
	КомандаПечати.Представление = НСтр("ru = 'Комплект документов с настройкой...'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 2;
КонецПроцедуры

Функция КомплектПечатныхФорм() Экспорт
	
	КомплектПечатныхФорм = РегистрыСведений.НастройкиПечатиОбъектов.ПодготовитьКомплектПечатныхФорм();
	
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "РасходнаяНакладная", НСтр("ru = 'Расходная накладная'"),                         0);
	
	Если ПолучитьФункциональнуюОпцию("ВыбиратьВариантВыводаСкидокПриПечатиДокументовПродажи") Тогда
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "Накладная", НСтр("ru = 'Реализация товаров (выводить скидки)'"),             0);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "НакладнаяБезСкидок", НСтр("ru = 'Реализация товаров (не выводить скидки)'"), 0);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "Акт", НСтр("ru = 'Акт об оказании услуг (выводить скидки)'"),                2);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "АктБезСкидок", НСтр("ru = 'Акт об оказании услуг (не выводить скидки)'"),    0);
	Иначе
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "Накладная", НСтр("ru = 'Реализация товаров'"),                               0);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "Акт", НСтр("ru = 'Акт об оказании услуг'"),                                  2);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("НеИспользоватьСчетаНаОплатуВыбиратьВариантВыводаСкидок") Тогда
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "СчетНаОплату", НСтр("ru = 'Счет на оплату (выводить скидки)'"), 1);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "СчетНаОплатуБезСкидок", НСтр("ru = 'Счет на оплату (не выводить скидки)'"), 0);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "СчетНаОплатуСФаксимиле", НСтр("ru = 'Счет на оплату с факсимиле (выводить скидки)'"), 0);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "СчетНаОплатуСФаксимилеБезСкидок", НСтр("ru = 'Счет на оплату с факсимиле (не выводить скидки)'"), 0);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("НеИспользоватьСчетаНаОплатуНеВыбиратьВариантВыводаСкидок") Тогда
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "СчетНаОплату", НСтр("ru = 'Счет на оплату'"), 1);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "СчетНаОплатуСФаксимиле", НСтр("ru = 'Счет на оплату с факсимиле'"), 0);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСертификатыНоменклатуры") Тогда
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
			"СертификатыНоменклатурыРеестр",
			НСтр("ru = 'Сертификаты (реестр)'"),
			0);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
			"СертификатыНоменклатурыИзображенияИзДокументов",
			НСтр("ru = 'Сертификаты (по каждой позиции документа)'"),
			0);
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм,
			"СертификатыНоменклатурыИзображенияИзДокументовБезДублей",
			НСтр("ru = 'Сертификаты (по одному на сертификат)'"),
			0);
	КонецЕсли;
	//ASP_Dante 01/09/19	
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "СчетНаОплатуГТС", НСтр("ru = 'Счет на оплату(ГТС)'"), 1);  //ASP  +++
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "СчетНаОплатуГТСБезСкидок", НСтр("ru = 'Счет на оплату БЕЗ Скидок'"), 1);
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "РасходнаяНакладнаяСГТД", НСтр("ru = 'Расходная накладная с ГТД'"), 1);
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "РасходнаяНакладнаяСКомплектующими", НСтр("ru = 'Расходная накладная с комплекующими'"), 1);  //asp --- 
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "КомплектовочныйЛист", НСтр("ru = 'Комплектовочный лист'"), 1);  //asp --- 
	РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, "ЗаданиеНаОтборРазмещениеТовара", НСтр("ru = 'Задание на отбор товаров'"),         0);
	//ASP_Dante 01/09/19
	РеализацияТоваровУслугЛокализация.КомплектПечатныхФорм(КомплектПечатныхФорм);
	
	Возврат КомплектПечатныхФорм;
	
КонецФункции
