&НаКлиенте
Процедура ВыполнитьПоиск(Команда)
	
	ТекСтрокаИсходная		=	СокрЛП(СтрокаПоиска);
		
		ТекСтрокаТолькоЦифры	=	"";
		
		// (
		
		Для ТекНомерСимвола = 1 По СтрДлина(ТекСтрокаИсходная) Цикл
			
			ТекСимвол	=	Сред(ТекСтрокаИсходная, ТекНомерСимвола, 1);
		
			Если	Найти("0123456789", ТекСимвол) > 0	Тогда
			
				ТекСтрокаТолькоЦифры	=	ТекСтрокаТолькоЦифры	+	ТекСимвол;
			
			КонецЕсли;
		
		КонецЦикла;
	
	Объект.Результаты.Очистить();	
	
	Контакты = ЗагрузитьСписокКонтактовТелефонКоторыхСодержитСтрокуПоиска(ТекСтрокаТолькоЦифры);
	
	Для Каждого Элемент Из Контакты Цикл
		
		Для Каждого Владелец Из Элемент.Значение Цикл
			НовСтрока				=	Объект.Результаты.Добавить();
			НовСтрока.Телефон 		=	Элемент.Ключ;
			НовСтрока.ТипТелефона 	=	Владелец.ТипТелефона;
			НовСтрока.Владелец 		=	Владелец.Ссылка;
			НовСтрока.ТипВладельца  =	Владелец.ТипВладельца;
		КонецЦикла;	
		
    КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура РезультатыВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	ТипыЗначений = Новый Соответствие;
	ТипыЗначений.Вставить(Строка(Тип("СправочникСсылка.Организации")),				"Справочник.Организации.ФормаОбъекта");
	ТипыЗначений.Вставить(Строка(Тип("СправочникСсылка.Пользователи")),				"Справочник.Пользователи.ФормаОбъекта");
	ТипыЗначений.Вставить(Строка(Тип("СправочникСсылка.Контрагенты")),				"Справочник.Контрагенты.ФормаОбъекта");
	ТипыЗначений.Вставить(Строка(Тип("СправочникСсылка.Партнеры")),					"Справочник.Партнеры.ФормаОбъекта");
	ТипыЗначений.Вставить(Строка(Тип("СправочникСсылка.КонтактныеЛицаПартнеров")),	"Справочник.КонтактныеЛицаПартнеров.ФормаОбъекта");
	ТипыЗначений.Вставить(Строка(Тип("СправочникСсылка.ФизическиеЛица")),			"Справочник.ФизическиеЛица.ФормаОбъекта");
	
	Владелец = Элемент.ТекущиеДанные.Владелец;
	Пр = Новый Структура;
    Пр.Вставить("Ключ", Владелец);
    ОткрытьФорму(ТипыЗначений.Получить(Строка(ТипЗнч(Владелец))), Пр);
	СтандартнаяОбработка	=	Ложь;
	
КонецПроцедуры
 
&НаСервере
Функция	ЗагрузитьСписокКонтактовТелефонКоторыхСодержитСтрокуПоиска(СтрокаПоиска)
	УстановитьПривилегированныйРежим(Истина);

	
	СписокТелефонов	=	Новый	Соответствие;
	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст	=	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	            	 	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Ссылка КАК Ссылка,
	            	 	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Вид КАК Вид,
	            	 	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.Представление КАК Представление,
	            	 	|	КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
	            	 	|	ВЫБОР
	            	 	|		КОГДА КонтактныеЛицаПартнеровКонтактнаяИнформация.НомерТелефона <> """"
	            	 	|			ТОГДА ""Контактное лицо""
	            	 	|	КОНЕЦ КАК ТипВладельца
	            	 	|ИЗ
	            	 	|	Справочник.КонтактныеЛицаПартнеров.КонтактнаяИнформация КАК КонтактныеЛицаПартнеровКонтактнаяИнформация
	            	 	|
	            	 	|ОБЪЕДИНИТЬ ВСЕ
	            	 	|
	            	 	|ВЫБРАТЬ
	            	 	|	КонтрагентыКонтактнаяИнформация.Ссылка,
	            	 	|	КонтрагентыКонтактнаяИнформация.Вид,
	            	 	|	КонтрагентыКонтактнаяИнформация.Представление,
	            	 	|	КонтрагентыКонтактнаяИнформация.НомерТелефона,
	            	 	|	ВЫБОР
	            	 	|		КОГДА КонтрагентыКонтактнаяИнформация.НомерТелефона <> """"
	            	 	|			ТОГДА ""Контрагент""
	            	 	|	КОНЕЦ
	            	 	|ИЗ
	            	 	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	            	 	|
	            	 	|ОБЪЕДИНИТЬ ВСЕ
	            	 	|
	            	 	|ВЫБРАТЬ
	            	 	|	ОрганизацииКонтактнаяИнформация.Ссылка,
	            	 	|	ОрганизацииКонтактнаяИнформация.Вид,
	            	 	|	ОрганизацииКонтактнаяИнформация.Представление,
	            	 	|	ОрганизацииКонтактнаяИнформация.НомерТелефона,
	            	 	|	ВЫБОР
	            	 	|		КОГДА ОрганизацииКонтактнаяИнформация.НомерТелефона <> """"
	            	 	|			ТОГДА ""Организация""
	            	 	|	КОНЕЦ
	            	 	|ИЗ
	            	 	|	Справочник.Организации.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	            	 	|
	            	 	|ОБЪЕДИНИТЬ ВСЕ
	            	 	|
	            	 	|ВЫБРАТЬ
	            	 	|	ПартнерыКонтактнаяИнформация.Ссылка,
	            	 	|	ПартнерыКонтактнаяИнформация.Вид,
	            	 	|	ПартнерыКонтактнаяИнформация.Представление,
	            	 	|	ПартнерыКонтактнаяИнформация.НомерТелефона,
	            	 	|	ВЫБОР
	            	 	|		КОГДА ПартнерыКонтактнаяИнформация.НомерТелефона <> """"
	            	 	|			ТОГДА ""Партнер""
	            	 	|	КОНЕЦ
	            	 	|ИЗ
	            	 	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	            	 	|
	            	 	|ОБЪЕДИНИТЬ ВСЕ
	            	 	|
	            	 	|ВЫБРАТЬ
	            	 	|	ПользователиКонтактнаяИнформация.Ссылка,
	            	 	|	ПользователиКонтактнаяИнформация.Вид,
	            	 	|	ПользователиКонтактнаяИнформация.Представление,
	            	 	|	ПользователиКонтактнаяИнформация.НомерТелефона,
	            	 	|	ВЫБОР
	            	 	|		КОГДА ПользователиКонтактнаяИнформация.НомерТелефона <> """"
	            	 	|			ТОГДА ""Пользователь""
	            	 	|	КОНЕЦ
	            	 	|ИЗ
	            	 	|	Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	            	 	|
	            	 	|ОБЪЕДИНИТЬ ВСЕ
	            	 	|
	            	 	|ВЫБРАТЬ
	            	 	|	ФизическиеЛицаКонтактнаяИнформация.Ссылка,
	            	 	|	ФизическиеЛицаКонтактнаяИнформация.Вид,
	            	 	|	ФизическиеЛицаКонтактнаяИнформация.Представление,
	            	 	|	ФизическиеЛицаКонтактнаяИнформация.НомерТелефона,
	            	 	|	ВЫБОР
	            	 	|		КОГДА ФизическиеЛицаКонтактнаяИнформация.НомерТелефона <> """"
	            	 	|			ТОГДА ""Физическое лицо""
	            	 	|	КОНЕЦ
	            	 	|ИЗ
	            	 	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация";
		
	Выборка		=	Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если СтрДлина(Выборка.НомерТелефона) <=0 Тогда		
			Продолжить;			
		КонецЕсли; 
		
		МассивНомеров	=	ПолучитьМассивИзСтрокиТелефонов(Выборка.Представление);
		
		Для К = 0 По МассивНомеров.Количество() - 1 Цикл
			
			НомерТелефона		=	МассивНомеров[К];	
			
			Если СтрЧислоВхождений(НомерТелефона, СтрокаПоиска) = 0 Тогда
				Продолжить;
            КонецЕсли;
			
			МассивВладельцев	=	СписокТелефонов.Получить(НомерТелефона);
			
			Если	МассивВладельцев	=	Неопределено	Тогда
			
				МассивВладельцев		=	Новый	Массив;
			
			КонецЕсли;
			
			Владелец =	Новый	Структура;
			Владелец.Вставить("ТипТелефона", Выборка.Вид);
			Владелец.Вставить("Ссылка", Выборка.Ссылка);
			Владелец.Вставить("ТипВладельца", Выборка.ТипВладельца);				
			МассивВладельцев.Добавить(Владелец);
					
			СписокТелефонов.Вставить(НомерТелефона, МассивВладельцев);
		
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат	СписокТелефонов;

КонецФункции

&НаСервере
Функция	ПолучитьМассивИзСтрокиТелефонов(Знач СтрокаТелефоны, МассивНомеровПредставление = Неопределено)
	УстановитьПривилегированныйРежим(Истина);

	СтрокаТелефоны	=	СтрЗаменить(СтрокаТелефоны, ".", ",");
	СтрокаТелефоны	=	СтрЗаменить(СтрокаТелефоны, ";", ",");
	
	
	МассивПодстрок	=	СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаТелефоны, ",");
	
	МассивНомеров				=	Новый	Массив;
	МассивНомеровПредставление	=	Новый	Массив;
	
	Для К = 0 По МассивПодстрок.Количество() - 1 Цикл
		
		ТекСтрокаИсходная		=	СокрЛП(МассивПодстрок[К]);
		
		ТекСтрокаТолькоЦифры	=	"";
		
		// (
		
		Для ТекНомерСимвола = 1 По СтрДлина(ТекСтрокаИсходная) Цикл
			
			ТекСимвол	=	Сред(ТекСтрокаИсходная, ТекНомерСимвола, 1);
		
			Если	Найти("0123456789", ТекСимвол) > 0	Тогда
			
				ТекСтрокаТолькоЦифры	=	ТекСтрокаТолькоЦифры	+	ТекСимвол;
			
			КонецЕсли;
		
		КонецЦикла;
		
		// )
		
		Если	НЕ ПустаяСтрока(ТекСтрокаТолькоЦифры)	Тогда
		
			МассивНомеров.Добавить(ТекСтрокаТолькоЦифры);
			МассивНомеровПредставление.Добавить(ТекСтрокаИсходная + "   |   " + ТекСтрокаТолькоЦифры + "");
		
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат	МассивНомеров;

КонецФункции


&НаКлиенте
Процедура ПриЗакрытии()
	
	Форма				=	ПолучитьФорму("ВнешняяОбработка.ПоискПоТелефону.Форма.ФормаОтзыва");
	
	Форма.Разработка	=	"ПоискПоТелефону";
	
	Форма.Открыть();

КонецПроцедуры

