#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура();
	СписокХО = Новый СписокЗначений;
	СписокХО.Добавить(ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.КорректировкаГрафикаОплатыПоставщику"));
	СписокХО.Добавить(ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.КорректировкаГрафикаПогашенияАвансаПоставщику"));
	Отбор = Новый Структура("ХозяйственнаяОперация", СписокХО);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ОткрытьФорму("Документ.КорректировкаГрафикаВзаиморасчетов.Форма.ФормаСпискаПоставщики", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий