
&НаСервере
Процедура ДокументПриИзмененииНаСервере()
попытка
СоздательКТ=Объект.ДокументКТ.Менеджер;
исключение
СоздательКТ=Объект.ДокументКТ.Ответственный;
конецпопытки;

если ЗначениеЗаполнено(СоздательКТ) тогда
Объект.СотрудникСоздатель=СоздательКТ;	
Объект.ПодразделениеСоздатель=СоздательКТ.Подразделение;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ФизическоеЛицо = &ФизическоеЛицо";
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", СоздательКТ.Подразделение.ТекущийРуководитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Инициатор=ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
конецесли;
попытка
Объект.НомерВходДокумента=Объект.ДокументКТ.НомерВходящегоДокумента;
исключение
Объект.НомерВходДокумента=Объект.ДокументКТ.Номер;
конецпопытки;
попытка
Объект.ДатаВходДокумента=Объект.ДокументКТ.ДатаВходящегоДокумента;
исключение
Объект.ДатаВходДокумента=Объект.ДокументКТ.Дата;
конецпопытки;

попытка
Объект.Контрагент=Объект.ДокументКТ.Контрагент;
исключение
конецпопытки;

КонецПроцедуры

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	ДокументПриИзмененииНаСервере();
КонецПроцедуры
