
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
// Процедура вызывает обработку заполнения документа по основанию.
//
Процедура ЗаполнитьПоДокументу()
	
	Документ = РеквизитФормыВЗначение("Объект");
	Документ.ОбработкаЗаполнения(Объект.ДокументОснование, );
	ЗначениеВРеквизитФормы(Документ, "Объект");
	Модифицированность = Истина;	
	
КонецПроцедуры // ЗаполнитьПоДокументу()

&НаСервере
Процедура ЗаполнитьПаспортныеДанныеНаСервере()
	Если ЗначениеЗаполнено(Объект.ФизЛицо) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументыФизическихЛицСрезПоследних.ВидДокумента,
		|	ДокументыФизическихЛицСрезПоследних.Серия,
		|	ДокументыФизическихЛицСрезПоследних.Номер,
		|	ДокументыФизическихЛицСрезПоследних.КемВыдан,
		|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи,
		|	ДокументыФизическихЛицСрезПоследних.Представление
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
		|			&ДатаСреза,
		|			Физлицо = &ФизЛицо
		|				И ВидДокумента.Наименование ПОДОБНО ""%паспорт%"") КАК ДокументыФизическихЛицСрезПоследних";
		Запрос.УстановитьПараметр("ДатаСреза", Объект.Дата);
		Запрос.УстановитьПараметр("ФизЛицо", Объект.ФизЛицо);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Объект.ПаспортСерия = СокрЛП(Выборка.Серия);
			Объект.ПаспортНомер = СокрЛП(Выборка.Номер);
			Объект.ПаспортВыдан = СокрЛП(Выборка.КемВыдан);
			Объект.ПаспортДатаВыдачи = Выборка.ДатаВыдачи;
			Объект.ПаспортныеДанные = СокрЛП(Выборка.Представление);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры//ЗаполнитьПаспортныеДанныеНаСервере()	

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 
	
КонецПроцедуры // ПриСозданииНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
// Процедура - обработчик нажатия на кнопку ЗаполнитьПоОснованию.
//
Процедура ЗаполнитьПоОснованию(Команда)
	
	Ответ = Вопрос(НСтр("ru = 'Документ будет полностью перезаполнен по ""Основанию""! Продолжить выполнение операции?'"), РежимДиалогаВопрос.ДаНет, 0);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоДокументу();		
	КонецЕсли;	

КонецПроцедуры  // ЗаполнитьВыполнить()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода Организация.
// В процедуре осуществляется очистка номера документа,
// а также производится установка параметров функциональных опций формы.
// Переопределяет соответствующий параметр формы.
//
Процедура ОрганизацияПриИзменении(Элемент)

	// Обработка события изменения организации.
	Объект.Номер = "";
		
КонецПроцедуры // ОрганизацияПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ввода ФизЛицо.
// В процедуре осуществляется заполнение паспортных данных
// физлица в надпись ПаспортныеДанные.
//
Процедура ФизЛицоПриИзменении(Элемент)
	
	ЗаполнитьПаспортныеДанныеНаСервере();
	
КонецПроцедуры


