Функция СведенияОВнешнейОбработке() Экспорт
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование", "Выручка и себестоимость по группам контрагентов");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Истина);
	РегистрационныеДанные.Вставить("Версия", "1.0");
	РегистрационныеДанные.Вставить("Вид", "ДополнительныйОтчет");
	РегистрационныеДанные.Вставить("Информация", "Выручка и себестоимость по группам контрагентов");
	
	///////////// команды /////////////////////////
	тзКоманд = Новый ТаблицаЗначений;
	тзКоманд.Колонки.Добавить("Идентификатор");
	тзКоманд.Колонки.Добавить("Представление");
	тзКоманд.Колонки.Добавить("Модификатор");
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	тзКоманд.Колонки.Добавить("Использование");
	
	
	строкаКоманды = тзКоманд.Добавить();
	строкаКоманды.Идентификатор = "ВыручкаИСебестоимостьПоГруппамКонтрагентов";
	строкаКоманды.Представление = "Выручка и себестоимость по группам контрагентов";
	строкаКоманды.ПоказыватьОповещение = Истина;
	строкаКоманды.Использование = "ОткрытиеФормы";
	РегистрационныеДанные.Вставить("Команды", тзКоманд);
	
	Возврат РегистрационныеДанные;
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    НастройкиКомпоновщика=КомпоновщикНастроек.ПолучитьНастройки();
    
    ТабСтрок=Новый ТаблицаЗначений();
    ТабСтрок.Колонки.Добавить("ПолеИстина",Новый ОписаниеТипов("Булево"));
    ТабСтрок.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
    ТабСтрок.Колонки.Добавить("Порядок",Новый ОписаниеТипов("Число"));
    ТабСтрок.Колонки.Добавить("Идн",Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
    
    ПараметрТипСуммы=НастройкиКомпоновщика.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипСуммы"));
	Если ПараметрТипСуммы.Значение>1 Тогда
		НоваяСтрока=ТабСтрок.Добавить();
		НоваяСтрока.ПолеИстина=Истина;
		НоваяСтрока.Наименование=?(ПараметрТипСуммы.Значение=2,"Объем продаж","Объем прибыли");
		НоваяСтрока.Порядок=0;
		НоваяСтрока.Идн="ОбъемПродаж";
		
		НоваяСтрока=ТабСтрок.Добавить();
		НоваяСтрока.ПолеИстина=Истина;
		НоваяСтрока.Наименование=?(ПараметрТипСуммы.Значение=2,"Процент от объема продаж","Процент от объема прибыли");
		НоваяСтрока.Порядок=1;
		НоваяСтрока.Идн="ОбъемПродажПроцент";
		
		НоваяСтрока=ТабСтрок.Добавить();
		НоваяСтрока.ПолеИстина=Истина;
		НоваяСтрока.Наименование=?(ПараметрТипСуммы.Значение=2,"Объем прибыли","Объем продаж");
		НоваяСтрока.Порядок=2;
		НоваяСтрока.Идн="ОбъемПрибыли";
		
		НоваяСтрока=ТабСтрок.Добавить();
		НоваяСтрока.ПолеИстина=Истина;
		НоваяСтрока.Наименование=?(ПараметрТипСуммы.Значение=2,"Процент от объема прибыли","Процент от объема продаж");
		НоваяСтрока.Порядок=3;
		НоваяСтрока.Идн="ОбъемПрибылиПроцент";
	Иначе
		НоваяСтрока=ТабСтрок.Добавить();
		НоваяСтрока.ПолеИстина=Истина;
		НоваяСтрока.Наименование=?(ПараметрТипСуммы.Значение=0,"Объем продаж","Объем прибыли");
		НоваяСтрока.Порядок=0;
		НоваяСтрока.Идн="ОбъемПродаж";
		
		НоваяСтрока=ТабСтрок.Добавить();
		НоваяСтрока.ПолеИстина=Истина;
		НоваяСтрока.Наименование=?(ПараметрТипСуммы.Значение=0,"Процент от объема продаж","Процент от прибыли");
		НоваяСтрока.Порядок=1;
		НоваяСтрока.Идн="ОбъемПродажПроцент";
	КонецЕсли;
    
    НоваяСтрока=ТабСтрок.Добавить();
    НоваяСтрока.ПолеИстина=Истина;
    НоваяСтрока.Наименование="Количество клиентов";
    НоваяСтрока.Порядок=4;
    НоваяСтрока.Идн="КоличествоКлиентов";
    
    НоваяСтрока=ТабСтрок.Добавить();
    НоваяСтрока.ПолеИстина=Истина;
    НоваяСтрока.Наименование="Процент от количества клиентов";
    НоваяСтрока.Порядок=5;
    НоваяСтрока.Идн="КоличествоКлиентовПроцент";
    
    НоваяСтрока=ТабСтрок.Добавить();
    НоваяСтрока.ПолеИстина=Истина;
    НоваяСтрока.Наименование="Средние продажи на клиента";
    НоваяСтрока.Порядок=6;
    НоваяСтрока.Идн="СредниеПродажи";
    
    НоваяСтрока=ТабСтрок.Добавить();
    НоваяСтрока.ПолеИстина=Истина;
    НоваяСтрока.Наименование="Количество заказов";
    НоваяСтрока.Порядок=7;
    НоваяСтрока.Идн="КоличествоЗаказов";
    
    НоваяСтрока=ТабСтрок.Добавить();
    НоваяСтрока.ПолеИстина=Истина;
    НоваяСтрока.Наименование="Процент от количества заказов";
    НоваяСтрока.Порядок=8;
    НоваяСтрока.Идн="КоличествоЗаказовПроцент";
    
    НоваяСтрока=ТабСтрок.Добавить();
    НоваяСтрока.ПолеИстина=Истина;
    НоваяСтрока.Наименование="Средние продажи на заказ";
    НоваяСтрока.Порядок=9;
    НоваяСтрока.Идн="СредниеПродажиНаЗаказ";
    
    
    
    СтандартнаяОбработка = Ложь; // Отключаем стандартную обработку 
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;      		
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;    	
	
	// Создаем макет компоновки данных
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	МакетКомпоновки = 
		КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновщика, ДанныеРасшифровки);
	
	// Инициализируем процессор компоновки
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, Новый Структура("ТабСтрок",ТабСтрок), ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	// Выводим результат отчета в табличный документ "ДокументРезультат"
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);		
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	//Поставим диаграммы в два столбца
	МасЗаголовков=Новый Массив();
	Для Каждого Стр из КомпоновщикНастроек.Настройки.Структура Цикл
        Если ТипЗнч(Стр)=Тип("ДиаграммаКомпоновкиДанных") Тогда
            МасЗаголовков.Добавить(Стр.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Заголовок")).Значение);
        КонецЕсли;
    КонецЦикла;
	
	Если ДокументРезультат.Рисунки.Количество()>0 Тогда
		ТекВерх=ДокументРезультат.Рисунки[0].Верх+20;
		Сч=0;
		МасРисунков=Новый Массив();
		Для Каждого Рис из ДокументРезультат.Рисунки Цикл
			МасРисунков.Добавить(Рис);
		КонецЦикла;
		Для Каждого Рис из МасРисунков Цикл
			Если ТипЗнч(Рис.Объект)=Тип("Диаграмма") Тогда
				Сч=Сч+1;
				Рис.Верх=ТекВерх;
				Если (Сч % 2)=0 Тогда
					Рис.Верх=ТекВерх;
					Рис.Лево=ДокументРезультат.Рисунки[Сч-2].Лево+ДокументРезультат.Рисунки[Сч-2].Ширина+10;
				КонецЕсли;
				НовыйРес=ДокументРезультат.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
				НовыйРес.Текст=МасЗаголовков[Сч-1];
				НовыйРес.Шрифт=Новый Шрифт(НовыйРес.Шрифт,,12,Истина);
				НовыйРес.Верх=ТекВерх-10;
				НовыйРес.Высота=10;
				НовыйРес.Ширина=Рис.Ширина;
				НовыйРес.Лево=Рис.Лево;
				НовыйРес.Линия=Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии,0);
				НовыйРес.ВертикальноеПоложение=ВертикальноеПоложение.Низ;
				НовыйРес.ГоризонтальноеПоложение=ГоризонтальноеПоложение.Центр;
				Если (Сч % 2)=0 Тогда
				 	ТекВерх=ТекВерх+Рис.Высота+10;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры