#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаСтатусов.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресВоВременномХранилище));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	Закрыть(АдресВоВременномХранилище());
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	ОтметитьЭлементыТаблицы(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	ОтметитьЭлементыТаблицы(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОтметитьЭлементыТаблицы(Пометка) 
	Для Каждого Строка Из ТаблицаСтатусов Цикл
		Строка.Пометка = Пометка;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция АдресВоВременномХранилище()
	Возврат ПоместитьВоВременноеХранилище(ТаблицаСтатусов.Выгрузить(), УникальныйИдентификатор)
КонецФункции

#КонецОбласти
