
&НаКлиенте
Процедура СнятьФлажки(Команда)
	ИзменитьФлагиНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	ИзменитьФлагиНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегистрацию(Команда)
	ВыполнитьДействиеНаСервере("ЗарегистрироватьВыбранные");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокДокументов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДокументов()
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Рег.Документ КАК Документ,
	|	Ложь КАК Пометка
	|ИЗ
	|	РегистрСведений.ЗарегистрированныеДокументыКПроверке КАК Рег
	|
	|УПОРЯДОЧИТЬ ПО
	|	Рег.Документ.Дата,
	|	Документ");
	ТаблицаРегистра.Загрузить(Запрос.Выполнить().Выгрузить()); 
	УстановитьПривилегированныйРежим(ЛОжь);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДействиеНаСервере(Действие)
	
	Узел = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятия30.НайтиПоКоду("002");
	ВыбранныеСтроки = ТаблицаРегистра.НайтиСтроки(Новый Структура("Пометка", Истина));
	Для Каждого ВыбраннаяСтрока из ВыбранныеСтроки цикл
		ТекущийДокумент=ВыбраннаяСтрока.Документ;
		
		Если  Действие="ЗарегистрироватьВыбранные" И Не Метаданные.ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятия30.Состав.Содержит(ТекущийДокумент.Метаданные()) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка документа "+Строка(ТекущийДокумент)+" в бухгалтерию не поддерживается.");	
			Продолжить;
		КонецЕсли;
		
		
		Если ТекущийДокумент<>Неопределено И Действие="ЗарегистрироватьВыбранные" Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(Узел, ТекущийДокумент);
		КонецЕсли;
		
		МенеджерЗаписиЗарегистрированныеДокументыКПроверке=РегистрыСведений.ЗарегистрированныеДокументыКПроверке.СоздатьМенеджерЗаписи();
		МенеджерЗаписиЗарегистрированныеДокументыКПроверке.Документ=ТекущийДокумент;
		МенеджерЗаписиЗарегистрированныеДокументыКПроверке.Удалить();
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Успешно обработан документ "+Строка(ТекущийДокумент)+".");
	КонецЦикла;
	
	ЗаполнитьСписокДокументов();
КонецПроцедуры

&НаСервере
Процедура ИзменитьФлагиНаСервере(ЗначениеФлага)
	ТЗ = ТаблицаРегистра.Выгрузить();
	ТЗ.ЗаполнитьЗначения(ЗначениеФлага, "Пометка");
	ТаблицаРегистра.Загрузить(ТЗ);
КонецПроцедуры




&НаКлиенте
Процедура УдалитьИзСпискаВыбранные(Команда)
	ВыполнитьДействиеНаСервере("УдалитьИзСпискаВыбранные");
КонецПроцедуры

