
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//ASP_Dante 09/09/19
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Форма =  ПараметрыВыполненияКоманды.Источник;
	Попытка
	Если Форма.Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствВКассуККМ")  Тогда
		ТорговыйОбъект = Форма.Объект.КассаККМ;
	ИначеЕсли Форма.Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту") Тогда
		ТорговыйОбъект = Форма.Объект.Касса;
	ИначеЕсли Форма.Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию") Тогда
		ТорговыйОбъект = Форма.Объект.Касса;
	Иначе
		ТорговыйОбъект = Неопределено;
	КонецЕсли;
	Исключение
		ТорговыйОбъект = Неопределено;
	КонецПопытки;
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ДокументСсылка",           Форма.Объект.Ссылка);
	ПараметрыОперации.Вставить("Партнер",                  Форма.Партнер);
	ПараметрыОперации.Вставить("Организация",              Форма.Объект.Организация);
	ПараметрыОперации.Вставить("ТорговыйОбъект",           ТорговыйОбъект);
	ПараметрыОперации.Вставить("ПодключенноеОборудование", Форма.ФискальнаяОперацияПодключенноеОборудование);
	ПараметрыОперации.Вставить("НаПринтер", Истина);
	ПараметрыОперации.Вставить("ASP_НаПринтер", Истина);	
	
	ПодключаемоеОборудованиеУТКлиент.ПробитьЧек(
	Форма,
	ПараметрыОперации,
	РежимЗаписиДокумента.Проведение,
	Новый ОписаниеОповещения("ФискальнаяОперацияЗавершение", Форма));
	//ASP_Dante 09/09/19
КонецПроцедуры
