
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ПараметрыПисьма = Новый Структура;
	Текст= "В 1С оформлена: "+  ПолучениеДанных(ПараметрКоманды,"ссылка") + Символы.ПС + Символы.ПС +
	"Клиент: " + ПолучениеДанных(ПараметрКоманды,"клиент") + Символы.ПС + Символы.ПС +
	"Заказ клиента: " + ПолучениеДанных(ПараметрКоманды,"заказклиента") + Символы.ПС + Символы.ПС +
	"Адрес объекта: " + ПолучениеДанных(ПараметрКоманды,"адрес") + Символы.ПС + Символы.ПС +
	"ФИО: " + ПолучениеДанных(ПараметрКоманды,"ФИО") + Символы.ПС + Символы.ПС + 
	"Телефон: " + ПолучениеДанных(ПараметрКоманды,"КонтактныйТелефон") + Символы.ПС + Символы.ПС +
	"Время работы: " + ПолучениеДанных(ПараметрКоманды,"ВремяРаботыОбъекта") + Символы.ПС + Символы.ПС +
	"Заявка на транспорт: " + ПолучениеДанных(ПараметрКоманды,"ЗаявкаНаТранспорт") + Символы.ПС + Символы.ПС +
	"Интервал доставки: " + ПолучениеДанных(ПараметрКоманды,"ИнтервалДоставки") + Символы.ПС + Символы.ПС +
	"Склад: " + ПолучениеДанных(ПараметрКоманды,"Склад") + Символы.ПС +  Символы.ПС +
	"Поставщик: " + ПолучениеДанных(ПараметрКоманды,"поставщик") + Символы.ПС + Символы.ПС +
	"Сумма услуги по заказу: " + ПолучениеДанных(ПараметрКоманды,"СуммаУслугиПоЗаказу") + Символы.ПС +  Символы.ПС +
	"Планируемая дата выполнения: " + ПолучениеДанных(ПараметрКоманды,"ПланируемаяДатаВыполнения") + Символы.ПС + Символы.ПС +
	"Услуга: " + ПолучениеДанных(ПараметрКоманды,"Услуга") + Символы.ПС + Символы.ПС +
	"Особенности монтажа: " +  ПолучениеТЧ(ПараметрКоманды) + Символы.ПС +    Символы.ПС +
	"Ответственный: " + ПолучениеДанных(ПараметрКоманды,"Ответственный") + Символы.ПС + Символы.ПС +
	"Менеджер: " + ПолучениеДанных(ПараметрКоманды,"Менеджер") + Символы.ПС +  Символы.ПС +
	"Комментарий: " + ПолучениеДанных(ПараметрКоманды,"Комментарий") + Символы.ПС ;
	//+ "Ответственный: " + ПолучениеДанных(ПараметрКоманды,"ответственный");
	ПараметрыПисьма.Вставить("УчетнаяЗапись", Неопределено);
	ПараметрыПисьма.Вставить("Получатель", ПолучитьПолучателей(ПараметрКоманды));
	//ПараметрыПисьма.Вставить("Получатель", "sborkapimenov@gortorgsnab.ru");
	ПараметрыПисьма.Вставить("Тема", ПолучениеДанных(ПараметрКоманды,"темаписьма"));
	ПараметрыПисьма.Вставить("Вложения", ПолучениеВложений(ПараметрКоманды));	
	ПараметрыПисьма.Вставить("Текст", Текст);
	//ПараметрыПисьма.Вставить("Вложения", СписокФайлов);
	//ПараметрыПисьма.Вставить("Предмет", ПараметрКоманды);
	
ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыПисьма, , , , , );	
	
	
КонецПроцедуры

Функция ПолучениеДанных(Документ,Параметр);
	Если параметр = "ссылка" тогда
		Возврат Документ.Ссылка;       
	ИначеЕсли параметр = "темаписьма" тогда
		Возврат (строка(формат(Документ.ПланируемаяДатаВыполнения,"ДЛФ=Д")) + ", " + строка(Документ.ЗаказКлиента.Партнер) + ", " + строка(Документ.ЗаказКлиента.Номер));
	ИначеЕсли параметр = "клиент" тогда
		Возврат Документ.ЗаказКлиента.Партнер;
	ИначеЕсли параметр = "заказклиента" тогда
		Возврат Документ.ЗаказКлиента;
	ИначеЕсли параметр = "адрес" тогда
		Возврат Документ.Адрес;
	ИначеЕсли параметр = "КонтактныйТелефон" тогда
		Возврат Документ.КонтактныйТелефон;
	ИначеЕсли параметр = "ФИО" тогда
		Возврат Документ.ФИО;      
	ИначеЕсли параметр = "ВремяРаботыОбъекта" тогда
		Возврат Документ.ВремяРаботыОбъекта;
	ИначеЕсли параметр = "ЗаявкаНаТранспорт" тогда
		Возврат Документ.ЗаявкаНаТранспорт;   
	ИначеЕсли параметр = "ИнтервалДоставки" тогда
		Возврат Документ.ИнтервалДоставки;
    ИначеЕсли параметр = "Склад" тогда
		Возврат Документ.ЗаявкаНаТранспорт.Склад;
	ИначеЕсли параметр = "поставщик" тогда
		Возврат Документ.партнер;
    ИначеЕсли параметр = "ПланируемаяДатаВыполнения" тогда
		Возврат формат(Документ.ПланируемаяДатаВыполнения,"ДЛФ=Д");
	ИначеЕсли параметр = "Услуга" тогда
		Возврат Документ.Услуга;
    ИначеЕсли параметр = "СуммаУслуги" тогда
		Возврат Документ.СуммаУслуги;
	ИначеЕсли параметр = "Ответственный" тогда
		Возврат Документ.Ответственный;
    ИначеЕсли параметр = "Менеджер" тогда
		Возврат Документ.Менеджер;
	ИначеЕсли параметр = "СуммаУслугиПоЗаказу" тогда
		Возврат Документ.СуммаУслугиПоЗаказу;
    ИначеЕсли параметр = "Комментарий" тогда
		Возврат Документ.комментарий;
    Иначе
	КонецЕсли;
	
КонецФункции         

Функция ПолучениеТЧ(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаУслугиОсобенностиМонтажа.ОсобенностиМонтажа КАК ОсобенностиМонтажа
	|ИЗ
	|	Документ.ЗаявкаНаУслуги.ОсобенностиМонтажа КАК ЗаявкаНаУслугиОсобенностиМонтажа
	|ГДЕ
	|	ЗаявкаНаУслугиОсобенностиМонтажа.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Документ);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Текст= "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Текст= Текст +", " +  ВыборкаДетальныеЗаписи.ОсобенностиМонтажа;
	КонецЦикла;
	
	
	Возврат Текст;
КонецФункции

Функция ПолучениеВложений(Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаУслугиПрисоединенныеФайлы.ПутьКФайлу КАК ПутьКФайлу,
	|	ЗаявкаНаУслугиПрисоединенныеФайлы.Ссылка КАК Ссылка,
	|	ЗаявкаНаУслугиПрисоединенныеФайлы.ФайлХранилище КАК ФайлХранилище,
	|	ЗаявкаНаУслугиПрисоединенныеФайлы.Том КАК Том,
	|	ЗаявкаНаУслугиПрисоединенныеФайлы.Наименование КАК Наименование,
	|	ЗаявкаНаУслугиПрисоединенныеФайлы.Расширение КАК Расширение
	|ИЗ
	|	Справочник.ЗаявкаНаУслугиПрисоединенныеФайлы КАК ЗаявкаНаУслугиПрисоединенныеФайлы
	|ГДЕ
	|	ЗаявкаНаУслугиПрисоединенныеФайлы.ВладелецФайла = &Документ";
	Запрос.УстановитьПараметр("Документ", Документ);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	СЗ = Новый СписокЗначений;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СЗ.Добавить(строка(ВыборкаДетальныеЗаписи.Том.ПолныйПутьWindows)+ВыборкаДетальныеЗаписи.ПутьКФайлу,ВыборкаДетальныеЗаписи.Наименование+"."+ВыборкаДетальныеЗаписи.Расширение);
	КонецЦикла;
	Возврат СЗ;
КонецФункции

Функция ПолучитьПолучателей(Документ)
	Если строка(Документ.Ответственный)="Борисов Александр Михайлович" Тогда Возврат "sborkaborisov@gortorgsnab.ru" + ";"+строка(УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(Документ.Менеджер, Справочники.ВидыКонтактнойИнформации.EmailПользователя));
	ИначеЕсли строка(Документ.Ответственный)="Пименов Антон Александрович" Тогда Возврат "sborkapimenov@gortorgsnab.ru" + ";"+строка(УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(Документ.Менеджер, Справочники.ВидыКонтактнойИнформации.EmailПользователя));
	Иначе Возврат "";	
	КонецЕсли
КонецФункции
