
&НаКлиенте
Процедура ОткрытьФайлДляПросмотра(Команда)
	
	АдресДоФайла = ФайлВФайлНаСервере();
	Если ЭтоАдресВременногоХранилища(АдресДоФайла) тогда
		ПолучитьФайл(АдресДоФайла,  Объект.Наименование + Объект.Расширение, Истина);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ФайлВФайлНаСервере()
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла() + Объект.Расширение;
	
	
	лКартинка = Справочники.Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.ПолучитьКартинкуПоПрикрепленномуФайлу(Объект.Ссылка);
	
	Если лКартинка <> Неопределено тогда
		
		лКартинка.Записать(ПутьКФайлу);
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
		
		Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИзФайлаНаДиске(Команда)
		
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = НСтр("ru = 'Укажите файл/картинку'");
	
	ОбработкаОкончанияЗагрузки = Новый ОписаниеОповещения("ОбновитьИзФайлаНаДискеЗавершениеЗагрузки", ЭтотОбъект, Диалог); 
	НачатьПомещениеФайла(ОбработкаОкончанияЗагрузки, , Диалог, Истина, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзФайлаНаДискеЗавершениеЗагрузки(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		
		ИмяФайла = Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьАдресВременногоФайлаСервер(Адрес, ВыбранноеИмяФайла); 
		 
		ОбновитьИзФайлаНаДискеЗавершениеЗагрузкиСервер(ИмяФайла);

	Иначе
		Сообщить("Файл не был указан.");
	КонецЕсли 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИзФайлаНаДискеЗавершениеЗагрузкиСервер(ИмяФайла) 
	
	лФайл = Новый Файл(ИмяФайла);
	
	Объект.ПутьКФайлу 	= ИмяФайла;
	Объект.Расширение 	= лФайл.Расширение;
	Объект.Размер 		= "0";
	Объект.Наименование = лФайл.Имя;
	
	ПараметрыФайла = Новый Структура;
	ПараметрыФайла.Вставить("ПрисоединенныйФайл", Объект.Ссылка);	
	ПараметрыФайла.Вставить("Картинка", ПоместитьВоВременноеХранилище(Новый Картинка(ИмяФайла), УникальныйИдентификатор));
	
	ЗаписатьПрисоединенныйФайл(ПараметрыФайла);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПрисоединенныйФайл(ПараметрыФайла)
	
	Справочники.Б_ХарактеристикиНоменклатурыПрисоединенныеФайлы.ЗаписатьПрисоединенныйФайл(ПараметрыФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура Основная(Команда)
	Объект.Основная = НЕ Объект.Основная;
	Элементы.ФормаОсновная.Пометка = Объект.Основная;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ФормаОсновная.Пометка = Объект.Основная;
КонецПроцедуры


