////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции, используемые в документе ПрочееОприходованиеТоваров.
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ОбработкаВыбора(Форма, ВыбранноеЗначение, ИсточникВыбора) Экспорт

	ТребуетсяВызовСервера = Ложь;
	
	//++ Локализация
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.ПартииТМЦВЭксплуатации.Форма.ФормаПодбора" Тогда
		
		Если ВыбранноеЗначение.Количество() > 0 Тогда
			ТребуетсяВызовСервера = Истина;
		КонецЕсли;
		
	КонецЕсли;	
	
	//-- Локализация
	
	Возврат ТребуетсяВызовСервера;
	
КонецФункции

Процедура ТоварыПартияПриИзменении(Форма) Экспорт
	
	//++ Локализация

	
	Возврат; // в УТ обработчик пустой
	
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриВыполненииКоманды(Команда, Форма) Экспорт

	
	//++ Локализация
	
	Элементы = Форма.Элементы;
	
	
	//-- Локализация
	
КонецПроцедуры

//++ Локализация


//-- Локализация

#КонецОбласти
