
&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	Если Параметры.Свойство("Расшифровка") и Параметры.Расшифровка <> Неопределено тогда 
		Если Параметры.Свойство("НастройкаДляРасшифровкиЭтапа") и Параметры.НастройкаДляРасшифровкиЭтапа <> Неопределено тогда 
			НастройкаРасшифровки = Параметры.НастройкаДляРасшифровкиЭтапа.ПолучитьНастройки();
		Иначе
			НастройкаРасшифровки = Параметры.Расшифровка.ПрименяемыеНастройки;
		КонецЕсли;
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкаРасшифровки);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	ВариантыОтчетов.ПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
КонецПроцедуры
