
&Вместо("ПровестиДокументы")
Функция Расш1_ПровестиДокументы(Документы) Экспорт
	
	НепроведенныеДокументы = Новый Массив;
	
	Для Каждого ДокументСсылка Из Документы Цикл
		//+++ {{ ASP 10.09.2020 000008403 }}
		ДополнительныеСвойства = Неопределено;
		Если ТипЗнч(ДокументСсылка) = Тип("Структура") Тогда
			ДополнительныеСвойства = ДокументСсылка.ДополнительныеСвойства;
			ДокументСсылка = ДокументСсылка.Ссылка;
		КонецЕсли;
		//+++ {{ ASP 10.09.2020 000008403 }}
		
		ВыполненоУспешно = Ложь;
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		Если ДокументОбъект.ПроверитьЗаполнение() Тогда
			//+++ {{ ASP 10.09.2020 000008403 }}
			Если ДополнительныеСвойства <> Неопределено Тогда
				Для Каждого КлючИЗначение Из ДополнительныеСвойства Цикл
					ДокументОбъект.ДополнительныеСвойства.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
				КонецЦикла;
			КонецЕсли;
			//--- {{ ASP 10.09.2020 000008403 }}
			РежимПроведения = РежимПроведенияДокумента.Неоперативный;
			Если ДокументОбъект.Дата >= НачалоДня(ТекущаяДатаСеанса())
				И ДокументСсылка.Метаданные().ОперативноеПроведение = Метаданные.СвойстваОбъектов.ОперативноеПроведение.Разрешить Тогда
					РежимПроведения = РежимПроведенияДокумента.Оперативный;
			КонецЕсли;
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведения);
				ВыполненоУспешно = Истина;
			Исключение
				ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
		Иначе
			ПредставлениеОшибки = НСтр("ru = 'Поля документа не заполнены.'");
		КонецЕсли;
		
		Если Не ВыполненоУспешно Тогда
			НепроведенныеДокументы.Добавить(Новый Структура("Ссылка,ОписаниеОшибки", ДокументСсылка, ПредставлениеОшибки));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НепроведенныеДокументы;
	
КонецФункции 
