Функция СведенияОВнешнейОбработке() Экспорт

	СведенияОбОбработке = Новый Структура;
	СведенияОбОбработке.Вставить("Вид", "ДополнительныйОтчет");
	//СведенияОбОбработке.Вставить("Вид", "Отчет");
	СведенияОбОбработке.Вставить("Наименование ", "Отчет по продажам по периодам");
	//ОбъектыМетаданных = Новый Массив;
	//ОбъектыМетаданных.Добавить("Документ.СчетНаОплатуКлиенту");
	//СведенияОбОбработке.Вставить("Назначение", ОбъектыМетаданных);
	СведенияОбОбработке.Вставить("Версия ", "1.0");
	СведенияОбОбработке.Вставить("БезопасныйРежим", Истина);
	СведенияОбОбработке.Вставить("Информация", "Отчет по продажам по периодам");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	ДобавитьКоманду(ТаблицаКоманд, "Отчет по продажам по периодам", "ID", "ОткрытиеФормы", Истина);
	//ДобавитьКоманду(ТаблицаКоманд, ".....", "ID", "ВызовКлиентскогоМетода", Истина);
	СведенияОбОбработке.Вставить("Команды", ТаблицаКоманд);
	
	Возврат СведенияОбОбработке;
	
КонецФункции // СведенияОВнешнейОбработке()

Функция ПолучитьТаблицуКоманд()

	ТаблицаКоманд = Новый ТаблицаЗначений;
	ТаблицаКоманд.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	ТаблицаКоманд.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));

	Возврат ТаблицаКоманд;

КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")

	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
  
КонецПроцедуры

