
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ЗаказКлиента") Тогда	
	Партнер =  ПолучитьПартнер(ПараметрКоманды);
	ПараметрыФормы = Новый Структура("Клиент",Партнер);
	ОткрытьФорму("ОбщаяФорма.ПростыеЗвонки_ЗвонокКлиенту", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	Иначе
	ПараметрыФормы = Новый Структура("Клиент",ПараметрКоманды);
	ОткрытьФорму("ОбщаяФорма.ПростыеЗвонки_ЗвонокКлиенту", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция ПолучитьПартнер(Ссылка)
Возврат Ссылка.Партнер;
КонецФункции