#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ.ПериодЗадания) Тогда
		Запись.ПериодЗадания = НачалоМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодЗаданияПриИзменении(Элемент)
	
	Запись.ПериодЗадания = НачалоМесяца(Запись.ПериодЗадания);

КонецПроцедуры

#КонецОбласти

