
&После("ПередЗаписью")
Процедура асп_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//ТаблицаРеестрДокументов	= новый ТаблицаЗначений;
	//ТаблицаРеестрДокументов.Колонки.Добавить("Ссылка", новый ОписаниеТипов("ДокументССылка.ТранспортнаяНакладная, Null"));
	//ТаблицаРеестрДокументов.Колонки.Добавить("ДатаДокументаИБ", новый ОписаниеТипов("Дата, Null"));
	//ТаблицаРеестрДокументов.Колонки.Добавить("НомерДокументаИБ", новый ОписаниеТипов("Строка, Null"));
	//ТаблицаРеестрДокументов.Колонки.Добавить("ТипСсылки", новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных, Null"));
	//ТаблицаРеестрДокументов.Колонки.Добавить("Организация", новый ОписаниеТипов("СправочникСсылка.Организации, Null"));
	//ТаблицаРеестрДокументов.Колонки.Добавить("Проведен", новый ОписаниеТипов("Булево, Null"));
	//ТаблицаРеестрДокументов.Колонки.Добавить("ПометкаУдаления", новый ОписаниеТипов("Булево, Null"));
	//Стр = ТаблицаРеестрДокументов.Добавить();
	//Стр.Ссылка = Ссылка;
	//Стр.ДатаДокументаИБ = Дата;
	//Стр.НомерДокументаИБ = Номер;
	//Стр.ТипСсылки = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию("Транспортная Накладная");
	//Стр.Организация = Организация;
	//Стр.Проведен = Проведен;
	//Стр.ПометкаУдаления = ПометкаУдаления;
	//Если ДополнительныеСвойства.Свойство("ТаблицыДляДвижений") Тогда
	//	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеестрДокументов", ТаблицаРеестрДокументов);
	//Иначе
	//	ТаблицыДляДвижений = новый Структура;
	//	ТаблицыДляДвижений.Вставить("ТаблицаРеестрДокументов", ТаблицаРеестрДокументов);
	//	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", ТаблицыДляДвижений);	
	//КонецЕсли;
	//
	//РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
КонецПроцедуры

&После("ПриЗаписи")
Процедура асп_ПриЗаписи(Отказ)
	ТаблицаРеестрДокументов	= новый ТаблицаЗначений;
	ТаблицаРеестрДокументов.Колонки.Добавить("Ссылка", новый ОписаниеТипов("ДокументССылка.ТранспортнаяНакладная, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("ДатаДокументаИБ", новый ОписаниеТипов("Дата, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("НомерДокументаИБ", новый ОписаниеТипов("Строка, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("ТипСсылки", новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("Организация", новый ОписаниеТипов("СправочникСсылка.Организации, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("Проведен", новый ОписаниеТипов("Булево, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("ПометкаУдаления", новый ОписаниеТипов("Булево, Null"));
	
	ТаблицаРеестрДокументов.Колонки.Добавить("Ответственный", новый ОписаниеТипов("СправочникСсылка.Пользователи, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("Подразделение", новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("Контрагент", новый ОписаниеТипов("СправочникСсылка.Контрагенты, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("Партнер", новый ОписаниеТипов("СправочникСсылка.Партнеры, Null"));
	
	Стр = ТаблицаРеестрДокументов.Добавить();
	Стр.Ссылка = Ссылка;
	Стр.ДатаДокументаИБ = Дата;
	Стр.НомерДокументаИБ = Номер;
	Стр.ТипСсылки = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию("Транспортная Накладная");
	Стр.Организация = Организация;
	Стр.Проведен = Проведен;
	Стр.ПометкаУдаления = ПометкаУдаления;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|Пользователи.Ссылка КАК Ответственный,
	|Пользователи.Подразделение КАК Подразделение
	|ИЗ
	|Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|НЕ Пользователи.ПометкаУдаления
	|И Пользователи.ФизическоеЛицо = &ФизическоеЛицо
	|УПОРЯДОЧИТЬ ПО
	|Пользователи.Недействителен УБЫВ";
	Запрос.УстановитьПараметр("ФизическоеЛицо", Отпустил);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Стр.Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
		Стр.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
	Иначе
		Стр.Ответственный = Справочники.Пользователи.ПустаяСсылка();
		Стр.Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Грузополучатель) и ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.Контрагенты")  Тогда
		Стр.Контрагент = Грузополучатель;
		Стр.Партнер = Грузополучатель.Партнер;
	Иначе
		Стр.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		Стр.Партнер = Справочники.Партнеры.ПустаяСсылка();
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицыДляДвижений") Тогда
		ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеестрДокументов", ТаблицаРеестрДокументов);
	Иначе
		ТаблицыДляДвижений = новый Структура;
		ТаблицыДляДвижений.Вставить("ТаблицаРеестрДокументов", ТаблицаРеестрДокументов);
		ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", ТаблицыДляДвижений);	
	КонецЕсли;
	
	РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
КонецПроцедуры


#Область Прочее

Процедура ДокументыОснованияИмеютВерныйСпособДоставки(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Шапка.Ссылка КАК Ссылка,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Шапка.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоСпособовДоставкиБезИспользованияЗаданияНаПеревозку,
	|	СУММА(ВЫБОР
	|			КОГДА Шапка.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоСпособовДоставкиСИспользованиемЗаданияНаПеревозку,
	|	ИСТИНА КАК МожетИспользоватьсяДоставка
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&МассивСсылок)
	|
	|СГРУППИРОВАТЬ ПО
	|	Шапка.Ссылка
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Шапка.Ссылка,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Шапка.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА Шапка.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ИСТИНА
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&МассивСсылок)
	|	И НЕ Шапка.РеализацияПоЗаказам
	|
	|СГРУППИРОВАТЬ ПО
	|	Шапка.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументТовары.Ссылка,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ДокументТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ДокументТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ИСТИНА
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивСсылок)
	|	И ДокументТовары.Ссылка.РеализацияПоЗаказам
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументТовары.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Шапка.Ссылка,
	|	1,
	|	0,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Шапка.Ссылка,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Шапка.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА Шапка.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ИСТИНА
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&МассивСсылок)
	|	И НЕ Шапка.ПеремещениеПоЗаказам
	|
	|СГРУППИРОВАТЬ ПО
	|	Шапка.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументТовары.Ссылка,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ДокументТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ДокументТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ИСТИНА
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивСсылок)
	|	И ДокументТовары.Ссылка.ПеремещениеПоЗаказам
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументТовары.Ссылка";
	
	ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками = 
		ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками");
	СпособыДоставкиСНашимУчастием = ДоставкаТоваровКлиентСервер.СпособыДоставкиДоКлиентаСНашимУчастием(
										ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками);
	
	Запрос.УстановитьПараметр("МассивСсылок", ДокументыОснования.ВыгрузитьКолонку("ДокументОснование"));
	Запрос.УстановитьПараметр("СпособыДоставкиСНашимУчастием", СпособыДоставкиСНашимУчастием);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗаданиеНаПеревозкуЗаполнено = ЗначениеЗаполнено(ЗаданиеНаПеревозку);
	
	ШаблонСообщенияСДоставкой = НСтр("ru = 'По документу ""%Документ%"" не предусмотрена доставка, поэтому данный документ не может являться основанием транспортной накладной, связанной с заданием на перевозку.'");
	ШаблонСообщенияБезДоставки = НСтр("ru = 'По документу ""%Документ%"" предусмотрена доставка, поэтому данный документ не может являться основанием транспортной накладной, не связанной с заданием на перевозку.'");
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		ТекстСообщения = "";
		
		Если (РезультатЗапроса.КоличествоСпособовДоставкиСИспользованиемЗаданияНаПеревозку = 0)
			И ЗаданиеНаПеревозкуЗаполнено Тогда
			ТекстСообщения = ШаблонСообщенияСДоставкой;
		ИначеЕсли (РезультатЗапроса.КоличествоСпособовДоставкиБезИспользованияЗаданияНаПеревозку = 0)
			И НЕ ЗаданиеНаПеревозкуЗаполнено Тогда
			ТекстСообщения = ШаблонСообщенияБезДоставки;
		КонецЕсли;
		
		Если Не ПустаяСтрока(ТекстСообщения) Тогда
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", РезультатЗапроса.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, РезультатЗапроса.Ссылка,,,Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДокументыОснованияИмеютНоменклатуруТипаТовар(Отказ)
	
	МассивВсехРаспоряжений = ДокументыОснования.ВыгрузитьКолонку("ДокументОснование");
	МассивРаспоряженийСТоварами = Документы.ТранспортнаяНакладная.ПолучитьТолькоДокументыОснованияСТоварами(МассивВсехРаспоряжений, Отказ);
		
КонецПроцедуры

Процедура ЗаполнитьДанныеВыбора(Элемент)
	Водитель = Элемент.Владелец;
	АвтомобильГосударственныйНомер = Элемент.АвтомобильНомер;
	АвтомобильМарка = Элемент.АвтомобильМарка;
	Перевозчик = Элемент.Контрагент;
	УдостоверениеСерия = Элемент.УдостоверениеСерия;
	УдостоверениеНомер = Элемент.УдостоверениеНомер;
	ВидПеревозки = "Грузовая";
	БанковскийСчетПеревозчика = Элемент.БанковскийСчетКонтрагента;
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура асп_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ДанныеЗаполнения <> Неопределено Тогда

		ДокументыОснованияМассив = Новый Массив;

		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
			ДокументыОснованияМассив.Добавить(ДанныеЗаполнения.ДокументОснование);
		Иначе
			ДокументыОснованияМассив.Добавить(ДанныеЗаполнения);
		КонецЕсли;

		Документы.ТранспортнаяНакладная.СоздатьТранспортныеНакладные(ДокументыОснованияМассив,,ЭтотОбъект);

	КонецЕсли;

	ИнициализироватьДокумент(ДанныеЗаполнения);
#Вставка

	//ГТС Начало заполнения водителя
	ЕСЛИ НЕ ЗначениеЗаполнено(Водитель) ТОГДА
		Для каждого СтрокаТЧ ИЗ ДокументыОснования
			Цикл
			Если ТипЗнч(СтрокаТЧ.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") И 
				СтрокаТЧ.ДокументОснование.ЗаявкаНаТранспорт <> Документы.ЗаявкаНаТранспорт.ПустаяСсылка()
				Тогда

				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ВодителиГТС.Ссылка,
				|	ВодителиГТС.Владелец
				|ИЗ
				|	Справочник.ВодителиГТС КАК ВодителиГТС
				|ГДЕ
				|	ВодителиГТС.Владелец = &Владелец И НЕ ПометкаУдаления";
				Запрос.УстановитьПараметр("Владелец", СтрокаТЧ.ДокументОснование.ЗаявкаНаТранспорт.Водитель);
				РезультатЗапроса = Запрос.Выполнить();

				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Сч=0;
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Сч=1;
					ЗаполнитьДанныеВыбора(ВыборкаДетальныеЗаписи.Ссылка);
				КонецЦикла;
				Если Сч>0 Тогда
					АдресДоставки = СтрокаТЧ.ДокументОснование.ЗаявкаНаТранспорт.Город + ", " + СтрокаТЧ.ДокументОснование.ЗаявкаНаТранспорт.АдресДоставки;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//ГТС конец заполнения водителя

#КонецВставки
КонецПроцедуры


#КонецОбласти
