
&ИзменениеИКонтроль("ЗаполнитьДокументНаОснованииПриобретенияТоваров")
Процедура асп_ЗаполнитьДокументНаОснованииПриобретенияТоваров(Знач ДокументОснование, Знач СкладПоступления, Знач ХозяйственнаяОперацияПриемки, Знач ЗаполнятьПоНакладной)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ТекстЗапросаЗаполненияНаОсновании(Ложь);
	
	Запрос.УстановитьПараметр("ДокументОснование",		ДокументОснование);
	Запрос.УстановитьПараметр("СкладПоступления",		СкладПоступления);
	Запрос.УстановитьПараметр("СкладУказан",			ЗначениеЗаполнено(СкладПоступления));
	Запрос.УстановитьПараметр("ЗаполнятьПоНакладной",	ЗаполнятьПоНакладной = Истина);
	
	РезультатЗапроса	= Запрос.ВыполнитьПакет();
	Выборка				= РезультатЗапроса[5].Выбрать();
	ТЗТовары			= РезультатЗапроса[6].Выгрузить();
	ТЗУпаковки			= РезультатЗапроса[7].Выгрузить();
	
    #Вставка
	//++ASP_СмирновН 17.04.25 000026764
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") тогда
		Если ТЗТовары.Количество() = 0 Тогда
			Для каждого СтрТЧДО из ДокументОснование.Товары Цикл
				НовСтрТЧ = ЭтотОбъект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтрТЧ,СтрТЧДО);
				НовСтрТЧ.Цена = СтрТЧДО.Цена;
				НовСтрТЧ.Сумма = СтрТЧДО.Сумма;
				НовСтрТЧ.СтавкаНДС = СтрТЧДО.СтавкаНДС;
				НовСтрТЧ.СуммаСНДС = СтрТЧДО.СуммаСНДС;
				НовСтрТЧ.АналитикаУчетаНоменклатуры = СтрТЧДО.АналитикаУчетаНоменклатуры; 
				НовСтрТЧ.КодСтроки = СтрТЧДО.КодСтроки;
			КонецЦикла; 
			Если ЭтотОбъект.ВидыЗапасов.Количество() = 0 Тогда
				Для Каждого СтрТЧДОВЗ из ДокументОснование.ВидыЗапасов Цикл
					НовСТРТЧВЗ = ЭтотОбъект.ВидыЗапасов.Добавить();
					ЗаполнитьЗначенияСвойств(НовСТРТЧВЗ,СтрТЧДОВЗ);
				КонецЦикла;
			КонецЕсли;	 
		КонецЕсли;
	КонецЕсли;
	//--ASP_СмирновН 17.04.25 000026764
	#КонецВставки
	Выборка.Следующий();
	
	ОбщегоНазначенияУТ.ПроверитьВозможностьВводаНаОсновании(ДокументОснование,
															Неопределено,
															Выборка.ЕстьОшибкиПроведен,
															Выборка.ЕстьОшибкиСтатус);
	
	Распоряжение	= ДокументОснование;
	Склад			= СкладПоступления;
	
	ПарыОперацийРаздельнойЗакупки = ЗакупкиСервер.ПарыОперацийРаздельнойЗакупки(Истина);
	ХозяйственнаяОперацияПриемкиФактическоеПоступление = ПарыОперацийРаздельнойЗакупки.Получить(ХозяйственнаяОперацияПриемки);
	ХозяйственнаяОперацияПриемкиФактическоеПоступление = ?(Не ЗначениеЗаполнено(ХозяйственнаяОперацияПриемкиФактическоеПоступление),
															ХозяйственнаяОперацияПриемки,
															ХозяйственнаяОперацияПриемкиФактическоеПоступление);
	
	ХозяйственнаяОперация = ХозяйственнаяОперацияПриемкиФактическоеПоступление;
	
	ЭтоТоварыВПути = Документы.ПоступлениеТоваровНаСклад.ЭтоПоступлениеИзТоваровВПути(ХозяйственнаяОперация);
	ИсключаемыеСвойства = ?(ЭтоТоварыВПути, "ВидДеятельностиНДС", "");
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, , ИсключаемыеСвойства);
	ЗаполнитьУпаковкиЦены(ТЗТовары, ТЗУпаковки);
	ПересчитатьКоличествоУпаковокЗаполнитьСтавкуНДС();
	ЗаполнитьЦеныПоСоглашению(Ложь);
	
КонецПроцедуры
