
&ИзменениеИКонтроль("ЗаполнитьНомера")
Процедура асп_ЗаполнитьНомера(Объект, ВидыЗапасов, ИмяТЧ, ИмяРеквизита)
	//++ Локализация
	// Создаем новые номера
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыЗапасов.НомерСтроки КАК НомерСтроки,
	|	ВидыЗапасов.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВидыЗапасов.НомерГТД КАК РНПТ,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНомеровГТД.НомерРНПТ) КАК ТипНомераГТД
	#Вставка
	//ASP_Dante 23/07/21 Доработка логики заполнения владельца ГТД
	|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура Как Владелец,
	//ASP_Dante 23/07/21
	#КонецВставки
	|ПОМЕСТИТЬ ВидыЗапасов
	|ИЗ
	|	&ТаблицаВидыЗапасов КАК ВидыЗапасов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РНПТ,
	|	СтранаПроисхождения,
	|	ТипНомераГТД";
	
	Запрос.УстановитьПараметр("ТаблицаВидыЗапасов", ВидыЗапасов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&РегистрационныйНомер			КАК Код,
	|	&РегистрационныйНомер			КАК РегистрационныйНомер,
	|	ВидыЗапасов.СтранаПроисхождения	КАК СтранаПроисхождения,
	|	ВидыЗапасов.ТипНомераГТД		КАК ТипНомераГТД
	#Вставка
	//ASP_Dante 23/07/21 Доработка логики заполнения владельца ГТД
	|	,ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура Как Владелец,
	//ASP_Dante 23/07/21
	#КонецВставки
	|ИЗ
	|	ВидыЗапасов КАК ВидыЗапасов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК УказанныеРНПТ
	|		ПО УказанныеРНПТ.Ссылка = ВидыЗапасов.РНПТ
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК ПодобранныеРНПТ
	|		ПО ПодобранныеРНПТ.СтранаПроисхождения = ВидыЗапасов.СтранаПроисхождения
	|			И ПодобранныеРНПТ.РегистрационныйНомер = &РегистрационныйНомер
	|			И НЕ ПодобранныеРНПТ.ПометкаУдаления
	|			И ПодобранныеРНПТ.ТипНомераГТД = ВидыЗапасов.ТипНомераГТД
	|
	|ГДЕ
	|	УказанныеРНПТ.Ссылка ЕСТЬ NULL
	|	И ПодобранныеРНПТ.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("РегистрационныйНомер", Объект.РНПТ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НомерГТД = Справочники.НомераГТД.СоздатьЭлемент();
		ЗаполнитьЗначенияСвойств(НомерГТД, Выборка);
		НомерГТД.Записать();
	КонецЦикла;
	
	// Подбираем номера РНПТ в виды запасов.
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВидыЗапасов.НомерСтроки,
	|	ВидыЗапасов.СтранаПроисхождения,
	|	ПодобранныеРНПТ.Ссылка КАК РНПТ
	|ИЗ
	|	ВидыЗапасов КАК ВидыЗапасов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК УказанныеРНПТ
	|		ПО УказанныеРНПТ.Ссылка = ВидыЗапасов.РНПТ
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК ПодобранныеРНПТ
	|		ПО ПодобранныеРНПТ.СтранаПроисхождения = ВидыЗапасов.СтранаПроисхождения
	|			И НЕ ПодобранныеРНПТ.ПометкаУдаления
	|			И ПодобранныеРНПТ.РегистрационныйНомер = &РегистрационныйНомер
	|			И ПодобранныеРНПТ.ТипНомераГТД = ВидыЗапасов.ТипНомераГТД
	|
	|ГДЕ
	|	УказанныеРНПТ.Ссылка ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыЗапасов.НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		// слияние упорядоченных массивов, |Выборки| <= |ВидыЗапасов|
		Для Каждого Стр Из Объект[ИмяТЧ] Цикл
			Если ЗначениеЗаполнено(Стр[ИмяРеквизита]) Или Стр.НомерСтроки < Выборка.НомерСтроки Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Выборка.РНПТ) Тогда
				ВызватьИсключение НСтр("ru='Обнаружены проблемы в подборе номеров РНПТ.'");
			КонецЕсли;
			
			Стр[ИмяРеквизита] = Выборка.РНПТ;

			Если Не Выборка.Следующий() Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//-- Локализация
КонецПроцедуры
