
&ИзменениеИКонтроль("ПартнерФормаЭлементаНастроитьПанельНавигации")
Процедура асп_ПартнерФормаЭлементаНастроитьПанельНавигации(Форма)

	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ИспользоватьДанныеПартнераКлиента", Форма.Объект.Клиент);
	СтруктураНастроек.Вставить("ИспользоватьДанныеПартнераПоставщика", Форма.Объект.Поставщик);
	СтруктураНастроек.Вставить("ИспользоватьДанныеТорговогоПредставителя", Форма.Объект.ОбслуживаетсяТорговымиПредставителями);
	СтруктураНастроек.Вставить("ИспользоватьДанныеПоставщикаИлиКонкурента", Форма.Объект.Поставщик ИЛИ Форма.Объект.Конкурент);
	#Вставка
	СтруктураНастроек.ИспользоватьДанныеПоставщикаИлиКонкурента = Форма.Объект.Поставщик ИЛИ Форма.Объект.Конкурент ИЛИ Форма.Объект.Клиент; 
	#КонецВставки
	СтруктураНастроек.Вставить("ИспользоватьДанныеКонтрагентаФизическогоЛица", ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов")
	                                                                           И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ЮрФизЛицо")
	                                                                           И (Форма.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Или Форма.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель));
	СтруктураНастроек.Вставить("ИспользоватьДанныеПартнераСоглашенияСКлиентами", Форма.Объект.Клиент 
	                                                                             И ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"));
	СтруктураНастроек.Вставить("ИспользоватьДанныеПартнераСделкиСКлиентами",   Форма.Объект.Клиент 
	                                                                             И ПолучитьФункциональнуюОпцию("ИспользоватьСделкиСКлиентами"));
	СтруктураНастроек.Вставить("ИспользоватьДоговорыКредитовИДепозитов", Форма.Объект.ПрочиеОтношения И ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыКредитовИДепозитов"));
	
	ОбщегоНазначенияУТ.НастроитьФормуПоПараметрам(Форма, СтруктураНастроек);

КонецПроцедуры
