
Процедура НакоплениеПриобретенногоТовараВЗаказахНаПеремещение(ПриобретениеТоваровУслуг, АдресРезультата) Экспорт
	
	Результат = Новый Структура("ДозаполненныеДокументы, СозданныеДокументы, Ошибки", Новый Массив, Новый Массив, Новый Массив);
	
	ПроизвестиНакоплениеПриобретенногоТовараВЗаказахНаПеремещение(ПриобретениеТоваровУслуг, Результат);
	
	ВозвращаемыйРезультат = Новый Структура;
	ИмяУведомления = "";
	Если Результат.Ошибки.Количество() = 1 Тогда
		ЕдинственнаяОшибка = Результат.Ошибки[0];
		Если ЕдинственнаяОшибка = "УжеСозданНаОснованииЗаказНаПеремещение"
		 Или ЕдинственнаяОшибка = "НетЗаказовПоставщикам" Тогда
			ИмяУведомления = ЕдинственнаяОшибка;
		КонецЕсли;
	ИначеЕсли Результат.ДозаполненныеДокументы.Количество() = 0
	 И Результат.СозданныеДокументы.Количество() = 0
	 И Результат.Ошибки.Количество() = 0 Тогда
		ИмяУведомления = "ПроверкаВыполнена";
	КонецЕсли;
	
	Если Не ПустаяСтрока(ИмяУведомления) Тогда
		ВозвращаемыйРезультат.Вставить("ИмяУведомления", ИмяУведомления);
		ПоместитьВоВременноеХранилище(ВозвращаемыйРезультат, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	
	ОбъектСДанными = Новый ТаблицаЗначений;
	ОбъектСДанными.Колонки.Добавить("Текст");
	ОбъектСДанными.Колонки.Добавить("Документ");
	ОбъектСДанными.Колонки.Добавить("Раздел");
	
	ПоказыватьРазделДозаполненныеДокументы = Ложь;
	Если Результат.ДозаполненныеДокументы.Количество() > 0 Тогда
		ПоказыватьРазделДозаполненныеДокументы = Истина;
		
		Для Каждого ДозаполненныйДокумент Из Результат.ДозаполненныеДокументы Цикл
			СтрокаТаблДокумента = ОбъектСДанными.Добавить();
			СтрокаТаблДокумента.Документ = ДозаполненныйДокумент;
			СтрокаТаблДокумента.Раздел = "ДозаполненныеДокументы";
		КонецЦикла;
	КонецЕсли;
	
	ПоказыватьРазделСозданныеДокументы = Ложь;
	Если Результат.СозданныеДокументы.Количество() > 0 Тогда
		ПоказыватьРазделСозданныеДокументы = Истина;
		
		Для Каждого СозданныйДокумент Из Результат.СозданныеДокументы Цикл
			СтрокаТаблДокумента = ОбъектСДанными.Добавить();
			СтрокаТаблДокумента.Документ = СозданныйДокумент;
			СтрокаТаблДокумента.Раздел = "СозданныеДокументы";
		КонецЦикла;
	КонецЕсли;
	
	ПоказыватьРазделОшибки = Ложь;
	Если Результат.Ошибки.Количество() > 0 Тогда
		ПоказыватьРазделОшибки = Истина;
		
		Для Каждого Ошибка Из Результат.Ошибки Цикл
			СтрокаТаблДокумента = ОбъектСДанными.Добавить();
			СтрокаТаблДокумента.Раздел = "Ошибки";
			Если ТипЗнч(Ошибка) = Тип("Структура") Тогда
				СтрокаТаблДокумента.Документ = Ошибка.Документ;
				СтрокаТаблДокумента.Текст = Ошибка.ТекстОшибки;
			Иначе
				СтрокаТаблДокумента.Текст = Строка(Ошибка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ОбъектСДанными", ОбъектСДанными);

	СхемаКомпоновкиДанных = ПолучитьОбщийМакет("асп_МакетУведомлений");
	
	НастройкиОсновногоВарианта = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки.Структура;
	Если Не ПоказыватьРазделСозданныеДокументы Тогда
		НастройкиОсновногоВарианта[0].Использование = Ложь;
	КонецЕсли;
	Если Не ПоказыватьРазделДозаполненныеДокументы Тогда
		НастройкиОсновногоВарианта[1].Использование = Ложь;
	КонецЕсли;
	Если Не ПоказыватьРазделОшибки Тогда
		НастройкиОсновногоВарианта[2].Использование = Ложь;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, СхемаКомпоновкиДанных.НастройкиПоУмолчанию);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);

	ДокументРезультат = Новый ТабличныйДокумент;

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ДокументРезультат.ТолькоПросмотр = Истина;
	ДокументРезультат.ОтображатьСетку = Ложь;
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
		
	ВозвращаемыйРезультат.Вставить("Уведомления", ДокументРезультат);
	ВозвращаемыйРезультат.Вставить("ПриобретениеТоваровУслуг", ПриобретениеТоваровУслуг);
	
	ПоместитьВоВременноеХранилище(ВозвращаемыйРезультат, АдресРезультата);
	
КонецПроцедуры

Процедура ПроизвестиНакоплениеПриобретенногоТовараВЗаказахНаПеремещение(ПриобретениеТоваровУслуг, Результат)
	ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,, "Накопление начало", "Накопление начало");
	ЗафиксированнаяТекущаяДата = ТекущаяДатаСеанса();
	
	
	//проверим, надо ли обрабатывать
	
	ЗапросДляПроверкиНеобходимостиОбработки = Новый Запрос;
	ЗапросДляПроверкиНеобходимостиОбработки.УстановитьПараметр("СсылкаНаПТУ", ПриобретениеТоваровУслуг);
	
	ЗапросДляПроверкиНеобходимостиОбработки.Текст =
		"ВЫБРАТЬ
		|	ЗаказНаПеремещение.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказНаПеремещение КАК ЗаказНаПеремещение
		|ГДЕ
		|	ЗаказНаПеремещение.ДокументОснование = &СсылкаНаПТУ
		|	И НЕ ЗаказНаПеремещение.ПометкаУдаления";
	Если Не ЗапросДляПроверкиНеобходимостиОбработки.Выполнить().Пустой() Тогда
		Результат.Ошибки.Добавить("УжеСозданНаОснованииЗаказНаПеремещение");
		
		//ASP_Hlopkov 21.10.2020+
		ЗаписьЖурналаРегистрации("Данные.Изменение", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ПриобретениеТоваровУслуг,, "Уже создан на основании заказ на перемещение" + Символы.ПС + ОписаниеОшибки()); 
		//ASP_Hlopkov 21.10.2020-
		ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,, "Есть заказы по ПТУ", "Есть заказы по ПТУ");
		Возврат; //обработка требовалась, и она уже была выполнена
	КонецЕсли;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ЗапросДляПроверкиНеобходимостиОбработки.МенеджерВременныхТаблиц = МенеджерВТ;
	
	ЗапросДляПроверкиНеобходимостиОбработки.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслугТовары.ЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.Ссылка.ЗаказПоставщику
	|		ИНАЧЕ ПриобретениеТоваровУслугТовары.ЗаказПоставщику
	|	КОНЕЦ КАК ЗаказПоставщику,
	|	ПриобретениеТоваровУслугТовары.Ссылка КАК ПриобретениеТоваровУслуг,
	|	ПриобретениеТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	|	ПриобретениеТоваровУслугТовары.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслугТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ПриобретениеТоваровУслугТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.Назначение.Заказ
	|		КОГДА ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента
	|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
	|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказКлиента,
	|	СУММА(ПриобретениеТоваровУслугТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ СодержимоеЭтогоПТУ
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ПО (ВЫБОР
	|				КОГДА ПриобретениеТоваровУслугТовары.ЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|					ТОГДА ПриобретениеТоваровУслугТовары.Ссылка.ЗаказПоставщику
	|				ИНАЧЕ ПриобретениеТоваровУслугТовары.ЗаказПоставщику
	|			КОНЕЦ = ЗаказПоставщикуТовары.Ссылка)
	|			И (ПриобретениеТоваровУслугТовары.КодСтроки = ЗаказПоставщикуТовары.КодСтроки)
	|			И (НЕ ЗаказПоставщикуТовары.Ссылка.ПометкаУдаления)
	|			И (НЕ ЗаказПоставщикуТовары.Отменено)
	|			И (ПриобретениеТоваровУслугТовары.Номенклатура = ЗаказПоставщикуТовары.Номенклатура)
	|			И (ПриобретениеТоваровУслугТовары.Характеристика = ЗаказПоставщикуТовары.Характеристика)
	|ГДЕ
	|	ПриобретениеТоваровУслугТовары.Ссылка = &СсылкаНаПТУ
	|	И ПриобретениеТоваровУслугТовары.Ссылка.Проведен
	|	И ПриобретениеТоваровУслугТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслугТовары.ЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.Ссылка.ЗаказПоставщику
	|		ИНАЧЕ ПриобретениеТоваровУслугТовары.ЗаказПоставщику
	|	КОНЕЦ,
	|	ПриобретениеТоваровУслугТовары.Ссылка,
	|	ПриобретениеТоваровУслугТовары.НомерСтроки,
	|	ПриобретениеТоваровУслугТовары.Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика,
	|	ПриобретениеТоваровУслугТовары.Склад,
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслугТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ПриобретениеТоваровУслугТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.Назначение.Заказ
	|		КОГДА ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента
	|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
	|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СодержимоеЭтогоПТУ.ЗаказПоставщику КАК ЗаказПоставщику,
	|	СодержимоеЭтогоПТУ.Номенклатура КАК Номенклатура,
	|	СодержимоеЭтогоПТУ.Характеристика КАК Характеристика,
	|	СодержимоеЭтогоПТУ.ЗаказКлиента КАК ЗаказКлиента,
	|	СодержимоеЭтогоПТУ.Склад КАК СкладОприходования,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
	|		ИНАЧЕ ЗаказКлиентаТовары.Склад
	|	КОНЕЦ КАК СкладПродажи,
	|	СУММА(СодержимоеЭтогоПТУ.Количество) КАК Количество
	|ПОМЕСТИТЬ СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам
	|ИЗ
	|	СодержимоеЭтогоПТУ КАК СодержимоеЭтогоПТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО СодержимоеЭтогоПТУ.ЗаказКлиента = СостоянияЗаказовКлиентов.Заказ 
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО (СодержимоеЭтогоПТУ.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
	|			И ЗаказКлиентаТовары.Номенклатура = СодержимоеЭтогоПТУ.Номенклатура
	|			И ЗаказКлиентаТовары.Характеристика = СодержимоеЭтогоПТУ.Характеристика)
	|ГДЕ
	|	СодержимоеЭтогоПТУ.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И СодержимоеЭтогоПТУ.Склад <> ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
	|		ИНАЧЕ ЗаказКлиентаТовары.Склад
	|	КОНЕЦ
	|	И СодержимоеЭтогоПТУ.ЗаказКлиента <> НЕОПРЕДЕЛЕНО
	|	И СодержимоеЭтогоПТУ.ЗаказКлиента.Проведен
	|	И СостоянияЗаказовКлиентов.Состояние ЕСТЬ НЕ NULL 
	|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяОплатаПослеОтгрузки)
	|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ГотовКЗакрытию)
	|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт)
	|
	|СГРУППИРОВАТЬ ПО
	|	СодержимоеЭтогоПТУ.ЗаказПоставщику,
	|	СодержимоеЭтогоПТУ.Номенклатура,
	|	СодержимоеЭтогоПТУ.Характеристика,
	|	СодержимоеЭтогоПТУ.ЗаказКлиента,
	|	СодержимоеЭтогоПТУ.Склад,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
	|		ИНАЧЕ ЗаказКлиентаТовары.Склад
	|	конец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказПоставщику КАК ЗаказПоставщику,
	|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказПоставщику.НомерПоДаннымПоставщика КАК НомерПоДаннымПоставщика
	|ИЗ
	|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам КАК СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам";
	ЗапросДляПроверкиНеобходимостиОбработки.УстановитьПараметр("ТекущаяДата", ЗафиксированнаяТекущаяДата);
	ВыборкаЗаказовПоставщикам = ЗапросДляПроверкиНеобходимостиОбработки.Выполнить().Выбрать();
	
	
	МассивОбрабатываемыхЗаказовПоставщикам = Новый Массив;
	МассивОставшихсяЗаказовПоставщику = Новый Массив;
	Пока ВыборкаЗаказовПоставщикам.Следующий() Цикл
		Если ПустаяСтрока(ВыборкаЗаказовПоставщикам.НомерПоДаннымПоставщика) Тогда
			МассивОставшихсяЗаказовПоставщику.Добавить(ВыборкаЗаказовПоставщикам.ЗаказПоставщику); //+++ {{ ASP 10.09.2020 000008403 }}
		Иначе
			МассивОбрабатываемыхЗаказовПоставщикам.Добавить(ВыборкаЗаказовПоставщикам.ЗаказПоставщику);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивОбрабатываемыхЗаказовПоставщикам.Количество() = 0
	 И МассивОставшихсяЗаказовПоставщику.Количество() = 0 Тогда
		Результат.Ошибки.Добавить("НетЗаказовПоставщикам");
		
		//ASP_Hlopkov 21.10.2020+
		ЗаписьЖурналаРегистрации("Данные.Изменение", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ПриобретениеТоваровУслуг,, "Нет заказов поставщикам" + Символы.ПС + ОписаниеОшибки()); 
		//ASP_Hlopkov 21.10.2020-
		
		Возврат; //нет Заказов поставщикам, по которым требуется обработка
	КонецЕсли;
	
	//ASP_Hlopkov 20.11.2020+
	ТекстЗапросаВТИзПроверкиНеобходимости = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслугТовары.ЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.Ссылка.ЗаказПоставщику
	|		ИНАЧЕ ПриобретениеТоваровУслугТовары.ЗаказПоставщику
	|	КОНЕЦ КАК ЗаказПоставщику,
	|	ПриобретениеТоваровУслугТовары.Ссылка КАК ПриобретениеТоваровУслуг,
	|	ПриобретениеТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	|	ПриобретениеТоваровУслугТовары.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслугТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ПриобретениеТоваровУслугТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.Назначение.Заказ
	|		КОГДА ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента
	|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
	|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказКлиента,
	|	СУММА(ПриобретениеТоваровУслугТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ СодержимоеЭтогоПТУ
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ПО (ВЫБОР
	|				КОГДА ПриобретениеТоваровУслугТовары.ЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|					ТОГДА ПриобретениеТоваровУслугТовары.Ссылка.ЗаказПоставщику
	|				ИНАЧЕ ПриобретениеТоваровУслугТовары.ЗаказПоставщику
	|			КОНЕЦ = ЗаказПоставщикуТовары.Ссылка)
	|			И (ПриобретениеТоваровУслугТовары.КодСтроки = ЗаказПоставщикуТовары.КодСтроки)
	|			И (НЕ ЗаказПоставщикуТовары.Ссылка.ПометкаУдаления)
	|			И (НЕ ЗаказПоставщикуТовары.Отменено)
	|			И (ПриобретениеТоваровУслугТовары.Номенклатура = ЗаказПоставщикуТовары.Номенклатура)
	|			И (ПриобретениеТоваровУслугТовары.Характеристика = ЗаказПоставщикуТовары.Характеристика)
	|ГДЕ
	|	ПриобретениеТоваровУслугТовары.Ссылка = &СсылкаНаПТУ
	|	И ПриобретениеТоваровУслугТовары.Ссылка.Проведен
	|	И ПриобретениеТоваровУслугТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслугТовары.ЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.Ссылка.ЗаказПоставщику
	|		ИНАЧЕ ПриобретениеТоваровУслугТовары.ЗаказПоставщику
	|	КОНЕЦ,
	|	ПриобретениеТоваровУслугТовары.Ссылка,
	|	ПриобретениеТоваровУслугТовары.НомерСтроки,
	|	ПриобретениеТоваровУслугТовары.Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика,
	|	ПриобретениеТоваровУслугТовары.Склад,
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслугТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ПриобретениеТоваровУслугТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.Назначение.Заказ
	|		КОГДА ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента
	|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
	|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СодержимоеЭтогоПТУ.ЗаказПоставщику КАК ЗаказПоставщику,
	|	СодержимоеЭтогоПТУ.Номенклатура КАК Номенклатура,
	|	СодержимоеЭтогоПТУ.Характеристика КАК Характеристика,
	|	СодержимоеЭтогоПТУ.ЗаказКлиента КАК ЗаказКлиента,
	|	СодержимоеЭтогоПТУ.Склад КАК СкладОприходования,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
	|		ИНАЧЕ ЗаказКлиентаТовары.Склад
	|	КОНЕЦ КАК СкладПродажи,
	|	СУММА(СодержимоеЭтогоПТУ.Количество) КАК Количество
	|ПОМЕСТИТЬ СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам
	|ИЗ
	|	СодержимоеЭтогоПТУ КАК СодержимоеЭтогоПТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО СодержимоеЭтогоПТУ.ЗаказКлиента = СостоянияЗаказовКлиентов.Заказ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО (СодержимоеЭтогоПТУ.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
	|			И ЗаказКлиентаТовары.Номенклатура = СодержимоеЭтогоПТУ.Номенклатура
	|			И ЗаказКлиентаТовары.Характеристика = СодержимоеЭтогоПТУ.Характеристика)
	|ГДЕ
	|	СодержимоеЭтогоПТУ.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И СодержимоеЭтогоПТУ.Склад <> ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
	|		ИНАЧЕ ЗаказКлиентаТовары.Склад
	|	КОНЕЦ
	|	И СодержимоеЭтогоПТУ.ЗаказКлиента <> НЕОПРЕДЕЛЕНО
	|	И СодержимоеЭтогоПТУ.ЗаказКлиента.Проведен
	|	И СостоянияЗаказовКлиентов.Состояние ЕСТЬ НЕ NULL 
	|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяОплатаПослеОтгрузки)
	|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ГотовКЗакрытию)
	|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт)
	|
	|СГРУППИРОВАТЬ ПО
	|	СодержимоеЭтогоПТУ.ЗаказПоставщику,
	|	СодержимоеЭтогоПТУ.Номенклатура,
	|	СодержимоеЭтогоПТУ.Характеристика,
	|	СодержимоеЭтогоПТУ.ЗаказКлиента,
	|	СодержимоеЭтогоПТУ.Склад,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
	|		ИНАЧЕ ЗаказКлиентаТовары.Склад
	|	КОНЕЦ";

    ТекстДобавочный = "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
	//ASP_Hlopkov 20.11.2020-
	
	ТекстЗапросаСодержимогоПриобретения =
		"ВЫБРАТЬ
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказПоставщику КАК ЗаказПоставщику,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказКлиента КАК ЗаказКлиента,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Номенклатура КАК Номенклатура,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Характеристика КАК Характеристика,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.СкладОприходования КАК СкладОприходования,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.СкладПродажи КАК СкладПродажи,
		|	ВЫБОР
		|		КОГДА СУММА(ЕСТЬNULL(асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.Количество, 0)) >= СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Количество
		|				ИЛИ СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Количество <= 0
		|			ТОГДА 0
		|		ИНАЧЕ СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Количество - СУММА(ЕСТЬNULL(асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.Количество, 0))
		|	КОНЕЦ КАК КРезервированию
		|ПОМЕСТИТЬ СодержимоеПТУДляПеремещенияПоЗаказуПоставщику
		|ИЗ
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам КАК СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.асп_ЗаказыНаПеремещениеСРезервамиПоПТУ КАК асп_ЗаказыНаПеремещениеСРезервамиПоПТУ
		|		ПО (асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.ДокументПриобретения = &СсылкаНаПТУ)
		|			И СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказПоставщику = асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.ЗаказПоставщику
		|			И СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказКлиента = асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.ЗаказКлиента
		|			И СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Номенклатура = асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.Номенклатура
		|			И СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Характеристика = асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.Характеристика
		|ГДЕ
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказПоставщику = &ЗаказПоставщику
		|
		|СГРУППИРОВАТЬ ПО
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказПоставщику,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказКлиента,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Номенклатура,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Характеристика,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.СкладОприходования,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.СкладПродажи,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Количество
		|
		|ИМЕЮЩИЕ
		|	ВЫБОР
		|		КОГДА СУММА(ЕСТЬNULL(асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.Количество, 0)) >= СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Количество
		|				ИЛИ СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Количество <= 0
		|			ТОГДА 0
		|		ИНАЧЕ СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Количество - СУММА(ЕСТЬNULL(асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.Количество, 0))
		|	КОНЕЦ > 0";
	
	//ASP_Hlopkov 20.11.2020+ Добавил проверку на группу складов иначе дальнейшие таблицы будут рассчитываться некорректно
	ТекстЗапросаПроверкиСклада = 
		"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику.ЗаказПоставщику КАК ЗаказПоставщику,
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику.ЗаказКлиента КАК ЗаказКлиента,
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику.Номенклатура КАК Номенклатура,
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику.Характеристика КАК Характеристика,
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику.СкладОприходования КАК СкладОприходования,
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику.СкладПродажи КАК СкладПродажи,
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику.КРезервированию КАК КРезервированию,
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику.СкладПродажи.ЭтоГруппа КАК СкладПродажиЭтоГруппа
		|ИЗ
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику КАК СодержимоеПТУДляПеремещенияПоЗаказуПоставщику";
	
	ЗапросДляПроверкиСклада = Новый Запрос;
	ЗапросДляПроверкиСклада.Текст = ТекстЗапросаВТИзПроверкиНеобходимости + ТекстДобавочный + ТекстЗапросаСодержимогоПриобретения + ТекстЗапросаПроверкиСклада;
	
	//ЗапросДляПроверкиСклада.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Если МассивОбрабатываемыхЗаказовПоставщикам.Количество() > 0 Тогда
	
		ЗапросДляПроверкиСклада.УстановитьПараметр("ЗаказПоставщику", МассивОбрабатываемыхЗаказовПоставщикам[0]);
		ЗапросДляПроверкиСклада.УстановитьПараметр("СсылкаНаПТУ", ПриобретениеТоваровУслуг);
		
		ТЗРезультатаПроверки = ЗапросДляПроверкиСклада.Выполнить().Выгрузить();
		
		Для Каждого СтрокаРезультата Из ТЗРезультатаПроверки Цикл
			
			Если СтрокаРезультата.СкладПродажиЭтоГруппа Тогда
				СтруктураОтбора = Новый Структура("Номенклатура, Характеристика", СтрокаРезультата.Номенклатура, СтрокаРезультата.Характеристика);
				
				МассивНайденныхСтрок = СтрокаРезультата.ЗаказКлиента.Товары.НайтиСтроки(СтруктураОтбора);
				
				Если МассивНайденныхСтрок.Количество() > 0 Тогда
					Для Каждого СтрокаМассива Из МассивНайденныхСтрок Цикл
						Если СтрокаМассива.Склад <> СтрокаРезультата.СкладОприходования Тогда
							СтрокаРезультата.СкладПродажи = СтрокаМассива.Склад;		
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;	
					
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;	
	//ASP_Hlopkov 20.11.2020-
	
	ТекстЗапросаЗаказовНаПеремещение =
	//ASP_Hlopkov 20.11.2020+
	"ВЫБРАТЬ
	|	ТЗРезультатаПроверки.Номенклатура КАК Номенклатура,
	|	ТЗРезультатаПроверки.Характеристика КАК Характеристика,
	|	ТЗРезультатаПроверки.СкладПродажи КАК СкладПродажи,
	|	ТЗРезультатаПроверки.СкладОприходования КАК СкладОприходования,
	|	ТЗРезультатаПроверки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ТЗРезультатаПроверки.ЗаказКлиента КАК ЗаказКлиента,
	|	ТЗРезультатаПроверки.КРезервированию КАК КРезервированию
	|ПОМЕСТИТЬ ТЗРезультатаПроверки
	|ИЗ
	|	&ТЗРезультатаПроверки КАК ТЗРезультатаПроверки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказНаПеремещениеТовары.Ссылка КАК ЗаказНаПеремещение,
	|	ВЫРАЗИТЬ(ЗаказНаПеремещениеТовары.Ссылка.ДокументОснование КАК Документ.ПриобретениеТоваровУслуг) КАК ПриобретениеТоваровУслуг,
	|	ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель КАК СкладОтправитель,
	|	ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель КАК СкладПолучатель,
	|	ЗаказНаПеремещениеТовары.КодСтроки КАК КодСтроки,
	|	ЗаказНаПеремещениеТовары.Номенклатура КАК Номенклатура,
	|	ЗаказНаПеремещениеТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказНаПеремещениеТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказНаПеремещениеТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказНаПеремещениеТовары.Назначение.Заказ
	|		КОГДА ЗаказНаПеремещениеТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказНаПеремещениеТовары.ASP_ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказКлиента,
	|	СУММА(ЗаказНаПеремещениеТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам
	|ИЗ
	|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
	|ГДЕ
	|	ЗаказНаПеремещениеТовары.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Закрыт)
	|	И ЗаказНаПеремещениеТовары.Ссылка.Проведен
	|	И (ЗаказНаПеремещениеТовары.Номенклатура, ЗаказНаПеремещениеТовары.Характеристика, ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель, ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель) В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ТЗРезультатаПроверки.Номенклатура,
	|				ТЗРезультатаПроверки.Характеристика,
	|				ТЗРезультатаПроверки.СкладОприходования,
	|				ТЗРезультатаПроверки.СкладПродажи
	|			ИЗ
	|				ТЗРезультатаПроверки КАК ТЗРезультатаПроверки) 
	// ASP_Мочалина 27/02/24
	//|	И НЕ ЗаказНаПеремещениеТовары.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно), ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить), ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада))
	//
	|	И НЕ ЗаказНаПеремещениеТовары.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить), ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада))
	|	И НЕ ЗаказНаПеремещениеТовары.Отменено
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказНаПеремещениеТовары.Ссылка,
	|	ВЫРАЗИТЬ(ЗаказНаПеремещениеТовары.Ссылка.ДокументОснование КАК Документ.ПриобретениеТоваровУслуг),
	|	ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель,
	|	ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель,
	|	ЗаказНаПеремещениеТовары.КодСтроки,
	|	ЗаказНаПеремещениеТовары.Номенклатура,
	|	ЗаказНаПеремещениеТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказНаПеремещениеТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказНаПеремещениеТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказНаПеремещениеТовары.Назначение.Заказ
	|		КОГДА ЗаказНаПеремещениеТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказНаПеремещениеТовары.ASP_ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриобретениеТоваровУслугТовары.Ссылка КАК ПриобретениеТоваровУслуг,
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслугТовары.ЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.Ссылка.ЗаказПоставщику
	|		ИНАЧЕ ПриобретениеТоваровУслугТовары.ЗаказПоставщику
	|	КОНЕЦ КАК ЗаказПоставщику,
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	|	ПриобретениеТоваровУслугТовары.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслугТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ПриобретениеТоваровУслугТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.Назначение.Заказ
	|		КОГДА ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента
	|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
	|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказКлиента
	|ПОМЕСТИТЬ СодержимоеВсехСвязанныхПТУ
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ПО (ВЫБОР
	|				КОГДА ПриобретениеТоваровУслугТовары.ЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|					ТОГДА ПриобретениеТоваровУслугТовары.Ссылка.ЗаказПоставщику
	|				ИНАЧЕ ПриобретениеТоваровУслугТовары.ЗаказПоставщику
	|			КОНЕЦ = ЗаказПоставщикуТовары.Ссылка)
	|			И ПриобретениеТоваровУслугТовары.КодСтроки = ЗаказПоставщикуТовары.КодСтроки
	|			И (НЕ ЗаказПоставщикуТовары.Ссылка.ПометкаУдаления)
	|			И (НЕ ЗаказПоставщикуТовары.Отменено)
	|			И ПриобретениеТоваровУслугТовары.Номенклатура = ЗаказПоставщикуТовары.Номенклатура
	|			И ПриобретениеТоваровУслугТовары.Характеристика = ЗаказПоставщикуТовары.Характеристика
	|ГДЕ
	|	ПриобретениеТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ПриобретениеТоваровУслуг
	|			ИЗ
	|				СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам)
	|	И ПриобретениеТоваровУслугТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслугТовары.Ссылка,
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслугТовары.ЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.Ссылка.ЗаказПоставщику
	|		ИНАЧЕ ПриобретениеТоваровУслугТовары.ЗаказПоставщику
	|	КОНЕЦ,
	|	ПриобретениеТоваровУслугТовары.Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика,
	|	ПриобретениеТоваровУслугТовары.Склад,
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслугТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ПриобретениеТоваровУслугТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.Назначение.Заказ
	|		КОГДА ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента
	|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
	|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СодержимоеВсехСвязанныхПТУ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг,
	|	СодержимоеВсехСвязанныхПТУ.Номенклатура КАК Номенклатура,
	|	СодержимоеВсехСвязанныхПТУ.Характеристика КАК Характеристика,
	|	СодержимоеВсехСвязанныхПТУ.ЗаказКлиента КАК ЗаказКлиента,
	|	СодержимоеВсехСвязанныхПТУ.ЗаказПоставщику КАК ЗаказПоставщику
	|ПОМЕСТИТЬ СвязиПриобретенийСЗаказамиПоставщикам
	|ИЗ
	|	СодержимоеВсехСвязанныхПТУ КАК СодержимоеВсехСвязанныхПТУ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО (СодержимоеВсехСвязанныхПТУ.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
	|			И СодержимоеВсехСвязанныхПТУ.Номенклатура = ЗаказКлиентаТовары.Номенклатура
	|			И СодержимоеВсехСвязанныхПТУ.Характеристика = ЗаказКлиентаТовары.Характеристика)
	|ГДЕ
	|	СодержимоеВсехСвязанныхПТУ.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И СодержимоеВсехСвязанныхПТУ.Склад <> ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
	|		ИНАЧЕ ЗаказКлиентаТовары.Склад
	|	КОНЕЦ
	|	И СодержимоеВсехСвязанныхПТУ.ЗаказКлиента <> НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	СодержимоеВсехСвязанныхПТУ.ЗаказПоставщику,
	|	СодержимоеВсехСвязанныхПТУ.Номенклатура,
	|	СодержимоеВсехСвязанныхПТУ.Характеристика,
	|	СодержимоеВсехСвязанныхПТУ.ЗаказКлиента,
	|	СодержимоеВсехСвязанныхПТУ.ПриобретениеТоваровУслуг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриобретениеТоваровУслугТовары.Ссылка КАК ПриобретениеТоваровУслуг,
	|	ЗаказПоставщикуТовары.Ссылка КАК ЗаказПоставщику,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
	|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказКлиента,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Ссылка.Склад
	|		ИНАЧЕ ЗаказПоставщикуТовары.Склад
	|	КОНЕЦ КАК Склад
	|ПОМЕСТИТЬ СтрокиЗаказовПоставщикамДляОстальнойАналитики
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ПО (ПриобретениеТоваровУслугТовары.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка)
	|ГДЕ
	|	ПриобретениеТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ПриобретениеТоваровУслуг
	|			ИЗ
	|				СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам)
	|	И ПриобретениеТоваровУслугТовары.Ссылка.ЗаказПоставщику = ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И ПриобретениеТоваровУслугТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|	И (ПриобретениеТоваровУслугТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ПриобретениеТоваровУслугТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ИЛИ ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ПриобретениеТоваровУслугТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслугТовары.Ссылка,
	|	ЗаказПоставщикуТовары.Ссылка,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Характеристика,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
	|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаказПоставщикуТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Ссылка.Склад
	|		ИНАЧЕ ЗаказПоставщикуТовары.Склад
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
	|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ЗаказКлиента КАК ЗаказКлиента,
	|	ВЫБОР
	|		КОГДА СвязиПриобретенийСЗаказамиПоставщикам.ЗаказПоставщику ЕСТЬ НЕ NULL 
	|			ТОГДА СвязиПриобретенийСЗаказамиПоставщикам.ЗаказПоставщику
	|		КОГДА СтрокиЗаказовПоставщикамДляОстальнойАналитики.ЗаказПоставщику ЕСТЬ НЕ NULL 
	|			ТОГДА СтрокиЗаказовПоставщикамДляОстальнойАналитики.ЗаказПоставщику
	|		КОГДА СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ПриобретениеТоваровУслуг.ЗаказПоставщику ЕСТЬ НЕ NULL 
	|			ТОГДА СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ПриобретениеТоваровУслуг.ЗаказПоставщику
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	КОНЕЦ КАК ЗаказПоставщику,
	|	ВЫБОР
	|		КОГДА СвязиПриобретенийСЗаказамиПоставщикам.ЗаказПоставщику ЕСТЬ НЕ NULL 
	|			ТОГДА 2
	|		КОГДА СтрокиЗаказовПоставщикамДляОстальнойАналитики.ЗаказПоставщику ЕСТЬ НЕ NULL 
	|			ТОГДА 3
	|		КОГДА СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ПриобретениеТоваровУслуг.ЗаказПоставщику ЕСТЬ НЕ NULL 
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет,
	|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.СкладОтправитель КАК СкладОтправитель,
	|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.СкладПолучатель КАК СкладПолучатель,
	|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.КодСтроки КАК КодСтроки,
	|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.Номенклатура КАК Номенклатура,
	|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.Характеристика КАК Характеристика,
	|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.Количество КАК Количество
	|ПОМЕСТИТЬ СтрокиЗаказовНаПеремещенияПоАналитике
	|ИЗ
	|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам КАК СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам
	|		ЛЕВОЕ СОЕДИНЕНИЕ СвязиПриобретенийСЗаказамиПоставщикам КАК СвязиПриобретенийСЗаказамиПоставщикам
	|		ПО (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ПриобретениеТоваровУслуг = СвязиПриобретенийСЗаказамиПоставщикам.ПриобретениеТоваровУслуг)
	|			И (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ЗаказКлиента = СвязиПриобретенийСЗаказамиПоставщикам.ЗаказКлиента)
	|			И (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.Номенклатура = СвязиПриобретенийСЗаказамиПоставщикам.Номенклатура)
	|			И (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.Характеристика = СвязиПриобретенийСЗаказамиПоставщикам.Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтрокиЗаказовПоставщикамДляОстальнойАналитики КАК СтрокиЗаказовПоставщикамДляОстальнойАналитики
	|		ПО (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ПриобретениеТоваровУслуг = СтрокиЗаказовПоставщикамДляОстальнойАналитики.ПриобретениеТоваровУслуг)
	|			И (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.Номенклатура = СтрокиЗаказовПоставщикамДляОстальнойАналитики.Номенклатура)
	|			И (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.Характеристика = СтрокиЗаказовПоставщикамДляОстальнойАналитики.Характеристика)
	|			И (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ЗаказКлиента = СтрокиЗаказовПоставщикамДляОстальнойАналитики.ЗаказКлиента)
	|			И (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.СкладОтправитель = СтрокиЗаказовПоставщикамДляОстальнойАналитики.Склад)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗРезультатаПроверки.ЗаказКлиента КАК ЗаказКлиента,
	|	ТЗРезультатаПроверки.Номенклатура КАК Номенклатура,
	|	ТЗРезультатаПроверки.Характеристика КАК Характеристика,
	|	СтрокиЗаказовНаПеремещенияПоАналитике.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
	|	СтрокиЗаказовНаПеремещенияПоАналитике.КодСтроки КАК КодСтроки,
	|	СтрокиЗаказовНаПеремещенияПоАналитике.Приоритет КАК Приоритет,
	|	СтрокиЗаказовНаПеремещенияПоАналитике.Количество КАК Количество
	|ПОМЕСТИТЬ СтрокиЗаказовНаПеремещенияКРезервированию
	|ИЗ
	|	ТЗРезультатаПроверки КАК ТЗРезультатаПроверки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтрокиЗаказовНаПеремещенияПоАналитике КАК СтрокиЗаказовНаПеремещенияПоАналитике
	|		ПО (ТЗРезультатаПроверки.ЗаказПоставщику = СтрокиЗаказовНаПеремещенияПоАналитике.ЗаказПоставщику)
	|			И (ТЗРезультатаПроверки.ЗаказКлиента = СтрокиЗаказовНаПеремещенияПоАналитике.ЗаказКлиента)
	|			И (ТЗРезультатаПроверки.СкладОприходования = СтрокиЗаказовНаПеремещенияПоАналитике.СкладОтправитель)
	|			И (ТЗРезультатаПроверки.СкладПродажи = СтрокиЗаказовНаПеремещенияПоАналитике.СкладПолучатель)
	|			И (ТЗРезультатаПроверки.Номенклатура = СтрокиЗаказовНаПеремещенияПоАналитике.Номенклатура)
	|			И (ТЗРезультатаПроверки.Характеристика = СтрокиЗаказовНаПеремещенияПоАналитике.Характеристика)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ЗаказКлиента КАК ЗаказКлиента,
	|	ВложенныйЗапрос.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
	|	КОЛИЧЕСТВО(*) КАК Колво
	|ПОМЕСТИТЬ КолвоРазличнойАналитики
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЗаказыНаПеремещения.ЗаказКлиента КАК ЗаказКлиента,
	|		ЗаказыНаПеремещения.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
	|		ЗаказыНаПеремещения.Номенклатура КАК Номенклатура,
	|		ЗаказыНаПеремещения.Характеристика КАК Характеристика
	|	ИЗ
	|		СтрокиЗаказовНаПеремещенияКРезервированию КАК ЗаказыНаПеремещения) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ЗаказКлиента,
	|	ВложенныйЗапрос.ЗаказНаПеремещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыНаПеремещения.ЗаказКлиента КАК ЗаказКлиента,
	|	ЗаказыНаПеремещения.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
	|	СУММА(ЗаказыНаПеремещения.Количество) КАК Колво
	|ПОМЕСТИТЬ ОбщееКоличество
	|ИЗ
	|	СтрокиЗаказовНаПеремещенияКРезервированию КАК ЗаказыНаПеремещения
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыНаПеремещения.ЗаказКлиента,
	|	ЗаказыНаПеремещения.ЗаказНаПеремещение";
	
	ТекстЗапросаУничтоженияВременныхТаблицСЗаказамиНаПеремещения =
		"УНИЧТОЖИТЬ СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СодержимоеВсехСвязанныхПТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СвязиПриобретенийСЗаказамиПоставщикам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СтрокиЗаказовПоставщикамДляОстальнойАналитики
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СтрокиЗаказовНаПеремещенияПоАналитике
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СтрокиЗаказовНаПеремещенияКРезервированию
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ КолвоРазличнойАналитики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ОбщееКоличество";
	ТекстЗапросаИтоговыхТаблиц =
		"ВЫБРАТЬ
		|	ПриобретенныеТовары.ЗаказКлиента КАК ЗаказКлиента,
		|	ПриобретенныеТовары.Номенклатура КАК Номенклатура,
		|	ПриобретенныеТовары.Характеристика КАК Характеристика,
		|	ПриобретенныеТовары.КРезервированию КАК КРезервированию
		|ИЗ
		//ASP_Hlopkov 20.11.2020+
		//|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику КАК ПриобретенныеТовары
		|	ТЗРезультатаПроверки КАК ПриобретенныеТовары
		//ASP_Hlopkov 20.11.2020-
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтрокиЗаказовНаПеремещения.ЗаказКлиента КАК ЗаказКлиента,
		|	СтрокиЗаказовНаПеремещения.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
		|	СтрокиЗаказовНаПеремещения.Номенклатура КАК Номенклатура,
		|	СтрокиЗаказовНаПеремещения.Характеристика КАК Характеристика,
		|	СтрокиЗаказовНаПеремещения.КодСтроки КАК КодСтроки
		|ИЗ
		|	СтрокиЗаказовНаПеремещенияКРезервированию КАК СтрокиЗаказовНаПеремещения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказКлиента,
		|	ЗаказНаПеремещение,
		|	Номенклатура,
		|	Характеристика,
		|	КодСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыНаПеремещения.ЗаказКлиента КАК ЗаказКлиента,
		|	ЗаказыНаПеремещения.ЗаказНаПеремещение КАК ЗаказНаПеремещение
		|ИЗ
		|	СтрокиЗаказовНаПеремещенияКРезервированию КАК ЗаказыНаПеремещения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КолвоРазличнойАналитики КАК КолвоРазличнойАналитики
		|		ПО (ЗаказыНаПеремещения.ЗаказКлиента = КолвоРазличнойАналитики.ЗаказКлиента)
		|			И (ЗаказыНаПеремещения.ЗаказНаПеремещение = КолвоРазличнойАналитики.ЗаказНаПеремещение)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбщееКоличество КАК ОбщееКоличество
		|		ПО (ЗаказыНаПеремещения.ЗаказКлиента = ОбщееКоличество.ЗаказКлиента)
		|			И (ЗаказыНаПеремещения.ЗаказНаПеремещение = ОбщееКоличество.ЗаказНаПеремещение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказКлиента,
		|	ЗаказыНаПеремещения.Приоритет,
		|	КолвоРазличнойАналитики.Колво УБЫВ,
		|	ОбщееКоличество.Колво УБЫВ
		|ИТОГИ ПО
		|	ЗаказКлиента,
		|	ЗаказНаПеремещение";
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("СсылкаНаПТУ", ПриобретениеТоваровУслуг);
	
	
	ИндексОбрабатываемогоЗаказаПоставщику = 0;
	ЭтоПерваяИтерацияПоЗаказуПоставщику = Истина;
	Пока ИндексОбрабатываемогоЗаказаПоставщику < МассивОбрабатываемыхЗаказовПоставщикам.Количество() Цикл
		
		ОбрабатываемыйЗаказПоставщику = МассивОбрабатываемыхЗаказовПоставщикам[ИндексОбрабатываемогоЗаказаПоставщику];
		
		Запрос.УстановитьПараметр("ЗаказПоставщику", ОбрабатываемыйЗаказПоставщику);
		Если ЭтоПерваяИтерацияПоЗаказуПоставщику Тогда
			Если ИндексОбрабатываемогоЗаказаПоставщику = 0 Тогда
				Запрос.Текст = ТекстЗапросаСодержимогоПриобретения;
			Иначе
				Запрос.Текст =
					"УНИЧТОЖИТЬ СодержимоеПТУДляПеремещенияПоЗаказуПоставщику
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|" + ТекстЗапросаСодержимогоПриобретения;
			КонецЕсли;
			
			
			Запрос.Выполнить();
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапросаЗаказовНаПеремещение;
		
		//ASP_Hlopkov 20.11.2020+
		Запрос.УстановитьПараметр("ТЗРезультатаПроверки", ТЗРезультатаПроверки);
		//ASP_Hlopkov 20.11.2020-
		
		Запрос.Выполнить();
		
		
		Запрос.Текст = ТекстЗапросаИтоговыхТаблиц;
		РезультатыЗапросов = Запрос.ВыполнитьПакет();
		
		Если ЭтоПерваяИтерацияПоЗаказуПоставщику Тогда
			ПриобретенныеТовары = РезультатыЗапросов[0].Выгрузить();
			
			Если ПриобретенныеТовары.Количество() = 0 Тогда
				ИндексОбрабатываемогоЗаказаПоставщику = ИндексОбрабатываемогоЗаказаПоставщику + 1;
				ЭтоПерваяИтерацияПоЗаказуПоставщику = Истина;
				
				Запрос.Текст = ТекстЗапросаУничтоженияВременныхТаблицСЗаказамиНаПеремещения;
				Запрос.Выполнить();
				
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		СтрокиЗаказовНаПеремещения = РезультатыЗапросов[1].Выгрузить();
		
		ВыборкаЗаказовКлиентов = РезультатыЗапросов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		
		ПредварительноеСозданиеЗаказовНаПеремещение = Ложь;
		
		Если ВыборкаЗаказовКлиентов.Количество() = 0 И ЭтоПерваяИтерацияПоЗаказуПоставщику Тогда
			ПредварительноеСозданиеЗаказовНаПеремещение = Истина;
		КонецЕсли;
		
		Если ПредварительноеСозданиеЗаказовНаПеремещение Тогда
			СоздатьЗаказыНаПеремещение(ПриобретениеТоваровУслуг, ОбрабатываемыйЗаказПоставщику, Результат);
			
			Запрос.Текст = ТекстЗапросаУничтоженияВременныхТаблицСЗаказамиНаПеремещения;
			Запрос.Выполнить();
			
			//ASP_Hlopkov 20.11.2020+
			Запрос.Текст =
				"УНИЧТОЖИТЬ ТЗРезультатаПроверки
				|;";
			Запрос.Выполнить();
			//ASP_Hlopkov 20.11.2020-
			
			Запрос.Текст = ТекстЗапросаЗаказовНаПеремещение;
			
			//ASP_Hlopkov 20.11.2020+
			Запрос.УстановитьПараметр("ТЗРезультатаПроверки", ТЗРезультатаПроверки);
			//ASP_Hlopkov 20.11.2020-
			
			Запрос.Выполнить();
			
			Запрос.Текст = ТекстЗапросаИтоговыхТаблиц;
			РезультатыЗапросов = Запрос.ВыполнитьПакет();
			//ПриобретенныеТовары = РезультатыЗапросов[0].Выгрузить();
			СтрокиЗаказовНаПеремещения = РезультатыЗапросов[1].Выгрузить();
			
			ВыборкаЗаказовКлиентов = РезультатыЗапросов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		КонецЕсли;
		
		
		ЗарезервированныеВЗаказеНаПеремещение = ПриобретенныеТовары.СкопироватьКолонки();
		ЗарезервированныеВЗаказеНаПеремещение.Колонки.КРезервированию.Имя = "Зарезервировано";
		
		СтруктураОтбораПриобретенного = Новый Структура("ЗаказКлиента, Номенклатура, Характеристика");
		СтруктураОтбораСтрокЗаказаНаПеремещение = Новый Структура("ЗаказКлиента, ЗаказНаПеремещение");
		
		Пока ВыборкаЗаказовКлиентов.Следующий() Цикл
			
			ВыборкаЗаказовНаПеремещение = ВыборкаЗаказовКлиентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЗаказовНаПеремещение.Следующий() Цикл
				
				ЗаполнитьЗначенияСвойств(СтруктураОтбораСтрокЗаказаНаПеремещение, ВыборкаЗаказовНаПеремещение);
				ОбрабатываемыеСтрокиЗаказаНаПеремещение = СтрокиЗаказовНаПеремещения.НайтиСтроки(СтруктураОтбораСтрокЗаказаНаПеремещение);
				
				ОбработатьДокумент = Ложь;
				Для Каждого ОбрабатываемаяСтрокаЗаказаНаПеремещение Из ОбрабатываемыеСтрокиЗаказаНаПеремещение Цикл
					ЗаполнитьЗначенияСвойств(СтруктураОтбораПриобретенного, ОбрабатываемаяСтрокаЗаказаНаПеремещение);
					СтрокиПриобретенного = ПриобретенныеТовары.НайтиСтроки(СтруктураОтбораПриобретенного);
					Если СтрокиПриобретенного.Количество() > 0 И СтрокиПриобретенного[0].КРезервированию > 0 Тогда
						ОбработатьДокумент = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Не ОбработатьДокумент Тогда
					Продолжить;
				КонецЕсли;
				
				
				Попытка
					ЗаблокироватьДанныеДляРедактирования(ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение);
					ЗаказНаПеремещениеОбъект = ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение.ПолучитьОбъект();
				Исключение
					СодержимоеОшибки = Новый Структура("Документ, ТекстОшибки", ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение, "Не удалось заблокировать документ;
						|вероятно, он редактируется другим пользователем");
					Результат.Ошибки.Добавить(СодержимоеОшибки);
					
					//ASP_Hlopkov 21.10.2020+
					ЗаписьЖурналаРегистрации("Данные.Изменение", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЗаказНаПеремещение,, "Не удалось заблокировать документ вероятно, он редактируется другим пользователем" + Символы.ПС + ОписаниеОшибки()); 
					//ASP_Hlopkov 21.10.2020-
					
					Продолжить;
				КонецПопытки;
				
				
				ЗарезервированныеВЗаказеНаПеремещение.Очистить();
				
				ДокументИзменен = Ложь;
				Для Каждого ОбрабатываемаяСтрокаЗаказаНаПеремещение Из ОбрабатываемыеСтрокиЗаказаНаПеремещение Цикл
					
					СтрокаРедактируемогоДокумента = ЗаказНаПеремещениеОбъект.Товары.Найти(ОбрабатываемаяСтрокаЗаказаНаПеремещение.КодСтроки, "КодСтроки");
					Если СтрокаРедактируемогоДокумента = Неопределено
						//  ASP_Мочалина 27.02.24
					// Или СтрокаРедактируемогоДокумента.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно
					 Или СтрокаРедактируемогоДокумента.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить
					 Или СтрокаРедактируемогоДокумента.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада Тогда
						Продолжить;
					КонецЕсли;
					
					
					ЗаполнитьЗначенияСвойств(СтруктураОтбораПриобретенного, ОбрабатываемаяСтрокаЗаказаНаПеремещение);
					
					СтрокиПриобретенного = ПриобретенныеТовары.НайтиСтроки(СтруктураОтбораПриобретенного);
					Если СтрокиПриобретенного.Количество() = 0 Тогда
						Продолжить;
					Иначе
						КРезервированию = СтрокиПриобретенного[0].КРезервированию;
					КонецЕсли;
					
					СтрокиЗарезервированного = ЗарезервированныеВЗаказеНаПеремещение.НайтиСтроки(СтруктураОтбораПриобретенного);
					Если СтрокиЗарезервированного.Количество() > 0 Тогда
						СтрокаЗарезервированного = СтрокиЗарезервированного[0];
						КРезервированию = КРезервированию - СтрокаЗарезервированного.Зарезервировано;
					Иначе
						СтрокаЗарезервированного = ЗарезервированныеВЗаказеНаПеремещение.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаЗарезервированного, СтруктураОтбораПриобретенного);
						СтрокаЗарезервированного.Зарезервировано = 0;
					КонецЕсли;
					
					Если Мин(КРезервированию, СтрокаРедактируемогоДокумента.Количество) <= 0 Тогда
						Продолжить;
					КонецЕсли;
					
					
					Если КРезервированию < СтрокаРедактируемогоДокумента.Количество Тогда
						ИндексРедактируемойСтроки = ЗаказНаПеремещениеОбъект.Товары.Индекс(СтрокаРедактируемогоДокумента);
						НоваяСтрокаРедактируемогоДокумента = ЗаказНаПеремещениеОбъект.Товары.Вставить(ИндексРедактируемойСтроки + 1);
						ЗаполнитьЗначенияСвойств(НоваяСтрокаРедактируемогоДокумента, СтрокаРедактируемогоДокумента);
						
						СтрокаРедактируемогоДокумента.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
						СтрокаРедактируемогоДокумента.Количество = КРезервированию;
						СтрокаРедактируемогоДокумента.КоличествоУпаковок = КРезервированию;
						
						НоваяСтрокаРедактируемогоДокумента.КодСтроки = 0;
						НоваяСтрокаРедактируемогоДокумента.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
						НоваяСтрокаРедактируемогоДокумента.Количество = НоваяСтрокаРедактируемогоДокумента.Количество - КРезервированию;
						НоваяСтрокаРедактируемогоДокумента.КоличествоУпаковок = НоваяСтрокаРедактируемогоДокумента.Количество;
					КонецЕсли;
					
					СтрокаРедактируемогоДокумента.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
					ДокументИзменен = Истина;
					
					СтрокаЗарезервированного.Зарезервировано = СтрокаЗарезервированного.Зарезервировано + СтрокаРедактируемогоДокумента.Количество;
				КонецЦикла;
				
				Если ДокументИзменен Тогда
					ПолучитьСообщенияПользователю(Истина);
					
					Попытка
						ЗаказНаПеремещениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
						Если Результат.ДозаполненныеДокументы.Найти(ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение) = Неопределено Тогда
							Результат.ДозаполненныеДокументы.Добавить(ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение);
						КонецЕсли;
					Исключение
						КлючСообщений = ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение;
						ВесьТекстОшибки = "Не удалось дозаполнить Заказ на перемещение:";
						
						МассивСообщенийПользователю = ПолучитьСообщенияПользователю(Истина);
						СтрокаСообщений = "";
						Для Каждого Сообщение Из МассивСообщенийПользователю Цикл
							ПредставлениеКлючаСообщения = "";
							Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Сообщение.КлючДанных))
							 И Сообщение.КлючДанных <> КлючСообщений Тогда
								ПредставлениеКлючаСообщения = Строка(Сообщение.КлючДанных) + ": ";
							КонецЕсли;
							
							СтрокаСообщений = СтрокаСообщений + ПредставлениеКлючаСообщения + Сообщение.Текст + Символы.ПС;
						КонецЦикла;
						
						СтрокаСообщений = ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС + СтрокаСообщений);
						ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
						
						Если ПредставлениеОшибки = "Не удалось провести """ + Строка(КлючСообщений) + """!" Тогда
							ПредставлениеОшибки = "";
						Иначе
							ПредставлениеОшибки = Символы.ПС + ПредставлениеОшибки;
						КонецЕсли;
						
						ВесьТекстОшибки = ВесьТекстОшибки + ПредставлениеОшибки + СтрокаСообщений;
						СодержимоеОшибки = Новый Структура("Документ, ТекстОшибки", КлючСообщений, ВесьТекстОшибки);
						
						Результат.Ошибки.Добавить(СодержимоеОшибки);
						ЗарезервированныеВЗаказеНаПеремещение.Очистить();
					КонецПопытки;
				КонецЕсли;
				
				РазблокироватьДанныеДляРедактирования(ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение);
				
				ЗарезервированныеВЗаказеНаПеремещение.Свернуть("ЗаказКлиента, Номенклатура, Характеристика", "Зарезервировано");
				Для Каждого СтрокаЗарезервированного Из ЗарезервированныеВЗаказеНаПеремещение Цикл
					ЗаполнитьЗначенияСвойств(СтруктураОтбораПриобретенного, СтрокаЗарезервированного);
					СтрокиПриобретенного = ПриобретенныеТовары.НайтиСтроки(СтруктураОтбораПриобретенного);
					Если СтрокиПриобретенного.Количество() > 0 Тогда
						СтрокиПриобретенного[0].КРезервированию = Макс(0, СтрокиПриобретенного[0].КРезервированию - СтрокаЗарезервированного.Зарезервировано);
					КонецЕсли;
					
					
					МенеджерЗаписиВРегистр = РегистрыСведений.асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписиВРегистр, СтрокаЗарезервированного);
					МенеджерЗаписиВРегистр.ДокументПриобретения = ПриобретениеТоваровУслуг;
					МенеджерЗаписиВРегистр.ЗаказПоставщику = ОбрабатываемыйЗаказПоставщику;
					МенеджерЗаписиВРегистр.ЗаказНаПеремещение = ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение;
					МенеджерЗаписиВРегистр.Прочитать();
					
					Если МенеджерЗаписиВРегистр.Выбран() Тогда
						НовоеЗначениеЗарезервированного = МенеджерЗаписиВРегистр.Количество + СтрокаЗарезервированного.Зарезервировано;
					Иначе
						НовоеЗначениеЗарезервированного = СтрокаЗарезервированного.Зарезервировано;
						
						ЗаполнитьЗначенияСвойств(МенеджерЗаписиВРегистр, СтрокаЗарезервированного);
						МенеджерЗаписиВРегистр.ДокументПриобретения = ПриобретениеТоваровУслуг;
						МенеджерЗаписиВРегистр.ЗаказПоставщику = ОбрабатываемыйЗаказПоставщику;
						МенеджерЗаписиВРегистр.ЗаказНаПеремещение = ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение;
					КонецЕсли;
					
					МенеджерЗаписиВРегистр.Количество = НовоеЗначениеЗарезервированного;
					МенеджерЗаписиВРегистр.Записать();
				КонецЦикла;
				
			КонецЦикла; //Пока ВыборкаЗаказовНаПеремещение.Следующий()
			
		КонецЦикла;
		
		ИндексСтрокиПриобретенного = 0;
		Пока ИндексСтрокиПриобретенного < ПриобретенныеТовары.Количество() Цикл
			СтрокаПриобретенного = ПриобретенныеТовары[ИндексСтрокиПриобретенного];
			Если СтрокаПриобретенного.КРезервированию = 0 Тогда
				ПриобретенныеТовары.Удалить(СтрокаПриобретенного);
			Иначе
				ИндексСтрокиПриобретенного = ИндексСтрокиПриобретенного + 1;
			КонецЕсли;
		КонецЦикла;
		
		
		Если ПриобретенныеТовары.Количество() > 0 И ЭтоПерваяИтерацияПоЗаказуПоставщику И Не ПредварительноеСозданиеЗаказовНаПеремещение Тогда
			КопияПриобретенныеТовары = ПриобретенныеТовары.Скопировать(); 
			ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,, "По приобретению", "По приобретению");
			СоздатьЗаказынаПеремещение(ПриобретениеТоваровУслуг, ОбрабатываемыйЗаказПоставщику, Результат, КопияПриобретенныеТовары);
			ЭтоПерваяИтерацияПоЗаказуПоставщику = Ложь;
		Иначе
			ИндексОбрабатываемогоЗаказаПоставщику = ИндексОбрабатываемогоЗаказаПоставщику + 1;
			ЭтоПерваяИтерацияПоЗаказуПоставщику = Истина;
		КонецЕсли;
		
		
		Запрос.Текст = ТекстЗапросаУничтоженияВременныхТаблицСЗаказамиНаПеремещения;
		Запрос.Выполнить();
		
	КонецЦикла;
	
	
	//+++ {{ ASP 10.09.2020 000008403 }}
	ЗапросПоОставшимсяЗаказамПоставщику = Новый Запрос;
	ЗапросПоОставшимсяЗаказамПоставщику.МенеджерВременныхТаблиц = МенеджерВТ;
	ЗапросПоОставшимсяЗаказамПоставщику.УстановитьПараметр("ЗаказыПоставщику", МассивОставшихсяЗаказовПоставщику);
	ЗапросПоОставшимсяЗаказамПоставщику.Текст =
		"ВЫБРАТЬ
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.СкладОприходования КАК СкладОприходования,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказКлиента КАК ЗаказКлиента,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Номенклатура КАК Номенклатура,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Характеристика КАК Характеристика,
		|	СУММА(СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Количество) КАК Количество
		|ПОМЕСТИТЬ СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам
		|ИЗ
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам КАК СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам
		|ГДЕ
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказПоставщику В(&ЗаказыПоставщику)
		|
		|СГРУППИРОВАТЬ ПО
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.СкладОприходования,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказКлиента,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Номенклатура,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
		|		ИНАЧЕ ЗаказКлиентаТовары.Склад
		|	КОНЕЦ КАК СкладПродажи,
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.СкладОприходования КАК СкладОприходования,
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.ЗаказКлиента КАК ЗаказКлиента,
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.Номенклатура КАК Номенклатура,
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.Характеристика КАК Характеристика,
		|	МАКСИМУМ(СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.Количество) КАК КоличествоВПриобретении,
		|	СУММА(ЕСТЬNULL(ЗаказКлиентаТовары.Количество, 0)) КАК КоличествоВЗаказах
		|ИЗ
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам КАК СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО (СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка)
		|			И (СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.Номенклатура = ЗаказКлиентаТовары.Номенклатура)
		|			И (СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.Характеристика = ЗаказКлиентаТовары.Характеристика)
		|			И (НЕ ЗаказКлиентаТовары.Отменено) 
		// ASP_Мочалина 27.02.24
		//|			И (ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно)) 
		|			И (ЗаказКлиентаТовары.Обособленно = ИСТИНА)
		|			И (ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|					И СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.СкладОприходования <> ЗаказКлиентаТовары.Ссылка.Склад
		|				ИЛИ СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.СкладОприходования <> ЗаказКлиентаТовары.Склад)
		|
		|СГРУППИРОВАТЬ ПО
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.СкладОприходования,
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.ЗаказКлиента,
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.Номенклатура,
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.Характеристика,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
		|		ИНАЧЕ ЗаказКлиентаТовары.Склад
		|	КОНЕЦ
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЕСТЬNULL(ЗаказКлиентаТовары.Количество, 0)) > 0
		|ИТОГИ
		|	МАКСИМУМ(СкладОприходования)
		|ПО
		|	СкладПродажи";
	
	ЗначенияРеквизитовПриобретения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПриобретениеТоваровУслуг, "Организация, Подразделение, ВариантПриемкиТоваров");
	
	ВыборкаПоСкладамПродажи = ЗапросПоОставшимсяЗаказамПоставщику.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоСкладамПродажи.Следующий() Цикл
		
		Перемещение = Документы.ЗаказНаПеремещение.СоздатьДокумент();
		Перемещение.ДокументОснование = ПриобретениеТоваровУслуг;
		Перемещение.Дата = ТекущаяДата();
		Перемещение.СкладОтправитель = ВыборкаПоСкладамПродажи.СкладОприходования;
		Перемещение.СкладПолучатель = ВыборкаПоСкладамПродажи.СкладПродажи;
		Перемещение.Ответственный = Пользователи.ТекущийПользователь();
		Перемещение.Статус = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
		Перемещение.ВариантПриемкиТоваров = ЗначенияРеквизитовПриобретения.ВариантПриемкиТоваров;
		ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,,"" + ВыборкаЗаказовКлиентов.СкладПродажи + Символы.ПС + ВыборкаЗаказовКлиентов.СкладОприходования, "Склад продажи / склад оприходования. ПроизвестиНакопление");
		Перемещение.Организация = ЗначенияРеквизитовПриобретения.Организация;
		Перемещение.Подразделение = ЗначенияРеквизитовПриобретения.Подразделение;
		Перемещение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
		Перемещение.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
		
		ВыборкаТоваров = ВыборкаПоСкладамПродажи.Выбрать();
		
		Пока ВыборкаТоваров.Следующий() Цикл
			КолвоКПеремещению = Мин(ВыборкаТоваров.КоличествоВПриобретении, ВыборкаТоваров.КоличествоВЗаказах);
			Если КолвоКПеремещению <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйТовар = Перемещение.Товары.Добавить();
			НовыйТовар.Количество = КолвоКПеремещению;
			НовыйТовар.КоличествоУпаковок = КолвоКПеремещению;
			НовыйТовар.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
			НовыйТовар.НачалоОтгрузки = ТекущаяДата() + ((24*60*60)*3);
			НовыйТовар.Номенклатура = ВыборкаТоваров.Номенклатура;
			НовыйТовар.Назначение = Справочники.Назначения.НайтиПоРеквизиту("Заказ", ВыборкаТоваров.ЗаказКлиента);
			НовыйТовар.Характеристика = ВыборкаТоваров.Характеристика;
		КонецЦикла;
		
		Если Перемещение.Товары.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПолучитьСообщенияПользователю(Истина);
		
		Попытка
			Перемещение.Записать(РежимЗаписиДокумента.Проведение);
			Результат.СозданныеДокументы.Добавить(Перемещение.Ссылка);
		Исключение
			ТекстОшибки = "Не удалось создать новый Заказ на перемещение на склад " + Строка(ВыборкаПоСкладамПродажи.СкладПродажи);
			Если Перемещение.Товары.Количество() > 0 Тогда
				ТекстОшибки = ТекстОшибки + " товара(ов) ";
				Для Каждого СтрокаТЧ Из Перемещение.Товары Цикл
					ТекстОшибки = ТекстОшибки + Строка(СтрокаТЧ.Номенклатура) + Символы.ПС;
				КонецЦикла;
			КонецЕсли;
			ТекстОшибки = ТекстОшибки + " по причине:" + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			
			МассивСообщенийПользователю = ПолучитьСообщенияПользователю(Истина);
			СтрокаСообщений = "";
			Для Каждого Сообщение Из МассивСообщенийПользователю Цикл
				СтрокаСообщений = СтрокаСообщений + Сообщение.Текст + Символы.ПС;
			КонецЦикла;
			
			СтрокаСообщений = ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС + СтрокаСообщений);
			ВесьТекстОшибки = ТекстОшибки + СтрокаСообщений;
			
			Результат.Ошибки.Добавить(ВесьТекстОшибки);
			
			//ASP_Hlopkov 21.10.2020+
			ЗаписьЖурналаРегистрации("Данные.Изменение", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЗаказНаПеремещение,, ВесьТекстОшибки + Символы.ПС + ОписаниеОшибки()); 
			//ASP_Hlopkov 21.10.2020-
			
		КонецПопытки;
		
	КонецЦикла;
	//--- {{ ASP 10.09.2020 000008403 }}
	
КонецПроцедуры

Процедура СоздатьЗаказынаПеремещение(ПриобретениеТоваровУслуг, ЗаказПоставщику, Результат, ПриобретенныеТовары = Неопределено)
	
	ЗначенияРеквизитовПриобретения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПриобретениеТоваровУслуг, "Организация, Подразделение, ВариантПриемкиТоваров, Склад");
	
	ЗапросПотребностейКПеремещению = Новый Запрос;
	
	Если ПриобретенныеТовары = Неопределено Тогда
		
		ЗапросПотребностейКПеремещению.Текст =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
		|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
		|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
		|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЗаказКлиента,
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
		|	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ СтрокиЗаказаПоставщику
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &ЗаказПоставщику
		|	И ЗаказПоставщикуТовары.Ссылка.Проведен
		|	И ЗаказПоставщикуТовары.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Закрыт)
		|	И ЗаказПоставщикуТовары.Склад = &СкладПТУ
		|	И НЕ ЗаказПоставщикуТовары.Отменено
		|	И ЗаказПоставщикуТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
		|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
		|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
		|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ЗаказПоставщикуТовары.Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтрокиЗаказаПоставщику.ЗаказКлиента КАК ЗаказКлиента
		|ИЗ
		|	СтрокиЗаказаПоставщику КАК СтрокиЗаказаПоставщику
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
		|		ПО ((ВЫРАЗИТЬ(СтрокиЗаказаПоставщику.ЗаказКлиента КАК Документ.ЗаказКлиента)) = СостоянияЗаказовКлиентов.Заказ)
		|ГДЕ
		|	СтрокиЗаказаПоставщику.ЗаказКлиента <> НЕОПРЕДЕЛЕНО
		|	И СтрокиЗаказаПоставщику.ЗаказКлиента.Проведен
		|	И СостоянияЗаказовКлиентов.Состояние ЕСТЬ НЕ NULL 
		|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяОплатаПослеОтгрузки)
		|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ГотовКЗакрытию)
		|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт)
		|";
			//ASP_Hlopkov 19.11.2020+
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			ЗапросПотребностейКПеремещению.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
			ЗапросПотребностейКПеремещению.УстановитьПараметр("СкладПТУ", ЗначенияРеквизитовПриобретения.Склад);
			
			ТЗСЗаказами = ЗапросПотребностейКПеремещению.Выполнить().Выгрузить();
			
			ЗапросПотребностейКПеремещениюПродолжение = Новый Запрос;
			
			ЗапросПотребностейКПеремещениюПродолжение.Текст =
			"ВЫБРАТЬ
			|	ТЗСЗаказами.ЗаказКлиента КАК ЗаказКлиента
			|ПОМЕСТИТЬ ВТЗаказыКлиентов
			|ИЗ
			|	&ТЗСЗаказами КАК ТЗСЗаказами
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТЗаказыКлиентов.ЗаказКлиента КАК ЗаказКлиента,
			|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
			|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
			|	ЗаказКлиентаТовары.Склад КАК СкладПродажи,
			|	&СкладПТУ КАК СкладОприходования,
			|	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество
			|ИЗ
			|	ВТЗаказыКлиентов КАК ВТЗаказыКлиентов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|		ПО (ВТЗаказыКлиентов.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка)
			|			И (НЕ ЗаказКлиентаТовары.Отменено)
			
			// ASP_Мочалина 27.02.24
			//|			И (ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно))
			|			И (ЗаказКлиентаТовары.Обособленно = ИСТИНА)
			|			И (ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)))
			|			И (ЗаказКлиентаТовары.Склад <> &СкладПТУ)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТЗаказыКлиентов.ЗаказКлиента,
			|	ЗаказКлиентаТовары.Номенклатура,
			|	ЗаказКлиентаТовары.Характеристика,
			|	ЗаказКлиентаТовары.Склад
			|	
			|УПОРЯДОЧИТЬ ПО
			|	ЗаказКлиента,
			|	СкладПродажи,
			|	Номенклатура,
			|	Характеристика
			|";
			
			ЗапросПотребностейКПеремещениюПродолжение.УстановитьПараметр("СкладПТУ", ЗначенияРеквизитовПриобретения.Склад);
			ЗапросПотребностейКПеремещениюПродолжение.УстановитьПараметр("ТЗСЗаказами", ТЗСЗаказами);
			
			РезПродолжения = ЗапросПотребностейКПеремещениюПродолжение.Выполнить();
			ТоварыЗаказовКлиентов = РезПродолжения.Выгрузить();
			ТоварыЗаказовКлиентов.Индексы.Добавить("ЗаказКлиента, Номенклатура, Характеристика");
			
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ
			//|	СтрокиЗаказаПоставщику.ЗаказКлиента КАК ЗаказКлиента,
			//|	СтрокиЗаказаПоставщику.Номенклатура КАК Номенклатура,
			//|	СтрокиЗаказаПоставщику.Характеристика КАК Характеристика,
			//|	СУММА(СтрокиЗаказаПоставщику.Количество) КАК Количество
			//|ИЗ
			//|	СтрокиЗаказаПоставщику КАК СтрокиЗаказаПоставщику
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
			//|		ПО ((ВЫРАЗИТЬ(СтрокиЗаказаПоставщику.ЗаказКлиента КАК Документ.ЗаказКлиента)) = СостоянияЗаказовКлиентов.Заказ)
			//|ГДЕ
			//|	СтрокиЗаказаПоставщику.ЗаказКлиента <> НЕОПРЕДЕЛЕНО
			//|	И СтрокиЗаказаПоставщику.ЗаказКлиента.Проведен
			//|	И СостоянияЗаказовКлиентов.Состояние ЕСТЬ НЕ NULL 
			//|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяОплатаПослеОтгрузки)
			//|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ГотовКЗакрытию)
			//|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт)
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	СтрокиЗаказаПоставщику.ЗаказКлиента,
			//|	СтрокиЗаказаПоставщику.Номенклатура,
			//|	СтрокиЗаказаПоставщику.Характеристика";
		//ЗапросПотребностейКПеремещению.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
		//ЗапросПотребностейКПеремещению.УстановитьПараметр("СкладПТУ", ЗначенияРеквизитовПриобретения.Склад);
		
		//МассивРезультатов = ЗапросПотребностейКПеремещению.ВыполнитьПакет();
		//
		//ТоварыЗаказовКлиентов = МассивРезультатов[2].Выгрузить();
		//ТоварыЗаказовКлиентов.Индексы.Добавить("ЗаказКлиента, Номенклатура, Характеристика");
		
		//ТоварыЗаказаПоставщику = МассивРезультатов[3].Выгрузить();
		
		
		//СтруктураОтбораТоваровЗаказовКлиентов = Новый Структура("ЗаказКлиента, Номенклатура, Характеристика");
		//МассивСтрокДляВторогоПрохода = Новый Массив;
		//Для Каждого СтрокаТоваровЗаказаПоставщику Из ТоварыЗаказаПоставщику Цикл
		//	ДобавитьНедостающееПоАналитикеКолвоПриПодготовкеПотребностейКПеремещению(СтрокаТоваровЗаказаПоставщику, ТоварыЗаказовКлиентов,
		//		СтруктураОтбораТоваровЗаказовКлиентов, ЗначенияРеквизитовПриобретения, МассивСтрокДляВторогоПрохода);
		//КонецЦикла;
		//Для Каждого СтрокаТоваровЗаказаПоставщику Из МассивСтрокДляВторогоПрохода Цикл
		//	ДобавитьНедостающееПоАналитикеКолвоПриПодготовкеПотребностейКПеремещению(СтрокаТоваровЗаказаПоставщику, ТоварыЗаказовКлиентов,
		//		СтруктураОтбораТоваровЗаказовКлиентов, ЗначенияРеквизитовПриобретения, Неопределено);
		//КонецЦикла;
		
		ЗапросПотребностейКПеремещению.Текст =
			"ВЫБРАТЬ
			|	ТоварыЗаказовКлиентов.ЗаказКлиента КАК ЗаказКлиента,
			|	ТоварыЗаказовКлиентов.СкладПродажи КАК СкладПродажи,
			|	ТоварыЗаказовКлиентов.СкладОприходования КАК СкладОприходования,
			|	ТоварыЗаказовКлиентов.Номенклатура КАК Номенклатура,
			|	ТоварыЗаказовКлиентов.Характеристика КАК Характеристика,
			|	ТоварыЗаказовКлиентов.Количество КАК Количество
			|ПОМЕСТИТЬ ТаблицаИсточник
			|ИЗ
			|	&ТоварыЗаказовКлиентов КАК ТоварыЗаказовКлиентов
			|;";
		ЗапросПотребностейКПеремещению.УстановитьПараметр("ТоварыЗаказовКлиентов", ТоварыЗаказовКлиентов);
		ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,,"По заказу клиента", "По заказу клиента");
		
	Иначе
		
		ЗапросПотребностейКПеремещению.Текст =
			"ВЫБРАТЬ
			|	ПриобретенныеТовары.ЗаказКлиента КАК ЗаказКлиента,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
			|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
			|		ИНАЧЕ ЗаказКлиентаТовары.Склад
			|	КОНЕЦ КАК СкладПродажи,
			|	&СкладОприходования КАК СкладОприходования,
			|	ПриобретенныеТовары.Номенклатура КАК Номенклатура,
			|	ПриобретенныеТовары.Характеристика КАК Характеристика,
			|	ПриобретенныеТовары.КРезервированию КАК Количество
			|ПОМЕСТИТЬ ТаблицаИсточник
			|ИЗ
			|	&ПриобретенныеТовары КАК ПриобретенныеТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|		ПО (ПриобретенныеТовары.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
			|			И ЗаказКлиентаТовары.Номенклатура = ПриобретенныеТовары.Номенклатура
			|			И ЗаказКлиентаТовары.Характеристика = ПриобретенныеТовары.Характеристика)
			|;";
		ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,,"По приобретению", "По Приобретению");
		ЗапросПотребностейКПеремещению.УстановитьПараметр("СкладОприходования", ЗначенияРеквизитовПриобретения.Склад);
		ЗапросПотребностейКПеремещению.УстановитьПараметр("ПриобретенныеТовары", ПриобретенныеТовары);
		
	КонецЕсли;
	
	ЗапросПотребностейКПеремещению.Текст = ЗапросПотребностейКПеремещению.Текст +
		"
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаИсточник.ЗаказКлиента КАК ЗаказКлиента,
		|	ТаблицаИсточник.СкладПродажи КАК СкладПродажи,
		|	ТаблицаИсточник.СкладОприходования КАК СкладОприходования,
		|	ТаблицаИсточник.Номенклатура КАК Номенклатура,
		|	ТаблицаИсточник.Характеристика КАК Характеристика,
		|	СУММА(ТаблицаИсточник.Количество) КАК Количество
		|ИЗ
		|	ТаблицаИсточник КАК ТаблицаИсточник
		//ASP_Hlopkov 19.11.2020+
		|ГДЕ
		|	ТаблицаИсточник.СкладПродажи <> ТаблицаИсточник.СкладОприходования
		//ASP_Hlopkov 19.11.2020-
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаИсточник.ЗаказКлиента,
		|	ТаблицаИсточник.СкладПродажи,
		|	ТаблицаИсточник.СкладОприходования,
		|	ТаблицаИсточник.Номенклатура,
		|	ТаблицаИсточник.Характеристика
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказКлиента,
		|	Номенклатура,
		|	Характеристика
		|ИТОГИ
		|	МАКСИМУМ(СкладОприходования)
		|ПО
		|	ЗаказКлиента,
		|	СкладПродажи";
	
	//ASP_Hlopkov 09.10.2020+
	Рез = ЗапросПотребностейКПеремещению.Выполнить();
	//ТЗРез = Рез.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);	
	//ASP_Hlopkov 09.10.2020-
	
	ВыборкаПервогоУровня = ЗапросПотребностейКПеремещению.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПервогоУровня.Следующий() Цикл
		
		ВыборкаЗаказовКлиентов = ВыборкаПервогоУровня.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		СтруктураОтбораПриобретенных = Новый Структура("Номенклатура, Характеристика");
		
		Пока ВыборкаЗаказовКлиентов.Следующий() Цикл
			
			
			
			//собственно, создание Заказа на перемещение
			
			Перемещение = Неопределено; //ASP_Dante 02/11/20 Для каждого заказа клиента свой заказ на перемещение.
			
			Если ПриобретенныеТовары <> Неопределено //ЭТОТ БЛОК УДАЛИТЬ
			 И ПриобретенныеТовары.Найти(ВыборкаЗаказовКлиентов.ЗаказКлиента, "ЗаказКлиента") = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
	#Область ПостановкаВРезервВСуществующихЗаказахНаПеремещениеИлиСозданиеЗаказаНаПеремещение //+++ {{ ASP 11.11.2020 000008970 }} обрамлено в область
			
			//ASP_Hlopkov 09.10.2020+ проверяем есть ли уже созданные заказы на перемещение с этим назначением
			Запрос = Новый Запрос;
			Запрос.Текст =
			
			    "ВЫБРАТЬ
				|	ЗаказНаПеремещениеТовары.Ссылка КАК Ссылка,
				|	ЗаказНаПеремещениеТовары.Номенклатура КАК Номенклатура,
				|	ЗаказНаПеремещениеТовары.ВариантОбеспечения КАК ВариантОбеспечения,
				|	ЗаказНаПеремещениеТовары.Назначение.Заказ КАК ЗаказКлиента,
				|	ЗаказНаПеремещениеТовары.Назначение КАК Назначение,
				//ASP_Hlopkov 15.10.2020+
				|	СУММА(ЗаказНаПеремещениеТовары.Количество) КАК Количество
				//ASP_Hlopkov 15.10.2020-
				|ИЗ
				|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
				|ГДЕ
				|	ЗаказНаПеремещениеТовары.Назначение.Заказ = &Заказ
				|	И НЕ ЗаказНаПеремещениеТовары.Ссылка.ПометкаУдаления
				//ASP_Hlopkov 20.10.2020+
				//|	И НЕ ЗаказНаПеремещениеТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
				//ASP_Hlopkov 20.10.2020-
				//ASP_Hlopkov 15.10.2020+
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказНаПеремещениеТовары.Ссылка,
				|	ЗаказНаПеремещениеТовары.Номенклатура,
				|	ЗаказНаПеремещениеТовары.ВариантОбеспечения,
				|	ЗаказНаПеремещениеТовары.Назначение.Заказ,
				|	ЗаказНаПеремещениеТовары.Назначение
				|
				//ASP_Hlopkov 15.10.2020-
				|УПОРЯДОЧИТЬ ПО
				//|	Ссылка,
				|	Номенклатура,
				|	ЗаказНаПеремещениеТовары.Ссылка.Дата
				|ИТОГИ
				|	СУММА(Количество)
				|ПО
				|	Номенклатура,
				|	Назначение";
			
			Запрос.УстановитьПараметр("Заказ", ВыборкаЗаказовКлиентов.ЗаказКлиента);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			//ТЗРез = РезультатЗапроса.Выгрузить();
			//Если есть обходим товары и пытаемся поставить в резерв
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				ТЗНеПоставленых = Новый ТаблицаЗначений;
				
				ТЗНеПоставленых.Колонки.Добавить("ЗаказКлиента");
				ТЗНеПоставленых.Колонки.Добавить("Номенклатура");
				ТЗНеПоставленых.Колонки.Добавить("Назначение");
				ТЗНеПоставленых.Колонки.Добавить("Количество");
				ТЗНеПоставленых.Колонки.Добавить("НужноСоздаватьЗаказ");
				
				ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаНоменклатура.Следующий() Цикл
					
					ВыборкаНазначение = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаНазначение.Следующий() Цикл
						
						ТЗТоваровЗаказа = ВыборкаНазначение.ЗаказКлиента.Товары.Выгрузить(,"Номенклатура, Количество");
						ТЗТоваровЗаказа.Свернуть("Номенклатура", "Количество");
						
						МассивНайденныхТоваров = ТЗТоваровЗаказа.НайтиСтроки(Новый Структура("Номенклатура", ВыборкаНазначение.Номенклатура));
						
						Если МассивНайденныхТоваров.Количество() > 0 Тогда
							СтрокаНайденогоТовара = МассивНайденныхТоваров[0];
							
							КоличествоТовараВЗаказе	= СтрокаНайденогоТовара.Количество;
						КонецЕсли;	
						
						КоличествоЗарезервировано = 0;
						
						ВыборкаДетальныеЗаписи = ВыборкаНазначение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							ЗаказПеремещОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
							
							МассивСтрокТоваров = ЗаказПеремещОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура, Назначение", ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Назначение));
							
							Если МассивСтрокТоваров.Количество() > 0 Тогда
								СтрокаТовара = МассивСтрокТоваров[0];
								
								Если КоличествоЗарезервировано < КоличествоТовараВЗаказе Тогда
									Если СтрокаТовара.Количество <= КоличествоТовараВЗаказе Тогда
										
										СтрокаТовара.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
									
										Попытка
											ЗаказПеремещОбъект.Записать(РежимЗаписиДокумента.Проведение);
											
											КоличествоЗарезервировано = КоличествоЗарезервировано + СтрокаТовара.Количество;
										Исключение
											ЗаписьЖурналаРегистрации("Данные.Проведение", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Документы.ЗаказНаПеремещение,, "Не удалось поставить в резерв товар " + ВыборкаДетальныеЗаписи.Номенклатура + ", в заказе " + ВыборкаДетальныеЗаписи.Ссылка + Символы.ПС + ОписаниеОшибки());
											Сообщить("Не удалось поставить в резерв товар " + ВыборкаДетальныеЗаписи.Номенклатура + ", в заказе " + ВыборкаДетальныеЗаписи.Ссылка);
										КонецПопытки;
										//ASP_Hlopkov 20.10.2020+
										Если ТЗНеПоставленых.Количество() = 0 Тогда
											НоваяСтрока = ТЗНеПоставленых.Добавить();
										
											НоваяСтрока.ЗаказКлиента = ВыборкаДетальныеЗаписи.ЗаказКлиента;
											НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
											НоваяСтрока.Назначение 	 = ВыборкаДетальныеЗаписи.Назначение;
											НоваяСтрока.Количество	 = ВыборкаДетальныеЗаписи.Количество;
										Иначе
											МассивНайденойСтроки = ТЗНеПоставленых.НайтиСтроки(Новый Структура("ЗаказКлиента, Номенклатура, Назначение", ВыборкаДетальныеЗаписи.ЗаказКлиента, ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Назначение));
											
											Если МассивНайденойСтроки.Количество() > 0 Тогда
												НоваяСтрока = МассивНайденойСтроки[0];
												НоваяСтрока.Количество = НоваяСтрока.Количество + ВыборкаДетальныеЗаписи.Количество;
											Иначе
												НоваяСтрока = ТЗНеПоставленых.Добавить();
										
												НоваяСтрока.ЗаказКлиента = ВыборкаДетальныеЗаписи.ЗаказКлиента;
												НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
												НоваяСтрока.Назначение 	 = ВыборкаДетальныеЗаписи.Назначение;
												НоваяСтрока.Количество	 = ВыборкаДетальныеЗаписи.Количество;
											КонецЕсли;
											
										КонецЕсли;
										
										Если (?(НоваяСтрока <> Неопределено, НоваяСтрока.Количество, 0) + КоличествоЗарезервировано) >= КоличествоТовараВЗаказе Тогда
											Если НоваяСтрока <> Неопределено Тогда
												НоваяСтрока.НужноСоздаватьЗаказ = Ложь;
											КонецЕсли;	
										Иначе
											Если НоваяСтрока <> Неопределено Тогда
												НоваяСтрока.НужноСоздаватьЗаказ = Истина;
											КонецЕсли;	
										КонецЕсли;	
										
									КонецЕсли;
									
								Иначе
									
									Если ТЗНеПоставленых.Количество() = 0 Тогда
										НоваяСтрока = ТЗНеПоставленых.Добавить();
												
										НоваяСтрока.ЗаказКлиента = ВыборкаДетальныеЗаписи.ЗаказКлиента;
										НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
										НоваяСтрока.Назначение 	 = ВыборкаДетальныеЗаписи.Назначение;
										НоваяСтрока.Количество	 = ВыборкаДетальныеЗаписи.Количество;
									Иначе
										МассивНайденойСтроки = ТЗНеПоставленых.НайтиСтроки(Новый Структура("ЗаказКлиента, Номенклатура, Назначение", ВыборкаДетальныеЗаписи.ЗаказКлиента, ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Назначение));
												
										Если МассивНайденойСтроки.Количество() > 0 Тогда
											НоваяСтрока = МассивНайденойСтроки[0];
											НоваяСтрока.Количество = НоваяСтрока.Количество + ВыборкаДетальныеЗаписи.Количество;
										Иначе
											НоваяСтрока = ТЗНеПоставленых.Добавить();
											
											НоваяСтрока.ЗаказКлиента = ВыборкаДетальныеЗаписи.ЗаказКлиента;
											НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
											НоваяСтрока.Назначение 	 = ВыборкаДетальныеЗаписи.Назначение;
											НоваяСтрока.Количество	 = ВыборкаДетальныеЗаписи.Количество;
										КонецЕсли;
										
									КонецЕсли;	
									
									Если (?(НоваяСтрока <> Неопределено, НоваяСтрока.Количество, 0) + КоличествоЗарезервировано) >= КоличествоТовараВЗаказе Тогда
										Если НоваяСтрока <> Неопределено Тогда
											НоваяСтрока.НужноСоздаватьЗаказ = Ложь;
										КонецЕсли;	
									Иначе
										Если НоваяСтрока <> Неопределено Тогда
											НоваяСтрока.НужноСоздаватьЗаказ = Истина;
										КонецЕсли;	
									КонецЕсли;
									//ASP_Hlopkov 20.10.2020-
								КонецЕсли;	
							КонецЕсли;	
						КонецЦикла;
					КонецЦикла;	
				КонецЦикла;	
			//ASP_Hlopkov 09.10.2020-
			Иначе	
			
				Перемещение = рефакторингСоздатьЗаказНаПеремещение(ПриобретениеТоваровУслуг, ВыборкаЗаказовКлиентов, ЗначенияРеквизитовПриобретения); //+++ {{ ASP 11.11.2020 000008970 }} проведен рефакторинг
				
			КонецЕсли;
			
	#КонецОбласти
			
			//Если ТЗНеПоставленых.Количество() > 0 Тогда
			Выборка = ВыборкаЗаказовКлиентов.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				//ASP_Hlopkov 20.10.2020+
				Если ТЗНеПоставленых <> Неопределено Тогда
					МассивНеПоставленых = ТЗНеПоставленых.НайтиСтроки(Новый Структура("ЗаказКлиента, Номенклатура", ВыборкаЗаказовКлиентов.ЗаказКлиента, Выборка.Номенклатура));
				
					Если МассивНеПоставленых.Количество() = 0 Тогда
						
						рефакторингДобавитьТоварВЗаказНаПеремещениеСоздавПриНеобходимостиПредварительноДокумент(Перемещение, Выборка, //+++ {{ ASP 11.11.2020 000008970 }} проведен рефакторинг
							ВыборкаЗаказовКлиентов, ПриобретениеТоваровУслуг, ЗначенияРеквизитовПриобретения, СтруктураОтбораПриобретенных, ПриобретенныеТовары);
						
					Иначе
						СтрокаМассива = МассивНеПоставленых[0];
						
						Если СтрокаМассива.НужноСоздаватьЗаказ Тогда
							
							рефакторингДобавитьТоварВЗаказНаПеремещениеСоздавПриНеобходимостиПредварительноДокумент(Перемещение, Выборка, //+++ {{ ASP 11.11.2020 000008970 }} проведен рефакторинг
								ВыборкаЗаказовКлиентов, ПриобретениеТоваровУслуг, ЗначенияРеквизитовПриобретения, СтруктураОтбораПриобретенных, ПриобретенныеТовары);
							
						КонецЕсли;	
						
					КонецЕсли;
					
				Иначе
					
					рефакторингДобавитьТоварВЗаказНаПеремещениеСоздавПриНеобходимостиПредварительноДокумент(Перемещение, Выборка, //+++ {{ ASP 11.11.2020 000008970 }} проведен рефакторинг
						ВыборкаЗаказовКлиентов, ПриобретениеТоваровУслуг, ЗначенияРеквизитовПриобретения, СтруктураОтбораПриобретенных, ПриобретенныеТовары);
					
				КонецЕсли;	
				//ASP_Hlopkov 20.10.2020-	
			КонецЦикла;
			
			
			//ASP_Hlopkov 19.10.2020+
			Если Перемещение = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			//ASP_Hlopkov 19.10.2020-

			
			Если Перемещение.Товары.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ПолучитьСообщенияПользователю(Истина);
			
			Попытка
				Перемещение.Записать(РежимЗаписиДокумента.Проведение);
				Результат.СозданныеДокументы.Добавить(Перемещение.Ссылка);
			Исключение
				ТекстОшибки = "Не удалось создать новый Заказ на перемещение";
				Если Перемещение.Товары.Количество() > 0 Тогда
					ТекстОшибки = ТекстОшибки + " с товаром(ами) ";
					Для Каждого СтрокаТЧ Из Перемещение.Товары Цикл
						ТекстОшибки = ТекстОшибки + Строка(СтрокаТЧ.Номенклатура) + Символы.ПС;
					КонецЦикла;
				КонецЕсли;
				ТекстОшибки = ТекстОшибки + "по причине:" + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				
				МассивСообщенийПользователю = ПолучитьСообщенияПользователю(Истина);
				СтрокаСообщений = "";
				Для Каждого Сообщение Из МассивСообщенийПользователю Цикл
					СтрокаСообщений = СтрокаСообщений + Сообщение.Текст + Символы.ПС;
				КонецЦикла;
				
				СтрокаСообщений = ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС + СтрокаСообщений);
				ВесьТекстОшибки = ТекстОшибки + СтрокаСообщений;
				
				Результат.Ошибки.Добавить(ВесьТекстОшибки);
				
				//ASP_Hlopkov 21.10.2020+
				ЗаписьЖурналаРегистрации("Данные.Изменение", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЗаказНаПеремещение,, ВесьТекстОшибки + Символы.ПС + ОписаниеОшибки()); 
				//ASP_Hlopkov 21.10.2020-
				
			КонецПопытки;
			
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

////+++ {{ ASP 11.11.2020 000008970 }} повторяющийся фрагмент кода в доработке от 20.10.2020 выделен в отдельную процедуру:
Процедура рефакторингДобавитьТоварВЗаказНаПеремещениеСоздавПриНеобходимостиПредварительноДокумент(Перемещение, Выборка, ВыборкаЗаказовКлиентов, ПриобретениеТоваровУслуг, ЗначенияРеквизитовПриобретения, СтруктураОтбораПриобретенных, ПриобретенныеТовары)
	
	Если Перемещение = Неопределено Тогда
		Перемещение = рефакторингСоздатьЗаказНаПеремещение(ПриобретениеТоваровУслуг, ВыборкаЗаказовКлиентов, ЗначенияРеквизитовПриобретения); //+++ {{ ASP 11.11.2020 000008970 }} проведен рефакторинг
	КонецЕсли;		
	КолвоКПеремещению = Выборка.Количество;
	//Если ПриобретенныеТовары <> Неопределено Тогда //ЭТОТ БЛОК УДАЛИТЬ
	//	ЗаполнитьЗначенияСвойств(СтруктураОтбораПриобретенных, Выборка);
	//	СтрокиПриобретенных = ПриобретенныеТовары.НайтиСтроки(СтруктураОтбораПриобретенных);
	//	Если СтрокиПриобретенных.Количество() = 0 Тогда
	//		Возврат;
	//	КонецЕсли;
	//	
	//	КолвоКПеремещению = Мин(КолвоКПеремещению, СтрокиПриобретенных[0].КРезервированию);
	//	Если КолвоКПеремещению = 0 Тогда
	//		Возврат;
	//	КонецЕсли;
	//	
	//	СтрокиПриобретенных[0].КРезервированию = 0;
	//КонецЕсли;
	//++ГТС 09.02.2021 Добавлена проверка по группе АналитическогоУчета, чтобы отсечь другую номенклатуру.   
	
	
	//Если Выборка.Номенклатура.ГруппаАналитическогоУчета=Справочники.ГруппыАналитическогоУчетаНоменклатуры.НайтиПоНаименованию("Тяжелые стеллажи",истина) Тогда  //ASP_Kalyanin 000027449 08.07.25   
	
		//--ГТС  09.02.2021 Добавлена проверка по группе АналитическогоУчета, чтобы отсечь другую номенклатуру.	
		
		НовыйТовар = Перемещение.Товары.Добавить();
		НовыйТовар.Количество = КолвоКПеремещению;
		НовыйТовар.КоличествоУпаковок = КолвоКПеремещению;
		НовыйТовар.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется;
		НовыйТовар.НачалоОтгрузки = ТекущаяДата() + ((24*60*60)*3);
		НовыйТовар.Номенклатура = Выборка.Номенклатура;
		НовыйТовар.Назначение = Справочники.Назначения.НайтиПоРеквизиту("Заказ", ВыборкаЗаказовКлиентов.ЗаказКлиента);
		НовыйТовар.Характеристика = Выборка.Характеристика;
		//ASP_Hlopkov 20.10.2020+
		НовыйТовар.ASP_ЗаказКлиента = ?(НовыйТовар.Назначение <> Справочники.Назначения.ПустаяСсылка(), НовыйТовар.Назначение.Заказ, Документы.ЗаказКлиента.ПустаяСсылка());
		//ASP_Hlopkov 20.10.2020-
		
	//++ГТС  09.02.2021 Добавлена проверка по группе АналитическогоУчета, чтобы отсечь другую номенклатуру.
		
	//КонецЕсли;   //ASP_Kalyanin 000027449 08.07.25 
	
	//--ГТС  09.02.2021 Добавлена проверка по группе АналитическогоУчета, чтобы отсечь другую номенклатуру. 
	
КонецПроцедуры

Функция рефакторингСоздатьЗаказНаПеремещение(ПриобретениеТоваровУслуг, ВыборкаЗаказовКлиентов, ЗначенияРеквизитовПриобретения)	
	Перемещение = Документы.ЗаказНаПеремещение.СоздатьДокумент();
	Перемещение.ДокументОснование = ПриобретениеТоваровУслуг;
	Перемещение.Дата = ТекущаяДата();
	Перемещение.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");
	Перемещение.СкладОтправитель = ВыборкаЗаказовКлиентов.СкладОприходования;
	Перемещение.СкладПолучатель = ВыборкаЗаказовКлиентов.СкладПродажи;
	Перемещение.Ответственный = Пользователи.ТекущийПользователь();
	Перемещение.Статус = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
	Перемещение.ВариантПриемкиТоваров = ЗначенияРеквизитовПриобретения.ВариантПриемкиТоваров;
	ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,,"" + ВыборкаЗаказовКлиентов.СкладПродажи + Символы.ПС + ВыборкаЗаказовКлиентов.СкладОприходования, "Склад продажи / склад оприходования. СоздатьЗаказ");
	Перемещение.Организация = ЗначенияРеквизитовПриобретения.Организация;
	Перемещение.Подразделение = ЗначенияРеквизитовПриобретения.Подразделение;
	Перемещение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	Перемещение.СпособДоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаЗаказовКлиентов.ЗаказКлиента, "СпособДоставки");
	Перемещение.Комментарий="Автоматически создан";
	Возврат Перемещение;
	
КонецФункции

//+++ {{ ASP 11.11.2020 000008970 }}
Процедура ДобавитьНедостающееПоАналитикеКолвоПриПодготовкеПотребностейКПеремещению(СтрокаТоваровЗаказаПоставщику, ТоварыЗаказовКлиентов, СтруктураОтбораТоваровЗаказовКлиентов, ЗначенияРеквизитовПриобретения, МассивСтрокДляВторогоПрохода)
	
	КолвоДляДобавления = СтрокаТоваровЗаказаПоставщику.Количество;
	ПодходящийСкладПродажи = Неопределено;
	
	ЗаполнитьЗначенияСвойств(СтруктураОтбораТоваровЗаказовКлиентов, СтрокаТоваровЗаказаПоставщику);
	ПодходящиеСтрокиЗаказовКлиентов = ТоварыЗаказовКлиентов.НайтиСтроки(СтруктураОтбораТоваровЗаказовКлиентов);
	
	Для Каждого ПодходящаяСтрокаЗаказовКлиентов Из ПодходящиеСтрокиЗаказовКлиентов Цикл
		ПодходящийСкладПродажи = ПодходящаяСтрокаЗаказовКлиентов.СкладПродажи;
		КолвоДляДобавления = КолвоДляДобавления - ПодходящаяСтрокаЗаказовКлиентов.Количество;
		Если КолвоДляДобавления <= 0 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если КолвоДляДобавления > 0 Тогда
		Если ПодходящийСкладПродажи = Неопределено Тогда
			СтрокиСТакимЗаказомКлиента = ТоварыЗаказовКлиентов.НайтиСтроки(Новый Структура("ЗаказКлиента", СтрокаТоваровЗаказаПоставщику.ЗаказКлиента));
			Если СтрокиСТакимЗаказомКлиента.Количество() > 0 Тогда
				ПодходящийСкладПродажи = СтрокиСТакимЗаказомКлиента[0].СкладПродажи;
			КонецЕсли;
		КонецЕсли;
		Если ПодходящийСкладПродажи = Неопределено И ТоварыЗаказовКлиентов.Количество() > 0 Тогда
			ПодходящийСкладПродажи = ТоварыЗаказовКлиентов[0].СкладПродажи;
		КонецЕсли;
		Если ПодходящийСкладПродажи = Неопределено И МассивСтрокДляВторогоПрохода <> Неопределено Тогда
			МассивСтрокДляВторогоПрохода.Добавить(СтрокаТоваровЗаказаПоставщику);
			Возврат; //если это уже второй проход, просто пропускаем эту строку
		КонецЕсли;
		
		НовСтрокаТоваровЗаказовКлиентов = ТоварыЗаказовКлиентов.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрокаТоваровЗаказовКлиентов, СтрокаТоваровЗаказаПоставщику);
		НовСтрокаТоваровЗаказовКлиентов.Количество = КолвоДляДобавления;
		НовСтрокаТоваровЗаказовКлиентов.СкладПродажи = ПодходящийСкладПродажи;
		НовСтрокаТоваровЗаказовКлиентов.СкладОприходования = ЗначенияРеквизитовПриобретения.Склад;
	КонецЕсли;
	
КонецПроцедуры
//--- {{ ASP 11.11.2020 000008970 }}

//+++ {{ ASP 25.03.2021 000010119 }}
Процедура УстановкаПараметровСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
	
	Если ИмяПараметра = "ASP_ВыполняетсяЗаполненияСебестоимостиДляБ24" Тогда
		ПараметрыСеанса.ASP_ВыполняетсяЗаполненияСебестоимостиДляБ24 = Ложь;
		Если УстановленныеПараметры <> Неопределено Тогда
			УстановленныеПараметры.Добавить("ASP_ВыполняетсяЗаполненияСебестоимостиДляБ24");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//--- {{ ASP 25.03.2021 000010119 }}


#Область ПоступлениеТоваровНаСклад

Процедура НакоплениеПоступившегоТовараВЗаказахНаПеремещение(ПоступлениеТоваровНаСклад, АдресРезультата) Экспорт
	
	Результат = Новый Структура("ДозаполненныеДокументы, СозданныеДокументы, Ошибки", Новый Массив, Новый Массив, Новый Массив);
	
	ПроизвестиНакоплениеПоступившегоТовараВЗаказахНаПеремещение(ПоступлениеТоваровНаСклад, Результат);
	
	ВозвращаемыйРезультат = Новый Структура;
	ИмяУведомления = "";
	Если Результат.Ошибки.Количество() = 1 Тогда
		ЕдинственнаяОшибка = Результат.Ошибки[0];
		Если ЕдинственнаяОшибка = "УжеСозданНаОснованииЗаказНаПеремещение"
		 Или ЕдинственнаяОшибка = "НетЗаказовПоставщикам" Тогда
			ИмяУведомления = ЕдинственнаяОшибка;
		КонецЕсли;
	ИначеЕсли Результат.ДозаполненныеДокументы.Количество() = 0
	 И Результат.СозданныеДокументы.Количество() = 0
	 И Результат.Ошибки.Количество() = 0 Тогда
		ИмяУведомления = "ПроверкаВыполнена";
	КонецЕсли;
	
	Если Не ПустаяСтрока(ИмяУведомления) Тогда
		ВозвращаемыйРезультат.Вставить("ИмяУведомления", ИмяУведомления);
		ПоместитьВоВременноеХранилище(ВозвращаемыйРезультат, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	
	ОбъектСДанными = Новый ТаблицаЗначений;
	ОбъектСДанными.Колонки.Добавить("Текст");
	ОбъектСДанными.Колонки.Добавить("Документ");
	ОбъектСДанными.Колонки.Добавить("Раздел");
	
	ПоказыватьРазделДозаполненныеДокументы = Ложь;
	Если Результат.ДозаполненныеДокументы.Количество() > 0 Тогда
		ПоказыватьРазделДозаполненныеДокументы = Истина;
		
		Для Каждого ДозаполненныйДокумент Из Результат.ДозаполненныеДокументы Цикл
			СтрокаТаблДокумента = ОбъектСДанными.Добавить();
			СтрокаТаблДокумента.Документ = ДозаполненныйДокумент;
			СтрокаТаблДокумента.Раздел = "ДозаполненныеДокументы";
		КонецЦикла;
	КонецЕсли;
	
	ПоказыватьРазделСозданныеДокументы = Ложь;
	Если Результат.СозданныеДокументы.Количество() > 0 Тогда
		ПоказыватьРазделСозданныеДокументы = Истина;
		
		Для Каждого СозданныйДокумент Из Результат.СозданныеДокументы Цикл
			СтрокаТаблДокумента = ОбъектСДанными.Добавить();
			СтрокаТаблДокумента.Документ = СозданныйДокумент;
			СтрокаТаблДокумента.Раздел = "СозданныеДокументы";
		КонецЦикла;
	КонецЕсли;
	
	ПоказыватьРазделОшибки = Ложь;
	Если Результат.Ошибки.Количество() > 0 Тогда
		ПоказыватьРазделОшибки = Истина;
		
		Для Каждого Ошибка Из Результат.Ошибки Цикл
			СтрокаТаблДокумента = ОбъектСДанными.Добавить();
			СтрокаТаблДокумента.Раздел = "Ошибки";
			Если ТипЗнч(Ошибка) = Тип("Структура") Тогда
				СтрокаТаблДокумента.Документ = Ошибка.Документ;
				СтрокаТаблДокумента.Текст = Ошибка.ТекстОшибки;
			Иначе
				СтрокаТаблДокумента.Текст = Строка(Ошибка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ОбъектСДанными", ОбъектСДанными);

	СхемаКомпоновкиДанных = ПолучитьОбщийМакет("асп_МакетУведомлений");
	
	НастройкиОсновногоВарианта = СхемаКомпоновкиДанных.ВариантыНастроек.Основной.Настройки.Структура;
	Если Не ПоказыватьРазделСозданныеДокументы Тогда
		НастройкиОсновногоВарианта[0].Использование = Ложь;
	КонецЕсли;
	Если Не ПоказыватьРазделДозаполненныеДокументы Тогда
		НастройкиОсновногоВарианта[1].Использование = Ложь;
	КонецЕсли;
	Если Не ПоказыватьРазделОшибки Тогда
		НастройкиОсновногоВарианта[2].Использование = Ложь;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, СхемаКомпоновкиДанных.НастройкиПоУмолчанию);

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных);

	ДокументРезультат = Новый ТабличныйДокумент;

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ДокументРезультат.ТолькоПросмотр = Истина;
	ДокументРезультат.ОтображатьСетку = Ложь;
	ДокументРезультат.ОтображатьЗаголовки = Ложь;
		
	ВозвращаемыйРезультат.Вставить("Уведомления", ДокументРезультат);
	ВозвращаемыйРезультат.Вставить("ПоступлениеТоваровНаСклад", ПоступлениеТоваровНаСклад);
	
	ПоместитьВоВременноеХранилище(ВозвращаемыйРезультат, АдресРезультата);
	
КонецПроцедуры

Процедура ПроизвестиНакоплениеПоступившегоТовараВЗаказахНаПеремещение(ПоступлениеТоваровНаСклад, Результат)
	ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,, "Накопление начало", "Накопление начало");
	ЗафиксированнаяТекущаяДата = ТекущаяДатаСеанса();
	//проверим, надо ли обрабатывать
	
	ЗапросДляПроверкиНеобходимостиОбработки = Новый Запрос;
	ЗапросДляПроверкиНеобходимостиОбработки.УстановитьПараметр("СсылкаНаПТНС", ПоступлениеТоваровНаСклад);
	
	ЗапросДляПроверкиНеобходимостиОбработки.Текст =
		"ВЫБРАТЬ
		|	ЗаказНаПеремещение.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказНаПеремещение КАК ЗаказНаПеремещение
		|ГДЕ
		|	ЗаказНаПеремещение.ДокументОснование = &СсылкаНаПТНС
		|	И НЕ ЗаказНаПеремещение.ПометкаУдаления";
	Если Не ЗапросДляПроверкиНеобходимостиОбработки.Выполнить().Пустой() Тогда
		Результат.Ошибки.Добавить("УжеСозданНаОснованииЗаказНаПеремещение");
		
		//ASP_Hlopkov 21.10.2020+
		ЗаписьЖурналаРегистрации("Данные.Изменение", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ПриобретениеТоваровУслуг,, "Уже создан на основании заказ на перемещение" + Символы.ПС + ОписаниеОшибки()); 
		//ASP_Hlopkov 21.10.2020-
		ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,, "Есть заказы по ПТУ", "Есть заказы по ПТУ");
		Возврат; //обработка требовалась, и она уже была выполнена
	КонецЕсли;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	ЗапросДляПроверкиНеобходимостиОбработки.МенеджерВременныхТаблиц = МенеджерВТ;
	
	ЗапросДляПроверкиНеобходимостиОбработки.Текст ="ВЫБРАТЬ
						|	ЗаказПоставщикуТовары.Ссылка КАК ЗаказПоставщику,
						|	ПоступлениеТоваровНаСкладТовары.Ссылка КАК ПоступлениеТоваровНаСклад,
						|	ПоступлениеТоваровНаСкладТовары.НомерСтроки КАК НомерСтроки,
						|	ПоступлениеТоваровНаСкладТовары.Номенклатура КАК Номенклатура,
						|	ПоступлениеТоваровНаСкладТовары.Характеристика КАК Характеристика,
						|	ПоступлениеТоваровНаСкладТовары.Ссылка.Склад КАК Склад,
						|	ВЫБОР
						|		КОГДА ПоступлениеТоваровНаСкладТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
						|				И ПоступлениеТоваровНаСкладТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
						|			ТОГДА ПоступлениеТоваровНаСкладТовары.Назначение.Заказ
						|		КОГДА ПоступлениеТоваровНаСкладТовары.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
						|				И ПоступлениеТоваровНаСкладТовары.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
						|			ТОГДА ПоступлениеТоваровНаСкладТовары.ЗаказКлиента
						|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
						|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
						|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
						|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
						|				И ЗаказПоставщикуТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
						|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
						|		ИНАЧЕ НЕОПРЕДЕЛЕНО
						|	КОНЕЦ КАК ЗаказКлиента,
						|	СУММА(ПоступлениеТоваровНаСкладТовары.Количество) КАК Количество
						|ПОМЕСТИТЬ ВТ_ДанныеПТУ
						|ИЗ
						|	Документ.ПоступлениеТоваровНаСклад.Товары КАК ПоступлениеТоваровНаСкладТовары
						|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
						|		ПО (ВЫБОР
						|				КОГДА ТИПЗНАЧЕНИЯ(ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
						|					ТОГДА ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение = ЗаказПоставщикуТовары.Ссылка
						|				КОГДА ТИПЗНАЧЕНИЯ(ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение) = ТИП(Документ.ПриобретениеТоваровУслуг)
						|					ТОГДА ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка
						|			КОНЕЦ)
						|			И (НЕ ЗаказПоставщикуТовары.Ссылка.ПометкаУдаления)
						|			И (НЕ ЗаказПоставщикуТовары.Отменено)
						|			И (ПоступлениеТоваровНаСкладТовары.Номенклатура = ЗаказПоставщикуТовары.Номенклатура)
						|			И (ПоступлениеТоваровНаСкладТовары.Характеристика = ЗаказПоставщикуТовары.Характеристика)
						|ГДЕ
						|	ПоступлениеТоваровНаСкладТовары.Ссылка = &СсылкаНаПТНС
						|	И ПоступлениеТоваровНаСкладТовары.Ссылка.Проведен
						|	И ПоступлениеТоваровНаСкладТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
						|
						|СГРУППИРОВАТЬ ПО
						|	ЗаказПоставщикуТовары.Ссылка,
						|	ВЫБОР
						|		КОГДА ПоступлениеТоваровНаСкладТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
						|				И ПоступлениеТоваровНаСкладТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
						|			ТОГДА ПоступлениеТоваровНаСкладТовары.Назначение.Заказ
						|		КОГДА ПоступлениеТоваровНаСкладТовары.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
						|				И ПоступлениеТоваровНаСкладТовары.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
						|			ТОГДА ПоступлениеТоваровНаСкладТовары.ЗаказКлиента
						|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
						|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
						|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
						|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
						|				И ЗаказПоставщикуТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
						|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
						|		ИНАЧЕ НЕОПРЕДЕЛЕНО
						|	КОНЕЦ,
						|	ПоступлениеТоваровНаСкладТовары.Ссылка,
						|	ПоступлениеТоваровНаСкладТовары.Номенклатура,
						|	ПоступлениеТоваровНаСкладТовары.Характеристика,
						|	ПоступлениеТоваровНаСкладТовары.Ссылка.Склад,
						|	ПоступлениеТоваровНаСкладТовары.НомерСтроки
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ВТ_ДанныеПТУ.ЗаказПоставщику КАК ЗаказПоставщику,
						|	ВТ_ДанныеПТУ.Номенклатура КАК Номенклатура,
						|	ВТ_ДанныеПТУ.Характеристика КАК Характеристика,
						|	ВТ_ДанныеПТУ.ЗаказКлиента КАК ЗаказКлиента,
						|	ВТ_ДанныеПТУ.Склад КАК СкладОприходования,
						|	ВЫБОР
						|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
						|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
						|		ИНАЧЕ ЗаказКлиентаТовары.Склад
						|	КОНЕЦ КАК СкладПродажи,
						|	СУММА(ВТ_ДанныеПТУ.Количество) КАК Количество
						|ПОМЕСТИТЬ СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам
						|ИЗ
						|	ВТ_ДанныеПТУ КАК ВТ_ДанныеПТУ
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
						|		ПО ВТ_ДанныеПТУ.ЗаказКлиента = СостоянияЗаказовКлиентов.Заказ
						|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
						|		ПО ВТ_ДанныеПТУ.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
						|			И (ЗаказКлиентаТовары.Номенклатура = ВТ_ДанныеПТУ.Номенклатура)
						|			И (ЗаказКлиентаТовары.Характеристика = ВТ_ДанныеПТУ.Характеристика)
						|ГДЕ
						|	СостоянияЗаказовКлиентов.Состояние ЕСТЬ НЕ NULL 
						|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяОплатаПослеОтгрузки)
						|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ГотовКЗакрытию)
						|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт)
						|
						|СГРУППИРОВАТЬ ПО
						|	ВЫБОР
						|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
						|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
						|		ИНАЧЕ ЗаказКлиентаТовары.Склад
						|	КОНЕЦ,
						|	ВТ_ДанныеПТУ.ЗаказПоставщику,
						|	ВТ_ДанныеПТУ.Номенклатура,
						|	ВТ_ДанныеПТУ.Характеристика,
						|	ВТ_ДанныеПТУ.ЗаказКлиента,
						|	ВТ_ДанныеПТУ.Склад
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ РАЗЛИЧНЫЕ
						|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказПоставщику КАК ЗаказПоставщику,
						|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказПоставщику.НомерПоДаннымПоставщика КАК НомерПоДаннымПоставщика
						|ИЗ
						|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам КАК СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам";
	
	ЗапросДляПроверкиНеобходимостиОбработки.УстановитьПараметр("ТекущаяДата", ЗафиксированнаяТекущаяДата);
	ВыборкаЗаказовПоставщикам = ЗапросДляПроверкиНеобходимостиОбработки.Выполнить().Выбрать();
	
	
	МассивОбрабатываемыхЗаказовПоставщикам = Новый Массив;
	МассивОставшихсяЗаказовПоставщику = Новый Массив;
	Пока ВыборкаЗаказовПоставщикам.Следующий() Цикл
		Если ПустаяСтрока(ВыборкаЗаказовПоставщикам.НомерПоДаннымПоставщика) Тогда
			МассивОставшихсяЗаказовПоставщику.Добавить(ВыборкаЗаказовПоставщикам.ЗаказПоставщику); //+++ {{ ASP 10.09.2020 000008403 }}
		Иначе
			МассивОбрабатываемыхЗаказовПоставщикам.Добавить(ВыборкаЗаказовПоставщикам.ЗаказПоставщику);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивОбрабатываемыхЗаказовПоставщикам.Количество() = 0
	 И МассивОставшихсяЗаказовПоставщику.Количество() = 0 Тогда
		Результат.Ошибки.Добавить("НетЗаказовПоставщикам");
		
		//ASP_Hlopkov 21.10.2020+
		ЗаписьЖурналаРегистрации("Данные.Изменение", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ПриобретениеТоваровУслуг,, "Нет заказов поставщикам" + Символы.ПС + ОписаниеОшибки()); 
		//ASP_Hlopkov 21.10.2020-
		
		Возврат; //нет Заказов поставщикам, по которым требуется обработка
	КонецЕсли;
	
	//ASP_Hlopkov 20.11.2020+
	ТекстЗапросаВТИзПроверкиНеобходимости = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	|			ТОГДА ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение
	|		КОГДА ТИПЗНАЧЕНИЯ(ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение) = ТИП(Документ.ПриобретениеТоваровУслуг)
	|			ТОГДА ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение.ЗаказПоставщику
	|	КОНЕЦ КАК ЗаказПоставщику,
	|	ПоступлениеТоваровНаСкладТовары.Ссылка КАК ПриобретениеТоваровУслуг,
	|	ПоступлениеТоваровНаСкладТовары.НомерСтроки КАК НомерСтроки,
	|	ПоступлениеТоваровНаСкладТовары.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровНаСкладТовары.Характеристика КАК Характеристика,
	|	ПоступлениеТоваровНаСкладТовары.Ссылка.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровНаСкладТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ПоступлениеТоваровНаСкладТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровНаСкладТовары.Назначение.Заказ
	|		КОГДА ПоступлениеТоваровНаСкладТовары.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ПоступлениеТоваровНаСкладТовары.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровНаСкладТовары.ЗаказКлиента
	|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
	|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказКлиента,
	|	СУММА(ПоступлениеТоваровНаСкладТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ СодержимоеЭтогоПТУ
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ПРАВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровНаСклад.Товары КАК ПоступлениеТоваровНаСкладТовары
	|		ПО (ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	|						ТОГДА ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение = ЗаказПоставщикуТовары.Ссылка
	|					КОГДА ТИПЗНАЧЕНИЯ(ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение) = ТИП(Документ.ПриобретениеТоваровУслуг)
	|						ТОГДА ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка
	|				КОНЕЦ
	|				И НЕ ЗаказПоставщикуТовары.Ссылка.ПометкаУдаления
	|				И НЕ ЗаказПоставщикуТовары.Отменено
	|				И ПоступлениеТоваровНаСкладТовары.Номенклатура = ЗаказПоставщикуТовары.Номенклатура
	|				И ПоступлениеТоваровНаСкладТовары.Характеристика = ЗаказПоставщикуТовары.Характеристика)
	|ГДЕ
	|	ПоступлениеТоваровНаСкладТовары.Ссылка = &СсылкаНаПТНС
	|	И ПоступлениеТоваровНаСкладТовары.Ссылка.Проведен
	|	И ПоступлениеТоваровНаСкладТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
	|			ТОГДА ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение
	|		КОГДА ТИПЗНАЧЕНИЯ(ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение) = ТИП(Документ.ПриобретениеТоваровУслуг)
	|			ТОГДА ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение.ЗаказПоставщику
	|	КОНЕЦ,
	|	ПоступлениеТоваровНаСкладТовары.Ссылка,
	|	ПоступлениеТоваровНаСкладТовары.НомерСтроки,
	|	ПоступлениеТоваровНаСкладТовары.Номенклатура,
	|	ПоступлениеТоваровНаСкладТовары.Характеристика,
	|	ПоступлениеТоваровНаСкладТовары.Ссылка.Склад,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровНаСкладТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ПоступлениеТоваровНаСкладТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровНаСкладТовары.Назначение.Заказ
	|		КОГДА ПоступлениеТоваровНаСкладТовары.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ПоступлениеТоваровНаСкладТовары.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ПоступлениеТоваровНаСкладТовары.ЗаказКлиента
	|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
	|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
	|				И ЗаказПоставщикуТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
	|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СодержимоеЭтогоПТУ.ЗаказПоставщику КАК ЗаказПоставщику,
	|	СодержимоеЭтогоПТУ.Номенклатура КАК Номенклатура,
	|	СодержимоеЭтогоПТУ.Характеристика КАК Характеристика,
	|	СодержимоеЭтогоПТУ.ЗаказКлиента КАК ЗаказКлиента,
	|	СодержимоеЭтогоПТУ.Склад КАК СкладОприходования,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
	|		ИНАЧЕ ЗаказКлиентаТовары.Склад
	|	КОНЕЦ КАК СкладПродажи,
	|	СУММА(СодержимоеЭтогоПТУ.Количество) КАК Количество
	|ПОМЕСТИТЬ СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам
	|ИЗ
	|	СодержимоеЭтогоПТУ КАК СодержимоеЭтогоПТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|		ПО (СодержимоеЭтогоПТУ.ЗаказКлиента = СостоянияЗаказовКлиентов.Заказ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ПО (СодержимоеЭтогоПТУ.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка)
	|			И (ЗаказКлиентаТовары.Номенклатура = СодержимоеЭтогоПТУ.Номенклатура)
	|			И (ЗаказКлиентаТовары.Характеристика = СодержимоеЭтогоПТУ.Характеристика)
	|ГДЕ
	|	СодержимоеЭтогоПТУ.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И СодержимоеЭтогоПТУ.Склад <> ВЫБОР
	|			КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|				ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
	|			ИНАЧЕ ЗаказКлиентаТовары.Склад
	|		КОНЕЦ
	|	И СодержимоеЭтогоПТУ.ЗаказКлиента <> НЕОПРЕДЕЛЕНО
	|	И СодержимоеЭтогоПТУ.ЗаказКлиента.Проведен
	|	И СостоянияЗаказовКлиентов.Состояние ЕСТЬ НЕ NULL 
	|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяОплатаПослеОтгрузки)
	|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ГотовКЗакрытию)
	|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт)
	|
	|СГРУППИРОВАТЬ ПО
	|	СодержимоеЭтогоПТУ.ЗаказПоставщику,
	|	СодержимоеЭтогоПТУ.Номенклатура,
	|	СодержимоеЭтогоПТУ.Характеристика,
	|	СодержимоеЭтогоПТУ.ЗаказКлиента,
	|	СодержимоеЭтогоПТУ.Склад,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
	|		ИНАЧЕ ЗаказКлиентаТовары.Склад
	|	КОНЕЦ";

    ТекстДобавочный = "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
	//ASP_Hlopkov 20.11.2020-
	
	ТекстЗапросаСодержимогоПриобретения =
		"ВЫБРАТЬ
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказПоставщику КАК ЗаказПоставщику,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказКлиента КАК ЗаказКлиента,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Номенклатура КАК Номенклатура,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Характеристика КАК Характеристика,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.СкладОприходования КАК СкладОприходования,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.СкладПродажи КАК СкладПродажи,
		|	ВЫБОР
		|		КОГДА СУММА(ЕСТЬNULL(асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.Количество, 0)) >= СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Количество
		|				ИЛИ СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Количество <= 0
		|			ТОГДА 0
		|		ИНАЧЕ СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Количество - СУММА(ЕСТЬNULL(асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.Количество, 0))
		|	КОНЕЦ КАК КРезервированию
		|ПОМЕСТИТЬ СодержимоеПТУДляПеремещенияПоЗаказуПоставщику
		|ИЗ
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам КАК СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.асп_ЗаказыНаПеремещениеСРезервамиПоПТУ КАК асп_ЗаказыНаПеремещениеСРезервамиПоПТУ
		|		ПО (асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.ДокументПриобретения = &СсылкаНаПТНС)
		|			И СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказПоставщику = асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.ЗаказПоставщику
		|			И СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказКлиента = асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.ЗаказКлиента
		|			И СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Номенклатура = асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.Номенклатура
		|			И СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Характеристика = асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.Характеристика
		|ГДЕ
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказПоставщику = &ЗаказПоставщику
		|
		|СГРУППИРОВАТЬ ПО
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказПоставщику,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказКлиента,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Номенклатура,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Характеристика,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.СкладОприходования,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.СкладПродажи,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Количество
		|
		|ИМЕЮЩИЕ
		|	ВЫБОР
		|		КОГДА СУММА(ЕСТЬNULL(асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.Количество, 0)) >= СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Количество
		|				ИЛИ СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Количество <= 0
		|			ТОГДА 0
		|		ИНАЧЕ СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Количество - СУММА(ЕСТЬNULL(асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.Количество, 0))
		|	КОНЕЦ > 0";
	
	//ASP_Hlopkov 20.11.2020+ Добавил проверку на группу складов иначе дальнейшие таблицы будут рассчитываться некорректно
	ТекстЗапросаПроверкиСклада = 
		"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику.ЗаказПоставщику КАК ЗаказПоставщику,
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику.ЗаказКлиента КАК ЗаказКлиента,
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику.Номенклатура КАК Номенклатура,
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику.Характеристика КАК Характеристика,
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику.СкладОприходования КАК СкладОприходования,
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику.СкладПродажи КАК СкладПродажи,
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику.КРезервированию КАК КРезервированию,
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику.СкладПродажи.ЭтоГруппа КАК СкладПродажиЭтоГруппа
		|ИЗ
		|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику КАК СодержимоеПТУДляПеремещенияПоЗаказуПоставщику";
	
	ЗапросДляПроверкиСклада = Новый Запрос;
	ЗапросДляПроверкиСклада.Текст = ТекстЗапросаВТИзПроверкиНеобходимости + ТекстДобавочный + ТекстЗапросаСодержимогоПриобретения + ТекстЗапросаПроверкиСклада;
	
	//ЗапросДляПроверкиСклада.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Если МассивОбрабатываемыхЗаказовПоставщикам.Количество() > 0 Тогда
	
		ЗапросДляПроверкиСклада.УстановитьПараметр("ЗаказПоставщику", МассивОбрабатываемыхЗаказовПоставщикам[0]);
		ЗапросДляПроверкиСклада.УстановитьПараметр("СсылкаНаПТНС", ПоступлениеТоваровНаСклад);
		
		ТЗРезультатаПроверки = ЗапросДляПроверкиСклада.Выполнить().Выгрузить();
		
		Для Каждого СтрокаРезультата Из ТЗРезультатаПроверки Цикл
			
			Если СтрокаРезультата.СкладПродажиЭтоГруппа Тогда
				СтруктураОтбора = Новый Структура("Номенклатура, Характеристика", СтрокаРезультата.Номенклатура, СтрокаРезультата.Характеристика);
				
				МассивНайденныхСтрок = СтрокаРезультата.ЗаказКлиента.Товары.НайтиСтроки(СтруктураОтбора);
				
				Если МассивНайденныхСтрок.Количество() > 0 Тогда
					Для Каждого СтрокаМассива Из МассивНайденныхСтрок Цикл
						Если СтрокаМассива.Склад <> СтрокаРезультата.СкладОприходования Тогда
							СтрокаРезультата.СкладПродажи = СтрокаМассива.Склад;		
						КонецЕсли;	
					КонецЦикла;	
				КонецЕсли;	
					
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;	
	//ASP_Hlopkov 20.11.2020-
	
	ТекстЗапросаЗаказовНаПеремещение =
	//ASP_Hlopkov 20.11.2020+
					"ВЫБРАТЬ
				|	ТЗРезультатаПроверки.Номенклатура КАК Номенклатура,
				|	ТЗРезультатаПроверки.Характеристика КАК Характеристика,
				|	ТЗРезультатаПроверки.СкладПродажи КАК СкладПродажи,
				|	ТЗРезультатаПроверки.СкладОприходования КАК СкладОприходования,
				|	ТЗРезультатаПроверки.ЗаказПоставщику КАК ЗаказПоставщику,
				|	ТЗРезультатаПроверки.ЗаказКлиента КАК ЗаказКлиента,
				|	ТЗРезультатаПроверки.КРезервированию КАК КРезервированию
				|ПОМЕСТИТЬ ТЗРезультатаПроверки
				|ИЗ
				|	&ТЗРезультатаПроверки КАК ТЗРезультатаПроверки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ЗаказНаПеремещениеТовары.Ссылка КАК ЗаказНаПеремещение,
				|	ВЫБОР
				|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказНаПеремещениеТовары.Ссылка.ДокументОснование) = ТИП(Документ.ПриобретениеТоваровУслуг)
				|			ТОГДА ВЫРАЗИТЬ(ЗаказНаПеремещениеТовары.Ссылка.ДокументОснование КАК Документ.ПриобретениеТоваровУслуг)
				|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказНаПеремещениеТовары.Ссылка.ДокументОснование) = ТИП(Документ.ПоступлениеТоваровНАСклад)
				|			ТОГДА ВЫРАЗИТЬ(ЗаказНаПеремещениеТовары.Ссылка.ДокументОснование КАК Документ.ПоступлениеТоваровНаСклад)
				|	КОНЕЦ КАК ПриобретениеТоваровУслуг,
				|	ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель КАК СкладОтправитель,
				|	ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель КАК СкладПолучатель,
				|	ЗаказНаПеремещениеТовары.КодСтроки КАК КодСтроки,
				|	ЗаказНаПеремещениеТовары.Номенклатура КАК Номенклатура,
				|	ЗаказНаПеремещениеТовары.Характеристика КАК Характеристика,
				|	ВЫБОР
				|		КОГДА ЗаказНаПеремещениеТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
				|				И ЗаказНаПеремещениеТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ТОГДА ЗаказНаПеремещениеТовары.Назначение.Заказ
				|		КОГДА ЗаказНаПеремещениеТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ТОГДА ЗаказНаПеремещениеТовары.ASP_ЗаказКлиента
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК ЗаказКлиента,
				|	СУММА(ЗаказНаПеремещениеТовары.Количество) КАК Количество
				|ПОМЕСТИТЬ СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам
				|ИЗ
				|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
				|ГДЕ
				|	ЗаказНаПеремещениеТовары.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Закрыт)
				|	И ЗаказНаПеремещениеТовары.Ссылка.Проведен
				|	И (ЗаказНаПеремещениеТовары.Номенклатура, ЗаказНаПеремещениеТовары.Характеристика, ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель, ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель) В
				|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|				ТЗРезультатаПроверки.Номенклатура,
				|				ТЗРезультатаПроверки.Характеристика,
				|				ТЗРезультатаПроверки.СкладОприходования,
				|				ТЗРезультатаПроверки.СкладПродажи
				|			ИЗ
				|				ТЗРезультатаПроверки КАК ТЗРезультатаПроверки)
				|	И НЕ ЗаказНаПеремещениеТовары.ВариантОбеспечения В (ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить), ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада))
				|	И НЕ ЗаказНаПеремещениеТовары.Отменено
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказНаПеремещениеТовары.Ссылка,
				|	ЗаказНаПеремещениеТовары.Ссылка.СкладОтправитель,
				|	ЗаказНаПеремещениеТовары.Ссылка.СкладПолучатель,
				|	ЗаказНаПеремещениеТовары.КодСтроки,
				|	ЗаказНаПеремещениеТовары.Номенклатура,
				|	ЗаказНаПеремещениеТовары.Характеристика,
				|	ВЫБОР
				|		КОГДА ЗаказНаПеремещениеТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
				|				И ЗаказНаПеремещениеТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ТОГДА ЗаказНаПеремещениеТовары.Назначение.Заказ
				|		КОГДА ЗаказНаПеремещениеТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ТОГДА ЗаказНаПеремещениеТовары.ASP_ЗаказКлиента
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказНаПеремещениеТовары.Ссылка.ДокументОснование) = ТИП(Документ.ПриобретениеТоваровУслуг)
				|			ТОГДА ВЫРАЗИТЬ(ЗаказНаПеремещениеТовары.Ссылка.ДокументОснование КАК Документ.ПриобретениеТоваровУслуг)
				|		КОГДА ТИПЗНАЧЕНИЯ(ЗаказНаПеремещениеТовары.Ссылка.ДокументОснование) = ТИП(Документ.ПоступлениеТоваровНАСклад)
				|			ТОГДА ВЫРАЗИТЬ(ЗаказНаПеремещениеТовары.Ссылка.ДокументОснование КАК Документ.ПоступлениеТоваровНаСклад)
				|	КОНЕЦ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПоступлениеТоваровНаСкладТовары.Ссылка КАК ПриобретениеТоваровУслуг,
				|	ВЫБОР
				|		КОГДА ТИПЗНАЧЕНИЯ(ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
				|			ТОГДА ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение
				|		КОГДА ТИПЗНАЧЕНИЯ(ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение) = ТИП(Документ.ПриобретениеТоваровУслуг)
				|			ТОГДА ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение.ЗаказПоставщику
				|	КОНЕЦ КАК ЗаказПоставщику,
				|	ПоступлениеТоваровНаСкладТовары.Номенклатура КАК Номенклатура,
				|	ПоступлениеТоваровНаСкладТовары.Характеристика КАК Характеристика,
				|	ПоступлениеТоваровНаСкладТовары.Ссылка.Склад КАК Склад,
				|	ВЫБОР
				|		КОГДА ПоступлениеТоваровНаСкладТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
				|				И ПоступлениеТоваровНаСкладТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ТОГДА ПоступлениеТоваровНаСкладТовары.Назначение.Заказ
				|		КОГДА ПоступлениеТоваровНаСкладТовары.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ТОГДА ПоступлениеТоваровНаСкладТовары.ЗаказКлиента
				|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
				|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
				|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
				|				И ЗаказПоставщикуТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК ЗаказКлиента
				|ПОМЕСТИТЬ СодержимоеВсехСвязанныхПТУ
				|ИЗ
				|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
				|		ПРАВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровНаСклад.Товары КАК ПоступлениеТоваровНаСкладТовары
				|		ПО (ВЫБОР
				|				КОГДА ТИПЗНАЧЕНИЯ(ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
				|					ТОГДА ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение = ЗаказПоставщикуТовары.Ссылка
				|				КОГДА ТИПЗНАЧЕНИЯ(ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение) = ТИП(Документ.ПриобретениеТоваровУслуг)
				|					ТОГДА ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка
				|			КОНЕЦ)
				|			И (НЕ ЗаказПоставщикуТовары.Ссылка.ПометкаУдаления)
				|			И (НЕ ЗаказПоставщикуТовары.Отменено)
				|			И (ПоступлениеТоваровНаСкладТовары.Номенклатура = ЗаказПоставщикуТовары.Номенклатура)
				|			И (ПоступлениеТоваровНаСкладТовары.Характеристика = ЗаказПоставщикуТовары.Характеристика)
				|ГДЕ
				|	ПоступлениеТоваровНаСкладТовары.Ссылка В
				|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|				СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ПриобретениеТоваровУслуг
				|			ИЗ
				|				СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам)
				|	И ПоступлениеТоваровНаСкладТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
				|
				|СГРУППИРОВАТЬ ПО
				|	ПоступлениеТоваровНаСкладТовары.Ссылка,
				|	ПоступлениеТоваровНаСкладТовары.Номенклатура,
				|	ПоступлениеТоваровНаСкладТовары.Характеристика,
				|	ПоступлениеТоваровНаСкладТовары.Ссылка.Склад,
				|	ВЫБОР
				|		КОГДА ПоступлениеТоваровНаСкладТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
				|				И ПоступлениеТоваровНаСкладТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ТОГДА ПоступлениеТоваровНаСкладТовары.Назначение.Заказ
				|		КОГДА ПоступлениеТоваровНаСкладТовары.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ТОГДА ПоступлениеТоваровНаСкладТовары.ЗаказКлиента
				|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
				|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
				|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
				|				И ЗаказПоставщикуТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА ТИПЗНАЧЕНИЯ(ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
				|			ТОГДА ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение
				|		КОГДА ТИПЗНАЧЕНИЯ(ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение) = ТИП(Документ.ПриобретениеТоваровУслуг)
				|			ТОГДА ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение.ЗаказПоставщику
				|	КОНЕЦ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СодержимоеВсехСвязанныхПТУ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг,
				|	СодержимоеВсехСвязанныхПТУ.Номенклатура КАК Номенклатура,
				|	СодержимоеВсехСвязанныхПТУ.Характеристика КАК Характеристика,
				|	СодержимоеВсехСвязанныхПТУ.ЗаказКлиента КАК ЗаказКлиента,
				|	СодержимоеВсехСвязанныхПТУ.ЗаказПоставщику КАК ЗаказПоставщику
				|ПОМЕСТИТЬ СвязиПриобретенийСЗаказамиПоставщикам
				|ИЗ
				|	СодержимоеВсехСвязанныхПТУ КАК СодержимоеВсехСвязанныхПТУ
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
				|		ПО (СодержимоеВсехСвязанныхПТУ.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка)
				|			И (СодержимоеВсехСвязанныхПТУ.Номенклатура = ЗаказКлиентаТовары.Номенклатура)
				|			И (СодержимоеВсехСвязанныхПТУ.Характеристика = ЗаказКлиентаТовары.Характеристика)
				|ГДЕ
				|	СодержимоеВсехСвязанныхПТУ.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
				|	И СодержимоеВсехСвязанныхПТУ.Склад <> ВЫБОР
				|			КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
				|				ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
				|			ИНАЧЕ ЗаказКлиентаТовары.Склад
				|		КОНЕЦ
				|	И СодержимоеВсехСвязанныхПТУ.ЗаказКлиента <> НЕОПРЕДЕЛЕНО
				|
				|СГРУППИРОВАТЬ ПО
				|	СодержимоеВсехСвязанныхПТУ.ЗаказПоставщику,
				|	СодержимоеВсехСвязанныхПТУ.Номенклатура,
				|	СодержимоеВсехСвязанныхПТУ.Характеристика,
				|	СодержимоеВсехСвязанныхПТУ.ЗаказКлиента,
				|	СодержимоеВсехСвязанныхПТУ.ПриобретениеТоваровУслуг
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ПоступлениеТоваровНаСкладТовары.Ссылка КАК ПриобретениеТоваровУслуг,
				|	ЗаказПоставщикуТовары.Ссылка КАК ЗаказПоставщику,
				|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
				|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
				|	ВЫБОР
				|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
				|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
				|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
				|				И ЗаказПоставщикуТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ КАК ЗаказКлиента,
				|	ВЫБОР
				|		КОГДА ЗаказПоставщикуТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
				|			ТОГДА ЗаказПоставщикуТовары.Ссылка.Склад
				|		ИНАЧЕ ЗаказПоставщикуТовары.Склад
				|	КОНЕЦ КАК Склад
				|ПОМЕСТИТЬ СтрокиЗаказовПоставщикамДляОстальнойАналитики
				|ИЗ
				|	Документ.ПоступлениеТоваровНаСклад.Товары КАК ПоступлениеТоваровНаСкладТовары
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
				|		ПО (ВЫБОР
				|				КОГДА ТИПЗНАЧЕНИЯ(ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение) = ТИП(Документ.ЗаказПоставщику)
				|					ТОГДА ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение = ЗаказПоставщикуТовары.Ссылка
				|				КОГДА ТИПЗНАЧЕНИЯ(ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение) = ТИП(Документ.ПриобретениеТоваровУслуг)
				|					ТОГДА ПоступлениеТоваровНаСкладТовары.Ссылка.Распоряжение.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка
				|			КОНЕЦ)
				|ГДЕ
				|	ПоступлениеТоваровНаСкладТовары.Ссылка В
				|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|				СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ПриобретениеТоваровУслуг
				|			ИЗ
				|				СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам)
				|	И ПоступлениеТоваровНаСкладТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
				|	И (ПоступлениеТоваровНаСкладТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
				|				И ПоступлениеТоваровНаСкладТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ИЛИ ПоступлениеТоваровНаСкладТовары.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
				|				И ПоступлениеТоваровНаСкладТовары.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка))
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказПоставщикуТовары.Ссылка,
				|	ЗаказПоставщикуТовары.Номенклатура,
				|	ЗаказПоставщикуТовары.Характеристика,
				|	ВЫБОР
				|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
				|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
				|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
				|				И ЗаказПоставщикуТовары.ASP_ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
				|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
				|		ИНАЧЕ НЕОПРЕДЕЛЕНО
				|	КОНЕЦ,
				|	ВЫБОР
				|		КОГДА ЗаказПоставщикуТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
				|			ТОГДА ЗаказПоставщикуТовары.Ссылка.Склад
				|		ИНАЧЕ ЗаказПоставщикуТовары.Склад
				|	КОНЕЦ,
				|	ПоступлениеТоваровНаСкладТовары.Ссылка
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
				|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ЗаказКлиента КАК ЗаказКлиента,
				|	ВЫБОР
				|		КОГДА СвязиПриобретенийСЗаказамиПоставщикам.ЗаказПоставщику ЕСТЬ НЕ NULL 
				|			ТОГДА СвязиПриобретенийСЗаказамиПоставщикам.ЗаказПоставщику
				|		КОГДА СтрокиЗаказовПоставщикамДляОстальнойАналитики.ЗаказПоставщику ЕСТЬ НЕ NULL 
				|			ТОГДА СтрокиЗаказовПоставщикамДляОстальнойАналитики.ЗаказПоставщику
				|		КОГДА СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ПриобретениеТоваровУслуг.ЗаказПоставщику ЕСТЬ НЕ NULL 
				|			ТОГДА СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ПриобретениеТоваровУслуг.ЗаказПоставщику
				|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
				|	КОНЕЦ КАК ЗаказПоставщику,
				|	ВЫБОР
				|		КОГДА СвязиПриобретенийСЗаказамиПоставщикам.ЗаказПоставщику ЕСТЬ НЕ NULL 
				|			ТОГДА 2
				|		КОГДА СтрокиЗаказовПоставщикамДляОстальнойАналитики.ЗаказПоставщику ЕСТЬ НЕ NULL 
				|			ТОГДА 3
				|		КОГДА СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ПриобретениеТоваровУслуг.ЗаказПоставщику ЕСТЬ НЕ NULL 
				|			ТОГДА 1
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК Приоритет,
				|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.СкладОтправитель КАК СкладОтправитель,
				|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.СкладПолучатель КАК СкладПолучатель,
				|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.КодСтроки КАК КодСтроки,
				|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.Номенклатура КАК Номенклатура,
				|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.Характеристика КАК Характеристика,
				|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.Количество КАК Количество
				|ПОМЕСТИТЬ СтрокиЗаказовНаПеремещенияПоАналитике
				|ИЗ
				|	СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам КАК СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам
				|		ЛЕВОЕ СОЕДИНЕНИЕ СвязиПриобретенийСЗаказамиПоставщикам КАК СвязиПриобретенийСЗаказамиПоставщикам
				|		ПО (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ПриобретениеТоваровУслуг = СвязиПриобретенийСЗаказамиПоставщикам.ПриобретениеТоваровУслуг)
				|			И (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ЗаказКлиента = СвязиПриобретенийСЗаказамиПоставщикам.ЗаказКлиента)
				|			И (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.Номенклатура = СвязиПриобретенийСЗаказамиПоставщикам.Номенклатура)
				|			И (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.Характеристика = СвязиПриобретенийСЗаказамиПоставщикам.Характеристика)
				|		ЛЕВОЕ СОЕДИНЕНИЕ СтрокиЗаказовПоставщикамДляОстальнойАналитики КАК СтрокиЗаказовПоставщикамДляОстальнойАналитики
				|		ПО (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ПриобретениеТоваровУслуг = СтрокиЗаказовПоставщикамДляОстальнойАналитики.ПриобретениеТоваровУслуг)
				|			И (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.Номенклатура = СтрокиЗаказовПоставщикамДляОстальнойАналитики.Номенклатура)
				|			И (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.Характеристика = СтрокиЗаказовПоставщикамДляОстальнойАналитики.Характеристика)
				|			И (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.ЗаказКлиента = СтрокиЗаказовПоставщикамДляОстальнойАналитики.ЗаказКлиента)
				|			И (СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам.СкладОтправитель = СтрокиЗаказовПоставщикамДляОстальнойАналитики.Склад)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ТЗРезультатаПроверки.ЗаказКлиента КАК ЗаказКлиента,
				|	ТЗРезультатаПроверки.Номенклатура КАК Номенклатура,
				|	ТЗРезультатаПроверки.Характеристика КАК Характеристика,
				|	СтрокиЗаказовНаПеремещенияПоАналитике.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
				|	СтрокиЗаказовНаПеремещенияПоАналитике.КодСтроки КАК КодСтроки,
				|	СтрокиЗаказовНаПеремещенияПоАналитике.Приоритет КАК Приоритет,
				|	СтрокиЗаказовНаПеремещенияПоАналитике.Количество КАК Количество
				|ПОМЕСТИТЬ СтрокиЗаказовНаПеремещенияКРезервированию
				|ИЗ
				|	ТЗРезультатаПроверки КАК ТЗРезультатаПроверки
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтрокиЗаказовНаПеремещенияПоАналитике КАК СтрокиЗаказовНаПеремещенияПоАналитике
				|		ПО (ТЗРезультатаПроверки.ЗаказПоставщику = СтрокиЗаказовНаПеремещенияПоАналитике.ЗаказПоставщику)
				|			И (ТЗРезультатаПроверки.ЗаказКлиента = СтрокиЗаказовНаПеремещенияПоАналитике.ЗаказКлиента)
				|			И (ТЗРезультатаПроверки.СкладОприходования = СтрокиЗаказовНаПеремещенияПоАналитике.СкладОтправитель)
				|			И (ТЗРезультатаПроверки.СкладПродажи = СтрокиЗаказовНаПеремещенияПоАналитике.СкладПолучатель)
				|			И (ТЗРезультатаПроверки.Номенклатура = СтрокиЗаказовНаПеремещенияПоАналитике.Номенклатура)
				|			И (ТЗРезультатаПроверки.Характеристика = СтрокиЗаказовНаПеремещенияПоАналитике.Характеристика)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВложенныйЗапрос.ЗаказКлиента КАК ЗаказКлиента,
				|	ВложенныйЗапрос.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
				|	КОЛИЧЕСТВО(*) КАК Колво
				|ПОМЕСТИТЬ КолвоРазличнойАналитики
				|ИЗ
				|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|		ЗаказыНаПеремещения.ЗаказКлиента КАК ЗаказКлиента,
				|		ЗаказыНаПеремещения.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
				|		ЗаказыНаПеремещения.Номенклатура КАК Номенклатура,
				|		ЗаказыНаПеремещения.Характеристика КАК Характеристика
				|	ИЗ
				|		СтрокиЗаказовНаПеремещенияКРезервированию КАК ЗаказыНаПеремещения) КАК ВложенныйЗапрос
				|
				|СГРУППИРОВАТЬ ПО
				|	ВложенныйЗапрос.ЗаказКлиента,
				|	ВложенныйЗапрос.ЗаказНаПеремещение
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ЗаказыНаПеремещения.ЗаказКлиента КАК ЗаказКлиента,
				|	ЗаказыНаПеремещения.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
				|	СУММА(ЗаказыНаПеремещения.Количество) КАК Колво
				|ПОМЕСТИТЬ ОбщееКоличество
				|ИЗ
				|	СтрокиЗаказовНаПеремещенияКРезервированию КАК ЗаказыНаПеремещения
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказыНаПеремещения.ЗаказКлиента,
				|	ЗаказыНаПеремещения.ЗаказНаПеремещение";
	
	ТекстЗапросаУничтоженияВременныхТаблицСЗаказамиНаПеремещения =
		"УНИЧТОЖИТЬ СтрокиЗаказовНаПеремещенияПоАналитикеБезСвязиСЗаказамиПоставщикам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СодержимоеВсехСвязанныхПТУ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СвязиПриобретенийСЗаказамиПоставщикам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СтрокиЗаказовПоставщикамДляОстальнойАналитики
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СтрокиЗаказовНаПеремещенияПоАналитике
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СтрокиЗаказовНаПеремещенияКРезервированию
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ КолвоРазличнойАналитики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ОбщееКоличество";
	ТекстЗапросаИтоговыхТаблиц =
		"ВЫБРАТЬ
		|	ПриобретенныеТовары.ЗаказКлиента КАК ЗаказКлиента,
		|	ПриобретенныеТовары.Номенклатура КАК Номенклатура,
		|	ПриобретенныеТовары.Характеристика КАК Характеристика,
		|	ПриобретенныеТовары.КРезервированию КАК КРезервированию
		|ИЗ
		//ASP_Hlopkov 20.11.2020+
		//|	СодержимоеПТУДляПеремещенияПоЗаказуПоставщику КАК ПриобретенныеТовары
		|	ТЗРезультатаПроверки КАК ПриобретенныеТовары
		//ASP_Hlopkov 20.11.2020-
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтрокиЗаказовНаПеремещения.ЗаказКлиента КАК ЗаказКлиента,
		|	СтрокиЗаказовНаПеремещения.ЗаказНаПеремещение КАК ЗаказНаПеремещение,
		|	СтрокиЗаказовНаПеремещения.Номенклатура КАК Номенклатура,
		|	СтрокиЗаказовНаПеремещения.Характеристика КАК Характеристика,
		|	СтрокиЗаказовНаПеремещения.КодСтроки КАК КодСтроки
		|ИЗ
		|	СтрокиЗаказовНаПеремещенияКРезервированию КАК СтрокиЗаказовНаПеремещения
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказКлиента,
		|	ЗаказНаПеремещение,
		|	Номенклатура,
		|	Характеристика,
		|	КодСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыНаПеремещения.ЗаказКлиента КАК ЗаказКлиента,
		|	ЗаказыНаПеремещения.ЗаказНаПеремещение КАК ЗаказНаПеремещение
		|ИЗ
		|	СтрокиЗаказовНаПеремещенияКРезервированию КАК ЗаказыНаПеремещения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КолвоРазличнойАналитики КАК КолвоРазличнойАналитики
		|		ПО (ЗаказыНаПеремещения.ЗаказКлиента = КолвоРазличнойАналитики.ЗаказКлиента)
		|			И (ЗаказыНаПеремещения.ЗаказНаПеремещение = КолвоРазличнойАналитики.ЗаказНаПеремещение)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбщееКоличество КАК ОбщееКоличество
		|		ПО (ЗаказыНаПеремещения.ЗаказКлиента = ОбщееКоличество.ЗаказКлиента)
		|			И (ЗаказыНаПеремещения.ЗаказНаПеремещение = ОбщееКоличество.ЗаказНаПеремещение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказКлиента,
		|	ЗаказыНаПеремещения.Приоритет,
		|	КолвоРазличнойАналитики.Колво УБЫВ,
		|	ОбщееКоличество.Колво УБЫВ
		|ИТОГИ ПО
		|	ЗаказКлиента,
		|	ЗаказНаПеремещение";
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("СсылкаНаПТНС", ПоступлениеТоваровНаСклад);
	
	
	ИндексОбрабатываемогоЗаказаПоставщику = 0;
	ЭтоПерваяИтерацияПоЗаказуПоставщику = Истина;
	Пока ИндексОбрабатываемогоЗаказаПоставщику < МассивОбрабатываемыхЗаказовПоставщикам.Количество() Цикл
		
		ОбрабатываемыйЗаказПоставщику = МассивОбрабатываемыхЗаказовПоставщикам[ИндексОбрабатываемогоЗаказаПоставщику];
		
		Запрос.УстановитьПараметр("ЗаказПоставщику", ОбрабатываемыйЗаказПоставщику);
		Если ЭтоПерваяИтерацияПоЗаказуПоставщику Тогда
			Если ИндексОбрабатываемогоЗаказаПоставщику = 0 Тогда
				Запрос.Текст = ТекстЗапросаСодержимогоПриобретения;
			Иначе
				Запрос.Текст =
					"УНИЧТОЖИТЬ СодержимоеПТУДляПеремещенияПоЗаказуПоставщику
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|" + ТекстЗапросаСодержимогоПриобретения;
			КонецЕсли;
			
			
			Запрос.Выполнить();
		КонецЕсли;
		
		Запрос.Текст = ТекстЗапросаЗаказовНаПеремещение;
		
		//ASP_Hlopkov 20.11.2020+
		Запрос.УстановитьПараметр("ТЗРезультатаПроверки", ТЗРезультатаПроверки);
		//ASP_Hlopkov 20.11.2020-
		
		Запрос.Выполнить();
		
		
		Запрос.Текст = ТекстЗапросаИтоговыхТаблиц;
		РезультатыЗапросов = Запрос.ВыполнитьПакет();
		
		Если ЭтоПерваяИтерацияПоЗаказуПоставщику Тогда
			ПриобретенныеТовары = РезультатыЗапросов[0].Выгрузить();
			
			Если ПриобретенныеТовары.Количество() = 0 Тогда
				ИндексОбрабатываемогоЗаказаПоставщику = ИндексОбрабатываемогоЗаказаПоставщику + 1;
				ЭтоПерваяИтерацияПоЗаказуПоставщику = Истина;
				
				Запрос.Текст = ТекстЗапросаУничтоженияВременныхТаблицСЗаказамиНаПеремещения;
				Запрос.Выполнить();
				
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		СтрокиЗаказовНаПеремещения = РезультатыЗапросов[1].Выгрузить();
		
		ВыборкаЗаказовКлиентов = РезультатыЗапросов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		
		ПредварительноеСозданиеЗаказовНаПеремещение = Ложь;
		
		Если ВыборкаЗаказовКлиентов.Количество() = 0 И ЭтоПерваяИтерацияПоЗаказуПоставщику Тогда
			ПредварительноеСозданиеЗаказовНаПеремещение = Истина;
		КонецЕсли;
		
		Если ПредварительноеСозданиеЗаказовНаПеремещение Тогда
			СоздатьЗаказынаПеремещениеИзПоступления(ПоступлениеТоваровНаСклад, ОбрабатываемыйЗаказПоставщику, Результат);
			
			Запрос.Текст = ТекстЗапросаУничтоженияВременныхТаблицСЗаказамиНаПеремещения;
			Запрос.Выполнить();
			
			//ASP_Hlopkov 20.11.2020+
			Запрос.Текст =
				"УНИЧТОЖИТЬ ТЗРезультатаПроверки
				|;";
			Запрос.Выполнить();
			//ASP_Hlopkov 20.11.2020-
			
			Запрос.Текст = ТекстЗапросаЗаказовНаПеремещение;
			
			//ASP_Hlopkov 20.11.2020+
			Запрос.УстановитьПараметр("ТЗРезультатаПроверки", ТЗРезультатаПроверки);
			//ASP_Hlopkov 20.11.2020-
			
			Запрос.Выполнить();
			
			Запрос.Текст = ТекстЗапросаИтоговыхТаблиц;
			РезультатыЗапросов = Запрос.ВыполнитьПакет();
			//ПриобретенныеТовары = РезультатыЗапросов[0].Выгрузить();
			СтрокиЗаказовНаПеремещения = РезультатыЗапросов[1].Выгрузить();
			
			ВыборкаЗаказовКлиентов = РезультатыЗапросов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		КонецЕсли;
		
		
		ЗарезервированныеВЗаказеНаПеремещение = ПриобретенныеТовары.СкопироватьКолонки();
		ЗарезервированныеВЗаказеНаПеремещение.Колонки.КРезервированию.Имя = "Зарезервировано";
		
		СтруктураОтбораПриобретенного = Новый Структура("ЗаказКлиента, Номенклатура, Характеристика");
		СтруктураОтбораСтрокЗаказаНаПеремещение = Новый Структура("ЗаказКлиента, ЗаказНаПеремещение");
		
		Пока ВыборкаЗаказовКлиентов.Следующий() Цикл
			
			ВыборкаЗаказовНаПеремещение = ВыборкаЗаказовКлиентов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЗаказовНаПеремещение.Следующий() Цикл
				
				ЗаполнитьЗначенияСвойств(СтруктураОтбораСтрокЗаказаНаПеремещение, ВыборкаЗаказовНаПеремещение);
				ОбрабатываемыеСтрокиЗаказаНаПеремещение = СтрокиЗаказовНаПеремещения.НайтиСтроки(СтруктураОтбораСтрокЗаказаНаПеремещение);
				
				ОбработатьДокумент = Ложь;
				Для Каждого ОбрабатываемаяСтрокаЗаказаНаПеремещение Из ОбрабатываемыеСтрокиЗаказаНаПеремещение Цикл
					ЗаполнитьЗначенияСвойств(СтруктураОтбораПриобретенного, ОбрабатываемаяСтрокаЗаказаНаПеремещение);
					СтрокиПриобретенного = ПриобретенныеТовары.НайтиСтроки(СтруктураОтбораПриобретенного);
					Если СтрокиПриобретенного.Количество() > 0 И СтрокиПриобретенного[0].КРезервированию > 0 Тогда
						ОбработатьДокумент = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Не ОбработатьДокумент Тогда
					Продолжить;
				КонецЕсли;
				
				
				Попытка
					ЗаблокироватьДанныеДляРедактирования(ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение);
					ЗаказНаПеремещениеОбъект = ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение.ПолучитьОбъект();
				Исключение
					СодержимоеОшибки = Новый Структура("Документ, ТекстОшибки", ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение, "Не удалось заблокировать документ;
						|вероятно, он редактируется другим пользователем");
					Результат.Ошибки.Добавить(СодержимоеОшибки);
					
					//ASP_Hlopkov 21.10.2020+
					ЗаписьЖурналаРегистрации("Данные.Изменение", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЗаказНаПеремещение,, "Не удалось заблокировать документ вероятно, он редактируется другим пользователем" + Символы.ПС + ОписаниеОшибки()); 
					//ASP_Hlopkov 21.10.2020-
					
					Продолжить;
				КонецПопытки;
				
				
				ЗарезервированныеВЗаказеНаПеремещение.Очистить();
				
				ДокументИзменен = Ложь;
				Для Каждого ОбрабатываемаяСтрокаЗаказаНаПеремещение Из ОбрабатываемыеСтрокиЗаказаНаПеремещение Цикл
					
					СтрокаРедактируемогоДокумента = ЗаказНаПеремещениеОбъект.Товары.Найти(ОбрабатываемаяСтрокаЗаказаНаПеремещение.КодСтроки, "КодСтроки");
					Если СтрокаРедактируемогоДокумента = Неопределено
						//  ASP_Мочалина 27.02.24
					// Или СтрокаРедактируемогоДокумента.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.ОтгрузитьОбособленно
					 Или СтрокаРедактируемогоДокумента.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить
					 Или СтрокаРедактируемогоДокумента.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада Тогда
						Продолжить;
					КонецЕсли;
					
					
					ЗаполнитьЗначенияСвойств(СтруктураОтбораПриобретенного, ОбрабатываемаяСтрокаЗаказаНаПеремещение);
					
					СтрокиПриобретенного = ПриобретенныеТовары.НайтиСтроки(СтруктураОтбораПриобретенного);
					Если СтрокиПриобретенного.Количество() = 0 Тогда
						Продолжить;
					Иначе
						КРезервированию = СтрокиПриобретенного[0].КРезервированию;
					КонецЕсли;
					
					СтрокиЗарезервированного = ЗарезервированныеВЗаказеНаПеремещение.НайтиСтроки(СтруктураОтбораПриобретенного);
					Если СтрокиЗарезервированного.Количество() > 0 Тогда
						СтрокаЗарезервированного = СтрокиЗарезервированного[0];
						КРезервированию = КРезервированию - СтрокаЗарезервированного.Зарезервировано;
					Иначе
						СтрокаЗарезервированного = ЗарезервированныеВЗаказеНаПеремещение.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаЗарезервированного, СтруктураОтбораПриобретенного);
						СтрокаЗарезервированного.Зарезервировано = 0;
					КонецЕсли;
					
					Если Мин(КРезервированию, СтрокаРедактируемогоДокумента.Количество) <= 0 Тогда
						Продолжить;
					КонецЕсли;
					
					
					Если КРезервированию < СтрокаРедактируемогоДокумента.Количество Тогда
						ИндексРедактируемойСтроки = ЗаказНаПеремещениеОбъект.Товары.Индекс(СтрокаРедактируемогоДокумента);
						НоваяСтрокаРедактируемогоДокумента = ЗаказНаПеремещениеОбъект.Товары.Вставить(ИндексРедактируемойСтроки + 1);
						ЗаполнитьЗначенияСвойств(НоваяСтрокаРедактируемогоДокумента, СтрокаРедактируемогоДокумента);
						
						СтрокаРедактируемогоДокумента.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
						СтрокаРедактируемогоДокумента.Количество = КРезервированию;
						СтрокаРедактируемогоДокумента.КоличествоУпаковок = КРезервированию;
						
						НоваяСтрокаРедактируемогоДокумента.КодСтроки = 0;
						НоваяСтрокаРедактируемогоДокумента.Упаковка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
						НоваяСтрокаРедактируемогоДокумента.Количество = НоваяСтрокаРедактируемогоДокумента.Количество - КРезервированию;
						НоваяСтрокаРедактируемогоДокумента.КоличествоУпаковок = НоваяСтрокаРедактируемогоДокумента.Количество;
					КонецЕсли;
					
					СтрокаРедактируемогоДокумента.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
					ДокументИзменен = Истина;
					
					СтрокаЗарезервированного.Зарезервировано = СтрокаЗарезервированного.Зарезервировано + СтрокаРедактируемогоДокумента.Количество;
				КонецЦикла;
				
				Если ДокументИзменен Тогда
					ПолучитьСообщенияПользователю(Истина);
					
					Попытка
						ЗаказНаПеремещениеОбъект.Записать(РежимЗаписиДокумента.Проведение);
						Если Результат.ДозаполненныеДокументы.Найти(ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение) = Неопределено Тогда
							Результат.ДозаполненныеДокументы.Добавить(ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение);
						КонецЕсли;
					Исключение
						КлючСообщений = ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение;
						ВесьТекстОшибки = "Не удалось дозаполнить Заказ на перемещение:";
						
						МассивСообщенийПользователю = ПолучитьСообщенияПользователю(Истина);
						СтрокаСообщений = "";
						Для Каждого Сообщение Из МассивСообщенийПользователю Цикл
							ПредставлениеКлючаСообщения = "";
							Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Сообщение.КлючДанных))
							 И Сообщение.КлючДанных <> КлючСообщений Тогда
								ПредставлениеКлючаСообщения = Строка(Сообщение.КлючДанных) + ": ";
							КонецЕсли;
							
							СтрокаСообщений = СтрокаСообщений + ПредставлениеКлючаСообщения + Сообщение.Текст + Символы.ПС;
						КонецЦикла;
						
						СтрокаСообщений = ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС + СтрокаСообщений);
						ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
						
						Если ПредставлениеОшибки = "Не удалось провести """ + Строка(КлючСообщений) + """!" Тогда
							ПредставлениеОшибки = "";
						Иначе
							ПредставлениеОшибки = Символы.ПС + ПредставлениеОшибки;
						КонецЕсли;
						
						ВесьТекстОшибки = ВесьТекстОшибки + ПредставлениеОшибки + СтрокаСообщений;
						СодержимоеОшибки = Новый Структура("Документ, ТекстОшибки", КлючСообщений, ВесьТекстОшибки);
						
						Результат.Ошибки.Добавить(СодержимоеОшибки);
						ЗарезервированныеВЗаказеНаПеремещение.Очистить();
					КонецПопытки;
				КонецЕсли;
				
				РазблокироватьДанныеДляРедактирования(ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение);
				
				ЗарезервированныеВЗаказеНаПеремещение.Свернуть("ЗаказКлиента, Номенклатура, Характеристика", "Зарезервировано");
				Для Каждого СтрокаЗарезервированного Из ЗарезервированныеВЗаказеНаПеремещение Цикл
					ЗаполнитьЗначенияСвойств(СтруктураОтбораПриобретенного, СтрокаЗарезервированного);
					СтрокиПриобретенного = ПриобретенныеТовары.НайтиСтроки(СтруктураОтбораПриобретенного);
					Если СтрокиПриобретенного.Количество() > 0 Тогда
						СтрокиПриобретенного[0].КРезервированию = Макс(0, СтрокиПриобретенного[0].КРезервированию - СтрокаЗарезервированного.Зарезервировано);
					КонецЕсли;
					
					
					МенеджерЗаписиВРегистр = РегистрыСведений.асп_ЗаказыНаПеремещениеСРезервамиПоПТУ.СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписиВРегистр, СтрокаЗарезервированного);
					МенеджерЗаписиВРегистр.ДокументПриобретения = ПоступлениеТоваровНаСклад;
					МенеджерЗаписиВРегистр.ЗаказПоставщику = ОбрабатываемыйЗаказПоставщику;
					МенеджерЗаписиВРегистр.ЗаказНаПеремещение = ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение;
					МенеджерЗаписиВРегистр.Прочитать();
					
					Если МенеджерЗаписиВРегистр.Выбран() Тогда
						НовоеЗначениеЗарезервированного = МенеджерЗаписиВРегистр.Количество + СтрокаЗарезервированного.Зарезервировано;
					Иначе
						НовоеЗначениеЗарезервированного = СтрокаЗарезервированного.Зарезервировано;
						
						ЗаполнитьЗначенияСвойств(МенеджерЗаписиВРегистр, СтрокаЗарезервированного);
						МенеджерЗаписиВРегистр.ДокументПриобретения = ПоступлениеТоваровНаСклад;
						МенеджерЗаписиВРегистр.ЗаказПоставщику = ОбрабатываемыйЗаказПоставщику;
						МенеджерЗаписиВРегистр.ЗаказНаПеремещение = ВыборкаЗаказовНаПеремещение.ЗаказНаПеремещение;
					КонецЕсли;
					
					МенеджерЗаписиВРегистр.Количество = НовоеЗначениеЗарезервированного;
					МенеджерЗаписиВРегистр.Записать();
				КонецЦикла;
				
			КонецЦикла; //Пока ВыборкаЗаказовНаПеремещение.Следующий()
			
		КонецЦикла;
		
		ИндексСтрокиПриобретенного = 0;
		Пока ИндексСтрокиПриобретенного < ПриобретенныеТовары.Количество() Цикл
			СтрокаПриобретенного = ПриобретенныеТовары[ИндексСтрокиПриобретенного];
			Если СтрокаПриобретенного.КРезервированию = 0 Тогда
				ПриобретенныеТовары.Удалить(СтрокаПриобретенного);
			Иначе
				ИндексСтрокиПриобретенного = ИндексСтрокиПриобретенного + 1;
			КонецЕсли;
		КонецЦикла;
		
		
		Если ПриобретенныеТовары.Количество() > 0 И ЭтоПерваяИтерацияПоЗаказуПоставщику И Не ПредварительноеСозданиеЗаказовНаПеремещение Тогда
			КопияПриобретенныеТовары = ПриобретенныеТовары.Скопировать(); 
			ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,, "По приобретению", "По приобретению");
			СоздатьЗаказынаПеремещениеИзПоступления(ПоступлениеТоваровНаСклад, ОбрабатываемыйЗаказПоставщику, Результат, КопияПриобретенныеТовары);
			ЭтоПерваяИтерацияПоЗаказуПоставщику = Ложь;
		Иначе
			ИндексОбрабатываемогоЗаказаПоставщику = ИндексОбрабатываемогоЗаказаПоставщику + 1;
			ЭтоПерваяИтерацияПоЗаказуПоставщику = Истина;
		КонецЕсли;
		
		
		Запрос.Текст = ТекстЗапросаУничтоженияВременныхТаблицСЗаказамиНаПеремещения;
		Запрос.Выполнить();
		
	КонецЦикла;
	
	
	//+++ {{ ASP 10.09.2020 000008403 }}
	ЗапросПоОставшимсяЗаказамПоставщику = Новый Запрос;
	ЗапросПоОставшимсяЗаказамПоставщику.МенеджерВременныхТаблиц = МенеджерВТ;
	ЗапросПоОставшимсяЗаказамПоставщику.УстановитьПараметр("ЗаказыПоставщику", МассивОставшихсяЗаказовПоставщику);
	ЗапросПоОставшимсяЗаказамПоставщику.Текст =
		"ВЫБРАТЬ
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.СкладОприходования КАК СкладОприходования,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказКлиента КАК ЗаказКлиента,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Номенклатура КАК Номенклатура,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Характеристика КАК Характеристика,
		|	СУММА(СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Количество) КАК Количество
		|ПОМЕСТИТЬ СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам
		|ИЗ
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам КАК СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам
		|ГДЕ
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказПоставщику В(&ЗаказыПоставщику)
		|
		|СГРУППИРОВАТЬ ПО
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.СкладОприходования,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.ЗаказКлиента,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Номенклатура,
		|	СодержимоеПТУДляПеремещенияПоВсемЗаказамПоставщикам.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
		|		ИНАЧЕ ЗаказКлиентаТовары.Склад
		|	КОНЕЦ КАК СкладПродажи,
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.СкладОприходования КАК СкладОприходования,
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.ЗаказКлиента КАК ЗаказКлиента,
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.Номенклатура КАК Номенклатура,
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.Характеристика КАК Характеристика,
		|	МАКСИМУМ(СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.Количество) КАК КоличествоВПриобретении,
		|	СУММА(ЕСТЬNULL(ЗаказКлиентаТовары.Количество, 0)) КАК КоличествоВЗаказах
		|ИЗ
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам КАК СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО (СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка)
		|			И (СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.Номенклатура = ЗаказКлиентаТовары.Номенклатура)
		|			И (СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.Характеристика = ЗаказКлиентаТовары.Характеристика)
		|			И (НЕ ЗаказКлиентаТовары.Отменено) 
		// ASP_Мочалина 27.02.24
		//|			И (ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно)) 
		|			И (ЗаказКлиентаТовары.Обособленно = ИСТИНА)
		|			И (ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|					И СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.СкладОприходования <> ЗаказКлиентаТовары.Ссылка.Склад
		|				ИЛИ СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.СкладОприходования <> ЗаказКлиентаТовары.Склад)
		|
		|СГРУППИРОВАТЬ ПО
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.СкладОприходования,
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.ЗаказКлиента,
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.Номенклатура,
		|	СодержимоеПТУДляПеремещенияПоОставшимсяЗаказамПоставщикам.Характеристика,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
		|		ИНАЧЕ ЗаказКлиентаТовары.Склад
		|	КОНЕЦ
		|
		|ИМЕЮЩИЕ
		|	СУММА(ЕСТЬNULL(ЗаказКлиентаТовары.Количество, 0)) > 0
		|ИТОГИ
		|	МАКСИМУМ(СкладОприходования)
		|ПО
		|	СкладПродажи";
	
	ЗначенияРеквизитовПоступления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПоступлениеТоваровНаСклад, "Организация, Подразделение, ВариантПриемкиТоваров");
	
	ВыборкаПоСкладамПродажи = ЗапросПоОставшимсяЗаказамПоставщику.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоСкладамПродажи.Следующий() Цикл
		
		Перемещение = Документы.ЗаказНаПеремещение.СоздатьДокумент();
		Перемещение.ДокументОснование = ПоступлениеТоваровНаСклад;
		Перемещение.Дата = ТекущаяДата();
		Перемещение.СкладОтправитель = ВыборкаПоСкладамПродажи.СкладОприходования;
		Перемещение.СкладПолучатель = ВыборкаПоСкладамПродажи.СкладПродажи;
		Перемещение.Ответственный = Пользователи.ТекущийПользователь();
		Перемещение.Статус = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
		Перемещение.ВариантПриемкиТоваров = ЗначенияРеквизитовПоступления.ВариантПриемкиТоваров;
		ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,,"" + ВыборкаЗаказовКлиентов.СкладПродажи + Символы.ПС + ВыборкаЗаказовКлиентов.СкладОприходования, "Склад продажи / склад оприходования. ПроизвестиНакопление");
		Перемещение.Организация = ЗначенияРеквизитовПоступления.Организация;
		Перемещение.Подразделение = ЗначенияРеквизитовПоступления.Подразделение;
		Перемещение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
		Перемещение.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
		
		ВыборкаТоваров = ВыборкаПоСкладамПродажи.Выбрать();
		
		Пока ВыборкаТоваров.Следующий() Цикл
			КолвоКПеремещению = Мин(ВыборкаТоваров.КоличествоВПриобретении, ВыборкаТоваров.КоличествоВЗаказах);
			Если КолвоКПеремещению <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйТовар = Перемещение.Товары.Добавить();
			НовыйТовар.Количество = КолвоКПеремещению;
			НовыйТовар.КоличествоУпаковок = КолвоКПеремещению;
			НовыйТовар.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
			НовыйТовар.НачалоОтгрузки = ТекущаяДата() + ((24*60*60)*3);
			НовыйТовар.Номенклатура = ВыборкаТоваров.Номенклатура;
			НовыйТовар.Назначение = Справочники.Назначения.НайтиПоРеквизиту("Заказ", ВыборкаТоваров.ЗаказКлиента);
			НовыйТовар.Характеристика = ВыборкаТоваров.Характеристика;
		КонецЦикла;
		
		Если Перемещение.Товары.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПолучитьСообщенияПользователю(Истина);
		
		Попытка
			Перемещение.Записать(РежимЗаписиДокумента.Проведение);
			Результат.СозданныеДокументы.Добавить(Перемещение.Ссылка);
		Исключение
			ТекстОшибки = "Не удалось создать новый Заказ на перемещение на склад " + Строка(ВыборкаПоСкладамПродажи.СкладПродажи);
			Если Перемещение.Товары.Количество() > 0 Тогда
				ТекстОшибки = ТекстОшибки + " товара(ов) ";
				Для Каждого СтрокаТЧ Из Перемещение.Товары Цикл
					ТекстОшибки = ТекстОшибки + Строка(СтрокаТЧ.Номенклатура) + Символы.ПС;
				КонецЦикла;
			КонецЕсли;
			ТекстОшибки = ТекстОшибки + " по причине:" + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			
			МассивСообщенийПользователю = ПолучитьСообщенияПользователю(Истина);
			СтрокаСообщений = "";
			Для Каждого Сообщение Из МассивСообщенийПользователю Цикл
				СтрокаСообщений = СтрокаСообщений + Сообщение.Текст + Символы.ПС;
			КонецЦикла;
			
			СтрокаСообщений = ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС + СтрокаСообщений);
			ВесьТекстОшибки = ТекстОшибки + СтрокаСообщений;
			
			Результат.Ошибки.Добавить(ВесьТекстОшибки);
			
			//ASP_Hlopkov 21.10.2020+
			ЗаписьЖурналаРегистрации("Данные.Изменение", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЗаказНаПеремещение,, ВесьТекстОшибки + Символы.ПС + ОписаниеОшибки()); 
			//ASP_Hlopkov 21.10.2020-
			
		КонецПопытки;
		
	КонецЦикла;
	//--- {{ ASP 10.09.2020 000008403 }}
	
КонецПроцедуры

Процедура СоздатьЗаказынаПеремещениеИзПоступления(ПоступлениеТовараНаСклад, ЗаказПоставщику, Результат, ПриобретенныеТовары = Неопределено)
	
	ЗначенияРеквизитовПриобретения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПоступлениеТовараНаСклад, "Организация, Подразделение, ВариантПриемкиТоваров, Склад");
	
	ЗапросПотребностейКПеремещению = Новый Запрос;
	
	Если ПриобретенныеТовары = Неопределено Тогда
		
		ЗапросПотребностейКПеремещению.Текст =
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
		|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
		|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
		|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ЗаказКлиента,
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика КАК Характеристика,
		|	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ СтрокиЗаказаПоставщику
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &ЗаказПоставщику
		|	И ЗаказПоставщикуТовары.Ссылка.Проведен
		|	И ЗаказПоставщикуТовары.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Закрыт)
		|	И ЗаказПоставщикуТовары.Склад = &СкладПТУ
		|	И НЕ ЗаказПоставщикуТовары.Отменено
		|	И ЗаказПоставщикуТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ЗаказПоставщикуТовары.Назначение.Заказ ССЫЛКА Документ.ЗаказКлиента
		|				И ЗаказПоставщикуТовары.Назначение.Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказКлиента.ПустаяСсылка)
		|			ТОГДА ЗаказПоставщикуТовары.Назначение.Заказ
		|		КОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
		|			ТОГДА ЗаказПоставщикуТовары.ASP_ЗаказКлиента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ,
		|	ЗаказПоставщикуТовары.Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтрокиЗаказаПоставщику.ЗаказКлиента КАК ЗаказКлиента
		|ИЗ
		|	СтрокиЗаказаПоставщику КАК СтрокиЗаказаПоставщику
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
		|		ПО ((ВЫРАЗИТЬ(СтрокиЗаказаПоставщику.ЗаказКлиента КАК Документ.ЗаказКлиента)) = СостоянияЗаказовКлиентов.Заказ)
		|ГДЕ
		|	СтрокиЗаказаПоставщику.ЗаказКлиента <> НЕОПРЕДЕЛЕНО
		|	И СтрокиЗаказаПоставщику.ЗаказКлиента.Проведен
		|	И СостоянияЗаказовКлиентов.Состояние ЕСТЬ НЕ NULL 
		|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ОжидаетсяОплатаПослеОтгрузки)
		|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ГотовКЗакрытию)
		|	И СостоянияЗаказовКлиентов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт)
		|";
			//ASP_Hlopkov 19.11.2020+
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			ЗапросПотребностейКПеремещению.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
			ЗапросПотребностейКПеремещению.УстановитьПараметр("СкладПТУ", ЗначенияРеквизитовПриобретения.Склад);
			
			ТЗСЗаказами = ЗапросПотребностейКПеремещению.Выполнить().Выгрузить();
			
			ЗапросПотребностейКПеремещениюПродолжение = Новый Запрос;
			
			ЗапросПотребностейКПеремещениюПродолжение.Текст =
			"ВЫБРАТЬ
			|	ТЗСЗаказами.ЗаказКлиента КАК ЗаказКлиента
			|ПОМЕСТИТЬ ВТЗаказыКлиентов
			|ИЗ
			|	&ТЗСЗаказами КАК ТЗСЗаказами
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТЗаказыКлиентов.ЗаказКлиента КАК ЗаказКлиента,
			|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
			|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
			|	ЗаказКлиентаТовары.Склад КАК СкладПродажи,
			|	&СкладПТУ КАК СкладОприходования,
			|	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество
			|ИЗ
			|	ВТЗаказыКлиентов КАК ВТЗаказыКлиентов
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|		ПО (ВТЗаказыКлиентов.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка)
			|			И (НЕ ЗаказКлиентаТовары.Отменено)
			
			// ASP_Мочалина 27.02.24
			//|			И (ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Обособленно))
			|			И (ЗаказКлиентаТовары.Обособленно = ИСТИНА)
			|			И (ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)))
			|			И (ЗаказКлиентаТовары.Склад <> &СкладПТУ)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТЗаказыКлиентов.ЗаказКлиента,
			|	ЗаказКлиентаТовары.Номенклатура,
			|	ЗаказКлиентаТовары.Характеристика,
			|	ЗаказКлиентаТовары.Склад
			|	
			|УПОРЯДОЧИТЬ ПО
			|	ЗаказКлиента,
			|	СкладПродажи,
			|	Номенклатура,
			|	Характеристика
			|";
			
			ЗапросПотребностейКПеремещениюПродолжение.УстановитьПараметр("СкладПТУ", ЗначенияРеквизитовПриобретения.Склад);
			ЗапросПотребностейКПеремещениюПродолжение.УстановитьПараметр("ТЗСЗаказами", ТЗСЗаказами);
			
			РезПродолжения = ЗапросПотребностейКПеремещениюПродолжение.Выполнить();
			ТоварыЗаказовКлиентов = РезПродолжения.Выгрузить();
			ТоварыЗаказовКлиентов.Индексы.Добавить("ЗаказКлиента, Номенклатура, Характеристика");
			
		ЗапросПотребностейКПеремещению.Текст =
			"ВЫБРАТЬ
			|	ТоварыЗаказовКлиентов.ЗаказКлиента КАК ЗаказКлиента,
			|	ТоварыЗаказовКлиентов.СкладПродажи КАК СкладПродажи,
			|	ТоварыЗаказовКлиентов.СкладОприходования КАК СкладОприходования,
			|	ТоварыЗаказовКлиентов.Номенклатура КАК Номенклатура,
			|	ТоварыЗаказовКлиентов.Характеристика КАК Характеристика,
			|	ТоварыЗаказовКлиентов.Количество КАК Количество
			|ПОМЕСТИТЬ ТаблицаИсточник
			|ИЗ
			|	&ТоварыЗаказовКлиентов КАК ТоварыЗаказовКлиентов
			|;";
		ЗапросПотребностейКПеремещению.УстановитьПараметр("ТоварыЗаказовКлиентов", ТоварыЗаказовКлиентов);
		ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,,"По заказу клиента", "По заказу клиента");
		
	Иначе
		
		ЗапросПотребностейКПеремещению.Текст =
			"ВЫБРАТЬ
			|	ПриобретенныеТовары.ЗаказКлиента КАК ЗаказКлиента,
			|	ВЫБОР
			|		КОГДА ЗаказКлиентаТовары.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
			|			ТОГДА ЗаказКлиентаТовары.Ссылка.Склад
			|		ИНАЧЕ ЗаказКлиентаТовары.Склад
			|	КОНЕЦ КАК СкладПродажи,
			|	&СкладОприходования КАК СкладОприходования,
			|	ПриобретенныеТовары.Номенклатура КАК Номенклатура,
			|	ПриобретенныеТовары.Характеристика КАК Характеристика,
			|	ПриобретенныеТовары.КРезервированию КАК Количество
			|ПОМЕСТИТЬ ТаблицаИсточник
			|ИЗ
			|	&ПриобретенныеТовары КАК ПриобретенныеТовары
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
			|		ПО (ПриобретенныеТовары.ЗаказКлиента = ЗаказКлиентаТовары.Ссылка
			|			И ЗаказКлиентаТовары.Номенклатура = ПриобретенныеТовары.Номенклатура
			|			И ЗаказКлиентаТовары.Характеристика = ПриобретенныеТовары.Характеристика)
			|;";
		ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,,"По приобретению", "По Приобретению");
		ЗапросПотребностейКПеремещению.УстановитьПараметр("СкладОприходования", ЗначенияРеквизитовПриобретения.Склад);
		ЗапросПотребностейКПеремещению.УстановитьПараметр("ПриобретенныеТовары", ПриобретенныеТовары);
		
	КонецЕсли;
	
	ЗапросПотребностейКПеремещению.Текст = ЗапросПотребностейКПеремещению.Текст +
		"
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаИсточник.ЗаказКлиента КАК ЗаказКлиента,
		|	ТаблицаИсточник.СкладПродажи КАК СкладПродажи,
		|	ТаблицаИсточник.СкладОприходования КАК СкладОприходования,
		|	ТаблицаИсточник.Номенклатура КАК Номенклатура,
		|	ТаблицаИсточник.Характеристика КАК Характеристика,
		|	СУММА(ТаблицаИсточник.Количество) КАК Количество
		|ИЗ
		|	ТаблицаИсточник КАК ТаблицаИсточник
		//ASP_Hlopkov 19.11.2020+
		|ГДЕ
		|	ТаблицаИсточник.СкладПродажи <> ТаблицаИсточник.СкладОприходования
		//ASP_Hlopkov 19.11.2020-
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаИсточник.ЗаказКлиента,
		|	ТаблицаИсточник.СкладПродажи,
		|	ТаблицаИсточник.СкладОприходования,
		|	ТаблицаИсточник.Номенклатура,
		|	ТаблицаИсточник.Характеристика
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказКлиента,
		|	Номенклатура,
		|	Характеристика
		|ИТОГИ
		|	МАКСИМУМ(СкладОприходования)
		|ПО
		|	ЗаказКлиента,
		|	СкладПродажи";
	
	//ASP_Hlopkov 09.10.2020+
	Рез = ЗапросПотребностейКПеремещению.Выполнить();
	//ТЗРез = Рез.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);	
	//ASP_Hlopkov 09.10.2020-
	
	ВыборкаПервогоУровня = ЗапросПотребностейКПеремещению.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПервогоУровня.Следующий() Цикл
		
		ВыборкаЗаказовКлиентов = ВыборкаПервогоУровня.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		СтруктураОтбораПриобретенных = Новый Структура("Номенклатура, Характеристика");
		
		Пока ВыборкаЗаказовКлиентов.Следующий() Цикл
			
			
			
			//собственно, создание Заказа на перемещение
			
			Перемещение = Неопределено; //ASP_Dante 02/11/20 Для каждого заказа клиента свой заказ на перемещение.
			
			Если ПриобретенныеТовары <> Неопределено //ЭТОТ БЛОК УДАЛИТЬ
			 И ПриобретенныеТовары.Найти(ВыборкаЗаказовКлиентов.ЗаказКлиента, "ЗаказКлиента") = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
	#Область ПостановкаВРезервВСуществующихЗаказахНаПеремещениеИлиСозданиеЗаказаНаПеремещение //+++ {{ ASP 11.11.2020 000008970 }} обрамлено в область
			
			//ASP_Hlopkov 09.10.2020+ проверяем есть ли уже созданные заказы на перемещение с этим назначением
			Запрос = Новый Запрос;
			Запрос.Текст =
			
			    "ВЫБРАТЬ
				|	ЗаказНаПеремещениеТовары.Ссылка КАК Ссылка,
				|	ЗаказНаПеремещениеТовары.Номенклатура КАК Номенклатура,
				|	ЗаказНаПеремещениеТовары.ВариантОбеспечения КАК ВариантОбеспечения,
				|	ЗаказНаПеремещениеТовары.Назначение.Заказ КАК ЗаказКлиента,
				|	ЗаказНаПеремещениеТовары.Назначение КАК Назначение,
				//ASP_Hlopkov 15.10.2020+
				|	СУММА(ЗаказНаПеремещениеТовары.Количество) КАК Количество
				//ASP_Hlopkov 15.10.2020-
				|ИЗ
				|	Документ.ЗаказНаПеремещение.Товары КАК ЗаказНаПеремещениеТовары
				|ГДЕ
				|	ЗаказНаПеремещениеТовары.Назначение.Заказ = &Заказ
				|	И НЕ ЗаказНаПеремещениеТовары.Ссылка.ПометкаУдаления
				//ASP_Hlopkov 20.10.2020+
				//|	И НЕ ЗаказНаПеремещениеТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
				//ASP_Hlopkov 20.10.2020-
				//ASP_Hlopkov 15.10.2020+
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказНаПеремещениеТовары.Ссылка,
				|	ЗаказНаПеремещениеТовары.Номенклатура,
				|	ЗаказНаПеремещениеТовары.ВариантОбеспечения,
				|	ЗаказНаПеремещениеТовары.Назначение.Заказ,
				|	ЗаказНаПеремещениеТовары.Назначение
				|
				//ASP_Hlopkov 15.10.2020-
				|УПОРЯДОЧИТЬ ПО
				//|	Ссылка,
				|	Номенклатура,
				|	ЗаказНаПеремещениеТовары.Ссылка.Дата
				|ИТОГИ
				|	СУММА(Количество)
				|ПО
				|	Номенклатура,
				|	Назначение";
			
			Запрос.УстановитьПараметр("Заказ", ВыборкаЗаказовКлиентов.ЗаказКлиента);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			//ТЗРез = РезультатЗапроса.Выгрузить();
			//Если есть обходим товары и пытаемся поставить в резерв
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				ТЗНеПоставленых = Новый ТаблицаЗначений;
				
				ТЗНеПоставленых.Колонки.Добавить("ЗаказКлиента");
				ТЗНеПоставленых.Колонки.Добавить("Номенклатура");
				ТЗНеПоставленых.Колонки.Добавить("Назначение");
				ТЗНеПоставленых.Колонки.Добавить("Количество");
				ТЗНеПоставленых.Колонки.Добавить("НужноСоздаватьЗаказ");
				
				ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаНоменклатура.Следующий() Цикл
					
					ВыборкаНазначение = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаНазначение.Следующий() Цикл
						
						ТЗТоваровЗаказа = ВыборкаНазначение.ЗаказКлиента.Товары.Выгрузить(,"Номенклатура, Количество");
						ТЗТоваровЗаказа.Свернуть("Номенклатура", "Количество");
						
						МассивНайденныхТоваров = ТЗТоваровЗаказа.НайтиСтроки(Новый Структура("Номенклатура", ВыборкаНазначение.Номенклатура));
						
						Если МассивНайденныхТоваров.Количество() > 0 Тогда
							СтрокаНайденогоТовара = МассивНайденныхТоваров[0];
							
							КоличествоТовараВЗаказе	= СтрокаНайденогоТовара.Количество;
						КонецЕсли;	
						
						КоличествоЗарезервировано = 0;
						
						ВыборкаДетальныеЗаписи = ВыборкаНазначение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							ЗаказПеремещОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
							
							МассивСтрокТоваров = ЗаказПеремещОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура, Назначение", ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Назначение));
							
							Если МассивСтрокТоваров.Количество() > 0 Тогда
								СтрокаТовара = МассивСтрокТоваров[0];
								
								Если КоличествоЗарезервировано < КоличествоТовараВЗаказе Тогда
									Если СтрокаТовара.Количество <= КоличествоТовараВЗаказе Тогда
										
										СтрокаТовара.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.СоСклада;
									
										Попытка
											ЗаказПеремещОбъект.Записать(РежимЗаписиДокумента.Проведение);
											
											КоличествоЗарезервировано = КоличествоЗарезервировано + СтрокаТовара.Количество;
										Исключение
											ЗаписьЖурналаРегистрации("Данные.Проведение", УровеньЖурналаРегистрации.Предупреждение, Метаданные.Документы.ЗаказНаПеремещение,, "Не удалось поставить в резерв товар " + ВыборкаДетальныеЗаписи.Номенклатура + ", в заказе " + ВыборкаДетальныеЗаписи.Ссылка + Символы.ПС + ОписаниеОшибки());
											Сообщить("Не удалось поставить в резерв товар " + ВыборкаДетальныеЗаписи.Номенклатура + ", в заказе " + ВыборкаДетальныеЗаписи.Ссылка);
										КонецПопытки;
										//ASP_Hlopkov 20.10.2020+
										Если ТЗНеПоставленых.Количество() = 0 Тогда
											НоваяСтрока = ТЗНеПоставленых.Добавить();
										
											НоваяСтрока.ЗаказКлиента = ВыборкаДетальныеЗаписи.ЗаказКлиента;
											НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
											НоваяСтрока.Назначение 	 = ВыборкаДетальныеЗаписи.Назначение;
											НоваяСтрока.Количество	 = ВыборкаДетальныеЗаписи.Количество;
										Иначе
											МассивНайденойСтроки = ТЗНеПоставленых.НайтиСтроки(Новый Структура("ЗаказКлиента, Номенклатура, Назначение", ВыборкаДетальныеЗаписи.ЗаказКлиента, ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Назначение));
											
											Если МассивНайденойСтроки.Количество() > 0 Тогда
												НоваяСтрока = МассивНайденойСтроки[0];
												НоваяСтрока.Количество = НоваяСтрока.Количество + ВыборкаДетальныеЗаписи.Количество;
											Иначе
												НоваяСтрока = ТЗНеПоставленых.Добавить();
										
												НоваяСтрока.ЗаказКлиента = ВыборкаДетальныеЗаписи.ЗаказКлиента;
												НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
												НоваяСтрока.Назначение 	 = ВыборкаДетальныеЗаписи.Назначение;
												НоваяСтрока.Количество	 = ВыборкаДетальныеЗаписи.Количество;
											КонецЕсли;
											
										КонецЕсли;
										
										Если (?(НоваяСтрока <> Неопределено, НоваяСтрока.Количество, 0) + КоличествоЗарезервировано) >= КоличествоТовараВЗаказе Тогда
											Если НоваяСтрока <> Неопределено Тогда
												НоваяСтрока.НужноСоздаватьЗаказ = Ложь;
											КонецЕсли;	
										Иначе
											Если НоваяСтрока <> Неопределено Тогда
												НоваяСтрока.НужноСоздаватьЗаказ = Истина;
											КонецЕсли;	
										КонецЕсли;	
										
									КонецЕсли;
									
								Иначе
									
									Если ТЗНеПоставленых.Количество() = 0 Тогда
										НоваяСтрока = ТЗНеПоставленых.Добавить();
												
										НоваяСтрока.ЗаказКлиента = ВыборкаДетальныеЗаписи.ЗаказКлиента;
										НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
										НоваяСтрока.Назначение 	 = ВыборкаДетальныеЗаписи.Назначение;
										НоваяСтрока.Количество	 = ВыборкаДетальныеЗаписи.Количество;
									Иначе
										МассивНайденойСтроки = ТЗНеПоставленых.НайтиСтроки(Новый Структура("ЗаказКлиента, Номенклатура, Назначение", ВыборкаДетальныеЗаписи.ЗаказКлиента, ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Назначение));
												
										Если МассивНайденойСтроки.Количество() > 0 Тогда
											НоваяСтрока = МассивНайденойСтроки[0];
											НоваяСтрока.Количество = НоваяСтрока.Количество + ВыборкаДетальныеЗаписи.Количество;
										Иначе
											НоваяСтрока = ТЗНеПоставленых.Добавить();
											
											НоваяСтрока.ЗаказКлиента = ВыборкаДетальныеЗаписи.ЗаказКлиента;
											НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
											НоваяСтрока.Назначение 	 = ВыборкаДетальныеЗаписи.Назначение;
											НоваяСтрока.Количество	 = ВыборкаДетальныеЗаписи.Количество;
										КонецЕсли;
										
									КонецЕсли;	
									
									Если (?(НоваяСтрока <> Неопределено, НоваяСтрока.Количество, 0) + КоличествоЗарезервировано) >= КоличествоТовараВЗаказе Тогда
										Если НоваяСтрока <> Неопределено Тогда
											НоваяСтрока.НужноСоздаватьЗаказ = Ложь;
										КонецЕсли;	
									Иначе
										Если НоваяСтрока <> Неопределено Тогда
											НоваяСтрока.НужноСоздаватьЗаказ = Истина;
										КонецЕсли;	
									КонецЕсли;
									//ASP_Hlopkov 20.10.2020-
								КонецЕсли;	
							КонецЕсли;	
						КонецЦикла;
					КонецЦикла;	
				КонецЦикла;	
			//ASP_Hlopkov 09.10.2020-
			Иначе	
			
				Перемещение = рефакторингСоздатьЗаказНаПеремещение(ПоступлениеТовараНаСклад, ВыборкаЗаказовКлиентов, ЗначенияРеквизитовПриобретения); //+++ {{ ASP 11.11.2020 000008970 }} проведен рефакторинг
				
			КонецЕсли;
			
	#КонецОбласти
			
			//Если ТЗНеПоставленых.Количество() > 0 Тогда
			Выборка = ВыборкаЗаказовКлиентов.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				//ASP_Hlopkov 20.10.2020+
				Если ТЗНеПоставленых <> Неопределено Тогда
					МассивНеПоставленых = ТЗНеПоставленых.НайтиСтроки(Новый Структура("ЗаказКлиента, Номенклатура", ВыборкаЗаказовКлиентов.ЗаказКлиента, Выборка.Номенклатура));
				
					Если МассивНеПоставленых.Количество() = 0 Тогда
						
						рефакторингДобавитьТоварВЗаказНаПеремещениеСоздавПриНеобходимостиПредварительноДокумент(Перемещение, Выборка, //+++ {{ ASP 11.11.2020 000008970 }} проведен рефакторинг
							ВыборкаЗаказовКлиентов, ПоступлениеТовараНаСклад, ЗначенияРеквизитовПриобретения, СтруктураОтбораПриобретенных, ПриобретенныеТовары);
						
					Иначе
						СтрокаМассива = МассивНеПоставленых[0];
						
						Если СтрокаМассива.НужноСоздаватьЗаказ Тогда
							
							рефакторингДобавитьТоварВЗаказНаПеремещениеСоздавПриНеобходимостиПредварительноДокумент(Перемещение, Выборка, //+++ {{ ASP 11.11.2020 000008970 }} проведен рефакторинг
								ВыборкаЗаказовКлиентов, ПоступлениеТовараНаСклад, ЗначенияРеквизитовПриобретения, СтруктураОтбораПриобретенных, ПриобретенныеТовары);
							
						КонецЕсли;	
						
					КонецЕсли;
					
				Иначе
					
					рефакторингДобавитьТоварВЗаказНаПеремещениеСоздавПриНеобходимостиПредварительноДокумент(Перемещение, Выборка, //+++ {{ ASP 11.11.2020 000008970 }} проведен рефакторинг
						ВыборкаЗаказовКлиентов, ПоступлениеТовараНаСклад, ЗначенияРеквизитовПриобретения, СтруктураОтбораПриобретенных, ПриобретенныеТовары);
					
				КонецЕсли;	
				//ASP_Hlopkov 20.10.2020-	
			КонецЦикла;
			
			
			//ASP_Hlopkov 19.10.2020+
			Если Перемещение = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			//ASP_Hlopkov 19.10.2020-

			
			Если Перемещение.Товары.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ПолучитьСообщенияПользователю(Истина);
			
			Попытка
				Перемещение.Записать(РежимЗаписиДокумента.Проведение);
				Результат.СозданныеДокументы.Добавить(Перемещение.Ссылка);
			Исключение
				ТекстОшибки = "Не удалось создать новый Заказ на перемещение";
				Если Перемещение.Товары.Количество() > 0 Тогда
					ТекстОшибки = ТекстОшибки + " с товаром(ами) ";
					Для Каждого СтрокаТЧ Из Перемещение.Товары Цикл
						ТекстОшибки = ТекстОшибки + Строка(СтрокаТЧ.Номенклатура) + Символы.ПС;
					КонецЦикла;
				КонецЕсли;
				ТекстОшибки = ТекстОшибки + "по причине:" + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				
				МассивСообщенийПользователю = ПолучитьСообщенияПользователю(Истина);
				СтрокаСообщений = "";
				Для Каждого Сообщение Из МассивСообщенийПользователю Цикл
					СтрокаСообщений = СтрокаСообщений + Сообщение.Текст + Символы.ПС;
				КонецЦикла;
				
				СтрокаСообщений = ?(ПустаяСтрока(СтрокаСообщений), "", Символы.ПС + СтрокаСообщений);
				ВесьТекстОшибки = ТекстОшибки + СтрокаСообщений;
				
				Результат.Ошибки.Добавить(ВесьТекстОшибки);
				
				//ASP_Hlopkov 21.10.2020+
				ЗаписьЖурналаРегистрации("Данные.Изменение", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЗаказНаПеремещение,, ВесьТекстОшибки + Символы.ПС + ОписаниеОшибки()); 
				//ASP_Hlopkov 21.10.2020-
				
			КонецПопытки;
			
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция Тест() Экспорт
	
	Возврат Истина;
	
КонецФункции