
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ASP_ВалютныйУчет
	Движения.ASP_ВалютныйУчет.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ASP_ВалютныйУчет.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Характеристика = ТекСтрокаТовары.Характеристика;
		Движение.ЦенаВВалюте = ТекСтрокаТовары.Цена;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Курс = ASP_КурсВалюты;
		Движение.ВидЦены=ВалютаУчета;
		Движение.Коррекция=?(ТекСтрокаТовары.Количество<0,истина,ложь)
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
