
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура асп_ОбработкаПроведения(Отказ, РежимПроведения)
    #Вставка
	Если СтрНайти(Строка(СкладПолучатель), "Объект не найден") > 0 Тогда //Отказ = Истина; 
		Попытка
			ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,,"Ошибка с битой ссылкой" + Символы.ПС + ЭтотОбъект.СкладПолучатель +
			Символы.ПС + ЭтотОбъект.Товары[0].ASP_ЗаказКлиента + Символы.ПС + ЭтотОбъект.Товары[0].Номенклатура + Символы.ПС + ЭтотОбъект.Товары[0].Количество +Символы.ПС + ЭтотОбъект.Товары[0].КоличествоУпаковок +"", "Ошибка с битой ссылкой");	
		Исключение
			ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,,"Ошибка с битой ссылкой" + Символы.ПС + ЭтотОбъект.СкладПолучатель + "", "Ошибка с битой ссылкой");	
		КонецПопытки;
	КонецЕсли;
	#КонецВставки
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ);
	
	//++ASP_Crow 11.03.2026 000029567 в расширение 
	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ);  
	Если Отказ Тогда
		ЗаписьЖурналаРегистрации("Проверка отказа перемещения", УровеньЖурналаРегистрации.Примечание,,,"Отказ после ДоставкаТоваров");  
	КонецЕсли;
	//ASP_Hlopkov 10.09.2020+ Добавил условие
	Если НЕ ДополнительныеСвойства.Свойство("БезКонтроляОстатков") Тогда
		ВыполнитьКонтрольЗаказаПослеПроведения(Отказ);
	КонецЕсли;
	Если Отказ Тогда
		ЗаписьЖурналаРегистрации("Проверка отказа перемещения", УровеньЖурналаРегистрации.Примечание,,,"Отказ после ВыполнитьКонтрольЗаказаПослеПроведения");  
	КонецЕсли;     
	//--ASP_Crow 11.03.2026 000029567 в расширение
	
	ВыполнитьКонтрольЗаказаПослеПроведения(Отказ);
	
	ЗаказНаПеремещениеЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры
