//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИспользуютсяСегменты = ПолучитьФункциональнуюОпцию("ИспользоватьСегментыНоменклатуры");
	
	ДанныеВыбора = Новый СписокЗначений; // СписокЗначений Из ПеречислениеСсылка.СоставыТоваровРетроБонусов
	ДанныеВыбора.Добавить(Номенклатура);
	ДанныеВыбора.Добавить(СвойствоНоменклатуры);
	Если ИспользуютсяСегменты Тогда
		ДанныеВыбора.Добавить(СегментыНоменклатуры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли