&НаСервере
Функция НайтиДокументРеализацииНаСервере(Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен
	|	И РеализацияТоваровУслуг.ЗаявкаНаТранспорт = &ЗаявкаНаТранспорт";

	Запрос.УстановитьПараметр("ЗаявкаНаТранспорт", Заявка);
	
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	МассивДокументов = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивДокументов.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;	
	
	Возврат МассивДокументов;
	
КонецФункции//НайтиДокументРеализацииНаСервере	
	
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДокРеализации = НайтиДокументРеализацииНаСервере(ПараметрКоманды);
		
	Если ДокРеализации.Количество() = 0 Тогда
		Сообщить("Не найдено связанных с заявкой (" + ПараметрКоманды + ") документов реализации!");	
		Возврат;
	КонецЕсли;
	
	Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ДокРеализации) Тогда
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			//"Документ.РеализацияТоваровУслуг",
			"Обработка.ПечатьОбщихФорм",
			"ТОРГ12",
			ДокРеализации,
			//Неопределено,
			ПараметрыВыполненияКоманды.Источник,
			Новый Структура("ВыводитьУслуги", Ложь)
		);
	
	КонецЕсли;
	
КонецПроцедуры
