#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		ПроверкаДоступностиЗаписиВидовЗаданийВРегистрОчереди(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ПроверкаДоступностиЗаписиВидовЗаданийВРегистрОчереди(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаДоступностиЗаписиВидовЗаданийВРегистрОчереди(НаборЗаписей)
	
	МетаданныеРегистра = Метаданные();
	ИдентификаторРегистра = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(МетаданныеРегистра.ПолноеИмя());

	СписокДоступныхВидовЗаданий = НеоперативнаяОчередьЗаданийПовтИсп.СписокДоступныхВидовЗаданийДляРегистраОчереди(
		ИдентификаторРегистра);

	Для Каждого Запись Из ЭтотОбъект Цикл

		Если СписокДоступныхВидовЗаданий.Найти(Запись.ВидЗадания) = Неопределено Тогда

			ТекстИсключения = НСтр(
				"ru='Недопустимо регистрировать задание с видом операции ""%1"" в регистре очереди ""%2"".'");
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстИсключения,
				Запись.ВидЗадания, МетаданныеРегистра.Представление());

		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли