#Область СлужебныйПрограммныйИнтерфейс

// Получает составные имена для полей выборки из регистра РаспоряженияНаОтгрузкуИВозврат
// по имени показателя, имени ресурса и признаку таблицы оборотов.
//
// Параметры:
// 	ИмяПоказателя - Строка
// 	ИмяРесурса - Строка
// 	Оборот - Булево.
//
// Возвращаемое значение:
// 	Структура:
// 		* ИмяПоляТаблицы - Строка
// 		* ИмяПоляВыборки - Строка.
//
Функция ИменаПолейВыборки(ИмяПоказателя, ИмяРесурса, Оборот) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ИмяПоляТаблицы", "");
	Результат.Вставить("ИмяПоляВыборки", "");
	
	ТаблицаСоответствия = РаботаСРаспоряжениямиПовтИсп.ТаблицаСоответствияИменПолейВыборки();
	
	ПараметрыПоиска = Новый Структура();
	ПараметрыПоиска.Вставить("ИмяПоказателя", ИмяПоказателя);
	ПараметрыПоиска.Вставить("ИмяРесурса", ИмяРесурса);
	ПараметрыПоиска.Вставить("Оборот", Оборот);
	
	ПоискСтрок = ТаблицаСоответствия.НайтиСтроки(ПараметрыПоиска);
	Если ПоискСтрок.Количество() > 0 Тогда
		
		СтрокаИменПолей = ПоискСтрок[0];
		
		Результат.ИмяПоляТаблицы = СтрокаИменПолей.ИмяПоляТаблицы;
		Результат.ИмяПоляВыборки = СтрокаИменПолей.ИмяПоляВыборки;
		
	Иначе
		
		ТекстИсключения = СтрШаблон(НСтр("ru = 'Ошибка вычисления имен полей при попытке получения данных по распоряжениям.
			|Показатель: ""%1""
			|Ресурс: ""%2""
			|Оборот %3'"),
			ИмяПоказателя,
			ИмяРесурса,
			Оборот);
		
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Создает таблицу соответствия имен полей выборки.
//
// Возвращаемое значение:
// 	ТаблицаЗначений:
// 		* ИмяПоказателя - Строка
// 		* ИмяРесурса - Строка
// 		* Оборот - Булево
// 		* ИмяПоляТаблицы - Строка
// 		* ИмяПоляВыборки - Строка.
//
Функция ТаблицаСоответствияИменПолейВыборки() Экспорт
	
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("ИмяПоказателя");
	Результат.Колонки.Добавить("ИмяРесурса");
	Результат.Колонки.Добавить("Оборот");
	Результат.Колонки.Добавить("ИмяПоляТаблицы");
	Результат.Колонки.Добавить("ИмяПоляВыборки");
	
	#Область Заказано
	
	ДобавитьИменаПоля(Результат, "Заказано", "Количество", Ложь, "Количество", "ЗаказаноКоличество");
	ДобавитьИменаПоля(Результат, "Заказано", "Сумма", Ложь, "Сумма", "ЗаказаноСумма");
	ДобавитьИменаПоля(Результат, "Заказано", "СуммаНДС", Ложь, "СуммаНДС", "ЗаказаноСуммаНДС");
	ДобавитьИменаПоля(Результат, "Заказано", "СуммаНДСУпр", Ложь, "СуммаНДСУпр", "ЗаказаноСуммаНДСУпр");
	ДобавитьИменаПоля(Результат, "Заказано", "СуммаНДСРегл", Ложь, "СуммаНДСРегл", "ЗаказаноСуммаНДСРегл");
	
	ДобавитьИменаПоля(Результат, "Заказано", "Количество", Истина, "КоличествоОборот", "ЗаказаноКоличествоОборот");
	ДобавитьИменаПоля(Результат, "Заказано", "Сумма", Истина, "СуммаОборот", "ЗаказаноСуммаОборот");
	ДобавитьИменаПоля(Результат, "Заказано", "СуммаНДС", Истина, "СуммаНДСОборот", "ЗаказаноСуммаНДСОборот");
	ДобавитьИменаПоля(Результат, "Заказано", "СуммаНДСУпр", Истина, "СуммаНДСУпрОборот", "ЗаказаноСуммаНДСУпрОборот");
	ДобавитьИменаПоля(Результат, "Заказано", "СуммаНДСРегл", Истина, "СуммаНДСРеглОборот", "ЗаказаноСуммаНДСРеглОборот");
	
	#КонецОбласти
	
	#Область ЗаявленоНаВозврат
	
	ДобавитьИменаПоля(Результат, "ЗаявленоНаВозврат", "Количество", Ложь, "Количество", "ЗаявленоНаВозвратКоличество");
	ДобавитьИменаПоля(Результат, "ЗаявленоНаВозврат", "Сумма", Ложь, "Сумма", "ЗаявленоНаВозвратСумма");
	ДобавитьИменаПоля(Результат, "ЗаявленоНаВозврат", "СуммаНДС", Ложь, "СуммаНДС", "ЗаявленоНаВозвратСуммаНДС");
	ДобавитьИменаПоля(Результат, "ЗаявленоНаВозврат", "СуммаНДСУпр", Ложь, "СуммаНДСУпр", "ЗаявленоНаВозвратСуммаНДСУпр");
	ДобавитьИменаПоля(Результат, "ЗаявленоНаВозврат", "СуммаНДСРегл", Ложь, "СуммаНДСРегл", "ЗаявленоНаВозвратСуммаНДСРегл");
	
	ДобавитьИменаПоля(Результат, "ЗаявленоНаВозврат", "Количество", Истина, "КоличествоОборот", "ЗаявленоНаВозвратКоличествоОборот");
	ДобавитьИменаПоля(Результат, "ЗаявленоНаВозврат", "Сумма", Истина, "СуммаОборот", "ЗаявленоНаВозвратСуммаОборот");
	ДобавитьИменаПоля(Результат, "ЗаявленоНаВозврат", "СуммаНДС", Истина, "СуммаНДСОборот", "ЗаявленоНаВозвратСуммаНДСОборот");
	ДобавитьИменаПоля(Результат, "ЗаявленоНаВозврат", "СуммаНДСУпр", Истина, "СуммаНДСУпрОборот", "ЗаявленоНаВозвратСуммаНДСУпрОборот");
	ДобавитьИменаПоля(Результат, "ЗаявленоНаВозврат", "СуммаНДСРегл", Истина, "СуммаНДСРеглОборот", "ЗаявленоНаВозвратСуммаНДСРеглОборот");
	
	#КонецОбласти
	
	#Область Отменено
	
	ДобавитьИменаПоля(Результат, "Отменено", "Количество", Ложь, "Количество", "ОтмененоКоличество");
	ДобавитьИменаПоля(Результат, "Отменено", "Сумма", Ложь, "Сумма", "ОтмененоСумма");
	ДобавитьИменаПоля(Результат, "Отменено", "СуммаНДС", Ложь, "СуммаНДС", "ОтмененоСуммаНДС");
	ДобавитьИменаПоля(Результат, "Отменено", "СуммаНДСУпр", Ложь, "СуммаНДСУпр", "ОтмененоСуммаНДСУпр");
	ДобавитьИменаПоля(Результат, "Отменено", "СуммаНДСРегл", Ложь, "СуммаНДСРегл", "ОтмененоСуммаНДСРегл");
	
	ДобавитьИменаПоля(Результат, "Отменено", "Количество", Истина, "КоличествоОборот", "ОтмененоКоличествоОборот");
	ДобавитьИменаПоля(Результат, "Отменено", "Сумма", Истина, "СуммаОборот", "ОтмененоСуммаОборот");
	ДобавитьИменаПоля(Результат, "Отменено", "СуммаНДС", Истина, "СуммаНДСОборот", "ОтмененоСуммаНДСОборот");
	ДобавитьИменаПоля(Результат, "Отменено", "СуммаНДСУпр", Истина, "СуммаНДСУпрОборот", "ОтмененоСуммаНДСУпрОборот");
	ДобавитьИменаПоля(Результат, "Отменено", "СуммаНДСРегл", Истина, "СуммаНДСРеглОборот", "ОтмененоСуммаНДСРеглОборот");
	
	#КонецОбласти
	
	#Область КОформлению
	
	ДобавитьИменаПоля(Результат, "КОформлению", "Количество", Ложь, "Количество", "КОформлениюКоличество");
	ДобавитьИменаПоля(Результат, "КОформлению", "Сумма", Ложь, "Сумма", "КОформлениюСумма");
	ДобавитьИменаПоля(Результат, "КОформлению", "СуммаНДС", Ложь, "СуммаНДС", "КОформлениюСуммаНДС");
	ДобавитьИменаПоля(Результат, "КОформлению", "СуммаНДСУпр", Ложь, "СуммаНДСУпр", "КОформлениюСуммаНДСУпр");
	ДобавитьИменаПоля(Результат, "КОформлению", "СуммаНДСРегл", Ложь, "СуммаНДСРегл", "КОформлениюСуммаНДСРегл");
	
	ДобавитьИменаПоля(Результат, "КОформлению", "Количество", Истина, "КоличествоОборот", "КОформлениюКоличествоОборот");
	ДобавитьИменаПоля(Результат, "КОформлению", "Сумма", Истина, "СуммаОборот", "КОформлениюСуммаОборот");
	ДобавитьИменаПоля(Результат, "КОформлению", "СуммаНДС", Истина, "СуммаНДСОборот", "КОформлениюСуммаНДСОборот");
	ДобавитьИменаПоля(Результат, "КОформлению", "СуммаНДСУпр", Истина, "СуммаНДСУпрОборот", "КОформлениюСуммаНДСУпрОборот");
	ДобавитьИменаПоля(Результат, "КОформлению", "СуммаНДСРегл", Истина, "СуммаНДСРеглОборот", "КОформлениюСуммаНДСРеглОборот");
	
	#КонецОбласти
	
	#Область Оформлено
	
	ДобавитьИменаПоля(Результат, "Оформлено", "Количество", Ложь, "Количество", "ОформленоКоличество");
	ДобавитьИменаПоля(Результат, "Оформлено", "Сумма", Ложь, "Сумма", "ОформленоСумма");
	ДобавитьИменаПоля(Результат, "Оформлено", "СуммаНДС", Ложь, "СуммаНДС", "ОформленоСуммаНДС");
	ДобавитьИменаПоля(Результат, "Оформлено", "СуммаНДСУпр", Ложь, "СуммаНДСУпр", "ОформленоСуммаНДСУпр");
	ДобавитьИменаПоля(Результат, "Оформлено", "СуммаНДСРегл", Ложь, "СуммаНДСРегл", "ОформленоСуммаНДСРегл");
	
	ДобавитьИменаПоля(Результат, "Оформлено", "Количество", Истина, "КоличествоОборот", "ОформленоКоличествоОборот");
	ДобавитьИменаПоля(Результат, "Оформлено", "Сумма", Истина, "СуммаОборот", "ОформленоСуммаОборот");
	ДобавитьИменаПоля(Результат, "Оформлено", "СуммаНДС", Истина, "СуммаНДСОборот", "ОформленоСуммаНДСОборот");
	ДобавитьИменаПоля(Результат, "Оформлено", "СуммаНДСУпр", Истина, "СуммаНДСУпрОборот", "ОформленоСуммаНДСУпрОборот");
	ДобавитьИменаПоля(Результат, "Оформлено", "СуммаНДСРегл", Истина, "СуммаНДСРеглОборот", "ОформленоСуммаНДСРеглОборот");
	
	#КонецОбласти
	
	#Область КОформлениюПоВозвратам
	
	ДобавитьИменаПоля(Результат, "КОформлениюПоВозвратам", "Количество", Ложь, "Количество", "КОформлениюПоВозвратамКоличество");
	ДобавитьИменаПоля(Результат, "КОформлениюПоВозвратам", "Сумма", Ложь, "Сумма", "КОформлениюПоВозвратамСумма");
	ДобавитьИменаПоля(Результат, "КОформлениюПоВозвратам", "СуммаНДС", Ложь, "СуммаНДС", "КОформлениюПоВозвратамСуммаНДС");
	ДобавитьИменаПоля(Результат, "КОформлениюПоВозвратам", "СуммаНДСУпр", Ложь, "СуммаНДСУпр", "КОформлениюПоВозвратамСуммаНДСУпр");
	ДобавитьИменаПоля(Результат, "КОформлениюПоВозвратам", "СуммаНДСРегл", Ложь, "СуммаНДСРегл", "КОформлениюПоВозвратамСуммаНДСРегл");
	
	ДобавитьИменаПоля(Результат, "КОформлениюПоВозвратам", "Количество", Истина, "КоличествоОборот", "КОформлениюПоВозвратамКоличествоОборот");
	ДобавитьИменаПоля(Результат, "КОформлениюПоВозвратам", "Сумма", Истина, "СуммаОборот", "КОформлениюПоВозвратамСуммаОборот");
	ДобавитьИменаПоля(Результат, "КОформлениюПоВозвратам", "СуммаНДС", Истина, "СуммаНДСОборот", "КОформлениюПоВозвратамСуммаНДСОборот");
	ДобавитьИменаПоля(Результат, "КОформлениюПоВозвратам", "СуммаНДСУпр", Истина, "СуммаНДСУпрОборот", "КОформлениюПоВозвратамСуммаНДСУпрОборот");
	ДобавитьИменаПоля(Результат, "КОформлениюПоВозвратам", "СуммаНДСРегл", Истина, "СуммаНДСРеглОборот", "КОформлениюПоВозвратамСуммаНДСРеглОборот");
	
	#КонецОбласти
	
	#Область ОформленоПоВозвратам
	
	ДобавитьИменаПоля(Результат, "ОформленоПоВозвратам", "Количество", Ложь, "Количество", "ОформленоПоВозвратамКоличество");
	ДобавитьИменаПоля(Результат, "ОформленоПоВозвратам", "Сумма", Ложь, "Сумма", "ОформленоПоВозвратамСумма");
	ДобавитьИменаПоля(Результат, "ОформленоПоВозвратам", "СуммаНДС", Ложь, "СуммаНДС", "ОформленоПоВозвратамСуммаНДС");
	ДобавитьИменаПоля(Результат, "ОформленоПоВозвратам", "СуммаНДСУпр", Ложь, "СуммаНДСУпр", "ОформленоПоВозвратамСуммаНДСУпр");
	ДобавитьИменаПоля(Результат, "ОформленоПоВозвратам", "СуммаНДСРегл", Ложь, "СуммаНДСРегл", "ОформленоПоВозвратамСуммаНДСРегл");
	
	ДобавитьИменаПоля(Результат, "ОформленоПоВозвратам", "Количество", Истина, "КоличествоОборот", "ОформленоПоВозвратамКоличествоОборот");
	ДобавитьИменаПоля(Результат, "ОформленоПоВозвратам", "Сумма", Истина, "СуммаОборот", "ОформленоПоВозвратамСуммаОборот");
	ДобавитьИменаПоля(Результат, "ОформленоПоВозвратам", "СуммаНДС", Истина, "СуммаНДСОборот", "ОформленоПоВозвратамСуммаНДСОборот");
	ДобавитьИменаПоля(Результат, "ОформленоПоВозвратам", "СуммаНДСУпр", Истина, "СуммаНДСУпрОборот", "ОформленоПоВозвратамСуммаНДСУпрОборот");
	ДобавитьИменаПоля(Результат, "ОформленоПоВозвратам", "СуммаНДСРегл", Истина, "СуммаНДСРеглОборот", "ОформленоПоВозвратамСуммаНДСРеглОборот");
	
	#КонецОбласти
	
	#Область КОтгрузке
	
	ДобавитьИменаПоля(Результат, "КОтгрузке", "Количество", Ложь, "Количество", "КОтгрузкеКоличество");
	ДобавитьИменаПоля(Результат, "КОтгрузке", "Сумма", Ложь, "Сумма", "КОтгрузкеСумма");
	ДобавитьИменаПоля(Результат, "КОтгрузке", "СуммаНДС", Ложь, "СуммаНДС", "КОтгрузкеСуммаНДС");
	ДобавитьИменаПоля(Результат, "КОтгрузке", "СуммаНДСУпр", Ложь, "СуммаНДСУпр", "КОтгрузкеСуммаНДСУпр");
	ДобавитьИменаПоля(Результат, "КОтгрузке", "СуммаНДСРегл", Ложь, "СуммаНДСРегл", "КОтгрузкеСуммаНДСРегл");
	
	ДобавитьИменаПоля(Результат, "КОтгрузке", "Количество", Истина, "КоличествоОборот", "КОтгрузкеКоличествоОборот");
	ДобавитьИменаПоля(Результат, "КОтгрузке", "Сумма", Истина, "СуммаОборот", "КОтгрузкеСуммаОборот");
	ДобавитьИменаПоля(Результат, "КОтгрузке", "СуммаНДС", Истина, "СуммаНДСОборот", "КОтгрузкеСуммаНДСОборот");
	ДобавитьИменаПоля(Результат, "КОтгрузке", "СуммаНДСУпр", Истина, "СуммаНДСУпрОборот", "КОтгрузкеСуммаНДСУпрОборот");
	ДобавитьИменаПоля(Результат, "КОтгрузке", "СуммаНДСРегл", Истина, "СуммаНДСРеглОборот", "КОтгрузкеСуммаНДСРеглОборот");
	
	#КонецОбласти
	
	#Область Отгружено
	
	ДобавитьИменаПоля(Результат, "Отгружено", "Количество", Ложь, "Количество", "ОтгруженоКоличество");
	ДобавитьИменаПоля(Результат, "Отгружено", "Сумма", Ложь, "Сумма", "ОтгруженоСумма");
	ДобавитьИменаПоля(Результат, "Отгружено", "СуммаНДС", Ложь, "СуммаНДС", "ОтгруженоСуммаНДС");
	ДобавитьИменаПоля(Результат, "Отгружено", "СуммаНДСУпр", Ложь, "СуммаНДСУпр", "ОтгруженоСуммаНДСУпр");
	ДобавитьИменаПоля(Результат, "Отгружено", "СуммаНДСРегл", Ложь, "СуммаНДСРегл", "ОтгруженоСуммаНДСРегл");
	
	ДобавитьИменаПоля(Результат, "Отгружено", "Количество", Истина, "КоличествоОборот", "ОтгруженоКоличествоОборот");
	ДобавитьИменаПоля(Результат, "Отгружено", "Сумма", Истина, "СуммаОборот", "ОтгруженоСуммаОборот");
	ДобавитьИменаПоля(Результат, "Отгружено", "СуммаНДС", Истина, "СуммаНДСОборот", "ОтгруженоСуммаНДСОборот");
	ДобавитьИменаПоля(Результат, "Отгружено", "СуммаНДСУпр", Истина, "СуммаНДСУпрОборот", "ОтгруженоСуммаНДСУпрОборот");
	ДобавитьИменаПоля(Результат, "Отгружено", "СуммаНДСРегл", Истина, "СуммаНДСРеглОборот", "ОтгруженоСуммаНДСРеглОборот");
	
	#КонецОбласти
	
	#Область КПриемке
	
	ДобавитьИменаПоля(Результат, "КПриемке", "Количество", Ложь, "Количество", "КПриемкеКоличество");
	ДобавитьИменаПоля(Результат, "КПриемке", "Сумма", Ложь, "Сумма", "КПриемкеСумма");
	ДобавитьИменаПоля(Результат, "КПриемке", "СуммаНДС", Ложь, "СуммаНДС", "КПриемкеСуммаНДС");
	ДобавитьИменаПоля(Результат, "КПриемке", "СуммаНДСУпр", Ложь, "СуммаНДСУпр", "КПриемкеСуммаНДСУпр");
	ДобавитьИменаПоля(Результат, "КПриемке", "СуммаНДСРегл", Ложь, "СуммаНДСРегл", "КПриемкеСуммаНДСРегл");
	
	ДобавитьИменаПоля(Результат, "КПриемке", "Количество", Истина, "КоличествоОборот", "КПриемкеКоличествоОборот");
	ДобавитьИменаПоля(Результат, "КПриемке", "Сумма", Истина, "СуммаОборот", "КПриемкеСуммаОборот");
	ДобавитьИменаПоля(Результат, "КПриемке", "СуммаНДС", Истина, "СуммаНДСОборот", "КПриемкеСуммаНДСОборот");
	ДобавитьИменаПоля(Результат, "КПриемке", "СуммаНДСУпр", Истина, "СуммаНДСУпрОборот", "КПриемкеСуммаНДСУпрОборот");
	ДобавитьИменаПоля(Результат, "КПриемке", "СуммаНДСРегл", Истина, "СуммаНДСРеглОборот", "КПриемкеСуммаНДСРеглОборот");
	
	#КонецОбласти
	
	#Область Принято
	
	ДобавитьИменаПоля(Результат, "Принято", "Количество", Ложь, "Количество", "ПринятоКоличество");
	ДобавитьИменаПоля(Результат, "Принято", "Сумма", Ложь, "Сумма", "ПринятоСумма");
	ДобавитьИменаПоля(Результат, "Принято", "СуммаНДС", Ложь, "СуммаНДС", "ПринятоСуммаНДС");
	ДобавитьИменаПоля(Результат, "Принято", "СуммаНДСУпр", Ложь, "СуммаНДСУпр", "ПринятоСуммаНДСУпр");
	ДобавитьИменаПоля(Результат, "Принято", "СуммаНДСРегл", Ложь, "СуммаНДСРегл", "ПринятоСуммаНДСРегл");
	
	ДобавитьИменаПоля(Результат, "Принято", "Количество", Истина, "КоличествоОборот", "ПринятоКоличествоОборот");
	ДобавитьИменаПоля(Результат, "Принято", "Сумма", Истина, "СуммаОборот", "ПринятоСуммаОборот");
	ДобавитьИменаПоля(Результат, "Принято", "СуммаНДС", Истина, "СуммаНДСОборот", "ПринятоСуммаНДСОборот");
	ДобавитьИменаПоля(Результат, "Принято", "СуммаНДСУпр", Истина, "СуммаНДСУпрОборот", "ПринятоСуммаНДСУпрОборот");
	ДобавитьИменаПоля(Результат, "Принято", "СуммаНДСРегл", Истина, "СуммаНДСРеглОборот", "ПринятоСуммаНДСРеглОборот");
	
	#КонецОбласти
	
	#Область ПринятоПоВозвратам
	
	ДобавитьИменаПоля(Результат, "ПринятоПоВозвратам", "Количество", Ложь, "Количество", "ПринятоПоВозвратамКоличество");
	ДобавитьИменаПоля(Результат, "ПринятоПоВозвратам", "Сумма", Ложь, "Сумма", "ПринятоПоВозвратамСумма");
	ДобавитьИменаПоля(Результат, "ПринятоПоВозвратам", "СуммаНДС", Ложь, "СуммаНДС", "ПринятоПоВозвратамСуммаНДС");
	ДобавитьИменаПоля(Результат, "ПринятоПоВозвратам", "СуммаНДСУпр", Ложь, "СуммаНДСУпр", "ПринятоПоВозвратамСуммаНДСУпр");
	ДобавитьИменаПоля(Результат, "ПринятоПоВозвратам", "СуммаНДСРегл", Ложь, "СуммаНДСРегл", "ПринятоПоВозвратамСуммаНДСРегл");
	
	ДобавитьИменаПоля(Результат, "ПринятоПоВозвратам", "Количество", Истина, "КоличествоОборот", "ПринятоПоВозвратамКоличествоОборот");
	ДобавитьИменаПоля(Результат, "ПринятоПоВозвратам", "Сумма", Истина, "СуммаОборот", "ПринятоПоВозвратамСуммаОборот");
	ДобавитьИменаПоля(Результат, "ПринятоПоВозвратам", "СуммаНДС", Истина, "СуммаНДСОборот", "ПринятоПоВозвратамСуммаНДСОборот");
	ДобавитьИменаПоля(Результат, "ПринятоПоВозвратам", "СуммаНДСУпр", Истина, "СуммаНДСУпрОборот", "ПринятоПоВозвратамСуммаНДСУпрОборот");
	ДобавитьИменаПоля(Результат, "ПринятоПоВозвратам", "СуммаНДСРегл", Истина, "СуммаНДСРеглОборот", "ПринятоПоВозвратамСуммаНДСРеглОборот");
	
	#КонецОбласти
	
	#Область СписаноДоППС
	
	ДобавитьИменаПоля(Результат, "СписаноДоППС", "Количество", Ложь, "Количество", "СписаноДоППСКоличество");
	ДобавитьИменаПоля(Результат, "СписаноДоППС", "Сумма", Ложь, "Сумма", "СписаноДоППССумма");
	ДобавитьИменаПоля(Результат, "СписаноДоППС", "СуммаНДС", Ложь, "СуммаНДС", "СписаноДоППССуммаНДС");
	ДобавитьИменаПоля(Результат, "СписаноДоППС", "СуммаНДСУпр", Ложь, "СуммаНДСУпр", "СписаноДоППССуммаНДСУпр");
	ДобавитьИменаПоля(Результат, "СписаноДоППС", "СуммаНДСРегл", Ложь, "СуммаНДСРегл", "СписаноДоППССуммаНДСРегл");
	
	ДобавитьИменаПоля(Результат, "СписаноДоППС", "Количество", Истина, "КоличествоОборот", "СписаноДоППСКоличествоОборот");
	ДобавитьИменаПоля(Результат, "СписаноДоППС", "Сумма", Истина, "СуммаОборот", "СписаноДоППССуммаОборот");
	ДобавитьИменаПоля(Результат, "СписаноДоППС", "СуммаНДС", Истина, "СуммаНДСОборот", "СписаноДоППССуммаНДСОборот");
	ДобавитьИменаПоля(Результат, "СписаноДоППС", "СуммаНДСУпр", Истина, "СуммаНДСУпрОборот", "СписаноДоППССуммаНДСУпрОборот");
	ДобавитьИменаПоля(Результат, "СписаноДоППС", "СуммаНДСРегл", Истина, "СуммаНДСРеглОборот", "СписаноДоППССуммаНДСРеглОборот");
	
	#КонецОбласти
	
	#Область ОприходованоДоППС
	
	ДобавитьИменаПоля(Результат, "ОприходованоДоППС", "Количество", Ложь, "Количество", "ОприходованоДоППСКоличество");
	ДобавитьИменаПоля(Результат, "ОприходованоДоППС", "Сумма", Ложь, "Сумма", "ОприходованоДоППССумма");
	ДобавитьИменаПоля(Результат, "ОприходованоДоППС", "СуммаНДС", Ложь, "СуммаНДС", "ОприходованоДоППССуммаНДС");
	ДобавитьИменаПоля(Результат, "ОприходованоДоППС", "СуммаНДСУпр", Ложь, "СуммаНДСУпр", "ОприходованоДоППССуммаНДСУпр");
	ДобавитьИменаПоля(Результат, "ОприходованоДоППС", "СуммаНДСРегл", Ложь, "СуммаНДСРегл", "ОприходованоДоППССуммаНДСРегл");
	
	ДобавитьИменаПоля(Результат, "ОприходованоДоППС", "Количество", Истина, "КоличествоОборот", "ОприходованоДоППСКоличествоОборот");
	ДобавитьИменаПоля(Результат, "ОприходованоДоППС", "Сумма", Истина, "СуммаОборот", "ОприходованоДоППССуммаОборот");
	ДобавитьИменаПоля(Результат, "ОприходованоДоППС", "СуммаНДС", Истина, "СуммаНДСОборот", "ОприходованоДоППССуммаНДСОборот");
	ДобавитьИменаПоля(Результат, "ОприходованоДоППС", "СуммаНДСУпр", Истина, "СуммаНДСУпрОборот", "ОприходованоДоППССуммаНДСУпрОборот");
	ДобавитьИменаПоля(Результат, "ОприходованоДоППС", "СуммаНДСРегл", Истина, "СуммаНДСРеглОборот", "ОприходованоДоППССуммаНДСРеглОборот");
	
	#КонецОбласти
	
	#Область ОформленоСчетовФактур
	
	ДобавитьИменаПоля(Результат, "ОформленоСчетовФактур", "Количество", Ложь, "Количество", "ОформленоСчетовФактурКоличество");
	ДобавитьИменаПоля(Результат, "ОформленоСчетовФактур", "Сумма", Ложь, "Сумма", "ОформленоСчетовФактурСумма");
	ДобавитьИменаПоля(Результат, "ОформленоСчетовФактур", "СуммаНДС", Ложь, "СуммаНДС", "ОформленоСчетовФактурСуммаНДС");
	ДобавитьИменаПоля(Результат, "ОформленоСчетовФактур", "СуммаНДСУпр", Ложь, "СуммаНДСУпр", "ОформленоСчетовФактурСуммаНДСУпр");
	ДобавитьИменаПоля(Результат, "ОформленоСчетовФактур", "СуммаНДСРегл", Ложь, "СуммаНДСРегл", "ОформленоСчетовФактурСуммаНДСРегл");
	
	ДобавитьИменаПоля(Результат, "ОформленоСчетовФактур", "Количество", Истина, "КоличествоОборот", "ОформленоСчетовФактурКоличествоОборот");
	ДобавитьИменаПоля(Результат, "ОформленоСчетовФактур", "Сумма", Истина, "СуммаОборот", "ОформленоСчетовФактурСуммаОборот");
	ДобавитьИменаПоля(Результат, "ОформленоСчетовФактур", "СуммаНДС", Истина, "СуммаНДСОборот", "ОформленоСчетовФактурСуммаНДСОборот");
	ДобавитьИменаПоля(Результат, "ОформленоСчетовФактур", "СуммаНДСУпр", Истина, "СуммаНДСУпрОборот", "ОформленоСчетовФактурСуммаНДСУпрОборот");
	ДобавитьИменаПоля(Результат, "ОформленоСчетовФактур", "СуммаНДСРегл", Истина, "СуммаНДСРеглОборот", "ОформленоСчетовФактурСуммаНДСРеглОборот");
	
	#КонецОбласти
	
	#Область Скорректировано
	
	ДобавитьИменаПоля(Результат, "Скорректировано", "Количество", Ложь, "Количество", "СкорректированоКоличество");
	ДобавитьИменаПоля(Результат, "Скорректировано", "Сумма", Ложь, "Сумма", "СкорректированоСумма");
	ДобавитьИменаПоля(Результат, "Скорректировано", "СуммаНДС", Ложь, "СуммаНДС", "СкорректированоСуммаНДС");
	ДобавитьИменаПоля(Результат, "Скорректировано", "СуммаНДСУпр", Ложь, "СуммаНДСУпр", "СкорректированоСуммаНДСУпр");
	ДобавитьИменаПоля(Результат, "Скорректировано", "СуммаНДСРегл", Ложь, "СуммаНДСРегл", "СкорректированоСуммаНДСРегл");
	
	ДобавитьИменаПоля(Результат, "Скорректировано", "Количество", Истина, "КоличествоОборот", "СкорректированоКоличествоОборот");
	ДобавитьИменаПоля(Результат, "Скорректировано", "Сумма", Истина, "СуммаОборот", "СкорректированоСуммаОборот");
	ДобавитьИменаПоля(Результат, "Скорректировано", "СуммаНДС", Истина, "СуммаНДСОборот", "СкорректированоСуммаНДСОборот");
	ДобавитьИменаПоля(Результат, "Скорректировано", "СуммаНДСУпр", Истина, "СуммаНДСУпрОборот", "СкорректированоСуммаНДСУпрОборот");
	ДобавитьИменаПоля(Результат, "Скорректировано", "СуммаНДСРегл", Истина, "СуммаНДСРеглОборот", "СкорректированоСуммаНДСРеглОборот");
	
	#КонецОбласти
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет строку в таблицу соответствия имен полей выборки.
//
// Параметры:
// 	Таблица - см. ТаблицаСоответствияИменПолейВыборки
// 	ИмяПоказателя - Строка
// 	ИмяРесурса - Строка
// 	Оборот - Булево
// 	ИмяПоляТаблицы - Строка
// 	ИмяПоляВыборки - Строка.
//
Процедура ДобавитьИменаПоля(Таблица, ИмяПоказателя, ИмяРесурса, Оборот, ИмяПоляТаблицы, ИмяПоляВыборки)
	
	НоваяСтрока = Таблица.Добавить();
	НоваяСтрока.ИмяПоказателя = ИмяПоказателя;
	НоваяСтрока.ИмяРесурса = ИмяРесурса;
	НоваяСтрока.Оборот = Оборот;
	НоваяСтрока.ИмяПоляТаблицы = ИмяПоляТаблицы;
	НоваяСтрока.ИмяПоляВыборки = ИмяПоляВыборки;
	
КонецПроцедуры

#КонецОбласти