&НаКлиенте
Процедура ПодразделенияПриАктивизацииСтроки(Элемент)
	
	лТекДанные	= Элементы.Подразделения.ТекущиеДанные;
	
	Если лТекДанные = Неопределено Тогда
	
		лПодразделение = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
		
	Иначе
		
		лПодразделение	= лТекДанные.ПодразделениеСсылка;
	
	КонецЕсли;
	
	ОтобразитьПрограммыСегментации(лПодразделение);
	
КонецПроцедуры

&НаСервере
Функция ОтобразитьПрограммыСегментации(пПодразделение)

	НачатьТранзакцию();
	
	Попытка
		ОтобразитьПоказателиПрограммы(пПодразделение, Справочники.сег_Сегменты.МаркетинговыйСегмент);
		ОтобразитьПоказателиПрограммы(пПодразделение, Справочники.сег_Сегменты.ОборотныйСегмент);
		ОтобразитьПоказателиПрограммы(пПодразделение, Справочники.сег_Сегменты.СегментПоЧастотеЗаказов);
	Исключение
		
		//Сообщить("Не удалось записать значения! " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
		
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	Возврат Истина;
	
КонецФункции // ОтобразитьПрограммыСегментации()

&НаСервере
Функция ОтобразитьПоказателиПрограммы(пПодразделение, пВидСегмента)
	
	нз = РегистрыСведений.сег_ПоказателиСегментов.СоздатьНаборЗаписей();
	нз.Отбор.ВидСегмента.Установить(пВидСегмента);
	нз.Отбор.Подразделение.Установить(пПодразделение);
	нз.Прочитать();
	
	Если пВидСегмента = Справочники.сег_Сегменты.МаркетинговыйСегмент Тогда
		ПервичныйКлиентПоказатель2 = 0;
		НовыйКлиентПоказатель1 = 0;
		НовыйКлиентПоказатель2 = 0;
		СтарыйКлиентПоказатель1 = 0;
		СтарыйКлиентПоказатель3 = 0;
		ПостоянныйКлиентПоказатель1 = 0;
		ПостоянныйКлиентПоказатель3 = 0;
		УснувшийКлиентПоказатель1 = 0;
		УснувшийКлиентПоказатель3 = 0;
		УснувшийКлиентПоказатель4 = 0;
		
		Для Каждого стр Из нз Цикл
			Если стр.Сегмент = Справочники.сег_Сегменты.ПервичныйКлиент Тогда
				ПервичныйКлиентПоказатель2 = стр.Показатель2;
			ИначеЕсли стр.Сегмент = Справочники.сег_Сегменты.НовыйКлиент Тогда
				НовыйКлиентПоказатель1 = стр.Показатель1;
				НовыйКлиентПоказатель2 = стр.Показатель2;
			ИначеЕсли стр.Сегмент = Справочники.сег_Сегменты.СтарыйКлиент Тогда
				СтарыйКлиентПоказатель1 = стр.Показатель1;
				СтарыйКлиентПоказатель3 = стр.Показатель3;
			ИначеЕсли стр.Сегмент = Справочники.сег_Сегменты.ПостоянныйКлиент Тогда
				ПостоянныйКлиентПоказатель1 = стр.Показатель1;
				ПостоянныйКлиентПоказатель3 = стр.Показатель3;
			ИначеЕсли стр.Сегмент = Справочники.сег_Сегменты.УснувшийКлиент Тогда
				УснувшийКлиентПоказатель1 = стр.Показатель1;
				УснувшийКлиентПоказатель3 = стр.Показатель3;
				УснувшийКлиентПоказатель4 = стр.Показатель4;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли пВидСегмента = Справочники.сег_Сегменты.ОборотныйСегмент Тогда
		МаленькийПоказатель2 = 0;
		СреднийПоказатель1 = 0;
		СреднийПоказатель2 = 0;
		БольшойПоказатель1 = 0;
		БольшойПоказатель2 = 0;
		ОченьБольшойПоказатель1 = 0;
		
		Для Каждого стр Из нз Цикл
			Если стр.Сегмент = Справочники.сег_Сегменты.Маленький Тогда
				МаленькийПоказатель2 = стр.Показатель2;
			ИначеЕсли стр.Сегмент = Справочники.сег_Сегменты.Средний Тогда
				СреднийПоказатель1 = стр.Показатель1;
				СреднийПоказатель2 = стр.Показатель2;
			ИначеЕсли стр.Сегмент = Справочники.сег_Сегменты.Большой Тогда
				БольшойПоказатель1 = стр.Показатель1;
				БольшойПоказатель2 = стр.Показатель2;
			ИначеЕсли стр.Сегмент = Справочники.сег_Сегменты.ОченьБольшой Тогда
				ОченьБольшойПоказатель1 = стр.Показатель1;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли пВидСегмента = Справочники.сег_Сегменты.СегментПоЧастотеЗаказов Тогда
		РедкоПоказатель2 = 0;
		СреднеПоказатель1 = 0;
		СреднеПоказатель2 = 0;
		ЧастоПоказатель1 = 0;
		ЧастоПоказатель2 = 0;
		ОченьЧастоПоказатель1 = 0;
		
		Для Каждого стр Из нз Цикл
			Если стр.Сегмент = Справочники.сег_Сегменты.Редко Тогда
				РедкоПоказатель2 = стр.Показатель2;
			ИначеЕсли стр.Сегмент = Справочники.сег_Сегменты.Средне Тогда
				СреднеПоказатель1 = стр.Показатель1;
				СреднеПоказатель2 = стр.Показатель2;
			ИначеЕсли стр.Сегмент = Справочники.сег_Сегменты.Часто Тогда
				ЧастоПоказатель1 = стр.Показатель1;
				ЧастоПоказатель2 = стр.Показатель2;
			ИначеЕсли стр.Сегмент = Справочники.сег_Сегменты.ОченьЧасто Тогда
				ОченьЧастоПоказатель1 = стр.Показатель1;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецФункции // ОтобразитьПоказателиПрограммы()

////////////////

&НаКлиенте
Процедура НовыйПоказатель1ПриИзменении(Элемент)
	
	ПервичныйКлиентПоказатель2 = НовыйКлиентПоказатель1;
	Если НовыйКлиентПоказатель2 < НовыйКлиентПоказатель1 Тогда
		НовыйКлиентПоказатель2 = НовыйКлиентПоказатель1;
	КонецЕсли;
	НовыйПоказатель2ПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйПоказатель2ПриИзменении(Элемент)
	
	Если СтарыйКлиентПоказатель1 < НовыйКлиентПоказатель2 Тогда
		СтарыйКлиентПоказатель1 = НовыйКлиентПоказатель2;
	КонецЕсли;
	СтарыйПоказатель1ПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СтарыйПоказатель1ПриИзменении(Элемент)
	
	ПостоянныйКлиентПоказатель1 = СтарыйКлиентПоказатель1;
	УснувшийКлиентПоказатель1 = СтарыйКлиентПоказатель1;
	СтарыйПоказатель5ПриИзменении(Элемент);
	//Если СтарыйКлиентПоказатель1 < НовыйКлиентПоказатель2 Тогда
	//	СтарыйКлиентПоказатель1 = НовыйКлиентПоказатель2;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтарыйПоказатель5ПриИзменении(Элемент)
	
	ПостоянныйКлиентПоказатель3 = СтарыйКлиентПоказатель3;
	УснувшийКлиентПоказатель3 = СтарыйКлиентПоказатель3;
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйПоказатель155ПриИзменении(Элемент)
	
	СреднийПоказатель1 = МаленькийПоказатель2;
	СтарыйПоказатель2ПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СтарыйПоказатель2ПриИзменении(Элемент)
	
	Если СреднийПоказатель2 < СреднийПоказатель1 Тогда
		СреднийПоказатель2 = СреднийПоказатель1;
	КонецЕсли;
	СреднийПоказатель2ПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СреднийПоказатель2ПриИзменении(Элемент)
	
	БольшойПоказатель1 = СреднийПоказатель2;
	ПостоянныйПоказатель2ПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПостоянныйПоказатель2ПриИзменении(Элемент)
	
	Если БольшойПоказатель2 < БольшойПоказатель1 Тогда
		БольшойПоказатель2 = БольшойПоказатель1;
	КонецЕсли;
	БольшойПоказатель2ПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура БольшойПоказатель2ПриИзменении(Элемент)
	
	ОченьБольшойПоказатель1 = БольшойПоказатель2;
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйПоказатель5ПриИзменении(Элемент)
	
	СреднеПоказатель1 = РедкоПоказатель2;
	СтарыйПоказатель6ПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СтарыйПоказатель6ПриИзменении(Элемент)
	
	Если СреднеПоказатель2 < СреднеПоказатель1 Тогда
		СреднеПоказатель2 = СреднеПоказатель1;
	КонецЕсли;
	СреднеПоказатель2ПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СреднеПоказатель2ПриИзменении(Элемент)
	
	ЧастоПоказатель1 = СреднеПоказатель2;
	ПостоянныйПоказатель8ПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПостоянныйПоказатель8ПриИзменении(Элемент)
	
	Если ЧастоПоказатель2 < ЧастоПоказатель1 Тогда
		ЧастоПоказатель2 = ЧастоПоказатель1;
	КонецЕсли;
	ЧастоПоказатель2ПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЧастоПоказатель2ПриИзменении(Элемент)
	
	ОченьЧастоПоказатель1 = ЧастоПоказатель2;
	
КонецПроцедуры

&НаКлиенте
Процедура УснувшийПоказатель4ПриИзменении(Элемент)
	
	ПостоянныйКлиентПоказатель4 = УснувшийКлиентПоказатель4;
	
КонецПроцедуры

/////////////////////////////////////////////

&НаКлиенте
Процедура Записать(Команда)

	лТекДанные	= Элементы.Подразделения.ТекущиеДанные;
	
	Если лТекДанные = Неопределено Тогда
	
		лПодразделение = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
		
	Иначе
		
		лПодразделение	= лТекДанные.ПодразделениеСсылка;
	
	КонецЕсли;
	
	Если СохранитьПрограммыСегментации(лПодразделение) Тогда
		Сообщить("Изменения сохранены!");
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция СохранитьПрограммыСегментации(пПодразделение)

	НачатьТранзакцию();
	
	Попытка
		ЗаполнитьПоказателиПрограммы(пПодразделение, Справочники.сег_Сегменты.МаркетинговыйСегмент);
		ЗаполнитьПоказателиПрограммы(пПодразделение, Справочники.сег_Сегменты.ОборотныйСегмент);
		ЗаполнитьПоказателиПрограммы(пПодразделение, Справочники.сег_Сегменты.СегментПоЧастотеЗаказов);
	Исключение
		
		Сообщить("Не удалось записать значения! " + ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
		
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	Возврат Истина;
	
КонецФункции // СохранитьПрограммыСегментации()

&НаСервере
Функция ЗаполнитьПоказателиПрограммы(пПодразделение, пВидСегмента)

	нз = РегистрыСведений.сег_ПоказателиСегментов.СоздатьНаборЗаписей();
	нз.Отбор.ВидСегмента.Установить(пВидСегмента);
	нз.Отбор.Подразделение.Установить(пПодразделение);
		
	Если пВидСегмента = Справочники.сег_Сегменты.МаркетинговыйСегмент Тогда
		стр = нз.Добавить();
		стр.Сегмент = Справочники.сег_Сегменты.ПервичныйКлиент;
		стр.Показатель2 = ПервичныйКлиентПоказатель2;
		
		стр = нз.Добавить();
		стр.Сегмент = Справочники.сег_Сегменты.НовыйКлиент;
		стр.Показатель1 = НовыйКлиентПоказатель1;
		стр.Показатель2 = НовыйКлиентПоказатель2;
		
		стр = нз.Добавить();
		стр.Сегмент = Справочники.сег_Сегменты.СтарыйКлиент;
		стр.Показатель1 = СтарыйКлиентПоказатель1;
		стр.Показатель3 = СтарыйКлиентПоказатель3;
		
		стр = нз.Добавить();
		стр.Сегмент = Справочники.сег_Сегменты.ПостоянныйКлиент;
		стр.Показатель1 = ПостоянныйКлиентПоказатель1;
		стр.Показатель3 = ПостоянныйКлиентПоказатель3;
		стр.Показатель4 = УснувшийКлиентПоказатель4;
		
		стр = нз.Добавить();
		стр.Сегмент = Справочники.сег_Сегменты.УснувшийКлиент;
		стр.Показатель1 = УснувшийКлиентПоказатель1;
		стр.Показатель3 = УснувшийКлиентПоказатель3;
		стр.Показатель4 = УснувшийКлиентПоказатель4;
	
	ИначеЕсли пВидСегмента = Справочники.сег_Сегменты.ОборотныйСегмент Тогда
		стр = нз.Добавить();
		стр.Сегмент = Справочники.сег_Сегменты.Маленький;
		стр.Показатель2 = МаленькийПоказатель2;
		
		стр = нз.Добавить();
		стр.Сегмент = Справочники.сег_Сегменты.Средний;
		стр.Показатель1 = СреднийПоказатель1;
		стр.Показатель2 = СреднийПоказатель2;
		
		стр = нз.Добавить();
		стр.Сегмент = Справочники.сег_Сегменты.Большой;
		стр.Показатель1 = БольшойПоказатель1;
		стр.Показатель2 = БольшойПоказатель2;
		
		стр = нз.Добавить();
		стр.Сегмент = Справочники.сег_Сегменты.ОченьБольшой;
		стр.Показатель1 = ОченьБольшойПоказатель1;
		
	ИначеЕсли пВидСегмента = Справочники.сег_Сегменты.СегментПоЧастотеЗаказов Тогда
		стр = нз.Добавить();
		стр.Сегмент = Справочники.сег_Сегменты.Редко;
		стр.Показатель2 = РедкоПоказатель2;
		
		стр = нз.Добавить();
		стр.Сегмент = Справочники.сег_Сегменты.Средне;
		стр.Показатель1 = СреднеПоказатель1;
		стр.Показатель2 = СреднеПоказатель2;
		
		стр = нз.Добавить();
		стр.Сегмент = Справочники.сег_Сегменты.Часто;
		стр.Показатель1 = ЧастоПоказатель1;
		стр.Показатель2 = ЧастоПоказатель2;
		
		стр = нз.Добавить();
		стр.Сегмент = Справочники.сег_Сегменты.ОченьЧасто;
		стр.Показатель1 = ОченьЧастоПоказатель1;
		
	КонецЕсли;
	
	Для Каждого стр Из нз Цикл
		стр.ВидСегмента = пВидСегмента;
		стр.Подразделение = пПодразделение;
	КонецЦикла;
	
	нз.Записать();
КонецФункции // ЗаполнитьПоказателиПрограммы()
