#Область СлужебныйПрограммныйИнтерфейс

// Заполнить справочники без прав на создание.
// 
// Параметры:
//  СправочникиБезПравНаСоздание - СписокЗначений Из Строка - Справочники без прав на создание
//  ГрупповаяОбработка - Булево - Групповая обработка
Процедура ЗаполнитьСправочникиБезПравНаСоздание(СправочникиБезПравНаСоздание, ГрупповаяОбработка = Ложь) Экспорт
		
	РаспознаваниеДокументовПереопределяемый.ЗаполнитьСправочникиБезПравНаСоздание(СправочникиБезПравНаСоздание);
	
КонецПроцедуры

Функция ЕстьПравоСозданияДокументаИзРаспознанного(Направление, ТипРаспознанногоДокумента, Знач ВидДокумента = Неопределено) Экспорт
	
	Если ТипРаспознанногоДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.ТОРГ12
		Или ТипРаспознанногоДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.АктОбОказанииУслуг
		Или ТипРаспознанногоДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.УПД
		Или ТипРаспознанногоДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетФактура Тогда
		
		Если Направление = Перечисления.НаправленияРаспознанногоДокумента.Входящий Тогда
			ВидДокумента = ?(ЗначениеЗаполнено(ВидДокумента), ВидДокумента, "ПТИУ");
			ИмяТипа = ?(ВидДокумента = "ПТИУ", "ПриобретениеТоваровУслуг", "ПриобретениеУслугПрочихАктивов"); 
		Иначе
			ВидДокумента = ?(ЗначениеЗаполнено(ВидДокумента), ВидДокумента, "РТИУ");
			ИмяТипа = ?(ВидДокумента = "РТИУ", "РеализацияТоваровУслуг", "РеализацияУслугПрочихАктивов"); 
		КонецЕсли;
		
	ИначеЕсли ТипРаспознанногоДокумента = Перечисления.ТипыДокументовРаспознаваниеДокументов.СчетНаОплату Тогда
		
		ИмяТипа = "ЗаказПоставщику"; 
		
	КонецЕсли;
	
	Возврат ПравоДоступа("Добавление", Метаданные.Документы[ИмяТипа]);
	
КонецФункции

#КонецОбласти