
&ИзменениеИКонтроль("СписокПлановОбмена")
Процедура асп_СписокПлановОбмена(ПланыОбменаПодсистемы)

	ЭтоБазоваяВерсия = СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации();

	Если Не ЭтоБазоваяВерсия Тогда

		ПланыОбменаПодсистемы.Добавить(Метаданные.ПланыОбмена.ОбменУправлениеТорговлейДокументооборот);
		ПланыОбменаПодсистемы.Добавить(Метаданные.ПланыОбмена.ОбменУправлениеТорговлейДокументооборот20);
		ПланыОбменаПодсистемы.Добавить(Метаданные.ПланыОбмена.ОбменУправлениеТорговлейРозница);
		ПланыОбменаПодсистемы.Добавить(Метаданные.ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятия);
        #Вставка
		ПланыОбменаПодсистемы.Добавить(Метаданные.ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятия30);
		#КонецВставки
		ПланыОбменаПодсистемы.Добавить(Метаданные.ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятияКОРП);
		ПланыОбменаПодсистемы.Добавить(Метаданные.ПланыОбмена.Полный);
		ПланыОбменаПодсистемы.Добавить(Метаданные.ПланыОбмена.СОтборами);

	КонецЕсли;

КонецПроцедуры
