
&ИзменениеИКонтроль("ПровестиДокумент")
Процедура асп_ПровестиДокумент(Документ, Отказ, ДопПараметры)
	
	УстановитьПривилегированныйРежим(Истина); 

	Свойства = СвойстваДокумента(Документ);
	МенеджерДокумента = Документы[Документ.Метаданные().Имя];
	ПроведениеДокументовЛокализация.ПереназначитьМодульПолученияДанныхДокумента(МенеджерДокумента);
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.Сторно") Тогда
		МеханизмыДокумента = УчетныеМеханизмыСторно(Документ);
	Иначе
		МеханизмыДокумента    = УчетныеМеханизмыДокумента(МенеджерДокумента);
	КонецЕсли;
	МеханизмыКонфигурации = УчетныеМеханизмыКонфигурации();
	
	ЗакрытиеМесяцаСервер.ИнициализироватьПараметрСеансаСформированныеЗадания(Документ);
	
	РегистрыКРегистрации = Новый Массив;
	ДвижимыеРегистры     = Новый Структура;
	Механизмы            = Новый СписокЗначений;
	Для каждого Механизм Из МеханизмыДокумента Цикл
		МодульМеханизма = ОбщегоНазначения.ОбщийМодуль(МеханизмыКонфигурации[Механизм]);
		
		ПараметрыМеханизма = МодульМеханизма.ПараметрыДляПроведенияДокумента(Документ, Свойства); // см. ПроведениеДокументов.ПараметрыУчетногоМеханизма
		ПараметрыМеханизма.Вставить("МодульМеханизма", МодульМеханизма);
		
		Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(РегистрыКРегистрации, ПараметрыМеханизма.ПодчиненныеРегистры);
			
			Для каждого Регистр Из ПараметрыМеханизма.ПодчиненныеРегистры Цикл
				ДвижимыеРегистры.Вставить(Регистр.Имя);
			КонецЦикла;
			
			Для каждого Регистр Из ПараметрыМеханизма.НезависимыеРегистры Цикл
				ДвижимыеРегистры.Вставить(Регистр.Имя);
			КонецЦикла;
			
			Если ПараметрыМеханизма.НеоперативноеПроведение = Истина Тогда
				МодульМеханизма.СоздатьЗаданиеДляНеоперативногоПроведенияДокумента(Документ, Свойства);
			КонецЕсли;
		КонецЕсли;
		
		Механизмы.Добавить(ПараметрыМеханизма, Механизм);
	КонецЦикла;
	Механизмы.СортироватьПоПредставлению();
	
	ЗаписываемыеРегистры = ПодготовитьНаборыЗаписейКРегистрацииДвижений(Документ, Свойства, РегистрыКРегистрации);
	
	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ТаблицыДляДвижений = ТаблицыДляДвижений(Документ, МенеджерДокумента, ДвижимыеРегистры, ДопПараметры);
		ОтразитьДвиженияПодчиненныхРегистров(Механизмы, Документ, ТаблицыДляДвижений, Отказ);
	КонецЕсли;
	
	МенеджерВременныхТаблиц = МенеджерВременныхТаблицКонтроля(Документ);
	УстановитьДопСвойстваКонтрольныхРегистров(Механизмы, Документ, МенеджерВременныхТаблиц);
	
	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ЗаписатьДвиженияНезависимыхРегистров(Механизмы, Документ, ТаблицыДляДвижений, МенеджерВременныхТаблиц, Отказ);
	КонецЕсли;
	
	ОбработатьДокументПередЗаписьюДвижений(Механизмы, Документ, МенеджерВременныхТаблиц, Отказ);

	Документ.Движения.Записать();
	
	ОбработатьДокументПослеЗаписиДвижений(Механизмы, Документ, МенеджерВременныхТаблиц, Отказ);
	ПроверитьДатуЗапретаПоТаблицеИзменений(Механизмы, Документ, МенеджерВременныхТаблиц, Отказ);
	#Вставка
	Если НЕ Документ.ДополнительныеСвойства.Свойство("БезКонтроляОстатков") Тогда
		ЭтоПрограммист = ?(ЗначениеЗаполнено(Пользователи.ТекущийПользователь()), Пользователи.ТекущийПользователь().Наименование = "Программист", Ложь);
		БылОтказДоПроверки = Отказ;
	#КонецВставки                                                                        
	ВыполнитьКонтрольРезультатовПроведения(Механизмы, Документ, МенеджерВременныхТаблиц, Отказ);
	#Вставка
		Если Не БылОтказДоПроверки И ЭтоПрограммист Тогда
			Отказ = Ложь;
		КонецЕсли;
	КонецЕсли;
	#КонецВставки
	
	Если Не Отказ Тогда
		СформироватьЗаданияНаОтложенныеДвижения(Документ, МенеджерВременныхТаблиц, Ложь);
		ОтметитьВыполнениеОбработкиОбновленияПодчиненныхРегистров(ЗаписываемыеРегистры, Документ);
	КонецЕсли;
	
	ЗакрытиеМесяцаСервер.ПроверитьСформированныеЗаданияПриПроведенииДокумента(Документ, Отказ);
	
	ЗапуститьВыполнениеЗаданийОперативнойОчереди(Документ, Отказ);
	ПроверитьВыполнитьЗаданияНеоперативнойОчереди(Механизмы, Документ, Отказ);
	
	МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

&ИзменениеИКонтроль("УчетныеМеханизмыКонфигурации")
Функция асп_УчетныеМеханизмыКонфигурации()

	МеханизмыКонфигурации = Новый Структура;

	МеханизмыКонфигурации.Вставить("АдресныйСклад", "СкладыСервер");
	МеханизмыКонфигурации.Вставить("Взаиморасчеты", "ВзаиморасчетыСервер");
	МеханизмыКонфигурации.Вставить("ВнутреннееТовародвижение", "ВнутреннееТовародвижение");
	МеханизмыКонфигурации.Вставить("Закупки", "Закупки");


    #Вставка
	МеханизмыКонфигурации.Вставить("ПередачаВПереработку", "ПереработкаНаСтороне");
    МеханизмыКонфигурации.Вставить("Производство", "ПроизводствоСервер");
	#КонецВставки
	МеханизмыКонфигурации.Вставить("Обеспечение", "РаспределениеЗапасовДвижения");
	МеханизмыКонфигурации.Вставить("ОборотныеРегистрыУправленческогоУчета", "УправленческийУчетПроведениеСервер");
	МеханизмыКонфигурации.Вставить("ОперативныйУчетТоваровОрганизаций", "ЗапасыСервер");
	МеханизмыКонфигурации.Вставить("ПередачаНаОтветхранение", "ПередачаНаОтветхранение");
	МеханизмыКонфигурации.Вставить("ПланированиеЗапасов", "Планирование");
	МеханизмыКонфигурации.Вставить("ПланированиеКонтрольДенежныхСредств", "ЛимитыРасходованияДенежныхСредствСервер");
	МеханизмыКонфигурации.Вставить("ПодакцизныеТовары", "РегистрыНакопления.ДвиженияПоАкцизам");
	МеханизмыКонфигурации.Вставить("ПодарочныеСертификаты", "ПодарочныеСертификатыСервер");
	МеханизмыКонфигурации.Вставить("ПриемНаОтветхранение", "ПриемНаОтветхранение");
	МеханизмыКонфигурации.Вставить("Продажи", "Продажи");
	МеханизмыКонфигурации.Вставить("ОформлениеОтчетовКомитентуОЗакупках", "РегистрыНакопления.ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках");

	МеханизмыКонфигурации.Вставить("РетроБонусы", "РетроБонусыСервер");

	МеханизмыКонфигурации.Вставить("РасчетыСПодотчетниками", "РегистрыНакопления.ДенежныеСредстваУПодотчетныхЛиц");
	МеханизмыКонфигурации.Вставить("РеестрДокументов", "РегистрыСведений.РеестрДокументов");
	МеханизмыКонфигурации.Вставить("ИсправлениеДокументов", "ИсправлениеДокументов");
	МеханизмыКонфигурации.Вставить("СебестоимостьИПартионныйУчет", "ПартионныйУчетСервер");
	МеханизмыКонфигурации.Вставить("СерийныйУчет", "РегистрыНакопления.ДвиженияСерийТоваров");
	МеханизмыКонфигурации.Вставить("СуммыДокументовВВалютахУчета", "РегистрыСведений.СуммыДокументовВВалютахУчета");
	МеханизмыКонфигурации.Вставить("УправлениеАссортиментом", "АссортиментСервер");
	МеханизмыКонфигурации.Вставить("УчетДенежныхСредств", "ДенежныеСредстваСервер");
	МеханизмыКонфигурации.Вставить("УчетДоходовРасходов", "ДоходыИРасходыСервер");
	МеханизмыКонфигурации.Вставить("УчетИмпорта", "УчетИмпорта");
	МеханизмыКонфигурации.Вставить("УчетНДС", "УчетНДСУП");
	МеханизмыКонфигурации.Вставить("УчетПрочихАктивовПассивов", "ПрочиеАктивыПассивыСервер");
	МеханизмыКонфигурации.Вставить("УчетРабот", "РегистрыНакопления.МатериалыИРаботыВПроизводстве");
	МеханизмыКонфигурации.Вставить("ФинансовыеИнструменты", "РегистрыНакопления.РасчетыПоФинансовымИнструментам");
	МеханизмыКонфигурации.Вставить("ФинансовыйРезультат", "РегистрыНакопления.ФинансовыеРезультаты");
	МеханизмыКонфигурации.Вставить("ЦеныИСкидки", "Ценообразование");


	МеханизмыКонфигурации.Вставить("ТМЦВЭксплуатации", "ТМЦВЭксплуатацииСервер");

	ПроведениеДокументовЛокализация.ДополнитьУчетныеМеханизмыКонфигурации(МеханизмыКонфигурации);

	Возврат МеханизмыКонфигурации;

КонецФункции
