
&ИзменениеИКонтроль("ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ")
Функция асп_ПолучитьСтруктуруЗаполненияУсловийПродажВСтрокеТЧ(Объект)

	СтруктураЗаполненияЦены = Новый Структура;
	СтруктураЗаполненияЦены.Вставить("Дата",       Объект.Дата);
	СтруктураЗаполненияЦены.Вставить("Валюта",     Объект.Валюта);
	СтруктураЗаполненияЦены.Вставить("Соглашение", Объект.Соглашение);
	СтруктураЗаполненияЦены.Вставить("Партнер",    Объект.Партнер);
	СтруктураЗаполненияЦены.Вставить("Ссылка",     Объект.Ссылка);
    #Вставка
	СтруктураЗаполненияЦены.Вставить("Договор",     Объект.Договор);
	
	
	ТипыДокументовПродажиКонечномуПокупателю = Новый Массив;
	ТипыДокументовПродажиКонечномуПокупателю.Добавить(Тип("ДокументСсылка.РеализацияТоваровУслуг"));
	ЭтоПродажаКонечномуПокупателю = ТипыДокументовПродажиКонечномуПокупателю.Найти(ТипЗнч(Объект.Ссылка)) <> Неопределено;
	
	СтруктураЗаполненияЦены.Вставить("ЭтоПродажаКонечномуПокупателю", ЭтоПродажаКонечномуПокупателю);

	#КонецВставки
	Возврат СтруктураЗаполненияЦены;

КонецФункции
