
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресТаблицыПользователей = Параметры.АдресТаблицыПользователей;
	ТаблицаПользователей = ПолучитьИзВременногоХранилища(АдресТаблицыПользователей);
	
	Пользователи.Очистить();
	Пользователи.Загрузить(ТаблицаПользователей);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ПеренестиВНастройку Тогда
		
		Результат = ПриЗакрытииНаСервере();
		
		Оповестить("ПользователиНастройки1ССверка", Результат, ЭтотОбъект.ВладелецФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриЗакрытииНаСервере()
	
	ТаблицаПользователей = Новый ТаблицаЗначений();
	ТаблицаПользователей.Колонки.Добавить("Пользователь");
	Для Каждого ПользовательНастройки Из Пользователи Цикл
		Если ЗначениеЗаполнено(ПользовательНастройки.Пользователь) Тогда
			СтрокаТаблицы = ТаблицаПользователей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ПользовательНастройки);
		КонецЕсли;
	КонецЦикла;
	
	АдресТаблицыПользователей = ПоместитьВоВременноеХранилище(ТаблицаПользователей, УникальныйИдентификатор);
	
	Возврат АдресТаблицыПользователей;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ПеренестиВНастройку = Истина;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти


