
&ИзменениеИКонтроль("ПередЗаписью")
Процедура асп_ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//ASP_Dante 02/09/19 //ASP_Crow 18.03.2026 000029567 В расширение
	Если Не ЭтоНовый() И БизнесПроцессыИЗадачиСервер.НеУстановленыПричиныЗакрытия(ЭтотОбъект.БизнесПроцесс) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не у всех заказов установлены причины отмены!");
		Отказ = Истина;
	КонецЕсли;
	//ASP_Dante 02/09/19
#Вставка
// Здесь можно описать новое поведение.
	//ASP_Dante 02/09/19 //ASP_Crow 18.03.2026 000029567 В расширение
	Если Не ЭтоНовый() И БизнесПроцессыИЗадачиСервер.НеУстановленыПричиныЗакрытия(ЭтотОбъект.БизнесПроцесс) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не у всех заказов установлены причины отмены!");
		Отказ = Истина;
	КонецЕсли;
	//ASP_Dante 02/09/19

#КонецВставки
	
	Если НЕ Ссылка.Пустая() Тогда
		ИсходныеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, 
			"Выполнена, ПометкаУдаления, СостояниеБизнесПроцесса");
	Иначе
		ИсходныеРеквизиты = Новый Структура(
			"Выполнена, ПометкаУдаления, СостояниеБизнесПроцесса",
			Ложь, Ложь, Перечисления.СостоянияБизнесПроцессов.ПустаяСсылка());
	КонецЕсли;
		
	Если ИсходныеРеквизиты.ПометкаУдаления <> ПометкаУдаления Тогда
		БизнесПроцессыИЗадачиСервер.ПриПометкеУдаленияЗадачи(Ссылка, ПометкаУдаления);
	КонецЕсли;
	
	ЭтоПроверка = ДополнительныеСвойства.Свойство("ТолькоПроверка") И ДополнительныеСвойства.ТолькоПроверка;
	ЭтоПеренаправление = ДополнительныеСвойства.Свойство("Перенаправление") И ДополнительныеСвойства.Перенаправление;
	
	Если ЭтоПользовательИсполнитель(Исполнитель)
	   И Не ЭтоПроверка 
	   И Не ЭтоПеренаправление Тогда
		
		ОписаниеПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Исполнитель, "Недействителен,ПометкаУдаления");
		
		Если ОписаниеПользователя.Недействителен 
		 Или ОписаниеПользователя.ПометкаУдаления Тогда
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Исполнителем задачи выбран недействительный пользователь.'"),,,, Отказ);
			Возврат; 
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ИсходныеРеквизиты.Выполнена И Выполнена Тогда
		
		Если СостояниеБизнесПроцесса = Перечисления.СостоянияБизнесПроцессов.Остановлен Тогда
			ВызватьИсключение НСтр("ru = 'Нельзя выполнять задачи остановленных бизнес-процессов.'");
		КонецЕсли;
		
		// Если задача выполнена, то запишем в реквизит Исполнитель того
		// пользователя, который фактически выполнил задачу. Это нам потом
		// потребуется для отчетов. Такую запись делаем только в том
		// случае, если в базе было не выполнено, а в объекте стало выполнено.
		Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
			Исполнитель = Пользователи.АвторизованныйПользователь();
		КонецЕсли;
		Если ДатаИсполнения = Дата(1, 1, 1) Тогда
			ДатаИсполнения = ТекущаяДатаСеанса();
		КонецЕсли;
	ИначеЕсли НЕ ПометкаУдаления И ИсходныеРеквизиты.Выполнена И Выполнена Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Эта задача уже была выполнена ранее.'"),,,, Отказ);
			Возврат;
	КонецЕсли;
	
	Если Важность.Пустая() Тогда
		Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СостояниеБизнесПроцесса) Тогда
		СостояниеБизнесПроцесса = Перечисления.СостоянияБизнесПроцессов.Активен;
	КонецЕсли;
	
	ПредметСтрокой = ОбщегоНазначения.ПредметСтрокой(Предмет);
	
	Если НЕ Ссылка.Пустая() И ИсходныеРеквизиты.СостояниеБизнесПроцесса <> СостояниеБизнесПроцесса Тогда
		УстановитьСостояниеПодчиненныхБизнесПроцессов(СостояниеБизнесПроцесса);
	КонецЕсли;
	
	Если Выполнена И Не ПринятаКИсполнению Тогда
		ПринятаКИсполнению = Истина;
		ДатаПринятияКИсполнению = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УстановитьПривилегированныйРежим(Истина);
	ГруппаИсполнителейЗадач = БизнесПроцессыИЗадачиСервер.ГруппаИсполнителейЗадач(РольИсполнителя, 
		ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации);
	УстановитьПривилегированныйРежим(Ложь);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// Заполнение реквизита ДатаПринятияКИсполнению.
	Если ПринятаКИсполнению И ДатаПринятияКИсполнению = Дата('00010101') Тогда
		ДатаПринятияКИсполнению = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЭтоПроверка Тогда
		Выполнена = Ложь;
	КонецЕсли;
	
КонецПроцедуры
