
&ИзменениеИКонтроль("ТекстЗапросаВтТовары")
Функция асп_ТекстЗапросаВтТовары(Запрос, ТекстыЗапроса)
	//++ASP_Crow 11.03.2026 000029567 в расширение
	
	ИмяРегистра = "ВтТовары";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
	|	ТаблицаТовары.Характеристика           КАК Характеристика,
	|	ТаблицаТовары.ЗаказНаПеремещение       КАК ЗаказНаПеремещение,
	|	ТаблицаТовары.КодСтроки                КАК КодСтроки,
	|	ТаблицаТовары.Количество               КАК Количество,
	|	ТаблицаТовары.Назначение               КАК Назначение,
	|	ТаблицаТовары.НазначениеОтправителя    КАК НазначениеОтправителя,
	|	ВЫБОР КОГДА &ПоЗаказуНаПеремещение ТОГДА
	|			ТоварыЗаказа.ВариантОбеспечения
	|	КОНЕЦ                                  КАК ВариантОбеспечения
	|
	|ПОМЕСТИТЬ ВтТовары
	|
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ТаблицаТовары
	|
	#Удаление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПеремещение.Товары КАК ТоварыЗаказа
	#КонецУдаления
	#Вставка
	//ASP_Dante 10/11/21 Задача 000013136
	|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ТоварыЗаказа.Номенклатура             КАК Номенклатура,
	|	ТоварыЗаказа.Характеристика           КАК Характеристика,
	|	ТоварыЗаказа.Ссылка       КАК Ссылка,
	|	ТоварыЗаказа.КодСтроки                КАК КодСтроки,
	|	ТоварыЗаказа.ВариантОбеспечения КАК ВариантОбеспечения
	|	 ИЗ Документ.ЗаказНаПеремещение.Товары КАК ТоварыЗаказа Сгруппировать ПО ТоварыЗаказа.Номенклатура,
	|	ТоварыЗаказа.Характеристика,
	|	ТоварыЗаказа.Ссылка,
	|	ТоварыЗаказа.КодСтроки,
	|	ТоварыЗаказа.ВариантОбеспечения) КАК ТоварыЗаказа
	//ASP_Dante 10/11/21
	#КонецВставки
	|		ПО ТаблицаТовары.ЗаказНаПеремещение= ТоварыЗаказа.Ссылка
	|			И ТаблицаТовары.Номенклатура   = ТоварыЗаказа.Номенклатура
	|			И ТаблицаТовары.Характеристика = ТоварыЗаказа.Характеристика
	|			И ТаблицаТовары.КодСтроки      = ТоварыЗаказа.КодСтроки
	|			И &ПоЗаказуНаПеремещение
	|
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|	И ТаблицаТовары.Номенклатура.ТипНоменклатуры В
	|		(ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар),ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра); 
	Возврат ТекстЗапроса;
	
КонецФункции
