&НаСервере
Процедура СформироватьСборкиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	//"ВЫБРАТЬ
	//|	КомплектующиеНоменклатуры.Комплектующая КАК Номенклатура,
	//|	КомплектующиеНоменклатуры.ХарактеристикаКомплектующей КАК Характеристика,
	//|	КомплектующиеНоменклатуры.Количество КАК Количество,
	//|	КомплектующиеНоменклатуры.ДоляСтоимости,
	//|	КомплектующиеНоменклатуры.Номенклатура КАК Комплект,
	//|	КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаКомплекта
	//|ИЗ
	//|	РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	//|ГДЕ
	//|	КомплектующиеНоменклатуры.Номенклатура В(&Номенклатура)
	//|	И КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры В(&ХарактеристикаНоменклатуры)";
	"ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Упаковка,
	|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец КАК Комплект,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика КАК ХарактеристикаКомплекта,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК ВариантКомплектации
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|ГДЕ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец в (&Номенклатура)
	|	И ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика в (&ХарактеристикаНоменклатуры)
	|	И ВариантыКомплектацииНоменклатурыТовары.Ссылка в (&ВариантКомплектации)";
	Запрос.УстановитьПараметр("Номенклатура"				, Комплекты.Выгрузить(, "Номенклатура"));
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры"	, Комплекты.Выгрузить(, "Характеристика"));
	Запрос.УстановитьПараметр("ВариантКомплектации"	, Комплекты.Выгрузить(, "ВариантКомплектации"));
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	
	Для каждого СтрокаКомплект Из Комплекты Цикл
		Если НЕ СтрокаКомплект.ВСборку Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаКомплект.СборкаТовара) Тогда
			Док = СтрокаКомплект.СборкаТовара.ПолучитьОбъект();
			Если Док.Проведен Тогда
				Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			ИначеЕсли Док.ПометкаУдаления Тогда
				Док.ПометкаУдаления = Ложь;
				Док.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;	
		Иначе	
			Док = Документы.СборкаТоваров.СоздатьДокумент();
		КонецЕсли;
		Док.Дата = ТекущаяДата();
		//ASP_Dante 09/09/19 Изменение реквизита документа
		//Док.ТипОперации = Перечисления.ТипыОперацийЗаказаНаСборку.СборкаИзКомплектующих;
		Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров;
		//ASP_Dante 09/09/19
		Док.ДокументОснование = ЗаказКлиента;
		Док.Склад = СтрокаКомплект.Склад;
		//Док.СтатусОтгрузки = Перечисления.УдалитьСтатусыОтгрузки.Отгружено;
		Док.Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;
		Док.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
		Док.Организация = ЗаказКлиента.Организация;
		Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Док.Подразделение = Док.Ответственный.Подразделение; 
		Док.Номенклатура = СтрокаКомплект.Номенклатура;
		Док.Характеристика = СтрокаКомплект.Характеристика;
		Док.Количество = СтрокаКомплект.Количество;
		Док.КоличествоУпаковок = Док.Количество;
		Док.Товары.Очистить();
		СтрокиКомплектующие = ТЗ.НайтиСтроки(Новый Структура("Комплект, ХарактеристикаКомплекта", СтрокаКомплект.Номенклатура, СтрокаКомплект.Характеристика));
															
		Для каждого СтрокаКомплектующей из СтрокиКомплектующие Цикл
			Колво = СтрокаКомплектующей.Количество * СтрокаКомплект.Количество;
			Если Колво = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДок = Док.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДок, СтрокаКомплектующей);
			СтрокаДок.Количество = Колво;
			СтрокаДок.КоличествоУпаковок = Колво;
			Док.ВариантКомплектации= СтрокаКомплектующей.ВариантКомплектации;
		КонецЦикла;
		
		Док.СборкаПодДеятельность = УчетНДСУП.ПараметрыУчетаПоОрганизации(Док.Организация, Док.Дата, Док.Склад, Док.Подразделение).ОсновноеНалогообложениеНДСПродажи;
		
		Док.Записать(РежимЗаписиДокумента.Запись);
		
		СтрокаКомплект.СборкаТовара = Док.Ссылка;
		
		Если Док.Товары.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось провести сборку: " + Док.Ссылка + ". НЕ НАЙДЕНО КОМПЛЕКТУЮЩИХ!";
			Сообщение.Поле = "Комплекты[" + Комплекты.Индекс(СтрокаКомплект) + "].СборкаТовара";
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		Док.Записать(РежимЗаписиДокумента.Запись);
	
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение  
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось провести сборку: " + Док.Ссылка;
			Сообщение.Поле = "Комплекты[" + Комплекты.Индекс(СтрокаКомплект) + "].СборкаТовара";
			Сообщение.Сообщить();
		КонецПопытки;	
	КонецЦикла;	
	
КонецПроцедуры//СформироватьСборкиНаСервере()	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаказКлиента = Параметры.ЗаказКлиента;
	Если НЕ ЗначениеЗаполнено(ЗаказКлиента) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказТовары.Номенклатура КАК Номенклатура,
	|	ЗаказТовары.Характеристика КАК Характеристика,
	|	СУММА(ЗаказТовары.Количество) КАК ЗаказаноОстаток,
	|	ЗаказТовары.Склад КАК Склад,
	|	ВариантыКомплектацииНоменклатуры.Ссылка КАК ВариантКомплектации
	|ПОМЕСТИТЬ ОстаткиЗаказов
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|		ПО (ЗаказТовары.Номенклатура = ВариантыКомплектацииНоменклатуры.Владелец
	|				И ВариантыКомплектацииНоменклатуры.Основной = ИСТИНА
	|				И ВариантыКомплектацииНоменклатуры.ПометкаУдаления = ЛОЖЬ)
	|ГДЕ
	|	ЗаказТовары.Ссылка = &ЗаказКлиента
	|	И ЗаказТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказТовары.Характеристика,
	|	ЗаказТовары.Номенклатура,
	|	ЗаказТовары.Склад,
	|	ВариантыКомплектацииНоменклатуры.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЗаказов.Номенклатура КАК Номенклатура,
	|	ОстаткиЗаказов.Характеристика КАК Характеристика,
	|	ОстаткиЗаказов.ЗаказаноОстаток - ЕСТЬNULL(СборкаТоваров.Количество, 0) + ЕСТЬNULL(СборкаТоваровРазборкаТоваров.Количество, 0) КАК Количество,
	|	ОстаткиЗаказов.Склад КАК Склад,
	|	ОстаткиЗаказов.ВариантКомплектации КАК ВариантКомплектации
	|ИЗ
	|	ОстаткиЗаказов КАК ОстаткиЗаказов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК СборкаТоваров
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК СборкаТоваровРазборкаТоваров
	|			ПО СборкаТоваров.Ссылка = СборкаТоваровРазборкаТоваров.ДокументОснование
	|				И (СборкаТоваровРазборкаТоваров.Проведен)
	|				И СборкаТоваров.Номенклатура = СборкаТоваровРазборкаТоваров.Номенклатура
	|				И СборкаТоваров.Характеристика = СборкаТоваровРазборкаТоваров.Характеристика
	|				И (СборкаТоваровРазборкаТоваров.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров))
	|				И СборкаТоваров.Склад = СборкаТоваровРазборкаТоваров.Склад
	|		ПО ОстаткиЗаказов.Номенклатура = СборкаТоваров.Номенклатура
	|			И ОстаткиЗаказов.Характеристика = СборкаТоваров.Характеристика
	|			И (СборкаТоваров.Проведен)
	|			И (СборкаТоваров.ДокументОснование = &ЗаказКлиента)
	|			И (СборкаТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров))
	|			И ОстаткиЗаказов.Склад = СборкаТоваров.Склад
	|ГДЕ
	|	ОстаткиЗаказов.ЗаказаноОстаток - ЕСТЬNULL(СборкаТоваров.Количество, 0) + ЕСТЬNULL(СборкаТоваровРазборкаТоваров.Количество, 0) > 0";
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = Комплекты.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
	КонецЦикла;
	
	Если Комплекты.Количество() = 0 Тогда
		Сообщить("Не найдено товаров для сборки!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры //ПриСозданииНаСервере

&НаКлиенте
Процедура СформироватьСборкиТоваров(Команда)
	
	ОтмеченныеСтроки = Комплекты.НайтиСтроки(Новый Структура("ВСборку", Истина));
	Если ОтмеченныеСтроки.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одной номенклатуры!";
		Сообщение.Поле = "Комплекты[0].ВСборку";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	СформироватьСборкиНаСервере();
	
КонецПроцедуры//СформироватьСборкиТоваров

&НаКлиенте
Процедура СформироватьЗаявкиНаРаспил(Команда)
ОтмеченныеСтроки = Комплекты.НайтиСтроки(Новый Структура("ВСборку", Истина));
	Если ОтмеченныеСтроки.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрано ни одной номенклатуры!";
		Сообщение.Поле = "Комплекты[0].ВСборку";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	СформироватьСборкиНаСервереБезПроведения();

КонецПроцедуры


&НаСервере
Процедура СформироватьСборкиНаСервереБезПроведения()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	//"ВЫБРАТЬ
	//|	КомплектующиеНоменклатуры.Комплектующая КАК Номенклатура,
	//|	КомплектующиеНоменклатуры.ХарактеристикаКомплектующей КАК Характеристика,
	//|	КомплектующиеНоменклатуры.Количество КАК Количество,
	//|	КомплектующиеНоменклатуры.ДоляСтоимости,
	//|	КомплектующиеНоменклатуры.Номенклатура КАК Комплект,
	//|	КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаКомплекта
	//|ИЗ
	//|	РегистрСведений.КомплектующиеНоменклатуры КАК КомплектующиеНоменклатуры
	//|ГДЕ
	//|	КомплектующиеНоменклатуры.Номенклатура В(&Номенклатура)
	//|	И КомплектующиеНоменклатуры.ХарактеристикаНоменклатуры В(&ХарактеристикаНоменклатуры)";
	"ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости,
	|	ВариантыКомплектацииНоменклатурыТовары.Количество,
	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
	|	ВариантыКомплектацииНоменклатурыТовары.Упаковка,
	|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец КАК Комплект,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика КАК ХарактеристикаКомплекта,
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК ВариантКомплектации
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	|ГДЕ
	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец в (&Номенклатура)
	|	И ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика в (&ХарактеристикаНоменклатуры)
	|	И ВариантыКомплектацииНоменклатурыТовары.Ссылка.Основной = ИСТИНА";
	Запрос.УстановитьПараметр("Номенклатура"				, Комплекты.Выгрузить(, "Номенклатура"));
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры"	, Комплекты.Выгрузить(, "Характеристика"));
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	
	Для каждого СтрокаКомплект Из Комплекты Цикл
		Если НЕ СтрокаКомплект.ВСборку Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаКомплект.СборкаТовара) Тогда
			Док = СтрокаКомплект.СборкаТовара.ПолучитьОбъект();
			Если Док.Проведен Тогда
				Док.Записать(РежимЗаписиДокумента.Запись);
			ИначеЕсли Док.ПометкаУдаления Тогда
				Док.ПометкаУдаления = Ложь;
				Док.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;	
		Иначе	
			Док = Документы.ЗаказНаСборку.СоздатьДокумент();
		КонецЕсли;
		Док.Дата = ТекущаяДата();
		//ASP_Dante 09/09/19 Изменение реквизита документа
		//Док.ТипОперации = Перечисления.ТипыОперацийЗаказаНаСборку.СборкаИзКомплектующих;
		Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров;
		//ASP_Dante 09/09/19
		Док.ДокументОснование = ЗаказКлиента;
		Док.Склад = ЗаказКлиента.Склад;
		//Док.СтатусОтгрузки = Перечисления.УдалитьСтатусыОтгрузки.Отгружено;
		Док.Статус = Перечисления.СтатусыВнутреннихЗаказов.УдалитьКОбеспечению;
		Док.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
		Док.Организация = ЗаказКлиента.Организация;
		Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		Док.Подразделение = Док.Ответственный.Подразделение; 
		Док.Номенклатура = СтрокаКомплект.Номенклатура;
		Док.Характеристика = СтрокаКомплект.Характеристика;
		Док.Количество = СтрокаКомплект.Количество;
		Док.КоличествоУпаковок = Док.Количество;
		Док.Назначение=ЗаказКлиента.Назначение;
		Док.Товары.Очистить();
		СтрокиКомплектующие = ТЗ.НайтиСтроки(Новый Структура("Комплект, ХарактеристикаКомплекта", СтрокаКомплект.Номенклатура, СтрокаКомплект.Характеристика));
															
		Для каждого СтрокаКомплектующей из СтрокиКомплектующие Цикл
			Колво = СтрокаКомплектующей.Количество * СтрокаКомплект.Количество;
			Если Колво = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаДок = Док.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДок, СтрокаКомплектующей);
			СтрокаДок.Количество = Колво;
			СтрокаДок.КоличествоУпаковок = Колво;
			СтрокаДок.ВариантОбеспечения=Перечисления.ВариантыОбеспечения.Требуется;
			Док.ВариантКомплектации= СтрокаКомплектующей.ВариантКомплектации;
		КонецЦикла;
		
		Док.СборкаПодДеятельность = Справочники.Организации.НалогообложениеНДС(Док.Организация, Док.Склад, Док.Дата);
		
		Док.Записать(РежимЗаписиДокумента.Запись);
		
		СтрокаКомплект.СборкаТовара = Док.Ссылка;
		
		Если Док.Товары.Количество() = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Документ записан, ожидает дальнейшей обработки";
			//: " + Док.Ссылка + ". НЕ НАЙДЕНО КОМПЛЕКТУЮЩИХ!";
			Сообщение.Поле = "Комплекты[" + Комплекты.Индекс(СтрокаКомплект) + "].СборкаТовара";
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		
		Попытка
			Док.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось записать сборку: " + Док.Ссылка;
			Сообщение.Поле = "Комплекты[" + Комплекты.Индекс(СтрокаКомплект) + "].СборкаТовара";
			Сообщение.Сообщить();
		КонецПопытки;	
	КонецЦикла;	
	
КонецПроцедуры//СформироватьСборкиНаСервере()	

&НаСервере
Процедура ОтчетПоРасчетуОстатковНаСервере() 
	РасчетОстатков.Очистить();             
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Комплектующая",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
    ТЗ.Колонки.Добавить("КоличествоТребуется",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(12, 3)));
    ТЗ.Колонки.Добавить("КоличествоДоступноВЗаказе",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(12, 3))); 
	ТЗ.Колонки.Добавить("НоменклатураНаименование",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(25))); 
	
	Для каждого СтрКомплект из Комплекты Цикл 
	Если СтрКомплект.ВСборку = истина Тогда
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Комплектующая,
		|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК Количество,
		|	ВариантыКомплектацииНоменклатуры.Ссылка КАК ВариантКомплектации,
		|	ВариантыКомплектацииНоменклатуры.Владелец КАК Комплект,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.Наименование КАК НоменклатураНаименование
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|		ПО ВариантыКомплектацииНоменклатурыТовары.Ссылка = ВариантыКомплектацииНоменклатуры.Ссылка
		|ГДЕ
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка = &ВариантКомплектации
		|	И ВариантыКомплектацииНоменклатуры.Владелец = &Комплект
		|
		|СГРУППИРОВАТЬ ПО
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
		|	ВариантыКомплектацииНоменклатуры.Владелец,
		|	ВариантыКомплектацииНоменклатуры.Ссылка,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.Наименование";  
	
	Запрос.УстановитьПараметр("Комплект"				, СтрКомплект.Номенклатура);
	Запрос.УстановитьПараметр("ВариантКомплектации"				, СтрКомплект.ВариантКомплектации);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	НоваяСтрока=ТЗ.Добавить();		
	//НоваяСтрока.Номенклатура=СтрКомплект.Номенклатура;
	НоваяСтрока.Комплектующая=ВыборкаДетальныеЗаписи.Комплектующая;
	НоваяСтрока.КоличествоТребуется=ВыборкаДетальныеЗаписи.Количество*СтрКомплект.Количество;
	НоваяСтрока.КоличествоДоступноВЗаказе=0; 
	НоваяСтрока.НоменклатураНаименование=ВыборкаДетальныеЗаписи.НоменклатураНаименование;
	КонецЦикла;
	
	КонецЕсли;
	КонецЦикла;
	ТЗ.Свернуть("Комплектующая,НоменклатураНаименование", "КоличествоТребуется, КоличествоДоступноВЗаказе");   
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	ТЧ.Комплектующая КАК Комплектующая,
	                |	ТЧ.КоличествоТребуется КАК КоличествоТребуется,
	                |	ТЧ.НоменклатураНаименование КАК НоменклатураНаименование
	                |ПОМЕСТИТЬ ТЧ
	                |ИЗ
	                |	&ТЧ КАК ТЧ
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	                |	СУММА(ЗаказКлиентаТовары.Количество) КАК Количество
	                |ПОМЕСТИТЬ Заказ
	                |ИЗ
	                |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	                |ГДЕ
	                |	ЗаказКлиентаТовары.ВариантОбеспечения = &ВариантОбеспечения
	                |	И ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЗаказКлиентаТовары.Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ТЧ.Комплектующая КАК Комплектующая,
	                |	ТЧ.КоличествоТребуется КАК КоличествоТребуется,
	                |	ЕСТЬNULL(Заказ1.Количество, 0) КАК КоличествоДоступноВЗаказе,
	                |	ТЧ.КоличествоТребуется - ЕСТЬNULL(Заказ1.Количество, 0) КАК КоличествоНеХватает,
	                |	ТЧ.НоменклатураНаименование КАК НоменклатураНаименование,
	                |	ЕСТЬNULL(ЗапасыИПотребностиОстатки.ВНаличииОстаток, 0) - (ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток, 0) + ЕСТЬNULL(ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток, 0)) КАК КоличествоСвободныйОстаток
	                |ИЗ
	                |	ТЧ КАК ТЧ
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Заказ КАК Заказ1
	                |		ПО ТЧ.Комплектующая = Заказ1.Номенклатура
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗапасыИПотребности.Остатки(, Склад = &СКЛАД) КАК ЗапасыИПотребностиОстатки
	                |		ПО ТЧ.Комплектующая = ЗапасыИПотребностиОстатки.Номенклатура
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	НоменклатураНаименование";
	Запрос2.УстановитьПараметр("ТЧ", ТЗ);
	Запрос2.УстановитьПараметр("ЗаказКлиента", ЗаказКлиентаДляРасчетаОстатков);
	Запрос2.УстановитьПараметр("ВариантОбеспечения", Перечисления.ВариантыОбеспечения.СоСклада);
	Запрос2.УстановитьПараметр("Склад", Комплекты[0].Склад);
	Выборка2 = Запрос2.Выполнить().Выбрать();
	Пока Выборка2.Следующий() Цикл
		СтрокаРасчетОстатков = РасчетОстатков.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРасчетОстатков, Выборка2);
	КонецЦикла;
    
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетПоРасчетуОстатков(Команда)  
	Если  ЗначениеЗаполнено(ЗаказКлиентаДляРасчетаОстатков) Тогда
	ОтчетПоРасчетуОстатковНаСервере();
	Элементы.РасчетОстатков.Видимость=Истина;                    
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
		ИзменитьФлагиНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
		ИзменитьФлагиНаСервере(Ложь);
КонецПроцедуры


&НаСервере
Процедура ИзменитьФлагиНаСервере(ЗначениеФлага)
	ТЗ1 = Комплекты.Выгрузить();
	ТЗ1.ЗаполнитьЗначения(ЗначениеФлага, "ВСборку");
	Комплекты.Загрузить(ТЗ1);
КонецПроцедуры

&НаСервере
Процедура СнятьРезервыПоЗаказуРасчетаОстатковНаСервере()
ОбъектЗаказРасчетаОстатков= ЗаказКлиентаДляРасчетаОстатков.ПолучитьОбъект(); 
Для каждого СтрРасчетОстатков из РасчетОстатков Цикл             
	Для каждого СтрЗаказ из ОбъектЗаказРасчетаОстатков.Товары Цикл  
		Если СтрЗаказ.Номенклатура=СтрРасчетОстатков.Комплектующая и СтрЗаказ.ВариантОбеспечения=Перечисления.ВариантыОбеспечения.СоСклада Тогда
			СтрЗаказ.ВариантОбеспечения=Перечисления.ВариантыОбеспечения.НеТребуется;
		Иначе
		КонецЕсли
	КонецЦикла;
КонецЦикла;   
попытка
ОбъектЗаказРасчетаОстатков.Записать(РежимЗаписиДокумента.Проведение);     
Сообщить("По заказу " +  строка(ЗаказКлиентаДляРасчетаОстатков) + " выполнено снятие резервов по нужным комплектующим");
исключение
сообщить("Не удалось снять резерв с заказа");
КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура СнятьРезервыПоЗаказуРасчетаОстатков(Команда)
	СнятьРезервыПоЗаказуРасчетаОстатковНаСервере();
КонецПроцедуры


