
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ПараметрыПисьма = Новый Структура;
	Текст= "В 1С оформлен документ:"+ Символы.ПС +
	ПолучениеДанных(ПараметрКоманды,"ссылка") + Символы.ПС +
	"Поставщик: " + ПолучениеДанных(ПараметрКоманды,"партнер") + Символы.ПС +
	"Склад: " + ПолучениеДанных(ПараметрКоманды,"склад") + Символы.ПС +
	"Статус: " + ПолучениеДанных(ПараметрКоманды,"статус") + Символы.ПС +
	"Комментарий: " + ПолучениеДанных(ПараметрКоманды,"комментарий") + Символы.ПС +  Символы.ПС +
	"Товары:" + Символы.ПС + ПолучениеТЧ(ПараметрКоманды) + Символы.ПС;
	//+ "Ответственный: " + ПолучениеДанных(ПараметрКоманды,"ответственный");
	ПараметрыПисьма.Вставить("УчетнаяЗапись", Неопределено);
	ПараметрыПисьма.Вставить("Получатель", ПолучениеПолучателей(ПараметрКоманды));
	ПараметрыПисьма.Вставить("Тема", "Оповещение 1С: " + ПолучениеДанных(ПараметрКоманды,"ссылка"));
	
	ПараметрыПисьма.Вставить("Текст", Текст);
	//ПараметрыПисьма.Вставить("Вложения", СписокФайлов);
	//ПараметрыПисьма.Вставить("Предмет", ПараметрКоманды);
	
ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыПисьма, , , , , );
КонецПроцедуры

Функция ПолучениеДанных(Документ,Параметр);

	Если параметр = "ссылка" тогда
		Возврат Документ.Ссылка;
	ИначеЕсли параметр = "склад" тогда
		Возврат Документ.Склад;
	ИначеЕсли параметр = "партнер" тогда
		Возврат Документ.Партнер;
	ИначеЕсли параметр = "ответственный" тогда
		Возврат Документ.Менеджер;
	ИначеЕсли параметр = "комментарий" тогда
		Возврат Документ.Комментарий;
	ИначеЕсли параметр = "статус" тогда
		Возврат Документ.Статус;
	
	КонецЕсли;
	

	
КонецФункции

Функция ПолучениеТЧ(Документ)
	    Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.Количество КАК Количество,
	|	ЗаказПоставщикуТовары.Упаковка КАК Упаковка,
	|	ЗаказПоставщикуТовары.Назначение КАК Назначение,
	|	ЗаказПоставщикуТовары.ДатаПоступления КАК ДатаПоступления
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПоставщикуТовары.Номенклатура.Наименование";
	Запрос.УстановитьПараметр("Ссылка", Документ);

		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Текст= "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Текст= Текст + ВыборкаДетальныеЗаписи.Количество  + Символы.Таб + "шт." + Символы.Таб + ВыборкаДетальныеЗаписи.Номенклатура + Символы.Таб + ВыборкаДетальныеЗаписи.Назначение + Символы.Таб +?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаПоступления),"Срок поставки: "+ Формат(ВыборкаДетальныеЗаписи.ДатаПоступления, "ДЛФ=Д"),"") + Символы.Таб +строка((?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Назначение),ВыборкаДетальныеЗаписи.Назначение.Заказ.Менеджер,"")))+ Символы.ПС;
	КонецЦикла;
	
	
	Возврат Текст;
КонецФункции     


Функция ПолучениеПолучателей(Документ)   
	
	Менеджер=Новый Массив;
	
	    Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.Количество КАК Количество,
	|	ЗаказПоставщикуТовары.Упаковка КАК Упаковка,
	|	ЗаказПоставщикуТовары.Назначение КАК Назначение,
	|	ЗаказПоставщикуТовары.ДатаПоступления КАК ДатаПоступления
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПоставщикуТовары.Номенклатура.Наименование";
	Запрос.УстановитьПараметр("Ссылка", Документ);

		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Текст= "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Назначение) тогда
					попытка
					Менеджер.Добавить(ВыборкаДетальныеЗаписи.Назначение.Заказ.Менеджер);
					исключение 
					конецпопытки;
				иначе
				Менеджер.Добавить(Справочники.Пользователи.НайтиПоНаименованию("Менеджер Оповещений"));
				КонецЕсли;

			
	КонецЦикла;
	СвернутыйМассив = Новый Массив;
		Для каждого Элемент Из Менеджер Цикл
			Если СвернутыйМассив.Найти(Элемент) = Неопределено Тогда
		СвернутыйМассив.Добавить(Элемент);
		КонецЕсли;
		КонецЦикла;
		Получатель="";
		Для каждого Мнд из СвернутыйМассив Цикл
			Если Строка(Мнд)="Менеджер Оповещений" Тогда
				Получатель=УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(Мнд, Справочники.ВидыКонтактнойИнформации.EmailПользователя);
				Прервать;
			Иначе
				Получатель=Получатель+ УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(Мнд, Справочники.ВидыКонтактнойИнформации.EmailПользователя)+"; "; 
			КонецЕсли;
		КонецЦикла;

	
	Возврат Получатель;
КонецФункции     



Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт
	
	Массив = Новый Массив();
	СтруктураСтрокой = "";
	НужнаЗапятая = Ложь;
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая = Истина;
	КонецЦикла;
	Для Каждого Строка Из ТаблицаЗначений Цикл
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Массив.Добавить(НоваяСтрока);
	КонецЦикла;
	Возврат Массив;
	
КонецФункции
