// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Сообщить пользователю.
// 
// Параметры:
//  Элемент - ЭлементыФормы - Элемент формы
//  ПутьКданным - Строка, Неопределено - Путь к данным элемента
//  ДругойЗаголовок - Строка - Другой заголовок
//  Отказ - Булево - Отказ
Процедура СообщитьПользователю(Элемент, ПутьКданным = Неопределено, ДругойЗаголовок = "", Отказ = Истина) Экспорт
	
	Параметры = Новый Структура("Заголовок", "");
	
	Если ПустаяСтрока(ДругойЗаголовок) Тогда
		ЗаполнитьЗначенияСвойств(Параметры, Элемент);
	Иначе
		Параметры.Заголовок = ДругойЗаголовок;
	КонецЕсли;
	
	Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Поле ""%1"" не заполнено.'"), Параметры.Заголовок);
	ОбщегоНазначенияКлиент.СообщитьПользователю(Текст, , ПутьКданным, , Отказ);
	
КонецПроцедуры

#КонецОбласти
