
&ИзменениеИКонтроль("ПриОпределенииОбъектовСКомандамиСозданияНаОсновании")
Процедура асп_ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты)

	//++ НЕ ГОСИС

	ТМЦВЭксплуатацииСервер.ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты);





	// СлужебныеПодсистемы.ОбъектыУТКАУП
	Объекты.Добавить(Метаданные.Документы.ВыкупПринятыхНаХранениеТоваров);
	Объекты.Добавить(Метаданные.Документы.ВыкупТоваровХранителем);
	Объекты.Добавить(Метаданные.Документы.ОтгрузкаТоваровКлиенту);
	Объекты.Добавить(Метаданные.Документы.ОтгрузкаТоваровСХранения);
	Объекты.Добавить(Метаданные.Документы.ПередачаТоваровХранителю);
	Объекты.Добавить(Метаданные.Документы.ПоступлениеТоваровОтХранителя);
	Объекты.Добавить(Метаданные.Документы.ПриемкаТоваровНаХранение);
	Объекты.Добавить(Метаданные.Документы.СписаниеОтгруженныхТоваров);
	Объекты.Добавить(Метаданные.Документы.ОприходованиеИзлишковОтгруженныхТоваров);
	Объекты.Добавить(Метаданные.Документы.ОтчетОСписанииТоваровСХранения);
	Объекты.Добавить(Метаданные.Документы.ПересортицаТоваровУХранителя);
	Объекты.Добавить(Метаданные.Документы.ПорчаТоваровУХранителя);
	Объекты.Добавить(Метаданные.Документы.АвансовыйОтчет);
	Объекты.Добавить(Метаданные.Документы.АктВыполненныхРабот);
	Объекты.Добавить(Метаданные.Документы.АктОРасхожденияхПослеОтгрузки);
	Объекты.Добавить(Метаданные.Документы.АктОРасхожденияхПослеПеремещения);
	Объекты.Добавить(Метаданные.Документы.АктОРасхожденияхПослеПриемки);
	Объекты.Добавить(Метаданные.Документы.АктПремииКлиенту);
	Объекты.Добавить(Метаданные.Документы.АннулированиеПодарочныхСертификатов);
	Объекты.Добавить(Метаданные.Документы.ВводОстатков);
	Объекты.Добавить(Метаданные.Документы.ВводОстатковВзаиморасчетов);
	Объекты.Добавить(Метаданные.Документы.ВводОстатковДенежныхСредств);
	Объекты.Добавить(Метаданные.Документы.ВводОстатковОПродажахЗаПрошлыеПериоды);
	Объекты.Добавить(Метаданные.Документы.ВводОстатковПоФинансовымИнструментам);
	Объекты.Добавить(Метаданные.Документы.ВводОстатковПрочиеРасходы);
	Объекты.Добавить(Метаданные.Документы.ВводОстатковПрочихАктивовПассивов);
	Объекты.Добавить(Метаданные.Документы.ВводОстатковРасчетовПоЭквайрингу);
	Объекты.Добавить(Метаданные.Документы.ВводОстатковСПодотчетниками);
	Объекты.Добавить(Метаданные.Документы.ВводОстатковТоваров);
	Объекты.Добавить(Метаданные.Документы.ВзаимозачетЗадолженности);
	Объекты.Добавить(Метаданные.Документы.ВнутреннееПотребление);
	Объекты.Добавить(Метаданные.Документы.ВозвратТоваровМеждуОрганизациями);
	Объекты.Добавить(Метаданные.Документы.ВозвратТоваровОтКлиента);
	Объекты.Добавить(Метаданные.Документы.ВозвратТоваровПоставщику);
	Объекты.Добавить(Метаданные.Документы.ВнесениеДенежныхСредствВКассуККМ);
	Объекты.Добавить(Метаданные.Документы.ВозвратПодарочныхСертификатов);
	Объекты.Добавить(Метаданные.Документы.ВыемкаДенежныхСредствИзКассыККМ);
	Объекты.Добавить(Метаданные.Документы.ВыкупВозвратнойТарыКлиентом);
	Объекты.Добавить(Метаданные.Документы.ВыкупВозвратнойТарыУПоставщика);
	Объекты.Добавить(Метаданные.Документы.ДвижениеПрочихАктивовПассивов);
	Объекты.Добавить(Метаданные.Документы.ДоверенностьВыданная);
	Объекты.Добавить(Метаданные.Документы.ЗаданиеНаПеревозку);
	Объекты.Добавить(Метаданные.Документы.ЗаданиеТорговомуПредставителю);
	Объекты.Добавить(Метаданные.Документы.ЗаказКлиента);
	Объекты.Добавить(Метаданные.Документы.ЗаказНаВнутреннееПотребление);
	Объекты.Добавить(Метаданные.Документы.ЗаказНаПеремещение);
	Объекты.Добавить(Метаданные.Документы.ЗаказНаСборку);
	Объекты.Добавить(Метаданные.Документы.ЗаказПоставщику);
	Объекты.Добавить(Метаданные.Документы.ЗаявкаНаВозвратТоваровОтКлиента);
	Объекты.Добавить(Метаданные.Документы.ЗаявкаНаКомандировку);
	Объекты.Добавить(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств);
	Объекты.Добавить(Метаданные.Документы.ИзменениеАссортимента);
	Объекты.Добавить(Метаданные.Документы.ИнвентаризационнаяОпись);
	Объекты.Добавить(Метаданные.Документы.ИнвентаризацияНаличныхДенежныхСредств);
	Объекты.Добавить(Метаданные.Документы.КоммерческоеПредложениеКлиенту);
	Объекты.Добавить(Метаданные.Документы.КорректировкаГрафикаВзаиморасчетов);
	Объекты.Добавить(Метаданные.Документы.КорректировкаЗадолженности);
	Объекты.Добавить(Метаданные.Документы.КорректировкаЗадолженностиПоФинансовымИнструментам);
	Объекты.Добавить(Метаданные.Документы.КорректировкаИзлишковНедостачПоТоварнымМестам);
	Объекты.Добавить(Метаданные.Документы.КорректировкаНазначенияТоваров);
	Объекты.Добавить(Метаданные.Документы.КорректировкаПоОрдеруНаТовары);
	Объекты.Добавить(Метаданные.Документы.КорректировкаПриобретения);
	Объекты.Добавить(Метаданные.Документы.КорректировкаРеализации);
	Объекты.Добавить(Метаданные.Документы.КорректировкаРасчетовСПодотчетнымиЛицами);
	Объекты.Добавить(Метаданные.Документы.КорректировкаРегистров);
	Объекты.Добавить(Метаданные.Документы.ЛимитыРасходаДенежныхСредств);
	Объекты.Добавить(Метаданные.Документы.НачислениеИСписаниеБонусныхБаллов);
	Объекты.Добавить(Метаданные.Документы.НачисленияКредитовИДепозитов);
	Объекты.Добавить(Метаданные.Документы.НормативРаспределенияПлановПродажПоКатегориям);
	Объекты.Добавить(Метаданные.Документы.ОжидаемоеПоступлениеДенежныхСредств);
	Объекты.Добавить(Метаданные.Документы.ОперацияПоПлатежнойКарте);
	Объекты.Добавить(Метаданные.Документы.ОприходованиеИзлишковТоваров);
	Объекты.Добавить(Метаданные.Документы.ОрдерНаОтражениеИзлишковТоваров);
	Объекты.Добавить(Метаданные.Документы.ОрдерНаОтражениеНедостачТоваров);
	Объекты.Добавить(Метаданные.Документы.ОрдерНаОтражениеПересортицыТоваров);
	Объекты.Добавить(Метаданные.Документы.ОрдерНаОтражениеПорчиТоваров);
	Объекты.Добавить(Метаданные.Документы.ОрдерНаПеремещениеТоваров);
	Объекты.Добавить(Метаданные.Документы.ОтборРазмещениеТоваров);
	Объекты.Добавить(Метаданные.Документы.ОтражениеРасхожденийПриИнкассацииДенежныхСредств);
	Объекты.Добавить(Метаданные.Документы.ОтчетБанкаПоОперациямЭквайринга);
	Объекты.Добавить(Метаданные.Документы.ОтчетКомиссионера);
	Объекты.Добавить(Метаданные.Документы.ОтчетКомиссионераОСписании);
	Объекты.Добавить(Метаданные.Документы.ОтчетКомитенту);
	Объекты.Добавить(Метаданные.Документы.ОтчетКомитентуОСписании);
	Объекты.Добавить(Метаданные.Документы.ОтчетОРозничныхПродажах);
	Объекты.Добавить(Метаданные.Документы.ОтчетПоКомиссииМеждуОрганизациями);
	Объекты.Добавить(Метаданные.Документы.ОтчетПоКомиссииМеждуОрганизациямиОСписании);
	Объекты.Добавить(Метаданные.Документы.ПередачаТоваровМеждуОрганизациями);
	Объекты.Добавить(Метаданные.Документы.ПеремещениеТоваров);
	Объекты.Добавить(Метаданные.Документы.ПересортицаТоваров);
	Объекты.Добавить(Метаданные.Документы.ПересчетТоваров);
	Объекты.Добавить(Метаданные.Документы.ПланЗакупок);
	Объекты.Добавить(Метаданные.Документы.ПланОстатков);
	Объекты.Добавить(Метаданные.Документы.ПланПродаж);
	Объекты.Добавить(Метаданные.Документы.ПланПродажПоКатегориям);
	Объекты.Добавить(Метаданные.Документы.ПланСборкиРазборки);
	Объекты.Добавить(Метаданные.Документы.ПланВнутреннихПотреблений);
	Объекты.Добавить(Метаданные.Документы.ПорчаТоваров);
	Объекты.Добавить(Метаданные.Документы.ПоступлениеБезналичныхДенежныхСредств);
	Объекты.Добавить(Метаданные.Документы.ПоступлениеТоваровНаСклад);
	Объекты.Добавить(Метаданные.Документы.ПоступлениеТоваровОтКлиента);
	Объекты.Добавить(Метаданные.Документы.ПоступлениеУслугВПодразделение);
	Объекты.Добавить(Метаданные.Документы.ПриобретениеТоваровУслуг);
	Объекты.Добавить(Метаданные.Документы.ПриобретениеУслугПрочихАктивов);
	Объекты.Добавить(Метаданные.Документы.ПриходныйКассовыйОрдер);
	Объекты.Добавить(Метаданные.Документы.ПриходныйОрдерНаТовары);
	Объекты.Добавить(Метаданные.Документы.ПрочееОприходованиеТоваров);
	Объекты.Добавить(Метаданные.Документы.ПрочиеДоходыРасходы);
	Объекты.Добавить(Метаданные.Документы.РаспоряжениеНаПеремещениеДенежныхСредств);
	Объекты.Добавить(Метаданные.Документы.РаспределениеДоходовПоНаправлениямДеятельности);
	Объекты.Добавить(Метаданные.Документы.РаспределениеРасходовБудущихПериодов);
	Объекты.Добавить(Метаданные.Документы.РассылкаКлиентам);
	Объекты.Добавить(Метаданные.Документы.РасходныйКассовыйОрдер);
	Объекты.Добавить(Метаданные.Документы.РасходныйОрдерНаТовары);
	Объекты.Добавить(Метаданные.Документы.РасчетКурсовыхРазниц);
	Объекты.Добавить(Метаданные.Документы.РасчетПроцентныхРасходовДисконтирования);
	Объекты.Добавить(Метаданные.Документы.РасчетСебестоимостиТоваров);
	Объекты.Добавить(Метаданные.Документы.РеализацияПодарочныхСертификатов);
	Объекты.Добавить(Метаданные.Документы.РеализацияТоваровУслуг);
	Объекты.Добавить(Метаданные.Документы.РеализацияУслугПрочихАктивов);
	Объекты.Добавить(Метаданные.Документы.РегистрацияЦенНоменклатурыПоставщика);
	Объекты.Добавить(Метаданные.Документы.СборкаТоваров);
	Объекты.Добавить(Метаданные.Документы.СверкаВзаиморасчетов2_4);
	Объекты.Добавить(Метаданные.Документы.СверкаВзаиморасчетов2_5_11);
	Объекты.Добавить(Метаданные.Документы.СписаниеБезналичныхДенежныхСредств);
	Объекты.Добавить(Метаданные.Документы.СписаниеРасхожденийПоступлениеПриобретение);
	Объекты.Добавить(Метаданные.Документы.СписаниеНедостачТоваров);
	Объекты.Добавить(Метаданные.Документы.СчетНаОплатуКлиенту);
	Объекты.Добавить(Метаданные.Документы.ТаможеннаяДекларацияИмпорт);
	Объекты.Добавить(Метаданные.Документы.УпаковочныйЛист);
	Объекты.Добавить(Метаданные.Документы.УсловияРетроБонусовКлиентов);
	Объекты.Добавить(Метаданные.Документы.УсловияРетроБонусовПоставщика);
	Объекты.Добавить(Метаданные.Документы.НачислениеРетроБонусовКлиента);
	Объекты.Добавить(Метаданные.Документы.НачислениеРетроБонусовПоставщика);
	Объекты.Добавить(Метаданные.Документы.УстановкаБлокировокЯчеек);
	Объекты.Добавить(Метаданные.Документы.УстановкаКвотАссортимента);
	Объекты.Добавить(Метаданные.Документы.УстановкаЦенНоменклатуры);
	Объекты.Добавить(Метаданные.Обработки.РабочееМестоМенеджераПоДоставке);
	Объекты.Добавить(Метаданные.Обработки.УправлениеПоступлением);
	Объекты.Добавить(Метаданные.Справочники.ВидыНоменклатуры);
	Объекты.Добавить(Метаданные.Справочники.ДоговорыКонтрагентов);
	Объекты.Добавить(Метаданные.Справочники.ДоговорыКредитовИДепозитов);
	Объекты.Добавить(Метаданные.Справочники.КонтактныеЛицаПартнеров);
	Объекты.Добавить(Метаданные.Справочники.Контрагенты);
	Объекты.Добавить(Метаданные.Справочники.Номенклатура);
	Объекты.Добавить(Метаданные.Справочники.ОбластиХранения);
	Объекты.Добавить(Метаданные.Справочники.Партнеры);
	Объекты.Добавить(Метаданные.Справочники.ПодарочныеСертификаты);
	Объекты.Добавить(Метаданные.Справочники.КартыЛояльности);
	Объекты.Добавить(Метаданные.Справочники.Претензии); 
	Объекты.Добавить(Метаданные.Справочники.СегментыНоменклатуры);
	Объекты.Добавить(Метаданные.Справочники.СегментыПартнеров);
	Объекты.Добавить(Метаданные.Справочники.СоглашенияСКлиентами);
	Объекты.Добавить(Метаданные.Справочники.СоглашенияСПоставщиками);
	Объекты.Добавить(Метаданные.Справочники.Склады);
	Объекты.Добавить(Метаданные.Справочники.СкладскиеПомещения); 
	Объекты.Добавить(Метаданные.Справочники.СкладскиеЯчейки); 
	Объекты.Добавить(Метаданные.Справочники.ВидыЦен);
	Объекты.Добавить(Метаданные.Справочники.ВариантыКомплектацииНоменклатуры); 
	Объекты.Добавить(Метаданные.Справочники.ВидыКартЛояльности);

	Объекты.Добавить(Метаданные.Документы.ОтчетКомитентуОЗакупках);
	Объекты.Добавить(Метаданные.Документы.ПервичныйДокумент);
	
	#Вставка
	Объекты.Добавить(Метаданные.Документы.ПередачаСырьяПереработчику);
	Объекты.Добавить(Метаданные.Документы.ОтчетПереработчика);
	Объекты.Добавить(Метаданные.Документы.ПоступлениеОтПереработчика);
	Объекты.Добавить(Метаданные.Документы.ВозвратСырьяОтПереработчика);
	Объекты.Добавить(Метаданные.Документы.ЗаказПереработчику);
	#КонецВставки
	УчетНДСУП.ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты);


	// Конец СлужебныеПодсистемы.ОбъектыУТКАУП

	СозданиеНаОснованииЛокализация.ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты);

	//-- НЕ ГОСИС


КонецПроцедуры
