
&НаКлиенте
&ИзменениеИКонтроль("ОформитьПоступлениеТоваровУслуг")
Процедура асп_ОформитьПоступлениеТоваровУслуг(ЭтоУслуги)
	ЭлементСписокРаспоряжения = Элементы.СписокРаспоряженияНаПоступление;

	ВыделенныеСтроки = ЭлементСписокРаспоряжения.ВыделенныеСтроки;
	Если Не ОбщегоНазначенияУТКЛиент.ВыбраныДокументыКОформлению(
		ВыделенныеСтроки,
		ПараметрыЖурнала("Накладные")) Тогда
		Возврат;
	КонецЕсли;

	ОчиститьСообщения();

	СписокРаспоряжений.Очистить();
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		НайденнаяСтрока = Элементы.СписокРаспоряженияНаПоступление.ДанныеСтроки(Строка);
		ДобавленнаяСтрока = СписокРаспоряжений.Добавить();
		ЗаполнитьЗначенияСвойств(ДобавленнаяСтрока, НайденнаяСтрока);
	КонецЦикла;

	// Выбор варианта действия и возврат резульата в виде имени формы которую необходимо открыть и ее входящих параметров.
	ПараметрыСозданныхДокументов = ОформитьПоступленияПоЗаказамНаСервере(ЭтоУслуги);

	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(ПараметрыСозданныхДокументов.СписокОшибок);

	Если ПараметрыСозданныхДокументов.Свойство("ТекстВопросаПользователю") Тогда

		ПоказатьВопрос(
		Новый ОписаниеОповещения(ПараметрыСозданныхДокументов.ПроцедураОбработкиОтветаПользователя, ЭтотОбъект, ПараметрыСозданныхДокументов),
		ПараметрыСозданныхДокументов.ТекстВопросаПользователю, РежимДиалогаВопрос.ДаНет);

	ИначеЕсли ПараметрыСозданныхДокументов.Свойство("ИмяФормы") Тогда

		Если ПараметрыСозданныхДокументов.Параметры.Свойство("СозданныеДокументы") Тогда

			ТекстОповещения = НСтр("ru = 'Создано документов: %1'");
			Если ПараметрыСозданныхДокументов.Параметры.СозданныеДокументы.Количество() > 0 Тогда
				ТекстОповещения = СтрШаблон(ТекстОповещения, ПараметрыСозданныхДокументов.Параметры.СозданныеДокументы.Количество());
				ПоказатьОповещениеПользователя(НСтр("ru = 'Создание документов'"), , ТекстОповещения);
			Иначе
				ТекстОповещения = СтрШаблон(ТекстОповещения, 0);
				ПоказатьОповещениеПользователя(НСтр("ru = 'Создание документов'"), , ТекстОповещения);
				Возврат;
			КонецЕсли;

			ПараметрыСозданныхДокументов.Параметры.Удалить("СозданныеДокументы");

		КонецЕсли;
		#Вставка
		//++ASP_СмирновН 17.04.25 000026764 чиним возникшую ошибку
		МассивДокументов = Новый массив;
		Проверка(МассивДокументов,ПараметрыСозданныхДокументов.Параметры.Основание.ДокументОснование);
		Если МассивДокументов.Количество() > 1 тогда
			Для каждого СтрМас Из МассивДокументов Цикл
				ПараметрыСозданныхДокументов.Параметры.Основание.ДокументОснование = СтрМас;
				ОткрытьФорму(ПараметрыСозданныхДокументов.ИмяФормы, ПараметрыСозданныхДокументов.Параметры, ЭтаФорма,новый УникальныйИдентификатор);
			КонецЦикла;	
		Иначе
			ОткрытьФорму(ПараметрыСозданныхДокументов.ИмяФормы, ПараметрыСозданныхДокументов.Параметры, ЭтаФорма);
		КонецЕсли;
		//--ASP_СмирновН 17.04.25 000026764
		#КонецВставки
		#Удаление
		ОткрытьФорму(ПараметрыСозданныхДокументов.ИмяФормы, ПараметрыСозданныхДокументов.Параметры, ЭтаФорма);
		#КонецУдаления
	КонецЕсли;

КонецПроцедуры 

&НаСервере
Функция Проверка(МассивДокументов,ДокументОснование)
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	ПриобретениеТоваровУслуг.Проведен
	|	И ПриобретениеТоваровУслуг.ЗаказПоставщику = &ЗаказПоставщику";
	Запрос.УстановитьПараметр("ЗаказПоставщику", ДокументОснование);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока выборка.Следующий() цикл
	 МассивДокументов.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

