&После("ОбработкаПроведения")
Процедура асп_ОбработкаПроведения(Отказ, РежимПроведения)
	//ASP_Lebedev_000020332_17/08/2023 Принудительная регистрация в узле обмена.
	ДатаКонтроля = Константы.ДатаКонтроляВыгрузкиДокументовВБП.Получить();
	ОбъектМодифицирован = ASP_Добавленный.СравнитьВерсииОбъекта(ЭтотОбъект); //000026792
	Если НЕ Отказ и ЭтотОбъект.Проведен и ЭтотОбъект.Дата > ДатаКонтроля и ОбъектМодифицирован Тогда
	//Если НЕ Отказ и ЭтотОбъект.Дата > ДатаКонтроля и ОбъектМодифицирован Тогда
		узел = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятия30.НайтиПоКоду("002");
		ПланыОбмена.ЗарегистрироватьИзменения(узел, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&После("ПриЗаписи")
Процедура асп_ПриЗаписи(Отказ)
	//++ASP_Kalyanin 000027461 09.07.25
	//Перенес данную доработку из обработки проведения тк при отметке на удаление документ не проводится и не попадает в обмен
	УстановитьПривилегированныйРежим(Истина);
	ДатаКонтроля = Константы.ДатаКонтроляВыгрузкиДокументовВБП.Получить();
	ОбъектМодифицирован = ASP_Добавленный.СравнитьВерсииОбъекта(ЭтотОбъект); //000026792
	Если НЕ Отказ и ЭтотОбъект.Дата > ДатаКонтроля и ОбъектМодифицирован Тогда
		узел = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятия30.НайтиПоКоду("002");
		ПланыОбмена.ЗарегистрироватьИзменения(узел, ЭтотОбъект);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	//--ASP_Kalyanin 000027461 09.07.25
КонецПроцедуры
