
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТаблицаПринтеров = Новый Массив;
	
	Попытка 
		Locator = Новый COMОбъект("WbemScripting.SWbemLocator"); 
	Исключение 
		Сообщить(ОписаниеОшибки()); 
		Возврат; 
	КонецПопытки; 
	
	ServicesSet = Locator.ConnectServer("."); 
	ObjectSet = ServicesSet.InstancesOf("Win32_Printer"); 
	
	Для каждого Item Из ObjectSet Цикл 
		ТаблицаПринтеров.Добавить(Item.Caption); 
		//Принтер.Принтер = Item.Caption; 
	КонецЦикла; 
	
	Если ТаблицаПринтеров.Количество() = 1 Тогда 
		Отказ = Истина; 
	КонецЕсли;
	
	Реквизит1.ЗагрузитьЗначения(ТаблицаПринтеров);
			
КонецПроцедуры

&НаКлиенте
Процедура Таблица1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбранныйПринтер = Элемент.ТекущиеДанные.Значение;
	ЭтаФорма.Закрыть(ВыбранныйПринтер);
КонецПроцедуры
