
#Область ПрограммныйИнтерфейс

#Область ПараметрыРегистрации

// Функция возвращает поддерживает ли фискальное устройство.
// 
// Параметры:
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - Идентификатор устройства
// 
// Возвращаемое значение:
//  Булево - Фискальное устройство поддерживает проверку кодов маркировки
Функция ФискальноеУстройствоПоддерживаетПроверкуКодовМаркировки(ИдентификаторУстройства) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ФискальноеУстройствоПоддерживаетПроверкуКодовМаркировки(ИдентификаторУстройства);
	
КонецФункции

// Функция возвращает для фискального устройства версию ФФД.
// 
// Параметры:
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - Идентификатор устройства.
// 
// Возвращаемое значение:
//  Неопределено - Фискальное устройство поддерживает версию ФФД
Функция ФискальноеУстройствоПоддерживаетВерсиюФФД(ИдентификаторУстройства) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ФискальноеУстройствоПоддерживаетВерсиюФФД(ИдентификаторУстройства);
	
КонецФункции    

// Функция возвращает поддерживает ли фискальное устройство ТС ПИоТ.
// 
// Параметры:
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - Идентификатор устройства.
// 
// Возвращаемое значение:
//  Булево - Фискальное устройство поддерживает ТС ПИоТ
Функция ФискальноеУстройствоПоддерживаетТСПИоТ(ИдентификаторУстройства) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ФискальноеУстройствоПоддерживаетТСПИоТ(ИдентификаторУстройства);
	
КонецФункции

#КонецОбласти

#Область ФормированиеДанныхККТ

// Получить таблицу параметров смены из ККТ.
//
// Параметры:
//  ДанныеXML - Строка - строка XML
//  РевизияИнтерфейса - Число - ревизия интерфейса
//  НомерСменыККТ - Число - номер смены
//  НомерЧекаККТ - Число - номер чека
//
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьПараметрыСменыИзXMLПакета(ДанныеXML, РевизияИнтерфейса = 0, НомерСменыККТ = 0, НомерЧекаККТ = 0) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиентСервер.
		ПолучитьПараметрыСменыИзXMLПакета(ДанныеXML, РевизияИнтерфейса, НомерСменыККТ, НомерЧекаККТ);
	
КонецФункции

// Возвращает XML текст инфо-квитанции
// Параметры:
//  Данные - Структура
//  ШиринаСтроки - Число
//  Ревизия - Строка
//
// Возвращаемое значение:
//  Строка - Строка XML
//
Функция XMLПакетИнфоКвитанции(Данные,  ШиринаСтроки, Ревизия) Экспорт
	
	Шаблон = ШаблоныФискальныхДокументов.ШаблонИнфоКвитанция(ШиринаСтроки, Данные);
	НефискальныйДокумент = ШаблоныФискальныхДокументов.ВывестиКакТекст(Шаблон);
	Возврат ОборудованиеЧекопечатающиеУстройства.ПолучитьXMLПакетДляТекста(НефискальныйДокумент, Ревизия);
	
КонецФункции

// Идентифицирует ли код товара (значение тега 1162) экземпляр товара.
//
// Параметры:
//   РеквизитКодаТовара - Строка - Значение реквизита кода товара в BASE64.
//   ШтриховойКодТовара - Строка - Штриховой код товара.
//
// Возвращаемое значение:
//  Булево - Истина - Если код товара идентифицирует экземпляр товара.
//
Функция КодТовараИдентифицируетЭкземпляр(Знач РеквизитКодаТовара = Неопределено, Знач ШтриховойКодТовара = Неопределено) Экспорт
	
	Результат = Ложь;
	// Если реквизит кода товара (1162)  не передается в готовом виде
	Если ПустаяСтрока(РеквизитКодаТовара) Тогда
		ДанныеКодаТовара = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(ШтриховойКодТовара);
		РеквизитКодаТовара = ДанныеКодаТовара.РеквизитКодаТовара;
	КонецЕсли;
		
	Если НЕ ПустаяСтрока(РеквизитКодаТовара) Тогда
		ТипыИдентификаторов = КодТовараЗаполняетсяДляТиповИдентификаторов();
		НачалоРеквизитКодаТовара = Лев(РеквизитКодаТовара, 3); 
		Если НачалоРеквизитКодаТовара = "RE0" Тогда // GS1 Data Matrix или Data Matrix  - Если первые 2 байта значения кода товара имеют значения "44h4Dh".
			Результат = ТипыИдентификаторов.Найти(Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеDataMatrixGS1) <> Неопределено;
		ИначеЕсли НачалоРеквизитКодаТовара = "UkZ" Тогда // Меховые изделия - Если первые 2 байта значения кода товара имеют значения "52h46h".
			Результат = ТипыИдентификаторов.Найти(Перечисления.ТипыИдентификаторовТовараККТ.ИзделияИзНатуральногоМеха) <> Неопределено;
		ИначеЕсли НачалоРеквизитКодаТовара = "xRR" Тогда // ЕГАИС 2.0 - Если первые 2 байта значения кода товара имеют значения "C5h14h".
			Результат = ТипыИдентификаторов.Найти(Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеЕГАИС2) <> Неопределено;
		ИначеЕсли НачалоРеквизитКодаТовара = "xR4" Тогда // ЕГАИС 3.0 - Если первые 2 байта значения кода товара имеют значения "C5h1Eh".
			Результат = ТипыИдентификаторов.Найти(Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеЕГАИС3) <> Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает, для каких типов идентификаторов будет заполняться код товара.
//
// Возвращаемое значение:
//  Массив из ПеречислениеСсылка.ТипыИдентификаторовТовараККТ
//
Функция КодТовараЗаполняетсяДляТиповИдентификаторов() Экспорт;
	
	ТипыИдентификаторов = Новый Массив();
	ТипыИдентификаторов.Добавить(Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеDataMatrixGS1);
	ТипыИдентификаторов.Добавить(Перечисления.ТипыИдентификаторовТовараККТ.ИзделияИзНатуральногоМеха);
	ТипыИдентификаторов.Добавить(Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеEAN13);
	ТипыИдентификаторов.Добавить(Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеEAN8);
	ТипыИдентификаторовОбработка = ТипыИдентификаторов;
	ВыполненаСтандартнаяОбработка = Истина; 
	МенеджерОборудованияВызовСервераПереопределяемый.КодТовараЗаполняетсяДляТиповИдентификаторов(ТипыИдентификаторовОбработка, ВыполненаСтандартнаяОбработка);
	Если ВыполненаСтандартнаяОбработка Тогда
		Результат = ТипыИдентификаторов
	Иначе
		Результат = ТипыИдентификаторовОбработка
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

#Область ФискальныеОперации

// Устарела: следует использовать ОборудованиеЧекопечатающиеУстройства.ЗаписатьФискальнуюОперацию.
// Записать операцию в журнал фискальных операций.
//
// Параметры:
//   ПараметрыФискализации - Структура - 
Процедура ЗаписатьФискальнуюОперацию(ПараметрыФискализации) Экспорт
	
	ОборудованиеЧекопечатающиеУстройства.ЗаписатьФискальнуюОперацию(ПараметрыФискализации);
	
КонецПроцедуры

// АПК: 142-выкл обратная совместимость

// Устарела: следует использовать ОборудованиеЧекопечатающиеУстройства.ДанныеФискальнойОперации.
// Получить данные журнала фискальных операций.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - Документ-основание.
//  ИдентификаторЗаписи - РегистрСведенийЗапись.ФискальныеОперации - запись фискальной операции.
//  ТипыДокументов - ПеречислениеСсылка.ТипыФискальныхДокументовККТ - типы документов.
//  ТипРасчета - ПеречислениеСсылка.ТипыРасчетаДенежнымиСредствами - тип расчета.
//  ФискальныйПризнак - Строка - Фискальный признак документа
// 
// Возвращаемое значение:
//  Структура - Структура по свойствами:
//   * НомерСменыККМ - Число - Номер чека ККМ.
//   * Сумма - Число - Сумма.
//   * ДокументОснование - ДокументСсылка - Документ-основание.
//   * ДанныеXML - ХранилищеЗначения - Данные чека, переданные в ККТ (XML).
//
Функция ДанныеФискальнойОперации(ДокументСсылка, ИдентификаторЗаписи = Неопределено, ТипыДокументов = Неопределено, ТипРасчета = Неопределено, ФискальныйПризнак = Неопределено) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ДанныеФискальнойОперации(ДокументСсылка, ИдентификаторЗаписи, ТипыДокументов, ТипРасчета, ФискальныйПризнак);
	
КонецФункции

// АПК: 142-вкл

// Устарела: следует использовать ОборудованиеЧекопечатающиеУстройства.ФискальнаяОперацииПоИдентификатору.
// Получить данные журнала фискальных операций.
//
// Параметры:
//  ИдентификаторЗаписи - РегистрСведенийЗапись.ФискальныеОперации - Идентификатор записи.
// 
// Возвращаемое значение:
// РегистрСведенийЗапись.ФискальныеОперации.
Функция ФискальнаяОперацииПоИдентификатору(ИдентификаторЗаписи) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ФискальнаяОперацииПоИдентификатору(ИдентификаторЗаписи);
	
КонецФункции

// Устарела: следует использовать ОборудованиеЧекопечатающиеУстройства.СписокФискальныхОпераций.
// Получить список журнала фискальных операций.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - Документ-основание.
//  ТипыДокументов - ПеречислениеСсылка.ТипыФискальныхДокументовККТ - типы фискальных документов.
//  ТипРасчета - ПеречислениеСсылка.ТипыРасчетаДенежнымиСредствами - типы расчета.
// 
// Возвращаемое значение:
//  См. ОборудованиеЧекопечатающиеУстройства.СписокФискальныхОпераций
//
Функция СписокФискальныхОпераций(ДокументСсылка, ТипыДокументов = Неопределено, ТипРасчета = Неопределено) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.СписокФискальныхОпераций(ДокументСсылка, ТипыДокументов, ТипРасчета);
	
КонецФункции

#КонецОбласти

#Область ОчередьЧековККТ 

// Устарела: следует использовать РаспределеннаяФискализация.ДобавитьЧекВОчередьЧековККТ.
// Добавить чек в очередь чеков ККТ.
//
// Параметры:
//  ПараметрыЧекаККТ - Структура - Параметры чека ККТ:
//  * ПозицииЧека - Массив из См. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека - .
//  ПараметрыПакетнойОперации - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыПакетнойОперацииВОчередиЧеков
// Возвращаемое значение:
//  РегистрСведенийЗапись
Функция ДобавитьЧекВОчередьЧековККТ(ПараметрыЧекаККТ, ПараметрыПакетнойОперации = Неопределено) Экспорт
	
	Если ОбщегоНазначенияБПО.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
		Возврат МодульРаспределеннаяФискализация.ДобавитьЧекВОчередьЧековККТ(ПараметрыЧекаККТ, ПараметрыПакетнойОперации);
	КонецЕсли;
	
КонецФункции

// Устарела: следует использовать РаспределеннаяФискализация.ДанныеЧекаВОчереди.
// Данные чека из очереди.
//
// Параметры:
//  ИдентификаторЗаписи - РегистрСведенийЗапись.ФискальныеОперации - Идентификатор записи.
// 
// Возвращаемое значение:
//  Структура.
Функция ДанныеЧекаВОчереди(ИдентификаторЗаписи) Экспорт
	
	Если ОбщегоНазначенияБПО.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
		Возврат МодульРаспределеннаяФискализация.ДанныеЧекаВОчереди(ИдентификаторЗаписи);
	КонецЕсли;
	
КонецФункции

// Устарела: следует использовать РаспределеннаяФискализация.ЧекиВОчередиНаФискализацию.
// Чеки в очереди на фискализацию.
//
// Параметры:
//  КассаККМ - ОпределяемыйТип.КассаБПО - Касса по которой провести фискализацию, если не указано тогда по всем.
//
// Возвращаемое значение:
//  Массив.
Функция ЧекиВОчередиНаФискализацию(КассаККМ = Неопределено) Экспорт
	
	Если ОбщегоНазначенияБПО.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
		Возврат МодульРаспределеннаяФискализация.ЧекиВОчередиНаФискализацию(КассаККМ);
	КонецЕсли;
	
КонецФункции

// Устарела: следует использовать РаспределеннаяФискализация.УдалитьЧекИзОчереди.
// Удалить чек из очереди.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - Документ-основание.
// 
Процедура УдалитьЧекИзОчереди(ДокументСсылка) Экспорт
	
	Если ОбщегоНазначенияБПО.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
		МодульРаспределеннаяФискализация.УдалитьЧекИзОчереди(ДокументСсылка);
	КонецЕсли;
	
КонецПроцедуры

// Устарела: следует использовать РаспределеннаяФискализация.ОчиститьОчередьЧеков.
// Очистить очередь чеков.
//
Процедура ОчиститьОчередьЧеков() Экспорт
	
	Если ОбщегоНазначенияБПО.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
		МодульРаспределеннаяФискализация.ОчиститьОчередьЧеков();
	КонецЕсли;
	
КонецПроцедуры

// Устарела: следует использовать РаспределеннаяФискализация.ЗаписатьСтатусЧекаВОчереди.
// Записать статус чека в очереди.
//
// Параметры:
//  ПараметрыФискализации - Структура:
//   * ИдентификаторФискальнойЗаписи - Строка
//   * ДокументОснование - ДокументСсылка
//   * РезультатВыполненияПакетнойОперации - Структура
//  СтатусЧека - ПеречислениеСсылка.СтатусЧекаККТВОчереди
//  ОборудованиеККТ - СправочникСсылка.ПодключаемоеОборудование -
//  ТекстОшибки - Строка
Процедура ЗаписатьСтатусЧекаВОчереди(ПараметрыФискализации, СтатусЧека, ОборудованиеККТ = Неопределено, ТекстОшибки = Неопределено) Экспорт
	
	Если ОбщегоНазначенияБПО.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
		МодульРаспределеннаяФискализация.ЗаписатьСтатусЧекаВОчереди(ПараметрыФискализации, СтатусЧека, ОборудованиеККТ, ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

// Устарела: следует использовать РаспределеннаяФискализация.ПолучитьСтатусЧекаВОчереди.
// Данные чека из очереди.
//
// Параметры:
//  ИдентификаторЗаписи - РегистрСведенийЗапись.ФискальныеОперации - Идентификатор записи.
// 
// Возвращаемое значение:
//  Структура.
Функция ПолучитьСтатусЧекаВОчереди(ИдентификаторЗаписи) Экспорт
	
	Если ОбщегоНазначенияБПО.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
		Возврат МодульРаспределеннаяФискализация.ПолучитьСтатусЧекаВОчереди(ИдентификаторЗаписи);
	КонецЕсли;
	
КонецФункции

// Устарела: следует использовать РаспределеннаяФискализация.ПолучитьФискальнуюОперацию.
// Данные чека из очереди по фискальный признаку и номеру чеку ККМ.
// 
// Параметры:
//  ФискальныйПризнак - Строка - Фискальный признак
//  НомерЧекаККМ - Строка - Номер чека ККМ
// 
// Возвращаемое значение:
//  Неопределено, Структура - Получить фискальную операцию:
//  * ДокументОснование - ОпределяемыйТип.ОснованиеФискальнойОперацииБПО.
//  * ИдентификаторЗаписи - УникальныйИдентификатор.
//  * ФискальныйПризнак - Строка - 
//  * НомерСменыККМ - Число.
//  * НомерЧекаККМ - Число. 
Функция ПолучитьФискальнуюОперацию(ФискальныйПризнак, НомерЧекаККМ = Неопределено) Экспорт
	
	Если ОбщегоНазначенияБПО.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализация = ОбщегоНазначенияБПО.ОбщийМодуль("РаспределеннаяФискализация");
		Возврат МодульРаспределеннаяФискализация.ПолучитьФискальнуюОперацию(ФискальныйПризнак, НомерЧекаККМ);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

// Устарела: следует использовать ФорматноЛогическийКонтроль.ВыполненаПроверкаОбязательностиИПравильностиЗаполненияТэгов.
// Выполняет проверку обязательности заполняет тэгов.
//
// Параметры:
//  Параметры - Структура 
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование
//  ОписаниеОшибки - Строка
// 
// Возвращаемое значение:
//  Булево.
Функция ВыполненаПроверкаОбязательностиИПравильностиЗаполненияТэгов(Параметры, ИдентификаторУстройства, ОписаниеОшибки) Экспорт
	
	Если ОбщегоНазначенияБПО.ИспользуетсяФорматноЛогическийКонтроль() Тогда
		МодульФорматноЛогическийКонтроль = ОбщегоНазначенияБПО.ОбщийМодуль("ФорматноЛогическийКонтроль");
		Возврат МодульФорматноЛогическийКонтроль.ВыполненаПроверкаОбязательностиИПравильностиЗаполненияТэгов(Параметры, ИдентификаторУстройства, ОписаниеОшибки);
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Устарела: следует использовать ФорматноЛогическийКонтроль.ПривестиДанныеКТребуемомуФормату.
// Процедура приводит к формату согласованному с ФНС.
//
// Параметры:
//  ОсновныеПараметры - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека
//  Отказ - Булево
//  ОписаниеОшибки - Строка
//  ИсправленыОсновныеПараметры - Булево
Процедура ПривестиДанныеКТребуемомуФормату(ОсновныеПараметры, Отказ, ОписаниеОшибки, ИсправленыОсновныеПараметры) Экспорт
	
	Если ОбщегоНазначенияБПО.ИспользуетсяФорматноЛогическийКонтроль() Тогда
		МодульФорматноЛогическийКонтроль = ОбщегоНазначенияБПО.ОбщийМодуль("ФорматноЛогическийКонтроль");
		МодульФорматноЛогическийКонтроль.ПривестиДанныеКТребуемомуФормату(ОсновныеПараметры, ИсправленыОсновныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Устарела: следует использовать ОборудованиеЧекопечатающиеУстройства.ШаблонЧека.
// Функция формирует шаблон чека.
//
// Параметры:
//  ОбщиеПараметры - См. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека
//  ТипОборудования - Строка - типы оборудования строкой.
//  ДополнительныйТекст - Строка - дополнительный текст шаблона чека.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование
//
// Возвращаемое значение:
//  Структура.
Функция ШаблонЧека(ОбщиеПараметры, ТипОборудования, ДополнительныйТекст = Неопределено, ИдентификаторУстройства = Неопределено) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ШаблонЧека(ОбщиеПараметры, ТипОборудования, ДополнительныйТекст, ИдентификаторУстройства);
	
КонецФункции

// Устарела: следует использовать ОборудованиеЧекопечатающиеУстройства.СформироватьФискальныйДокумент.
// Функция формирует табличный документ по данным фискального чека.
//
// Параметры:
//  ТипДокумента - Число
//   ОбщиеПараметры - Структура - параметры фискального документа загруженная из данных XML
//                    см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека
//   РеквизитыЧека - Структура - параметры фискального документа из регистра сведений фискальные документы
//                    см. ДанныеФискальнойОперации()
//   ФорматФФД - Строка - формат фискальных данных, влияет на вывод таблицы оплаты при "1.0" 
//                        используются только виды оплат "НАЛИЧНЫМИ", "ЭЛЕКТРОННО"
//
// Возвращаемое значение:
//  ТабличныйДокумент - табличный документ со сформированным фискальным документом, может быть сохранен в любой формат.
//
Функция СформироватьФискальныйДокумент(ТипДокумента, ОбщиеПараметры, РеквизитыЧека, ФорматФФД = "1.1") Экспорт
	
	Контекст = ПараметрыВыводЧека();
	Контекст.ФорматФФД = ФорматФФД;
	
	ВывестиДополнительнуюСтроку(Контекст, Контекст.ДополнительнаяСтрокаШапка);

	ВывестиРазделитель(Контекст, "НетЛинии");
	ВывестиРазделитель(Контекст, "Двойная");
	
	ВывестиШапкуЧека(Контекст, ОбщиеПараметры, ТипДокумента);
	ВывестиПозицииЧека(Контекст, ОбщиеПараметры);
	ВывестиТаблицуОплат(Контекст, ОбщиеПараметры);
	
	ВывестиРазделитель(Контекст, "Двойная");
	ВывестиРазделитель(Контекст, "НетЛинии");
	
	ВывестиРеквизитыЧека(Контекст, ОбщиеПараметры, РеквизитыЧека);
	ВывестиСтрокуПоЦентру(Контекст, ОбщиеПараметры.ТекстПодвала);
	
	ВывестиРазделитель(Контекст, "Двойная");
	ВывестиРазделитель(Контекст, "НетЛинии");
	
	ВывестиДополнительнуюСтроку(Контекст, Контекст.ДополнительнаяСтрокаПодвал);
	
	Возврат Контекст.ТабличныйДокумент;
	
	//Возврат ОборудованиеЧекопечатающиеУстройства.СформироватьФискальныйДокумент(ТипДокумента, ОбщиеПараметры, РеквизитыЧека, ФорматФФД);
	
КонецФункции

// Устарела: следует использовать ОборудованиеЧекопечатающиеУстройства.СформироватьФискальныйДокумент.
// Функция формирует табличный документ по данным фискального чека.
//
// Параметры:
//  ТипДокумента - Число
//   ОбщиеПараметры - Структура - параметры фискального документа загруженная из данных XML
//                    см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека
//   РеквизитыЧека - Структура - параметры фискального документа из регистра сведений фискальные документы
//                    см. ДанныеФискальнойОперации().
//   ФорматФФД - Строка - формат фискальных данных, влияет на вывод таблицы оплаты при "1.0" 
//                        используются только виды оплат "НАЛИЧНЫМИ", "ЭЛЕКТРОННО".
//
// Возвращаемое значение:
//  Строка - Текст.
//
Функция СформироватьФискальныйДокументТекст(ТипДокумента, ОбщиеПараметры, РеквизитыЧека = Неопределено, ФорматФФД = "1.1", ШиринаЧека = 36) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.СформироватьФискальныйДокументТекст(ТипДокумента, ОбщиеПараметры, РеквизитыЧека, ФорматФФД, ШиринаЧека);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПередОткрытиемКассовойСмены(ПараметрыПодключения, ДанныеОперации) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ПередОткрытиемКассовойСмены(ПараметрыПодключения, ДанныеОперации);
	
КонецФункции

Функция ПередЗакрытиемКассовойСмены(ПараметрыПодключения, ДанныеОперации) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ПередЗакрытиемКассовойСмены(ПараметрыПодключения, ДанныеОперации);
	
КонецФункции

Функция ПослеОткрытияКассовойСмены(ПараметрыПодключения, РезультатВыполнения) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ПослеОткрытияКассовойСмены(ПараметрыПодключения, РезультатВыполнения);
	
КонецФункции

Функция ПослеЗакрытияКассовойСмены(ПараметрыПодключения, РезультатВыполнения) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройства.ПослеЗакрытияКассовойСмены(ПараметрыПодключения, РезультатВыполнения);
	
КонецФункции


#Область ФормированиеДанныхККТ

// Получить XMLПакет для операции.
// 
// Параметры:
//  ОбщиеПараметры - Структура, Булево - Общие параметры
//  РевизияИнтерфейса - Число - Ревизия интерфейса
// 
// Возвращаемое значение:
//  Строка - Получить XMLПакет для операции
Функция ПолучитьXMLПакетДляОперации(ОбщиеПараметры, РевизияИнтерфейса = 0) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиентСервер.
		ПолучитьXMLПакетДляОперации(ОбщиеПараметры, РевизияИнтерфейса);
	
КонецФункции

// Получить XMLПакет для текста.
// 
// Параметры:
//  СтрокаТекста - Строка, Структура - Строка текста
//  РевизияИнтерфейса - Число - Ревизия интерфейса
// 
// Возвращаемое значение:
//  Массив из ЗаписьXML - Получить XMLПакет для текста.
Функция ПолучитьXMLПакетДляТекста(СтрокаТекста, РевизияИнтерфейса = 0) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиентСервер.
		ПолучитьXMLПакетДляТекста(СтрокаТекста, РевизияИнтерфейса);
	
КонецФункции  

Процедура ЗаполнитьXMLПакетыДляТекстовогоДокумента(ТестовыеЧеки, НефискальныеДокументы, ПараметрыПодключения, ШиринаСтроки = 32) Экспорт
	
	ОборудованиеЧекопечатающиеУстройстваКлиентСервер.
		ЗаполнитьXMLПакетыДляТекстовогоДокумента(ТестовыеЧеки, НефискальныеДокументы, ПараметрыПодключения, ШиринаСтроки);

КонецПроцедуры

Функция ПолучитьПараметрыСостоянияИзXMLПакета(Данные, НомерСмены = Неопределено) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПолучитьПараметрыСостоянияИзXMLПакета(Данные, НомерСмены);
	
КонецФункции         

Функция ПолучитьСтатусСостоянияИзXMLПакета(Данные) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПолучитьСтатусСостоянияИзXMLПакета(Данные);
	
КонецФункции             

Функция ПолучитьСлужебнуюИнформациюИзXMLПакета(Данные) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПолучитьСлужебнуюИнформациюИзXMLПакета(Данные);
	
КонецФункции  

Функция ПолучитьПараметрыРезультатаИзXMLПакета(Данные) Экспорт
	
	Возврат ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПолучитьПараметрыРезультатаИзXMLПакета(Данные);
	
КонецФункции  

#КонецОбласти

///////////////////////////////////////////////////////////////////////////////
// Коды маркировки

// Устарела: следует использовать МенеджерОборудованияМаркировка.КодПланируемыйСтатусМаркируемогоТовара.
// Получить код планируемого статус маркируемого товара
// 
// Параметры:
//  ПланируемыйСтатусМаркируемогоТовара - ПеречислениеСсылка - Планируемый статус маркируемого товара.  
// 
// Возвращаемое значение:
//  Число - Код планируемого статус маркируемого товара по ОФД
//
Функция КодПланируемыйСтатусМаркируемогоТовара(ПланируемыйСтатусМаркируемогоТовара) Экспорт
	
	Если ОбщегоНазначенияБПО.ИспользуетсяМаркировка() Тогда
		МодульМенеджерОборудованияМаркировка = ОбщегоНазначенияБПО.ОбщийМодуль("МенеджерОборудованияМаркировка");
		Возврат МодульМенеджерОборудованияМаркировка.КодПланируемыйСтатусМаркируемогоТовара(ПланируемыйСтатусМаркируемогоТовара);
	КонецЕсли;
	
КонецФункции

// Устарела: следует использовать МенеджерОборудованияМаркировка.КодОтветаОИСМОСтатусеТовара.
// Получить код ответ ОИСМ о статусе товара
// 
// Параметры:
//  ОтветОИСМОСтатусеТовара - ПеречислениеСсылка - Ответ от ИСМО.  
// 
// Возвращаемое значение:
//  Число - Ответ ОИСМ о статусе товара по ОФД
//
Функция КодОтветаОИСМОСтатусеТовара(ОтветОИСМОСтатусеТовара) Экспорт
	
	Если ОбщегоНазначенияБПО.ИспользуетсяМаркировка() Тогда
		МодульМенеджерОборудованияМаркировка = ОбщегоНазначенияБПО.ОбщийМодуль("МенеджерОборудованияМаркировка");
		Возврат МодульМенеджерОборудованияМаркировка.КодОтветаОИСМОСтатусеТовара(ОтветОИСМОСтатусеТовара);
	КонецЕсли;
	
КонецФункции

// Устарела: следует использовать МенеджерОборудованияМаркировка.ОтветОИСМОСтатусеТовараПоКоду.
// Получить ответ ОИСМ о статусе товара по коду.
// 
// Параметры:
//  ОтветОИСМОСтатусеТовара - Число - Ответ от ИСМО.  
// 
// Возвращаемое значение:
//  ПеречислениеСсылка - Ответ ОИСМ.
//
Функция ОтветОИСМОСтатусеТовараПоКоду(ОтветОИСМОСтатусеТовара) Экспорт
	
	Если ОбщегоНазначенияБПО.ИспользуетсяМаркировка() Тогда
		МодульМенеджерОборудованияМаркировка = ОбщегоНазначенияБПО.ОбщийМодуль("МенеджерОборудованияМаркировка");
		Возврат МодульМенеджерОборудованияМаркировка.ОтветОИСМОСтатусеТовараПоКоду(ОтветОИСМОСтатусеТовара);
	КонецЕсли;
	
КонецФункции

// Устарела: следует использовать МенеджерОборудованияМаркировка.КодТипаМаркировкиККТ.
// Получить код типа маркировки ККТ по коду.
// 
// Параметры:
//  ТипМаркировкиККТ - ПеречислениеСсылка.ТипыМаркировкиККТ - Тип маркировки ККТ.
// 
// Возвращаемое значение:
//  Строка, Произвольный - Код типа маркировки ККТ
Функция КодТипаМаркировкиККТ(ТипМаркировкиККТ) Экспорт
	
	Если ОбщегоНазначенияБПО.ИспользуетсяМаркировка() Тогда
		МодульМенеджерОборудованияМаркировка = ОбщегоНазначенияБПО.ОбщийМодуль("МенеджерОборудованияМаркировка");
		Возврат МодульМенеджерОборудованияМаркировка.КодТипаМаркировкиККТ(ТипМаркировкиККТ);
	КонецЕсли;
	
КонецФункции

// Устарела: следует использовать МенеджерОборудованияМаркировка.ТипМаркировкиККТПоКоду.
// Получить код типа маркировки ККТ.
// 
// Параметры:
//  КодТипМаркировкиККТ - Число - Код тип маркировки ККТ
// 
// Возвращаемое значение:
//  Произвольный, ПеречислениеСсылка.ТипыМаркировкиККТ - Тип маркировки ККТПо коду
Функция ТипМаркировкиККТПоКоду(КодТипМаркировкиККТ) Экспорт
	
	Если ОбщегоНазначенияБПО.ИспользуетсяМаркировка() Тогда
		МодульМенеджерОборудованияМаркировка = ОбщегоНазначенияБПО.ОбщийМодуль("МенеджерОборудованияМаркировка");
		Возврат МодульМенеджерОборудованияМаркировка.ТипМаркировкиККТПоКоду(КодТипМаркировкиККТ);
	КонецЕсли;
	
КонецФункции

// Устарела: следует использовать МенеджерОборудованияМаркировка.СтатусРезультатаЗапросаКМПоКоду.
// Получить статус результата запроса КМ по коду.
// 
// Параметры:
//  КодСтатуса - Число - Код статуса.
// 
// Возвращаемое значение:
//  Произвольный, ПеречислениеСсылка - Статус результата запроса КМПо коду
Функция СтатусРезультатаЗапросаКМПоКоду(КодСтатуса) Экспорт
	
	Если ОбщегоНазначенияБПО.ИспользуетсяМаркировка() Тогда
		МодульМенеджерОборудованияМаркировка = ОбщегоНазначенияБПО.ОбщийМодуль("МенеджерОборудованияМаркировка");
		Возврат МодульМенеджерОборудованияМаркировка.СтатусРезультатаЗапросаКМПоКоду(КодСтатуса);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ФормированиеЧека

// Создает контекст для выполнения процедуры формирования фискального чека
// Возвращаемое значение:
//   Структура - структура контекста для вывода фискального документа в табличный документ
Функция ПараметрыВыводЧека()
	
	ШиринаСтроки = 46;
	ШиринаСтраницыА4 = 100;
	РазмерБоковогоПоля = Макс(0, (ШиринаСтраницыА4 - ШиринаСтроки) / 2);
	
	Контекст = Новый Структура();
	Контекст.Вставить("Строка",            0);
	Контекст.Вставить("ФорматФФД",         "1.1");
	Контекст.Вставить("ШиринаСтроки",      ШиринаСтроки);
	Контекст.Вставить("ФорматЧисло",       "ЧРД=.;ЧЦ=12;ЧДЦ=2;ЧН=0.00;ЧГ=0");
	Контекст.Вставить("ФорматКоличество",  "ЧРД=.;ЧЦ=12;ЧДЦ=3;ЧН=0.000;ЧГ=0");
	Контекст.Вставить("ТабличныйДокумент", Новый ТабличныйДокумент());
	Контекст.ТабличныйДокумент.Область(, 2, , 3).ШиринаКолонки = ШиринаСтроки / 2;  
	//ASP_Lebedev При обновлении
	//Печать копии чека (из его представления) выводит лишние поля, затем они печатаются/сохраняются в pdf и съезжает чек за пределы ленты.
	Контекст.ТабличныйДокумент.Область(, 1, , 1).ШиринаКолонки = 0;//РазмерБоковогоПоля;
	Контекст.ТабличныйДокумент.Область(, 4, , 4).ШиринаКолонки = 0;//РазмерБоковогоПоля;
	Контекст.ТабличныйДокумент.ПолеСверху = 2;  
	Контекст.ТабличныйДокумент.ПолеСнизу = 2;
	Контекст.ТабличныйДокумент.ПолеСлева = 2;
	Контекст.ТабличныйДокумент.ПолеСправа = 2; 
	Контекст.ТабличныйДокумент.АвтоМасштаб = Истина;
	Контекст.ТабличныйДокумент.РазмерКолонтитулаСверху = 0;
	Контекст.ТабличныйДокумент.РазмерКолонтитулаСнизу = 0;
	Контекст.Вставить("ДополнительнаяСтрокаШапка",  "");
	Контекст.Вставить("ДополнительнаяСтрокаПодвал", "");
	МенеджерОборудованияВызовСервераПереопределяемый.ДополнительныйТекстПриФормированииЧекаPDF(Контекст.ДополнительнаяСтрокаШапка, Контекст.ДополнительнаяСтрокаПодвал);
	
	Итоги = Новый Структура();
	Итоги.Вставить("СуммаЧека", 0);
	Итоги.Вставить("СуммаПозицийНДС0", 0);
	Итоги.Вставить("СуммаПозицийНДС10", 0);
	Итоги.Вставить("СуммаПозицийНДС18", 0);
	Итоги.Вставить("СуммаПозицийНДС20", 0);
	Итоги.Вставить("СуммаПозицийНДС22", 0);
	Итоги.Вставить("СуммаПозицийНДС110", 0);
	Итоги.Вставить("СуммаПозицийНДС118", 0);
	Итоги.Вставить("СуммаПозицийНДС120", 0);
	Итоги.Вставить("СуммаПозицийНДС122", 0);
	Итоги.Вставить("СуммаПозицийБезНДС", 0);
	Итоги.Вставить("СуммаНДС0", 0);
	Итоги.Вставить("СуммаНДС10", 0);
	Итоги.Вставить("СуммаНДС18", 0);
	Итоги.Вставить("СуммаНДС20", 0); 
	Итоги.Вставить("СуммаНДС22", 0);
	Итоги.Вставить("СуммаНДС110", 0);
	Итоги.Вставить("СуммаНДС118", 0);
	Итоги.Вставить("СуммаНДС120", 0);
	Итоги.Вставить("СуммаНДС122", 0);  //
	Итоги.Вставить("СуммаБезНДС", 0);
	Контекст.Вставить("Итоги", Итоги);
	
	Оплата = Новый Структура();
	Оплата.Вставить("СуммаНаличными",0);
	Оплата.Вставить("СуммаЭлектронными",0);
	Оплата.Вставить("СуммаПостоплатой",0);
	Оплата.Вставить("СуммаПредоплатой",0);
	Оплата.Вставить("СуммаПредоставлением",0);
	Оплата.Вставить("СуммаОплаты",0);
	Оплата.Вставить("СуммаСдачи",0);
	Контекст.Вставить("Оплата", Оплата);
	
	Возврат Контекст;
	
КонецФункции

// Выводит разделитель в табличном документе при формировании фискального документа
// Параметры:
//   Контекст - Структура - контекст который вернула функция ПараметрыВыводЧека()
//   ТипЛинии - Строка - тип линии:
//       "Двойная" - линия "========================="
//       "Сплошная" - линия "-------------------------"
//       "НетЛинии" - пустая строка
Процедура ВывестиРазделитель(Контекст, ТипЛинии = "Двойная")
	
	Если ТипЛинии = "Двойная" Тогда
		ЛинияРазделитель = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Двойная, 1);
	ИначеЕсли ТипЛинии = "Сплошная" Тогда
		ЛинияРазделитель = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	Иначе
		ЛинияРазделитель = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии, 1);
	КонецЕсли;
	Контекст.Строка = Контекст.Строка + 1;
	Область         = Контекст.ТабличныйДокумент.Область(Контекст.Строка, 2, Контекст.Строка, 3);
	Область.ГраницаСнизу = ЛинияРазделитель;
	
КонецПроцедуры

// Выводит рекламную строку на весь документ
// Параметры:
//   Контекст - Структура - контекст который вернула функция ПараметрыВыводЧека()
//   Текст - Строка - текст рекламной строки
Процедура ВывестиДополнительнуюСтроку(Контекст, Текст)
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	Контекст.Строка = Контекст.Строка + 1;
	
	Область = Контекст.ТабличныйДокумент.Область(Контекст.Строка, 1, , 4);
	Область.ПоВыделеннымКолонкам = Истина;
	Область.РазмещениеТекста   = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	Область = Контекст.ТабличныйДокумент.Область(Контекст.Строка, 1);
	Область.Текст = Текст;
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	
КонецПроцедуры

// Выводит строку в фискальном документе и выравнивает ее по центру
// Параметры:
//   Контекст - Структура - контекст который вернула функция ПараметрыВыводЧека()
//   Текст - Строка - текст строки
//   Выделить - Булево - если истина тогда будет выведено полужирным шрифтом
Процедура ВывестиСтрокуПоЦентру(Контекст, Текст, Выделить = Ложь)
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	Контекст.Строка = Контекст.Строка + 1;
	
	Область = Контекст.ТабличныйДокумент.Область(Контекст.Строка, 2, , 3);
	Область.ПоВыделеннымКолонкам = Истина;
	Область.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	Область = Контекст.ТабличныйДокумент.Область(Контекст.Строка, 2);
	Область.Текст = Текст;
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	Область.Шрифт = Новый Шрифт(Область.Шрифт,,,Выделить);
	
КонецПроцедуры

// Выводит строку в фискальном документе в двух колонках слева и справа
// Параметры:
//   Контекст - Структура - контекст который вернула функция ПараметрыВыводЧека()
//   ТекстЛевый - Строка - текст строки в левой колонке выравнивается слева
//   ТекстПравый - Строка - текст строки в правой колонке выравнивается справа
//   Выделить - Булево - если истина тогда будет выведено полужирным шрифтом
Процедура ВывестиСтрокуПоШирине(Контекст, ТекстЛевый="", ТекстПравый = "", Выделить = Ложь)
	
	Если ПустаяСтрока(ТекстЛевый) И ПустаяСтрока(ТекстПравый) Тогда
		Возврат;
	КонецЕсли;
	
	Контекст.Строка = Контекст.Строка + 1;
	Область = Контекст.ТабличныйДокумент.Область(Контекст.Строка, 2);
	Область.Текст = ТекстЛевый;
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	Область = Контекст.ТабличныйДокумент.Область(Контекст.Строка, 3);
	Область.Текст = ТекстПравый;
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	Область.Шрифт = Новый Шрифт(Область.Шрифт,,,Выделить);
	
КонецПроцедуры

// Выводит строку в фискальном документе слева
// Параметры:
//   Контекст - Структура - контекст который вернула функция ПараметрыВыводЧека()
//   Текст - Строка - текст строки, выравнивается слева
//   Выделить - Булево - если истина тогда будет выведено полужирным шрифтом
Процедура ВывестиСтрокуСлева(Контекст, Текст, Выделить = Ложь)
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	Контекст.Строка = Контекст.Строка + 1;
	Область = Контекст.ТабличныйДокумент.Область(Контекст.Строка, 2, , 3);
	Область.ПоВыделеннымКолонкам = Истина;
	Область.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	Область = Контекст.ТабличныйДокумент.Область(Контекст.Строка, 2);
	Область.Текст = Текст;
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	Область.Шрифт = Новый Шрифт(Область.Шрифт,,,Выделить);
	
КонецПроцедуры

// Выводит поле в двух колонках, слева ИмяПоля справа значение поля, если значение не заполнено, строка не выводится
// если значение число, то будет выполнено форматирование по строке заданной в контексте
// Параметры:
//   Контекст - Структура - контекст который вернула функция ПараметрыВыводЧека()
//   ИмяПоля - Строка - имя поля, выравнивается слева
//   Значение - Строка - значение поля, выравнивается справа
Процедура ВывестиПолеПоШирине(Контекст, ИмяПоля, Значение)
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Значение = "=" + Формат(Значение, Контекст.ФорматЧисло);
	КонецЕсли;
	
	Контекст.Строка = Контекст.Строка + 1;
	Область       = Контекст.ТабличныйДокумент.Область(Контекст.Строка, 2);
	Область.Текст = ИмяПоля;
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	
	Область       = Контекст.ТабличныйДокумент.Область(Контекст.Строка, 3);
	Область.Текст = Значение;
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
	
КонецПроцедуры

// Выводит поле и значение друг за другом слева, если значение не заполнено, строка не выводится
// если значение число, то будет выполнено форматирование по строке заданной в контексте
// Параметры:
//   Контекст - Структура - контекст который вернула функция ПараметрыВыводЧека()
//   ИмяПоля - Строка - имя поля, выравнивается слева
//   Значение - Строка - значение поля, выравнивается справа
Процедура ВывестиПолеСлева(Контекст, ИмяПоля, Значение)
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		ЗначениеСтрокой = "=" + Формат(Значение, Контекст.ФорматЧисло);
	Иначе
		ЗначениеСтрокой = Строка(Значение);
	КонецЕсли;
	
	Контекст.Строка = Контекст.Строка + 1;
	Область       = Контекст.ТабличныйДокумент.Область(Контекст.Строка, 2);
	Область.Текст = ИмяПоля + " " + ЗначениеСтрокой;
	Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
	
КонецПроцедуры

// Возвращает код типа штрихкода по имени для передачи в ГенерацияШтрихкода
// Параметры:
//   СтрокаТипШтрихкода - Строка - текстовое представление вида штрихкода
Функция ЧисловойТипШтрихкода(СтрокаТипШтрихкода)
	
	ТипыШтрихкода = Новый Соответствие();
	ТипыШтрихкода.Вставить("EAN8", 0);
	ТипыШтрихкода.Вставить("EAN13", 1);
	ТипыШтрихкода.Вставить("EAN128", 2);
	ТипыШтрихкода.Вставить("Code39", 3);
	ТипыШтрихкода.Вставить("Code128", 4);
	ТипыШтрихкода.Вставить("Code16k", 5);
	ТипыШтрихкода.Вставить("PDF417", 6);
	ТипыШтрихкода.Вставить("Standart (Industrial) 2 of 5", 7);
	ТипыШтрихкода.Вставить("Interleaved 2 of 5", 8);
	ТипыШтрихкода.Вставить("Code39", 9);
	ТипыШтрихкода.Вставить("Code93", 10);
	ТипыШтрихкода.Вставить("ITF14", 11);
	ТипыШтрихкода.Вставить("RSS14", 12);
	ТипыШтрихкода.Вставить("EAN13AddOn2", 14);
	ТипыШтрихкода.Вставить("EAN13AddOn5", 15);
	ТипыШтрихкода.Вставить("QR", 16);
	ТипыШтрихкода.Вставить("GS1DataBarExpandedStacked", 17);
	ТипыШтрихкода.Вставить("Datamatrix ASCII", 18);
	ТипыШтрихкода.Вставить("Datamatrix BASE256", 19);
	ТипыШтрихкода.Вставить("Datamatrix TEXT", 20);
	ТипыШтрихкода.Вставить("Datamatrix C40", 21);
	ТипыШтрихкода.Вставить("Datamatrix X12", 22);
	ТипыШтрихкода.Вставить("Datamatrix EDIFACT", 23);
	ТипыШтрихкода.Вставить("Datamatrix GS1ASCII", 24);
	
	Результат = ТипыШтрихкода.Получить(СтрокаТипШтрихкода);
	
	Возврат ?(Результат = Неопределено, 99, Результат);
	
КонецФункции

// Выводит штрихкод табличный документ
// Параметры:
//   Контекст - Структура - контекст который вернула функция ПараметрыВыводЧека()
//   ТипШтрихкода - Строка - тип штрихкода в текстовом виде
//   Штрихкод - Строка - значение штрихкода
Процедура ВывестиШтрихкод(Контекст, ТипШтрихкода, Штрихкод)
	
	ТабличныйДокумент = Контекст.ТабличныйДокумент;
	
	ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	ПараметрыШтрихкода.Масштабировать     = Истина;
	ПараметрыШтрихкода.СохранятьПропорции = Истина;
	ПараметрыШтрихкода.ОтображатьТекст    = Ложь;
	ПараметрыШтрихкода.Штрихкод = Штрихкод;
	ПараметрыШтрихкода.ТипКода  = ЧисловойТипШтрихкода(ТипШтрихкода);

	Штрихкод = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	Если ПараметрыШтрихкода.ТипКода = 16 Тогда
		Штрихкод.РазмерКартинки = РазмерКартинки.Пропорционально;
		ПараметрыШтрихкода.Ширина = 100;
		ПараметрыШтрихкода.Высота = 100;
		КоличествоСтрок = 6;
	Иначе
		Штрихкод.РазмерКартинки = РазмерКартинки.РеальныйРазмер;
		ПараметрыШтрихкода.Ширина = 100;
		ПараметрыШтрихкода.Высота = 100;
		КоличествоСтрок = 2;
	КонецЕсли;
	
	Изображение = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
	Штрихкод.Картинка = Изображение.Картинка;
	Штрихкод.ГраницаСверху = Ложь;
	Штрихкод.ГраницаСнизу  = Ложь;
	Штрихкод.ГраницаСправа = Ложь;
	Штрихкод.ГраницаСлева  = Ложь;
	
	Контекст.Строка = Контекст.Строка + 1;
	Область = Контекст.ТабличныйДокумент.Область(Контекст.Строка, 2, Контекст.Строка + КоличествоСтрок, 3);
	Область.ПоВыделеннымКолонкам = Истина;
	Область.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	
	ОбластьСтроки = Контекст.ТабличныйДокумент.Область(Контекст.Строка, , Контекст.Строка + КоличествоСтрок - 1);
	ОбластьСтроки.ВместеСоСледующим = Истина;
	Штрихкод.Расположить(Область);
	
	Контекст.Строка = Контекст.Строка + КоличествоСтрок;
	
КонецПроцедуры

// Определяет тип чека при выводе шапки фискального документа
// Параметры:
//   ТипДокумента - Число - 
//   ТипРасчета  - ПеречислениеСсылка.ТипыРасчетаДенежнымиСредствами - 
Функция ВывестиШапкуТипЧека(ТипДокумента, ТипРасчета = Неопределено)

	Если ТипДокумента = 0 Тогда
		ТипыЧеков = Новый Соответствие();
		ТипыЧеков.Вставить(1, НСтр("ru='ПРИХОД'"));          // Чек продажи     
		ТипыЧеков.Вставить(2, НСтр("ru='ВОЗВРАТ ПРИХОДА'")); // Чек возврата продажи 
		ТипыЧеков.Вставить(3, НСтр("ru='РАСХОД'"));          // Чек покупки 
		ТипыЧеков.Вставить(4, НСтр("ru='ВОЗВРАТ РАСХОДА'")); // Чек возврата покупки 
		ТипЧека = ТипыЧеков.Получить(ОборудованиеЧекопечатающиеУстройстваКлиентСервер.КодРасчетаДенежнымиСредствами(ТипРасчета));
	ИначеЕсли ТипДокумента = 1 Тогда
		ТипЧека = НСтр("ru='ОТКРЫТИЕ СМЕНЫ'");  
	ИначеЕсли ТипДокумента = 2 Тогда
		ТипЧека = НСтр("ru='ВНЕСЕНИЕ'");  
	ИначеЕсли ТипДокумента = 3 Тогда
		ТипЧека = НСтр("ru='ВЫЕМКА'");  
	ИначеЕсли ТипДокумента = 4 Тогда
		ТипЧека = НСтр("ru='ОТЧЕТ БЕЗ ГАШЕНИЯ'");   
	ИначеЕсли ТипДокумента = 5 Тогда
		ТипЧека = НСтр("ru='ОТЧЕТ С ГАШЕНИЕМ'");  
	КонецЕсли;
	
	Возврат ТипЧека;

КонецФункции

// Выводит шапку фискального документа в табличный документ
// Параметры:
//   Контекст - Структура - контекст который вернула функция ПараметрыВыводЧека()
//   ОбщиеПараметры - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека
//   ТипДокумента - Число - 
Процедура ВывестиШапкуЧека(Контекст, ОбщиеПараметры, ТипДокумента)
	
	ВывестиСтрокуПоЦентру(Контекст, ОбщиеПараметры.ОрганизацияНазвание);
	
	Если НЕ ПустаяСтрока(ОбщиеПараметры.АдресРасчетов) Тогда
		ВывестиСтрокуПоЦентру(Контекст, ОбщиеПараметры.АдресРасчетов);
		ВывестиСтрокуПоЦентру(Контекст, ОбщиеПараметры.МестоРасчетов);
	ИначеЕсли НЕ ПустаяСтрока(ОбщиеПараметры.АдресМагазина) Тогда
		ВывестиСтрокуСлева(Контекст, ОбщиеПараметры.АдресМагазина);
	КонецЕсли;
	
	ВывестиСтрокуПоЦентру(Контекст, ОбщиеПараметры.ТекстШапки);
	
	Если ТипДокумента = 0 Тогда 
		ВывестиСтрокуПоЦентру(Контекст, НСтр("ru='КАССОВЫЙ ЧЕК'"), Истина);
	КонецЕсли;
	
	ТипЧека        = ВывестиШапкуТипЧека(ТипДокумента, ОбщиеПараметры.ТипРасчета);
	ОрганизацияИНН = ?(ПустаяСтрока(ОбщиеПараметры.ОрганизацияИНН), "", НСтр("ru='ИНН'") + Символы.НПП + ОбщиеПараметры.ОрганизацияИНН);
	Если Не ПустаяСтрока(ОрганизацияИНН) Тогда
		ВывестиСтрокуСлева(Контекст, ТипЧека);
	Иначе
		ВывестиСтрокуПоШирине(Контекст, ТипЧека, ОрганизацияИНН);
	КонецЕсли;
	
	НомерЧека = ?(ПустаяСтрока(ОбщиеПараметры.НомерЧека),"", НСтр("ru='ЧЕК №'") + ОбщиеПараметры.НомерЧека);
	ДатаВремя = ?(ПустаяСтрока(ОбщиеПараметры.ДатаВремя), 
		МенеджерОборудованияКлиентСервер.ДатаСеанса(),
		ОбщиеПараметры.ДатаВремя);
	ДатаВремя = Формат(ДатаВремя, "ДФ=""дд.ММ.гггг ЧЧ:мм"""); // АПК: 1367 особенность локального законодательства
	ВывестиСтрокуПоШирине(Контекст, НомерЧека, ДатаВремя);
	
	Если ТипДокумента = 0  Тогда
		Покупатель    = ОбщиеПараметры.Получатель;
		ПокупательИНН = ОбщиеПараметры.ПолучательИНН;
		ПокупательАдрес = "";
		СведенияОПокупателе = ОбщиеПараметры.СведенияОПокупателе;
		Покупатель      = ?(Не ПустаяСтрока(СведенияОПокупателе.Покупатель),      СведенияОПокупателе.Покупатель,      Покупатель);
		ПокупательИНН   = ?(Не ПустаяСтрока(СведенияОПокупателе.ПокупательИНН),   СведенияОПокупателе.ПокупательИНН,   ПокупательИНН);
		ПокупательАдрес = ?(Не ПустаяСтрока(СведенияОПокупателе.ПокупательАдрес), СведенияОПокупателе.ПокупательАдрес, ПокупательАдрес);
		ВывестиПолеСлева(Контекст, НСтр("ru='ПОКУПАТЕЛЬ:'"),     Покупатель);
		ВывестиПолеСлева(Контекст, НСтр("ru='ИНН ПОКУПАТЕЛЯ:'"), ПокупательИНН);
		ВывестиПолеСлева(Контекст, НСтр("ru='АДРЕС ПОКУПАТЕЛЯ:'"), ПокупательАдрес);
		ВывестиСтрокуСлева(Контекст, ВРег(Строка(ОбщиеПараметры.ПризнакАгента)));
		ВывестиПолеСлева(Контекст, НСтр("ru='ПОСТАВЩИК:'"), ОбщиеПараметры.ДанныеПоставщика.Наименование);
		ВывестиПолеПоШирине(Контекст, НСтр("ru='ТЛФ.ПОСТ.:'"), ОбщиеПараметры.ДанныеПоставщика.Телефон);
		ВывестиПолеПоШирине(Контекст, НСтр("ru='ИНН ПОСТАВЩИКА:'"), ОбщиеПараметры.ДанныеПоставщика.ИНН);
		ВывестиПолеПоШирине(Контекст, НСтр("ru='ПЛ.АГЕНТ ОПЕР.:'"), ОбщиеПараметры.ДанныеАгента.ПлатежныйАгент.Операция);
		ВывестиПолеПоШирине(Контекст, НСтр("ru='ПЛ.АГЕНТ.ТЛФ.:'"), ОбщиеПараметры.ДанныеАгента.ПлатежныйАгент.Телефон);
		ВывестиПолеПоШирине(Контекст, НСтр("ru='ОПЕРАТОР ПЕРЕВОДА:'"), ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Наименование);
		ВывестиПолеПоШирине(Контекст, " " + НСтр("ru='ТЛФ.ОП.ПЕРЕВОДА:'"), ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Телефон);
		ВывестиПолеПоШирине(Контекст, " " + НСтр("ru='АДР.ОП.ПЕРЕВОДА:'"), ОбщиеПараметры.ДанныеАгента.ОператорПеревода.Адрес);
		ВывестиПолеПоШирине(Контекст, " " + НСтр("ru='ИНН ОП.ПЕРЕВОДА:'"), ОбщиеПараметры.ДанныеАгента.ОператорПеревода.ИНН);
		ВывестиПолеПоШирине(Контекст, НСтр("ru='ОПЕР.ПО ПРИЕМУ ПЛАТ.ТЛФ:'"), ОбщиеПараметры.ДанныеАгента.ОператорПоПриемуПлатежей.Телефон);
		ВывестиПолеПоШирине(Контекст, НСтр("ru='РЕК.ПОЛЬЗ.:'"), ОбщиеПараметры.ДополнительныйРеквизитПользователя.Наименование);
		ВывестиПолеПоШирине(Контекст, " " + НСтр("ru='РЕК.ПОЛЬЗ.:'"), ОбщиеПараметры.ДополнительныйРеквизитПользователя.Значение);
	КонецЕсли;
	
	ВывестиРазделитель(Контекст, "Сплошная");
	ВывестиРазделитель(Контекст, "НетЛинии");
	
КонецПроцедуры

// Выводит текст налога и скидки при выводе позиции строки фискального документа
// Параметры:
//   Контекст - Структура - контекст который вернула функция ПараметрыВыводЧека()
//   ПозицияЧека - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека
Процедура ВывестиПозицииЧекаНалогИСкидка(Контекст, ПозицияЧека)
	
	Итоги = Контекст.Итоги;
	
	ТекстСкидки = "";
	Если ПозицияЧека.СуммаСкидок<>Неопределено Тогда
		Если ПозицияЧека.СуммаСкидок > 0 Тогда
			ТекстСкидки = НСтр("ru='СКИДКА'") + "=" + Формат(ПозицияЧека.СуммаСкидок, Контекст.ФорматЧисло);
		ИначеЕсли ПозицияЧека.СуммаСкидок < 0 Тогда
			ТекстСкидки = НСтр("ru='НАДБАВКА'") + "=" + Формат(ПозицияЧека.СуммаСкидок, Контекст.ФорматЧисло);
		КонецЕсли;
	КонецЕсли;

	ПозицияСуммаНДС = ?(ПозицияЧека.СуммаНДС = Неопределено, 0, ПозицияЧека.СуммаНДС); 
	ТекстНалога = "";
	Если ПозицияЧека.СтавкаНДС = 10 Тогда
		Итоги.СуммаПозицийНДС10 = Итоги.СуммаПозицийНДС10 + ПозицияЧека.Сумма;
		Итоги.СуммаНДС10        = Итоги.СуммаНДС10        + ПозицияСуммаНДС;
		ТекстНалога             = НСтр("ru='НДС 10%'");
	ИначеЕсли ПозицияЧека.СтавкаНДС = 18 Тогда
		Итоги.СуммаПозицийНДС18 = Итоги.СуммаПозицийНДС18 + ПозицияЧека.Сумма; 
		Итоги.СуммаНДС18        = Итоги.СуммаНДС18        + ПозицияСуммаНДС;
		ТекстНалога             = НСтр("ru='НДС 18%'");
	ИначеЕсли ПозицияЧека.СтавкаНДС = 20 Тогда
		Итоги.СуммаПозицийНДС20 = Итоги.СуммаПозицийНДС20 + ПозицияЧека.Сумма; 
		Итоги.СуммаНДС20        = Итоги.СуммаНДС20        + ПозицияСуммаНДС;
		ТекстНалога             = НСтр("ru='НДС 20%'");   
	ИначеЕсли ПозицияЧека.СтавкаНДС = 22 Тогда
		Итоги.СуммаПозицийНДС22 = Итоги.СуммаПозицийНДС22 + ПозицияЧека.Сумма; 
		Итоги.СуммаНДС22       = Итоги.СуммаНДС22        + ПозицияСуммаНДС;
		ТекстНалога             = НСтр("ru='НДС 22%'");

	ИначеЕсли ПозицияЧека.СтавкаНДС = 0 Тогда
		Итоги.СуммаПозицийНДС0  = Итоги.СуммаПозицийНДС0 + ПозицияЧека.Сумма;
		Итоги.СуммаНДС0         = Итоги.СуммаНДС0        + ПозицияСуммаНДС;
		ТекстНалога             = НСтр("ru='НДС 0%'");
	ИначеЕсли ПозицияЧека.СтавкаНДС = 110 Тогда
		Итоги.СуммаПозицийНДС110 = Итоги.СуммаПозицийНДС110 + ПозицияЧека.Сумма;
		Итоги.СуммаНДС110        = Итоги.СуммаНДС110        + ПозицияСуммаНДС;
		ТекстНалога              = НСтр("ru='НДС 10/110'");
	ИначеЕсли ПозицияЧека.СтавкаНДС = 118 Тогда
		Итоги.СуммаПозицийНДС118 = Итоги.СуммаПозицийНДС118 + ПозицияЧека.Сумма;
		Итоги.СуммаНДС118        = Итоги.СуммаНДС118        + ПозицияСуммаНДС;
		ТекстНалога              = НСтр("ru='НДС 18/118'");
	ИначеЕсли ПозицияЧека.СтавкаНДС = 120 Тогда
		Итоги.СуммаПозицийНДС120 = Итоги.СуммаПозицийНДС120 + ПозицияЧека.Сумма;
		Итоги.СуммаНДС120        = Итоги.СуммаНДС120        + ПозицияСуммаНДС;
		ТекстНалога              = НСтр("ru='НДС 20/120'");  
	ИначеЕсли ПозицияЧека.СтавкаНДС = 122 Тогда
		Итоги.СуммаПозицийНДС122 = Итоги.СуммаПозицийНДС122 + ПозицияЧека.Сумма;
		Итоги.СуммаНДС122        = Итоги.СуммаНДС122        + ПозицияСуммаНДС;
		ТекстНалога              = НСтр("ru='НДС 22/122'");

	Иначе 
		Итоги.СуммаПозицийБезНДС = Итоги.СуммаПозицийБезНДС + ПозицияЧека.Сумма;
		Итоги.СуммаБезНДС        = Итоги.СуммаБезНДС        + ПозицияЧека.Сумма;
		ТекстНалога              = НСтр("ru='БЕЗ НДС'");
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстСкидки) Тогда
		ВывестиСтрокуСлева(Контекст, ТекстНалога);
	Иначе
		ВывестиСтрокуПоШирине(Контекст, ТекстНалога, ТекстСкидки);
	КонецЕсли;
			
КонецПроцедуры

// Выводит все позиции чека фискального документа в табличный документ
// Параметры:
//   Контекст - Структура - контекст который вернула функция ПараметрыВыводЧека()
//   ОбщиеПараметры - см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека
//
Процедура ВывестиПозицииЧека(Контекст, ОбщиеПараметры)
	
	Для Каждого ТекущаяПозицияЧека Из ОбщиеПараметры.ПозицииЧека Цикл
		ПозицияЧека = ТекущаяПозицияЧека; // см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека
		Если ПозицияЧека.Свойство("ФискальнаяСтрока") Тогда
			НомерСекции  = ?(ПозицияЧека.Свойство("НомерСекции") , ПозицияЧека.НомерСекции , 0);
			СтавкаНДС    = ?(ПозицияЧека.Свойство("СтавкаНДС")   , ПозицияЧека.СтавкаНДС   , 0);
			СуммаНДС     = ?(ПозицияЧека.Свойство("СуммаНДС")    , ?(ПустаяСтрока(ПозицияЧека.СуммаНДС), 0, ПозицияЧека.СуммаНДС), 0);
			
			ВывестиРазделитель(Контекст, "НетЛинии");
			ВывестиСтрокуСлева(Контекст, ПозицияЧека.Наименование, Истина);
			
			ЦенаДляПечати = Окр(ПозицияЧека.Сумма / ?(ПозицияЧека.Количество > 0, ПозицияЧека.Количество, 1), 2);
			СтрокаТовара = СтрШаблон("%1  х %2 = %3", 
				Формат(ПозицияЧека.Количество, Контекст.ФорматКоличество),
				Формат(ЦенаДляПечати,          Контекст.ФорматЧисло),
				Формат(ПозицияЧека.Сумма,      Контекст.ФорматЧисло));
			ВывестиПолеПоШирине(Контекст, ,СтрокаТовара);
			Контекст.Итоги.СуммаЧека = Контекст.Итоги.СуммаЧека + ПозицияЧека.Сумма;
			
			ВывестиПозицииЧекаНалогИСкидка(Контекст, ПозицияЧека);
			
			ВывестиСтрокуСлева(Контекст, ВРег(Строка(ПозицияЧека.ПризнакПредметаРасчета)));
			Если НЕ ПустаяСтрока(ПозицияЧека.ПризнакСпособаРасчета) Тогда
				ПризнакСпособаРасчета = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.КодПризнакаСпособаРасчета(ПозицияЧека.ПризнакСпособаРасчета);
				ПризнакСпособаРасчетаНаименование = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.НаименованиеПризнакаСпособаРасчета(ПризнакСпособаРасчета);
				ВывестиСтрокуСлева(Контекст, ПризнакСпособаРасчетаНаименование);
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(ПозицияЧека.КонтрольнаяМарка) Тогда 
				ВывестиСтрокуСлева(Контекст, НСтр("ru='[М]'"));
			ИначеЕсли ПозицияЧека.ДанныеКодаТоварнойНоменклатуры.Свойство("РеквизитКодаТовара") Тогда 
				Штрихкод = ПозицияЧека.Штрихкод;
				Если ПозицияЧека.Свойство("КодВидаНоменклатурнойКлассификации") И НЕ ПустаяСтрока(ПозицияЧека.КодВидаНоменклатурнойКлассификации) Тогда
					Штрихкод = ПозицияЧека.КодВидаНоменклатурнойКлассификации;
				КонецЕсли;
				КодТовараИдентифицируетЭкземпляр = ОборудованиеЧекопечатающиеУстройстваВызовСервера.КодТовараИдентифицируетЭкземпляр(ПозицияЧека.ДанныеКодаТоварнойНоменклатуры.РеквизитКодаТовара, Штрихкод);
				КодТовараТекст = Штрихкод;
				Если КодТовараИдентифицируетЭкземпляр Тогда
					КодТовараТекст = НСтр("ru='[М]'") + КодТовараТекст + Символы.НПП;
				КонецЕсли;
				ВывестиСтрокуСлева(Контекст, КодТовараТекст);
			КонецЕсли;
			
			ВывестиПолеСлева(Контекст, НСтр("ru='КОД СТРАНЫ:'"), ПозицияЧека.КодСтраныПроисхожденияТовара);
			ВывестиПолеСлева(Контекст, НСтр("ru='ДЕКЛАРАЦИЯ:'"), ПозицияЧека.НомерТаможеннойДекларации);
			ВывестиПолеСлева(Контекст, НСтр("ru='АКЦИЗ:'"), Строка(ПозицияЧека.СуммаАкциза));
			ВывестиПолеСлева(Контекст, НСтр("ru='ЕД.ИЗМЕРЕНИЯ:'"), ПозицияЧека.ЕдиницаИзмерения);
			ВывестиСтрокуСлева(Контекст, ВРег(Строка(ПозицияЧека.ПризнакАгентаПоПредметуРасчета)));
			ВывестиПолеПоШирине(Контекст, НСтр("ru='ПОСТАВЩИК:'"), ПозицияЧека.ДанныеПоставщика.Наименование);
			ВывестиПолеПоШирине(Контекст, НСтр("ru='ТЛФ.ПОСТ.:'"), ПозицияЧека.ДанныеПоставщика.Телефон);
			ВывестиПолеПоШирине(Контекст, НСтр("ru='ИНН ПОСТАВЩИКА:'"), ПозицияЧека.ДанныеПоставщика.ИНН);
			ВывестиПолеПоШирине(Контекст, НСтр("ru='ПЛ.АГЕНТ ОПЕР.:'"), ПозицияЧека.ДанныеАгента.ПлатежныйАгент.Операция);
			// АПК: 1299-выкл особенность форматирования в чеках
			ВывестиПолеПоШирине(Контекст, НСтр("ru=' ПЛ.АГЕНТ ТЛФ.:'"), ПозицияЧека.ДанныеАгента.ПлатежныйАгент.Телефон);
			// АПК: 1299-вкл
			ВывестиПолеПоШирине(Контекст, НСтр("ru='ОПЕРАТОР ПЕРЕВОДА:'"), ПозицияЧека.ДанныеАгента.ОператорПеревода.Наименование);
			ВывестиПолеПоШирине(Контекст, НСтр("ru='ТЛФ.ОП.ПЕРЕВОДА:'"), ПозицияЧека.ДанныеАгента.ОператорПеревода.Телефон);
			ВывестиПолеПоШирине(Контекст, НСтр("ru='АДР.ОП.ПЕРЕВОДА:'"), ПозицияЧека.ДанныеАгента.ОператорПеревода.Адрес);
			ВывестиПолеПоШирине(Контекст, НСтр("ru='ИНН ОП.ПЕРЕВОДА:'"), ПозицияЧека.ДанныеАгента.ОператорПеревода.ИНН);
			ВывестиПолеПоШирине(Контекст, НСтр("ru='ОПЕР.ПО ПРИЕМУ ПЛАТ.ТЛФ:'"), ПозицияЧека.ДанныеАгента.ОператорПоПриемуПлатежей.Телефон);
			ВывестиПолеПоШирине(Контекст, НСтр("ru='ДОП.РЕК.:'"), ПозицияЧека.ДополнительныйРеквизит);
			
		ИначеЕсли ПозицияЧека.Свойство("ТекстоваяСтрока") Тогда
			ВывестиСтрокуСлева(Контекст, ПозицияЧека.Текст);
		ИначеЕсли ПозицияЧека.Свойство("ШтрихКод") Тогда
			СтрокаШтрихкода = "|ШтрихКод|" + ПозицияЧека.ТипШтрихкода + "|" + ПозицияЧека.ШтрихКод; 
			ВывестиШтрихкод(
				Контекст, 
				ПозицияЧека.ТипШтрихкода, 
				МенеджерОборудованияКлиентСервер.Base64ВШтрихкод(ПозицияЧека.ШтрихКодBase64));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Вспомогательная функция расчет итогов оплаты
// Параметры:
//   Контекст - Структура - контекст который вернула функция ПараметрыВыводЧека()
//   ОбщиеПараметры - Структура - параметры фискального документа загруженная из данных XML
//                    см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека
Процедура ВывестиТаблицуОплатРассчитать(Контекст, ОбщиеПараметры)
	
	Оплата       = Контекст.Оплата;
	ТаблицаОплат = ОбщиеПараметры.ТаблицаОплат;
	
	Для Каждого СтрокаОплаты Из ТаблицаОплат Цикл
		Если СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно") Тогда
			Оплата.СуммаЭлектронными = Оплата.СуммаЭлектронными + СтрокаОплаты.Сумма;
		ИначеЕсли СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата") Тогда
			Оплата.СуммаПредоплатой = Оплата.СуммаПредоплатой + СтрокаОплаты.Сумма;
		ИначеЕсли СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата") Тогда
			Оплата.СуммаПостоплатой = Оплата.СуммаПостоплатой + СтрокаОплаты.Сумма;
		ИначеЕсли СтрокаОплаты.ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.ВстречноеПредоставление") Тогда
			Оплата.СуммаПредоставлением = Оплата.СуммаПредоставлением + СтрокаОплаты.Сумма;
		Иначе
			Оплата.СуммаНаличными = Оплата.СуммаНаличными + СтрокаОплаты.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Оплата.СуммаОплаты = Оплата.СуммаНаличными 
		+ Оплата.СуммаЭлектронными 
		+ Оплата.СуммаПостоплатой 
		+ Оплата.СуммаПредоплатой 
		+ Оплата.СуммаПредоставлением;
	Оплата.СуммаСдачи = Оплата.СуммаОплаты - Контекст.Итоги.СуммаЧека;
	
КонецПроцедуры

// Вспомогательная функция для вывода строки оплаты фискального документа в табличный документ
// Параметры:
//   Контекст - Структура - контекст который вернула функция ПараметрыВыводЧека()
Процедура ВывестиТаблицуОплатСуммаНДС(Контекст, ИмяПоля, СуммаПозицийНДС, СуммаНДС = 0, Отношение = 1)

	Если СуммаПозицийНДС > 0 Тогда
		ЗначениеНДС = ?(СуммаНДС > 0, СуммаНДС, СуммаПозицийНДС / Отношение);
		ВывестиПолеПоШирине(Контекст, ИмяПоля, ЗначениеНДС);
	КонецЕсли;
	
КонецПроцедуры

// Выводит таблицу оплат фискального документа в табличный документ
// Параметры:
//   Контекст - Структура - контекст который вернула функция ПараметрыВыводЧека()
//   ОбщиеПараметры - Структура - параметры фискального документа загруженная из данных XML
//                    см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека
Процедура ВывестиТаблицуОплат(Контекст, ОбщиеПараметры)
	
	ВывестиТаблицуОплатРассчитать(Контекст, ОбщиеПараметры);
	Оплата = Контекст.Оплата;
	Итоги  = Контекст.Итоги;
	
	ВывестиРазделитель(Контекст, "Сплошная");
	ВывестиРазделитель(Контекст, "НетЛинии");
	ВывестиПолеПоШирине(Контекст, НСтр("ru='ИТОГ'"), Итоги.СуммаЧека);
	ВывестиРазделитель(Контекст, "Сплошная");
	ВывестиРазделитель(Контекст, "НетЛинии");
	
	ВывестиСтрокуСлева(Контекст, НСтр("ru='ОПЛАТА'"));
	
	ФорматФФД = Контекст.ФорматФФД;
	
	Если ФорматФФД = "1.0" Тогда // ФФД 1.0
		ВывестиПолеПоШирине(Контекст, " " + НСтр("ru='НАЛИЧНЫМИ'"),    Оплата.СуммаНаличными);
		ВывестиПолеПоШирине(Контекст, " " + НСтр("ru='ЭЛЕКТРОННЫМИ'"), Оплата.СуммаЭлектронными);
		ВывестиПолеПоШирине(Контекст, " " + НСтр("ru='ЭЛЕКТРОННЫМИ'"), Оплата.СуммаПостоплатой);
		ВывестиПолеПоШирине(Контекст, " " + НСтр("ru='ЭЛЕКТРОННЫМИ'"), Оплата.СуммаПредоплатой);
		ВывестиПолеПоШирине(Контекст, " " + НСтр("ru='ЭЛЕКТРОННЫМИ'"), Оплата.СуммаПредоставлением);
	Иначе // ФФД 1.05 & ФФД 1.1
		ВывестиПолеПоШирине(Контекст, " " + НСтр("ru='НАЛИЧНЫМИ'"),       Оплата.СуммаНаличными);
		ВывестиПолеПоШирине(Контекст, " " + НСтр("ru='БЕЗНАЛИЧНЫМИ'"),    Оплата.СуммаЭлектронными);
		ВывестиПолеПоШирине(Контекст, " " + НСтр("ru='ПРЕДВАРИТЕЛЬНАЯ'"), Оплата.СуммаПредоплатой);
		ВывестиПолеПоШирине(Контекст, " " + НСтр("ru='ПОСЛЕДУЮЩАЯ'"),     Оплата.СуммаПостоплатой);
		ВывестиПолеПоШирине(Контекст, " " + НСтр("ru='ИНАЯ ФОРМА'"),      Оплата.СуммаПредоставлением);
	КонецЕсли; 
	
	Если Оплата.СуммаСдачи > 0 Тогда
		ВывестиПолеПоШирине(Контекст, НСтр("ru='ПОЛУЧЕНО'"),    Оплата.СуммаОплаты);
		ВывестиПолеПоШирине(Контекст, " " + НСтр("ru='СДАЧА'"), Оплата.СуммаСдачи);
	КонецЕсли; 
	
	Если ОбщиеПараметры.Свойство("СистемаНалогообложения") Тогда
		СистемаНалогообложенияКод = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.КодСистемыНалогообложенияККТ(ОбщиеПараметры.СистемаНалогообложения);
		СистемаНалогообложения    = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.НаименованиеСистемыНалогообложения(СистемаНалогообложенияКод, Истина);
		ВывестиПолеПоШирине(Контекст, НСтр("ru='СНО:'"), СистемаНалогообложения);
	КонецЕсли;          
	
	// АПК: 1299-выкл особенность форматирования в чеках
	ВывестиТаблицуОплатСуммаНДС(Контекст, НСтр("ru=' СУММА НДС 20%'"),     Итоги.СуммаПозицийНДС20,  Итоги.СуммаНДС20, 120*20); 
	ВывестиТаблицуОплатСуммаНДС(Контекст, НСтр("ru=' СУММА НДС 22%'"),     Итоги.СуммаПозицийНДС22,  Итоги.СуммаНДС22, 122*22);

	ВывестиТаблицуОплатСуммаНДС(Контекст, НСтр("ru=' СУММА НДС 18%'"),     Итоги.СуммаПозицийНДС18,  Итоги.СуммаНДС18, 118*18);
	ВывестиТаблицуОплатСуммаНДС(Контекст, НСтр("ru=' СУММА НДС 10%'"),     Итоги.СуммаПозицийНДС10,  Итоги.СуммаНДС10, 110*10);
	ВывестиТаблицуОплатСуммаНДС(Контекст, НСтр("ru=' СУММА НДС 20/120'"), Итоги.СуммаПозицийНДС120, Итоги.СуммаНДС120, 120*20);
	ВывестиТаблицуОплатСуммаНДС(Контекст, НСтр("ru=' СУММА НДС 22/122'"), Итоги.СуммаПозицийНДС122, Итоги.СуммаНДС122, 122*22);
	ВывестиТаблицуОплатСуммаНДС(Контекст, НСтр("ru=' СУММА НДС 18/118'"), Итоги.СуммаПозицийНДС118, Итоги.СуммаНДС118, 118*18);
	ВывестиТаблицуОплатСуммаНДС(Контекст, НСтр("ru=' СУММА НДС 10/110'"), Итоги.СуммаПозицийНДС110, Итоги.СуммаНДС110, 110*10);
	ВывестиТаблицуОплатСуммаНДС(Контекст, НСтр("ru=' СУММА НДС 0%'"),      Итоги.СуммаПозицийНДС0);
	ВывестиТаблицуОплатСуммаНДС(Контекст, НСтр("ru=' СУММА БЕЗ НДС'"),     Итоги.СуммаПозицийБезНДС);
	// АПК: 1299-вкл
	
	ВывестиСтрокуСлева(Контекст,НСтр("ru='КАССИР'") + ":" + Символы.НПП + ОбщиеПараметры.Кассир);
		
КонецПроцедуры

// Выводит подвал фискального документа с фискальными данными и QR кодом
// Параметры:
//   Контекст - Структура - контекст который вернула функция ПараметрыВыводЧека()
//   ОбщиеПараметры - Структура - параметры фискального документа загруженная из данных XML
//                    см. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека
//   Реквизиты - Структура - параметры фискального документа из регистра сведений фискальные документы
//                    см. ДанныеФискальнойОперации()
Процедура ВывестиРеквизитыЧека(Контекст, ОбщиеПараметры, Реквизиты)
	
	ВывестиСтрокуПоШирине(Контекст, НСтр("ru = 'РН ККТ:'"), Реквизиты.РегистрационныйНомерККТ);
	ВывестиСтрокуПоШирине(Контекст, НСтр("ru = 'ФН №:'"), Реквизиты.ЗаводскойНомерФН);
	ВывестиСтрокуПоШирине(Контекст, НСтр("ru = 'ФД №:'"), Реквизиты.НомерЧекаККМ);
	ВывестиСтрокуПоШирине(Контекст, НСтр("ru = 'ФП:'"), Реквизиты.ФискальныйПризнак);

	ПараметрыQRКода = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыQRКодаЧекаККТ();
	ПараметрыQRКода.ДатаВремяРасчета  = Реквизиты.Дата;
	ПараметрыQRКода.СуммаРасчета      = Реквизиты.Сумма;
	ПараметрыQRКода.ФискальныйПризнак = Реквизиты.ФискальныйПризнак;
	ПараметрыQRКода.ПризнакРасчета    = Реквизиты.ТипРасчета;
	ПараметрыQRКода.НомерФискальногоНакопителя = Реквизиты.ЗаводскойНомерФН;
	ПараметрыQRКода.НомерФискальногоДокумента  = Реквизиты.НомерЧекаККМ;
	QRКодЧекаККТ = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.СформироватьQRКодЧекаККТ(ПараметрыQRКода);
	
	ВывестиШтрихкод(Контекст, "QR", QRКодЧекаККТ);
	ВывестиРазделитель(Контекст, "НетЛинии");
	
	
КонецПроцедуры

#КонецОбласти
