
&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
Процедура асп_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
#Вставка

	//ASP_Dante 02/09/19 //ASP_Crow 18.03.2026 000029567 В расширение
	Если ТекущийОбъект.Наименование = "Автоматическое закрытие заказов клиентов" И БизнесПроцессыИЗадачиСервер.НеУстановленыПричиныЗакрытия(ТекущийОбъект.БизнесПроцесс) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не у всех заказов установлены причины отмены!");
		Отказ = Истина;
	КонецЕсли;
	//ASP_Dante 02/09/19

#КонецВставки
	ВыполнитьЗадачу = Ложь;
	Если Не (ПараметрыЗаписи.Свойство("ВыполнитьЗадачу", ВыполнитьЗадачу) И ВыполнитьЗадачу) Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗаданиеВыполнено И Не ЗаданиеПодтверждено И Не ЗначениеЗаполнено(ТекущийОбъект.РезультатВыполнения) Тогда
		ОбщегоНазначения.СообщитьПользователю(
		НСтр("ru = 'Укажите причину, по которой задача возвращается на доработку.'"),, 
		"Объект.РезультатВыполнения",, Отказ);
		Возврат;
	ИначеЕсли Не ЗаданиеВыполнено И ЗаданиеПодтверждено И Не ЗначениеЗаполнено(ТекущийОбъект.РезультатВыполнения) Тогда
		ОбщегоНазначения.СообщитьПользователю(
		НСтр("ru = 'Укажите причину, по которой задача отменяется.'"),, 
		"Объект.РезультатВыполнения",, Отказ);
		Возврат;
	КонецЕсли;

	// Предварительная запись бизнес-процесса для корректной работы обработчика точки маршрута.
	ЗаписатьРеквизитыБизнесПроцесса(ТекущийОбъект);

КонецПроцедуры
