
&ИзменениеИКонтроль("СоздатьСоставнойПрослеживаемыйНомерГТД")
Функция асп_СоздатьСоставнойПрослеживаемыйНомерГТД(КомплектующиеДляСозданияСоставногоНомераГТД, ЭтоОсновнойКомплект, НоменклатураШапки, ХарактеристикаШапки, СерияШапки, СуммаПоРНПТ, ВсегдаИспользоватьСуммаПоРНПТДляСтоимостиКомплекта)

	РеквизитыГТД = "Код, СтранаПроисхождения";

	Отбор = Новый Структура("ЭтоОсновнойКомплект", ЭтоОсновнойКомплект);
	НайденныеСтроки = КомплектующиеДляСозданияСоставногоНомераГТД.НайтиСтроки(Отбор);

	СоставнойНомерГТДОбъект = Справочники.НомераГТД.СоздатьЭлемент();
	Инициализирован = Ложь;

	СуммаПоТЧ = 0;
	Для Каждого Строка Из НайденныеСтроки Цикл
		Если Не Инициализирован Тогда
			ЗначенияРеквизитовГТД = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Строка.НомерРНПТ, РеквизитыГТД);

			СоставнойНомерГТДОбъект.Код = ЗначенияРеквизитовГТД.Код;
			СоставнойНомерГТДОбъект.СтранаПроисхождения = ЗначенияРеквизитовГТД.СтранаПроисхождения;
			СоставнойНомерГТДОбъект.ТипНомераГТД = Перечисления.ТипыНомеровГТД.НомерРНПТКомплекта;
			СоставнойНомерГТДОбъект.Номенклатура = НоменклатураШапки;
			#Вставка
			СоставнойНомерГТДОбъект.Владелец = НоменклатураШапки;
			#КонецВставки
			Если НоменклатураШапки <> Неопределено Тогда
				СоставнойНомерГТДОбъект.НаименованиеТовара = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатураШапки, "НаименованиеПолное");
				СоставнойНомерГТДОбъект.СуммаПоРНПТ = СуммаПоРНПТ;
				Если СоставнойНомерГТДОбъект.СуммаПоРНПТ = 0 Тогда
					СоставнойНомерГТДОбъект.СуммаПоРНПТ = СуммаПоВыбранномуПрослеживаемомуТовару(НоменклатураШапки, ХарактеристикаШапки, СерияШапки);
				КонецЕсли;
			КонецЕсли;

			Если ВсегдаИспользоватьСуммаПоРНПТДляСтоимостиКомплекта Тогда
				СоставнойНомерГТДОбъект.СуммаПоРНПТ = СуммаПоРНПТ;
			КонецЕсли;

			Инициализирован = Истина;
		КонецЕсли;
		НоваяСтрока = СоставнойНомерГТДОбъект.ПрослеживаемыеКомплектующие.Добавить();
		НоваяСтрока.НомерРНПТ = Строка.НомерРНПТ;
		НоваяСтрока.КоличествоПоРНПТ = Строка.КоличествоПоРНПТ;
		НоваяСтрока.ЕдиницаИзмеренияТНВЭД = Строка.ЕдиницаИзмеренияТНВЭД;

		НоваяСтрока.СуммаПоРНПТ = СуммаПоВыбранномуПрослеживаемомуТовару(Строка.Номенклатура, Строка.Характеристика, Строка.Серия, Строка.НомерРНПТ, Строка.КоличествоПоРНПТ);
		Если ВсегдаИспользоватьСуммаПоРНПТДляСтоимостиКомплекта Или НоваяСтрока.СуммаПоРНПТ = 0 Тогда
			НоваяСтрока.СуммаПоРНПТ = Строка.СуммаПоРНПТ;
		КонецЕсли;

		СуммаПоТЧ = СуммаПоТЧ + НоваяСтрока.СуммаПоРНПТ;

	КонецЦикла;
	СоставнойНомерГТДОбъект.ПрослеживаемыеКомплектующие.Свернуть("НомерРНПТ,ЕдиницаИзмеренияТНВЭД", "КоличествоПоРНПТ,СуммаПоРНПТ");

	СоставнойНомерГТДОбъект.КоличествоКомплектующих = СоставнойНомерГТДОбъект.ПрослеживаемыеКомплектующие.Количество();
	Если СоставнойНомерГТДОбъект.СуммаПоРНПТ < СуммаПоТЧ Тогда
		СоставнойНомерГТДОбъект.СуммаПоРНПТ = СуммаПоТЧ;
	КонецЕсли;

	СоставнойНомерГТДОбъект.Записать();

	Возврат СоставнойНомерГТДОбъект.Ссылка;

КонецФункции
