#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьДанные(Организация, Контрагент, ИдентификаторРасхождения, СуммаДокумента, НДСДокумента) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.СервисСверкиРасчетовУстраненныеРасхождения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Организация              = Организация; 
	МенеджерЗаписи.Контрагент               = Контрагент;
	МенеджерЗаписи.ИдентификаторРасхождения = ИдентификаторРасхождения;
	МенеджерЗаписи.СуммаДокумента           = СуммаДокумента;
	МенеджерЗаписи.НДСДокумента             = НДСДокумента;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ОчиститьУстраненныеРасхождения() Экспорт
	
	НаборЗаписейРасхождения = РегистрыСведений.СервисСверкиРасчетовУстраненныеРасхождения.СоздатьНаборЗаписей();
	НаборЗаписейРасхождения.Записать();
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли