
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();
	
	Источник = ПараметрыВыполненияКоманды.Источник;
	Если ТипЗнч(Источник) <> Тип("ФормаКлиентскогоПриложения") Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("СозданиеШаблонаПродолжение", Источник, Источник.Модифицированность);
	
	Если Источник.Модифицированность Тогда
		ПоказатьВопрос(Оповещение,
			НСтр("ru = 'Для создания шаблона заказ на доставку будет сохранен. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти