
// Вызываются процедуры и функции общих модулей:
//	- РасчетСебестоимостиПрикладныеАлгоритмы.

#Область ПрограммныйИнтерфейс

#Область Инициализация

// Перед началом расшифровки заполняет все необходимые параметры и инициализирует все структуры данных, используемые алгоритмом расчета.
//
// Параметры:
//	Дата - Дата - период документа распределения
//	МассивОрганизаций - Массив - Организации
//	Регистратор - ДокументСсылка - документ распределения расходов
//
// Возвращаемое значение:
//	Структура - параметры, используемые при расчете.
//
Функция ИнициализироватьПараметрыРасшифровкиРаспределения(Дата, МассивОрганизаций, Регистратор) Экспорт
	
	ПараметрыРасчета = Неопределено;
	ПараметрыОтладки = Неопределено;
	
	ПараметрыЗапуска = Новый Структура(
		"Дата, МассивОрганизаций, РасшифровкаРаспределения",
		Дата, МассивОрганизаций, Истина);
	
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыОтладки(ПараметрыОтладки, ПараметрыЗапуска);
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьПараметрыРасчетаПартий(ПараметрыЗапуска, ПараметрыРасчета, ПараметрыОтладки);
	
	ПараметрыРасчета.Вставить("Регистратор", Регистратор);
	
	Возврат ПараметрыРасчета;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыЭтапов_1_2_3_4_5

// Вт Этапы, ПартииПроизводстваПоЭтапам, ПартииПроизводстваСводно, РаспределенныеОтчеты,
// втДолиПоПереработке, втПродукция, втДолиИтог, Продукция, ДолиВыпуска.
//
// Возвращаемое значение:
// 	Строка - текст запроса
Функция ТекстПартииПроизводства() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДокументыПартий.Организация               КАК Организация,
	|	ДокументыПартий.ПартияПроизводства        КАК ПартияПроизводства,
	|	МАКСИМУМ(ДокументыПартий.Этап)            КАК Этап,
	|	ДокументыПартий.ДокументПартии            КАК ДокументПартии,
	|	ДокументыПартий.НомерГруппыЗатрат         КАК НомерГруппыЗатрат,
	|	ДокументыПартий.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
	|	ДокументыПартий.Номенклатура              КАК Номенклатура,
	|	ДокументыПартий.Назначение                КАК Назначение,
	|	ДокументыПартий.ВидДеятельностиНДС        КАК ВидДеятельностиНДС,
	|	ДокументыПартий.НаправлениеДеятельности   КАК НаправлениеДеятельности,
	// Флаг показывает возможность распределить затраты, в том числе исправленные, на выпуск изделий.
	// Если в периоде отнесения затрат выпуск изделий не отражен и не планируется в будущем,
	// то такие затраты будут списаны на статью "Сторно производственных затрат".
	|	МАКСИМУМ(ДокументыПартий.РаспределениеЗатратНаВыпуск) КАК РаспределениеЗатратНаВыпуск
	|ПОМЕСТИТЬ ДокументыПартийПроизводстваБезЗаказа
	|ИЗ
	|	(
	// Партии производства, по которым оформлен выпуск в текущем периоде
	|	ВЫБРАТЬ
	|		ДокументыПартий.Организация                       КАК Организация,
	|		СпрПартииПроизводства.Ссылка                      КАК ПартияПроизводства,
	|		ДокументыПартий.Ссылка                            КАК Этап,
	|		СпрПартииПроизводства.Документ                    КАК ДокументПартии,
	|		СпрПартииПроизводства.Код                         КАК НомерГруппыЗатрат,
	|		ВЫБОР
	|			КОГДА НЕ СпрПартииПроизводства.ГруппаПродукции = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|				ТОГДА СпрПартииПроизводства.ГруппаПродукции
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ                                             КАК АналитикаФинансовогоУчета,
	|		СпрПартииПроизводства.ОсновноеИзделиеНоменклатура КАК Номенклатура,
	|		СпрПартииПроизводства.Назначение                  КАК Назначение,
	|		СпрПартииПроизводства.ВидДеятельностиНДС          КАК ВидДеятельностиНДС,
	|		СпрПартииПроизводства.НаправлениеДеятельности     КАК НаправлениеДеятельности,
	|		ИСТИНА                                            КАК РаспределениеЗатратНаВыпуск
	|	ИЗ
	|		(ВЫБРАТЬ
	|			РеквизитыДокумента.Ссылка            КАК Ссылка,
	|			РеквизитыДокумента.Организация       КАК Организация,
	|			ВЫБОР
	|				КОГДА РеквизитыДокумента.Исправление
	|					И РеквизитыДокумента.ИсправлениеСохраняетПартииПроизводства
	|					ТОГДА РеквизитыДокумента.ИсправляемыйДокумент
	|				ИНАЧЕ РеквизитыДокумента.Ссылка
	|			КОНЕЦ                                КАК ДокументПартииПроизводства,
	|			ТаблицаТоваров.НомерГруппыЗатрат     КАК НомерГруппыЗатрат
	|		ИЗ
	|			Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ТаблицаТоваров
	|		
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК РеквизитыДокумента
	|			ПО РеквизитыДокумента.Ссылка = ТаблицаТоваров.Ссылка
	|		
	// Исключаем документы по которым введена корректировка или сторнирование в текущем периоде
	|			ЛЕВОЕ СОЕДИНЕНИЕ ИсправленныеДокументы КАК ИсправленныеДокументы
	|			ПО ИсправленныеДокументы.СторнируемыйДокумент = РеквизитыДокумента.Ссылка
	|		
	|		ГДЕ
	|			РеквизитыДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|			И РеквизитыДокумента.Проведен
	|			И РеквизитыДокумента.Организация В (&МассивОрганизаций)
	// Исключаем документы по которым введена корректировка или сторнирование в текущем периоде
	|			И ИсправленныеДокументы.СторнируемыйДокумент ЕСТЬ NULL
	|		) КАК ДокументыПартий
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Документ = ДокументыПартий.ДокументПартииПроизводства
	|		И СпрПартииПроизводства.Код = ДокументыПартий.НомерГруппыЗатрат
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	// Добавляем партии производства, по которым было исправление приходов в котел.
	|	ВЫБРАТЬ
	|		ДокументыПартий.Организация                       КАК Организация,
	|		СпрПартииПроизводства.Ссылка                      КАК ПартияПроизводства,
	|		НЕОПРЕДЕЛЕНО                                      КАК Этап,
	|		СпрПартииПроизводства.Документ                    КАК ДокументПартии,
	|		СпрПартииПроизводства.Код                         КАК НомерГруппыЗатрат,
	|		ВЫБОР
	|			КОГДА НЕ СпрПартииПроизводства.ГруппаПродукции = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|				ТОГДА СпрПартииПроизводства.ГруппаПродукции
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ                                             КАК АналитикаФинансовогоУчета,
	|		СпрПартииПроизводства.ОсновноеИзделиеНоменклатура КАК Номенклатура,
	|		СпрПартииПроизводства.Назначение                  КАК Назначение,
	|		СпрПартииПроизводства.ВидДеятельностиНДС          КАК ВидДеятельностиНДС,
	|		СпрПартииПроизводства.НаправлениеДеятельности     КАК НаправлениеДеятельности,
	|		ЛОЖЬ                                              КАК РаспределениеЗатратНаВыпуск
	|	ИЗ
	|		(
	// Сторнированные пономенклатурных затрат. Движения исправляющего документа.
	|		ВЫБРАТЬ
	|			СторноДвижения.Организация КАК Организация,
	|			СторноДвижения.Партия      КАК ПартияПроизводства
	|		ИЗ
	|			ИсправленныеДокументы КАК ИсправленныеДокументы
	|			
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СторноДвижения
	|			ПО СторноДвижения.Регистратор = ИсправленныеДокументы.Регистратор
	|			И ТИПЗНАЧЕНИЯ(СторноДвижения.Партия) = ТИП(Справочник.ПартииПроизводства)
	|			И СторноДвижения.Сторно
	|		ГДЕ
	|			НЕ СторноДвижения.Количество = 0
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	// Сторнированные пономенклатурных затрат. Движения исправляемого документа.
	|		ВЫБРАТЬ
	|			СторноДвижения.Организация КАК Организация,
	|			СторноДвижения.Партия      КАК ПартияПроизводства
	|		ИЗ
	|			ИсправленныеДокументы КАК ИсправленныеДокументы
	|			
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК СторноДвижения
	|			ПО СторноДвижения.Регистратор = ИсправленныеДокументы.СторнируемыйДокумент
	|			И ТИПЗНАЧЕНИЯ(СторноДвижения.Партия) = ТИП(Справочник.ПартииПроизводства)
	|		ГДЕ
	|			НЕ СторноДвижения.Количество = 0
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	// Сторнированные постатейных затрат. Движения исправляющего документа.
	|		ВЫБРАТЬ
	|			СторноДвижения.Организация        КАК Организация,
	|			СторноДвижения.ПартияПроизводства КАК ПартияПроизводства
	|		ИЗ
	|			ИсправленныеДокументы КАК ИсправленныеДокументы
	|			
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК СторноДвижения
	|			ПО СторноДвижения.Регистратор = ИсправленныеДокументы.Регистратор
	|			И ТИПЗНАЧЕНИЯ(СторноДвижения.ПартияПроизводства) = ТИП(Справочник.ПартииПроизводства)
	|			И СторноДвижения.Сторно
	|		ГДЕ
	|			НЕ СторноДвижения.Стоимость = 0
	|			ИЛИ НЕ СторноДвижения.СтоимостьБезНДС = 0
	|			ИЛИ НЕ СторноДвижения.СтоимостьРегл = 0
	|			ИЛИ НЕ СторноДвижения.ПостояннаяРазница = 0
	|			ИЛИ НЕ СторноДвижения.ВременнаяРазница = 0
	|			ИЛИ НЕ СторноДвижения.СтоимостьУпр = 0
	|			ИЛИ НЕ СторноДвижения.СтоимостьНДД = 0
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	// Сторнированные постатейных затрат. Движения исправляемого документа.
	|		ВЫБРАТЬ
	|			СторноДвижения.Организация        КАК Организация,
	|			СторноДвижения.ПартияПроизводства КАК ПартияПроизводства
	|		ИЗ
	|			ИсправленныеДокументы КАК ИсправленныеДокументы
	|			
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК СторноДвижения
	|			ПО СторноДвижения.Регистратор = ИсправленныеДокументы.СторнируемыйДокумент
	|			И ТИПЗНАЧЕНИЯ(СторноДвижения.ПартияПроизводства) = ТИП(Справочник.ПартииПроизводства)
	|		ГДЕ
	|			НЕ СторноДвижения.Стоимость = 0
	|			ИЛИ НЕ СторноДвижения.СтоимостьБезНДС = 0
	|			ИЛИ НЕ СторноДвижения.СтоимостьРегл = 0
	|			ИЛИ НЕ СторноДвижения.ПостояннаяРазница = 0
	|			ИЛИ НЕ СторноДвижения.ВременнаяРазница = 0
	|			ИЛИ НЕ СторноДвижения.СтоимостьУпр = 0
	|			ИЛИ НЕ СторноДвижения.СтоимостьНДД = 0
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	// Сторнированные трудозатрат. Движения исправляющего документа.
	|		ВЫБРАТЬ
	|			СторноДвижения.Организация        КАК Организация,
	|			СторноДвижения.ПартияПроизводства КАК ПартияПроизводства
	|		ИЗ
	|			ИсправленныеДокументы КАК ИсправленныеДокументы
	|			
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК СторноДвижения
	|			ПО СторноДвижения.Регистратор = ИсправленныеДокументы.Регистратор
	|			И ТИПЗНАЧЕНИЯ(СторноДвижения.ПартияПроизводства) = ТИП(Справочник.ПартииПроизводства)
	|			И СторноДвижения.Сторно
	|		ГДЕ
	|			НЕ СторноДвижения.Количество = 0
	|				ИЛИ НЕ СторноДвижения.НормативнаяСтоимость = 0
	|				ИЛИ НЕ СторноДвижения.Стоимость = 0
	|				ИЛИ НЕ СторноДвижения.СтоимостьРегл = 0
	|				ИЛИ НЕ СторноДвижения.ПостояннаяРазница = 0
	|				ИЛИ НЕ СторноДвижения.ВременнаяРазница = 0
	|				ИЛИ НЕ СторноДвижения.СтоимостьНДД = 0
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	// Сторнированные трудозатрат. Движения исправляемого документа.
	|		ВЫБРАТЬ
	|			СторноДвижения.Организация        КАК Организация,
	|			СторноДвижения.ПартияПроизводства КАК ПартияПроизводства
	|		ИЗ
	|			ИсправленныеДокументы КАК ИсправленныеДокументы
	|			
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК СторноДвижения
	|			ПО СторноДвижения.Регистратор = ИсправленныеДокументы.СторнируемыйДокумент
	|			И ТИПЗНАЧЕНИЯ(СторноДвижения.ПартияПроизводства) = ТИП(Справочник.ПартииПроизводства)
	|		ГДЕ
	|			НЕ СторноДвижения.Количество = 0
	|				ИЛИ НЕ СторноДвижения.НормативнаяСтоимость = 0
	|				ИЛИ НЕ СторноДвижения.Стоимость = 0
	|				ИЛИ НЕ СторноДвижения.СтоимостьРегл = 0
	|				ИЛИ НЕ СторноДвижения.ПостояннаяРазница = 0
	|				ИЛИ НЕ СторноДвижения.ВременнаяРазница = 0
	|				ИЛИ НЕ СторноДвижения.СтоимостьНДД = 0
	|		) КАК ДокументыПартий
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДокументыПартий.ПартияПроизводства
	|		И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ПроизводствоБезЗаказа)
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|	) КАК ДокументыПартий
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументыПартий.Организация,
	|	ДокументыПартий.ПартияПроизводства,
	|	ДокументыПартий.ДокументПартии,
	|	ДокументыПартий.НомерГруппыЗатрат,
	|	ДокументыПартий.АналитикаФинансовогоУчета,
	|	ДокументыПартий.Номенклатура,
	|	ДокументыПартий.Назначение,
	|	ДокументыПартий.ВидДеятельностиНДС,
	|	ДокументыПартий.НаправлениеДеятельности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// В таблице содержаться все партии производства, в том числе исправленные партии производства без заказа.
	// Для исправленных партий производства без заказа, для которых отсутствует и не планируется выпуск,
	// в поле Этап хранится Неопределено.
	|ВЫБРАТЬ
	|	ДД.ПартияПроизводства			КАК ПартияПроизводства,
	|	ДД.ДокументПартии				КАК ДокументПартии,
	|	ДД.НомерГруппыЗатрат			КАК НомерГруппыЗатрат,
	|	ДД.АналитикаФинансовогоУчета	КАК АналитикаФинансовогоУчета,
	|	ДД.Этап							КАК Этап,
	|	ДД.Организация					КАК Организация,
	|	ДД.Номенклатура					КАК Номенклатура,
	|	ДД.Назначение					КАК Назначение,
	|	ДД.ВидДеятельностиНДС			КАК ВидДеятельностиНДС,
	|	ДД.НаправлениеДеятельности		КАК НаправлениеДеятельности,
	|	ДД.РаспределениеЗатратНаВыпуск	КАК РаспределениеЗатратНаВыпуск
	|ПОМЕСТИТЬ ПартииПроизводстваПоЭтапам
	|ИЗ
	|	(
	// Производство без заказа 2.2.
	|	ВЫБРАТЬ
	|		ДокументыПартийПроизводстваБезЗаказа.ПартияПроизводства          КАК ПартияПроизводства,
	|		ДокументыПартийПроизводстваБезЗаказа.ДокументПартии              КАК ДокументПартии,
	|		ДокументыПартийПроизводстваБезЗаказа.НомерГруппыЗатрат           КАК НомерГруппыЗатрат,
	|		ДокументыПартийПроизводстваБезЗаказа.АналитикаФинансовогоУчета   КАК АналитикаФинансовогоУчета,
	|		ДокументыПартийПроизводстваБезЗаказа.Этап                        КАК Этап,
	|		ДокументыПартийПроизводстваБезЗаказа.Организация                 КАК Организация,
	|		ДокументыПартийПроизводстваБезЗаказа.Номенклатура                КАК Номенклатура,
	|		ДокументыПартийПроизводстваБезЗаказа.Назначение                  КАК Назначение,
	|		ДокументыПартийПроизводстваБезЗаказа.ВидДеятельностиНДС          КАК ВидДеятельностиНДС,
	|		ДокументыПартийПроизводстваБезЗаказа.НаправлениеДеятельности     КАК НаправлениеДеятельности,
	|		ДокументыПартийПроизводстваБезЗаказа.РаспределениеЗатратНаВыпуск КАК РаспределениеЗатратНаВыпуск
	|	ИЗ
	|		ДокументыПартийПроизводстваБезЗаказа КАК ДокументыПартийПроизводстваБезЗаказа
	
	//++ Устарело_Переработка24
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	// отчеты переработчиков без этапов
	|	ВЫБРАТЬ
	|		СпрПартииПроизводства.Ссылка				КАК ПартияПроизводства,
	|		СпрПартииПроизводства.Документ				КАК ДокументПартии,
	|		СпрПартииПроизводства.Код					КАК НомерГруппыЗатрат,
	|		ВЫБОР
	|			КОГДА НЕ СпрПартииПроизводства.ГруппаПродукции = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|				ТОГДА СпрПартииПроизводства.ГруппаПродукции
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ										КАК АналитикаФинансовогоУчета,
	|		РеквизитыОтчета.Ссылка						КАК Этап,
	|		РеквизитыОтчета.Организация					КАК Организация,
	|		СпрПартииПроизводства.ОсновноеИзделиеНоменклатура КАК Номенклатура,
	|		СпрПартииПроизводства.Назначение			КАК Назначение,
	|		СпрПартииПроизводства.ВидДеятельностиНДС	КАК ВидДеятельностиНДС,
	|		ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|		ИСТИНА                                      КАК РаспределениеЗатратНаВыпуск
	|	ИЗ
	|		Документ.ОтчетПереработчика.Продукция КАК ТаблицаТоваров
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика КАК РеквизитыОтчета
	|			ПО РеквизитыОтчета.Ссылка = ТаблицаТоваров.Ссылка
	|
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|			ПО СпрПартииПроизводства.Документ = ТаблицаТоваров.Ссылка
	|				И СпрПартииПроизводства.Код = ТаблицаТоваров.НомерГруппыЗатрат
	|				И НЕ СпрПартииПроизводства.ПометкаУдаления
	|
	|	ГДЕ
	|		РеквизитыОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РеквизитыОтчета.Организация В(&МассивОрганизаций)
	|		И РеквизитыОтчета.Проведен
	|		И НЕ РеквизитыОтчета.ГруппировкаЗатрат = ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства)) КАК ДД
	//-- Устарело_Переработка24
	|	
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|	
	//// отчеты переработчиков 2.5 без этапов
	//|	ВЫБРАТЬ
	//|		СпрПартииПроизводства.Ссылка				КАК ПартияПроизводства,
	//|		СпрПартииПроизводства.Документ				КАК ДокументПартии,
	//|		СпрПартииПроизводства.Код					КАК НомерГруппыЗатрат,
	//|		ВЫБОР
	//|			КОГДА НЕ СпрПартииПроизводства.ГруппаПродукции = ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	//|				ТОГДА СпрПартииПроизводства.ГруппаПродукции
	//|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	//|		КОНЕЦ										КАК АналитикаФинансовогоУчета,
	//|		РеквизитыОтчета.Ссылка						КАК Этап,
	//|		РеквизитыОтчета.Организация					КАК Организация,
	//|		СпрПартииПроизводства.ОсновноеИзделиеНоменклатура КАК Номенклатура,
	//|		СпрПартииПроизводства.Назначение			КАК Назначение,
	//|		СпрПартииПроизводства.ВидДеятельностиНДС	КАК ВидДеятельностиНДС,
	//|		ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	//|			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	//|		ИСТИНА                                      КАК РаспределениеЗатратНаВыпуск
	//|	ИЗ
	//|		Документ.ОтчетПереработчика2_5.ВыходныеИзделия КАК ТаблицаТоваров
	//|
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика2_5 КАК РеквизитыОтчета
	//|			ПО РеквизитыОтчета.Ссылка = ТаблицаТоваров.Ссылка
	//|
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	//|			ПО СпрПартииПроизводства.Документ = ТаблицаТоваров.Ссылка
	//|				И СпрПартииПроизводства.Код = ТаблицаТоваров.НомерГруппыЗатрат
	//|				И НЕ СпрПартииПроизводства.ПометкаУдаления
	//|
	//// Исключаем документы по которым введена корректировка или сторнирование в текущем периоде
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ИсправленныеДокументы КАК ИсправленныеДокументы
	//|			ПО ИсправленныеДокументы.СторнируемыйДокумент = ТаблицаТоваров.Ссылка
	//|
	//|	ГДЕ
	//|		РеквизитыОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	//|		И РеквизитыОтчета.Организация В(&МассивОрганизаций)
	//|		И РеквизитыОтчета.Проведен
	//|		И НЕ РеквизитыОтчета.ГруппировкаЗатрат = ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства)
	//// Исключаем документы по которым введена корректировка или сторнирование в текущем периоде
	//|		И ИсправленныеДокументы.СторнируемыйДокумент ЕСТЬ NULL
	//|	) КАК ДД
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ДД.ПартияПроизводства,
	//|	ДД.ДокументПартии,
	//|	ДД.НомерГруппыЗатрат,
	//|	ДД.АналитикаФинансовогоУчета,
	//|	ДД.Этап,
	//|	ДД.Организация,
	//|	ДД.Номенклатура,
	//|	ДД.Назначение,
	//|	ДД.ВидДеятельностиНДС,
	//|	ДД.НаправлениеДеятельности,
	//|	ДД.РаспределениеЗатратНаВыпуск
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Этап
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДД.ПартияПроизводства                    КАК ПартияПроизводства,
	|	ДД.ДокументПартии                        КАК ДокументПартии,
	|	ДД.НомерГруппыЗатрат                     КАК НомерГруппыЗатрат,
	|	ДД.НаправлениеДеятельности               КАК НаправлениеДеятельности,
	|	ДД.АналитикаФинансовогоУчета             КАК АналитикаФинансовогоУчета,
	|	ДД.Организация                           КАК Организация,
	|	ДД.Номенклатура                          КАК Номенклатура,
	|	ДД.Назначение                            КАК Назначение,
	|	ДД.ВидДеятельностиНДС                    КАК ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА ЛОЖЬ
	|	КОНЕЦ                                    КАК ДлительноеПроизводство,
	|	МАКСИМУМ(ДД.РаспределениеЗатратНаВыпуск) КАК РаспределениеЗатратНаВыпуск
	|ПОМЕСТИТЬ ПартииПроизводстваСводно
	|ИЗ
	|	ПартииПроизводстваПоЭтапам КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.ПартияПроизводства,
	|	ДД.ДокументПартии,
	|	ДД.НомерГруппыЗатрат,
	|	ДД.НаправлениеДеятельности,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.Организация,
	|	ДД.Номенклатура,
	|	ДД.Назначение,
	|	ДД.ВидДеятельностиНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПартияПроизводства,
	|	Организация
	//++ Устарело_Переработка24
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Обслуживание переработки на стороне.
	// Отчеты переработчиков, материалы которых не подлежат распределению.
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеквизитыОтчета.Ссылка			КАК ОтчетПереработчика,
	|	СпрПартииПроизводства.Ссылка	КАК ПартияПроизводства
	|ПОМЕСТИТЬ РаспределенныеОтчеты
	|ИЗ
	|	Документ.ОтчетПереработчика.Продукция КАК ТаблицаТоваров
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика КАК РеквизитыОтчета
	|		ПО РеквизитыОтчета.Ссылка = ТаблицаТоваров.Ссылка
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Документ = ТаблицаТоваров.Ссылка
	|			И СпрПартииПроизводства.Код = ТаблицаТоваров.НомерГруппыЗатрат
	|			И НЕ СпрПартииПроизводства.ПометкаУдаления
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУчетныеПолитикиФинУчета КАК ВТУчетныеПолитикиФинУчета
	|		ПО РеквизитыОтчета.Организация = ВТУчетныеПолитикиФинУчета.Организация
	|
	|ГДЕ
	|	РеквизитыОтчета.Проведен
	|	И РеквизитыОтчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеквизитыОтчета.Организация В(&МассивОрганизаций)
	|	И НЕ РеквизитыОтчета.ГруппировкаЗатрат = ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства)
	|	И НЕ ВТУчетныеПолитикиФинУчета.УчетГотовойПродукцииПоПлановойСтоимости
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОтчетПереработчика,
	|	ПартияПроизводства
	//-- Устарело_Переработка24
	|;";
	
	Возврат ТекстЗапроса
	
КонецФункции


Функция ТекстОстаткиПартийМатериаловВНЗП() Экспорт
	Возврат "
	// Начальные остатки
	|ВЫБРАТЬ
	|	""1"" КАК ЗапросИсточник,
	|	ДД.Организация					КАК Организация,
	|	ДД.АналитикаУчетаНоменклатуры	КАК АналитикаУчетаНоменклатуры,
	|	ДД.Партия						КАК ПартияПроизводства,
	|	ДД.ВидЗапасов					КАК ВидЗапасов,
	|	ДД.РазделУчета					КАК РазделУчета,
	|	ДД.АналитикаУчетаПартий			КАК АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета	КАК АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС			КАК ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА ДД.АналитикаУчетаНоменклатуры.СтатьяКалькуляции.ТипЗатрат = ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ							КАК ПобочноеИзделие,
	|	ДД.КоличествоОстаток			КАК Количество,
	|	ДД.СтоимостьОстаток КАК Стоимость,
	|	ДД.СтоимостьБезНДСОстаток КАК СтоимостьБезНДС,
	|	ДД.СтоимостьЗабалансоваяОстаток КАК СтоимостьЗабалансовая,
	|	ДД.СтоимостьРеглОстаток КАК СтоимостьРегл,
	|	ДД.СтоимостьЗабалансоваяРеглОстаток КАК СтоимостьЗабалансоваяРегл,
	|	ДД.СтоимостьУпрОстаток КАК СтоимостьУпр
	|
	|ПОМЕСТИТЬ ОстаткиМатериаловДетально
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			&ГраницаКонецПредыдущегоПериода,
	|			(Организация, Партия) В(
	|				ВЫБРАТЬ
	|					Т.Организация,
	|					Т.ПартияПроизводства
	|				ИЗ
	|					ПартииПроизводстваСводно КАК Т)) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// В расчет так же берем сторно и исправления текущего периода.
	|ВЫБРАТЬ
	|	""2"" КАК ЗапросИсточник,
	|	ДД.Организация					КАК Организация,
	|	ДД.АналитикаУчетаНоменклатуры	КАК АналитикаУчетаНоменклатуры,
	|	ДД.Партия						КАК ПартияПроизводства,
	|	ДД.ВидЗапасов					КАК ВидЗапасов,
	|	ДД.РазделУчета					КАК РазделУчета,
	|	ДД.АналитикаУчетаПартий			КАК АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета	КАК АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС			КАК ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА ДД.АналитикаУчетаНоменклатуры.СтатьяКалькуляции.ТипЗатрат = ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ							КАК ПобочноеИзделие,
	|	ДД.Количество					КАК Количество,
	|	ДД.Стоимость КАК Стоимость,
	|	ДД.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ДД.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	ДД.СтоимостьРегл КАК СтоимостьРегл,
	|	ДД.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|	ДД.СтоимостьУпр КАК СтоимостьУпр
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИсправленныеДокументы КАК ИсправленныеДокументы
	|		ПО ИсправленныеДокументы.СторнируемыйДокумент = ДД.Регистратор
	|		
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПартииПроизводстваСводно КАК Партии
	|		ПО ДД.Партия = Партии.ПартияПроизводства
	|		И ДД.Организация = Партии.Организация
	|	
	|ГДЕ
	|	ДД.Период < &НачалоПериода
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДД.Активность
	|	И ДД.РасчетПартий
	|	И НЕ ДД.Сторно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	// Приходы текущего периода, в том числе Сторно
	|ВЫБРАТЬ
	|	""3"" КАК ЗапросИсточник,
	|	ДД.Организация					КАК Организация,
	|	ДД.АналитикаУчетаНоменклатуры	КАК АналитикаУчетаНоменклатуры,
	|	ДД.Партия						КАК ПартияПроизводства,
	|	ДД.ВидЗапасов					КАК ВидЗапасов,
	|	ДД.РазделУчета					КАК РазделУчета,
	|	ДД.АналитикаУчетаПартий			КАК АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета	КАК АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС			КАК ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА ДД.АналитикаУчетаНоменклатуры.СтатьяКалькуляции.ТипЗатрат = ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ							КАК ПобочноеИзделие,
	|	ДД.Количество					КАК Количество,
	|	ДД.Стоимость КАК Стоимость,
	|	ДД.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ДД.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	ДД.СтоимостьРегл КАК СтоимостьРегл,
	|	ДД.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|	ДД.СтоимостьУпр КАК СтоимостьУпр
	|ИЗ
	|	ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|		
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПартииПроизводстваСводно КАК Партии
	|		ПО ДД.Партия = Партии.ПартияПроизводства
	|		И ДД.Организация = Партии.Организация
	|
	//++ Устарело_Переработка24
	|	ЛЕВОЕ СОЕДИНЕНИЕ РаспределенныеОтчеты КАК РаспределенныеОтчеты
	|		ПО ДД.Регистратор = РаспределенныеОтчеты.ОтчетПереработчика
	|		И ДД.Партия = РаспределенныеОтчеты.ПартияПроизводства
	//-- Устарело_Переработка24
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Организация В (&МассивОрганизаций)
	|	И ДД.СлужебноеВидДвиженияПриход
	|	И (НЕ ДД.РасчетПартий
	|		ИЛИ ДД.Сторно)
	//++ Устарело_Переработка24
	// Отчеты переработчиков 2.1 по выпускающим этапам сами списывают материалы на продукцию.
	|	И РаспределенныеОтчеты.ОтчетПереработчика ЕСТЬ NULL
	//-- Устарело_Переработка24
	
	|	И (
	// Исключаем сторно отчетов переработчика
	|		ТИПЗНАЧЕНИЯ(ДД.Регистратор) <> ТИП(Документ.Сторно)
	|		ИЛИ ТИПЗНАЧЕНИЯ(ДД.ДокументИсточник) = ТИП(Документ.КорректировкаПриобретения))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""4"" КАК ЗапросИсточник,
	|	ДД.Организация					КАК Организация,
	|	ДД.АналитикаУчетаНоменклатуры	КАК АналитикаУчетаНоменклатуры,
	|	ДД.Партия						КАК ПартияПроизводства,
	|	ДД.ВидЗапасов					КАК ВидЗапасов,
	|	ДД.РазделУчета					КАК РазделУчета,
	|	ДД.АналитикаУчетаПартий			КАК АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета	КАК АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС			КАК ВидДеятельностиНДС,
	|	ВЫБОР
	|		КОГДА ДД.АналитикаУчетаНоменклатуры.СтатьяКалькуляции.ТипЗатрат = ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ							КАК ПобочноеИзделие,
	|	ДД.Количество					КАК Количество,
	|	ДД.Стоимость КАК Стоимость,
	|	ДД.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ДД.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|	ДД.СтоимостьРегл КАК СтоимостьРегл,
	|	ДД.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|	ДД.СтоимостьУпр КАК СтоимостьУпр
	|ИЗ
	|	ВтПроизводственныеЗатратыСебестоимостьТоваров КАК ДД
	|		
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПартииПроизводстваСводно КАК ПартииПроизводстваСводно
	|		ПО ДД.Партия = ПартииПроизводстваСводно.ПартияПроизводства
	|		И ДД.Организация = ПартииПроизводстваСводно.Организация
	|
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Организация В (&МассивОрганизаций)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|;
	|ВЫБРАТЬ
	|	ДД.Организация						КАК Организация,
	|	ДД.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
	|	ДД.ПартияПроизводства				КАК ПартияПроизводства,
	|	ДД.ВидЗапасов						КАК ВидЗапасов,
	|	ДД.РазделУчета						КАК РазделУчета,
	|	ДД.АналитикаУчетаПартий				КАК АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета		КАК АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС				КАК ВидДеятельностиНДС,
	|	ДД.ПобочноеИзделие					КАК ПобочноеИзделие,
	|	ВЫБОР
	|		КОГДА СУММА(ДД.Количество) < 0
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ								КАК КоэффициентПриведения,
	|	СУММА(ДД.Количество)				КАК Количество,
	|	СУММА(ВЫБОР
	|		КОГДА ВТУчетныеПолитикиФинУчета.МетодОценкиСтоимостиТоваров = ЗНАЧЕНИЕ(Перечисление.МетодыОценкиСтоимостиТоваров.Среднескользящая)
	|		ТОГДА ДД.Стоимость
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Стоимость,
	|	СУММА(ВЫБОР
	|		КОГДА ВТУчетныеПолитикиФинУчета.МетодОценкиСтоимостиТоваров = ЗНАЧЕНИЕ(Перечисление.МетодыОценкиСтоимостиТоваров.Среднескользящая)
	|		ТОГДА ДД.СтоимостьБезНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СтоимостьБезНДС,
	|	СУММА(ВЫБОР
	|		КОГДА ВТУчетныеПолитикиФинУчета.МетодОценкиСтоимостиТоваров = ЗНАЧЕНИЕ(Перечисление.МетодыОценкиСтоимостиТоваров.Среднескользящая)
	|		ТОГДА ДД.СтоимостьЗабалансовая
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СтоимостьЗабалансовая,
	|	СУММА(ВЫБОР
	|		КОГДА ВТУчетныеПолитикиФинУчета.МетодОценкиСтоимостиТоваров = ЗНАЧЕНИЕ(Перечисление.МетодыОценкиСтоимостиТоваров.Среднескользящая)
	|		ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СтоимостьРегл,
	|	СУММА(ВЫБОР
	|		КОГДА ВТУчетныеПолитикиФинУчета.МетодОценкиСтоимостиТоваров = ЗНАЧЕНИЕ(Перечисление.МетодыОценкиСтоимостиТоваров.Среднескользящая)
	|		ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СтоимостьЗабалансоваяРегл,
	|	СУММА(ВЫБОР
	|		КОГДА ВТУчетныеПолитикиФинУчета.МетодОценкиСтоимостиТоваров = ЗНАЧЕНИЕ(Перечисление.МетодыОценкиСтоимостиТоваров.Среднескользящая)
	|		ТОГДА ДД.СтоимостьУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СтоимостьУпр
	|ПОМЕСТИТЬ ОстаткиМатериалов
	|ИЗ
	|	ОстаткиМатериаловДетально КАК ДД
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУчетныеПолитикиФинУчета КАК ВТУчетныеПолитикиФинУчета
	|	ПО ДД.Организация = ВТУчетныеПолитикиФинУчета.Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ПартияПроизводства,
	|	ДД.ВидЗапасов,
	|	ДД.РазделУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.ПобочноеИзделие
	|;
	|	
	|ВЫБРАТЬ
	|	Остатки.Организация					КАК Организация,
	|	Остатки.ПартияПроизводства			КАК ПартияПроизводства,
	|	Остатки.АналитикаУчетаНоменклатуры	КАК АналитикаУчетаНоменклатуры,
	|	ДД.Партия							КАК ПартияМатериала,
	|	ДД.АналитикаУчетаПартий				КАК АналитикаУчетаПартий,
	|	СУММА(ВЫРАЗИТЬ(ДД.Количество КАК ЧИСЛО(15,3))) КАК Количество
	|ПОМЕСТИТЬ ПартииМатериаловВНЗП
	|ИЗ
	|	ОстаткиМатериалов КАК Остатки
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКэшРасчетныеОборотыСебестоимостьТоваров КАК ДД
	|		ПО Остатки.ПартияПроизводства = ДД.КорПартия
	|			И Остатки.АналитикаУчетаНоменклатуры = ДД.КорАналитикаУчетаНоменклатуры
	|
	|ГДЕ
	|	ДД.Период <= &КонецПериода
	|	И НЕ ДД.СлужебноеВидДвиженияПриход
	|	И НЕ ДД.Партия = НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Организация,
	|	Остатки.ПартияПроизводства,
	|	ДД.Партия,
	|	ДД.АналитикаУчетаПартий,
	|	Остатки.АналитикаУчетаНоменклатуры
	|;";
	
КонецФункции

Функция ТекстПустаяТаблицаПартииМатериаловВНЗП() Экспорт
	
	Возврат "
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка) КАК ПартияПроизводства,
	|	НЕОПРЕДЕЛЕНО КАК ПартияМатериала,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаПартий,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15,3)) КАК Количество
	|ПОМЕСТИТЬ ПартииМатериаловВНЗП
	|;";
	
КонецФункции

Функция ТекстДолиСтоимостиПоПродукции() Экспорт
	

	// описание данных
	#Область ТекствтПродукция_ОписаниеДанных
	ТекствтПродукция_ОписаниеДанных = "
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|													КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|													КАК РазделУчета,
	|	ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|													КАК ПартияПроизводства,
	|	НЕОПРЕДЕЛЕНО									КАК ПартияВыпуска,
	|	ДАТАВРЕМЯ(1,1,1)								КАК ДатаПроизводства,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|													КАК АналитикаУчетаПартий,
	|	ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|													КАК АналитикаФинансовогоУчета,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|													КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|													КАК Подразделение,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|													КАК ВидДеятельностиНДС,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|													КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|													КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|													КАК Серия,
	|	ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка)
	|													КАК Спецификация,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(36))						КАК ИдентификаторСтроки,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(36))						КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)
	|													КАК ВидЗапасов,
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|													КАК АналитикаУчетаНоменклатуры,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|													КАК СтатьяРасходовСписания,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|													КАК СтатьяАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО									КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО									КАК АналитикаАктивовПассивов,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 3))					КАК Факт,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 3))					КАК План,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(15, 3))					КАК КоличествоПродукции,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(23, 10))					КАК ДоляСтоимостиФакт,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(23, 10))					КАК ДоляСтоимости,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(23, 10))					КАК ПолнаяДоляСтоимости
	|ПОМЕСТИТЬ втПродукция";
	#КонецОбласти
	
	// план и факт по производству без заказов - товары
	#Область ТекствтПродукция_ПБЗ_Товары_И_ПрослеживаемыеРаботы
	ТекствтПродукция_ПБЗ_Товары = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА СпрВидыЗапасов.ТипЗапасов ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		КОГДА СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|		КОГДА СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ИЛИ СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	КОНЕЦ											КАК РазделУчета,
	|	ПартииПроизводства.ПартияПроизводства			КАК ПартияПроизводства,
	|	РеквизитыДокумента.Ссылка						КАК ПартияВыпуска,
	|	РеквизитыДокумента.Дата							КАК ДатаПроизводства,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЕСТЬNULL(АналитикиУчетаПартийРабот.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(АналитикиУчетаПартийТоваров.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка))
	|	КОНЕЦ											КАК АналитикаУчетаПартий,
	|	ПартииПроизводства.АналитикаФинансовогоУчета	КАК АналитикаФинансовогоУчета,
	|	ПартииПроизводства.Организация					КАК Организация,
	|	РеквизитыДокумента.Подразделение				КАК Подразделение,
	|	РеквизитыДокумента.ВыпускПодДеятельность		КАК ВидДеятельностиНДС,
	|	АналитикаПоПолучателю.Номенклатура				КАК Номенклатура,
	|	АналитикаПоПолучателю.Характеристика			КАК Характеристика,
	|	АналитикаПоПолучателю.Серия						КАК Серия,
	|	ТаблицаТовары.Спецификация						КАК Спецификация,
	|	ТаблицаТовары.ИдентификаторСтроки				КАК ИдентификаторСтроки,
	|	ТаблицаТовары.ИдентификаторФинЗаписи			КАК ИдентификаторФинЗаписи,
	|	СпрВидыЗапасов.Ссылка							КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	|		 И НЕ СпрСклады.ЦеховаяКладовая
	|		 И НЕ АналитикаПоПодразделению.КлючАналитики ЕСТЬ NULL
	|			ТОГДА АналитикаПоПодразделению.КлючАналитики
	|		КОГДА НЕ &УчитыватьСебестоимостьТоваровПоНазначениям
	|		 И НЕ АналитикаПоПодразделению.КлючАналитики ЕСТЬ NULL
	|		 И НЕ СпрСклады.ЦеховаяКладовая
	|			ТОГДА АналитикаПоПодразделениюБезНазначения.КлючАналитики
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ АналитикаПоПолучателюБезНазначения.КлючАналитики
	|	КОНЕЦ											КАК АналитикаУчетаНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаТовары.Получатель) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА ТаблицаТовары.Получатель
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ											КАК СтатьяРасходовСписания,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаТовары.Получатель) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|			ТОГДА ТаблицаТовары.Получатель
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ											КАК СтатьяАктивовПассивов,
	|	ТаблицаТовары.АналитикаРасходов					КАК АналитикаРасходов,
	|	ТаблицаТовары.АналитикаАктивовПассивов			КАК АналитикаАктивовПассивов,
	|	СУММА(ТаблицаТовары.Количество)					КАК Факт,
	|	СУММА(ТаблицаТовары.Количество)					КАК План,
	|	СУММА(ТаблицаТовары.Количество)					КАК КоличествоПродукции,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаТовары.ДоляСтоимости = 0
	|				ТОГДА ТаблицаТовары.Количество
	|			ИНАЧЕ ТаблицаТовары.ДоляСтоимости
	|		КОНЕЦ)										КАК ДоляСтоимостиФакт,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТаблицаТовары.ДоляСтоимости = 0
	|				ТОГДА ТаблицаТовары.Количество - ЕСТЬNULL(ПартииМатериаловВНЗП.Количество, 0)
	|			ИНАЧЕ ТаблицаТовары.ДоляСтоимости
	|				- ЕСТЬNULL(ПартииМатериаловВНЗП.Количество, 0)
	|					* ТаблицаТовары.ДоляСтоимости
	|					/ ТаблицаТовары.Количество
	|		КОНЕЦ КАК ЧИСЛО(23, 10)))					КАК ДоляСтоимости,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаТовары.ДоляСтоимости = 0
	|				ТОГДА ТаблицаТовары.Количество
	|			ИНАЧЕ ТаблицаТовары.ДоляСтоимости
	|		КОНЕЦ)										КАК ПолнаяДоляСтоимости
	|ИЗ
	|	ПартииПроизводстваПоЭтапам КАК ПартииПроизводства
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУчетныеПолитикиФинУчета КАК ВТУчетныеПолитикиФинУчета
	|		ПО ПартииПроизводства.Организация = ВТУчетныеПолитикиФинУчета.Организация
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК РеквизитыДокумента
	|		ПО РеквизитыДокумента.Ссылка = ПартииПроизводства.Этап
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВидыЗапасовВыходныеИзделия КАК ТаблицаТовары
	|		ПО ТаблицаТовары.Ссылка = РеквизитыДокумента.Ссылка
	|		И ТаблицаТовары.НомерГруппыЗатрат = ПартииПроизводства.НомерГруппыЗатрат
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО ТаблицаТовары.ВидЗапасов = СпрВидыЗапасов.Ссылка
	|		И ПартииПроизводства.Организация = СпрВидыЗапасов.Организация
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПоПолучателю
	|		ПО АналитикаПоПолучателю.Ссылка = ТаблицаТовары.АналитикаУчетаНоменклатуры
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК СпрСклады
	|		ПО СпрСклады.Ссылка = АналитикаПоПолучателю.МестоХранения
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПоПолучателюБезНазначения
	|		ПО АналитикаПоПолучателюБезНазначения.Номенклатура = АналитикаПоПолучателю.Номенклатура
	|			И АналитикаПоПолучателюБезНазначения.Характеристика = АналитикаПоПолучателю.Характеристика
	|			И АналитикаПоПолучателюБезНазначения.Серия = АналитикаПоПолучателю.Серия
	|			И АналитикаПоПолучателюБезНазначения.МестоХранения = АналитикаПоПолучателю.МестоХранения
	|			И АналитикаПоПолучателюБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			И АналитикаПоПолучателюБезНазначения.СтатьяКалькуляции = АналитикаПоПолучателю.СтатьяКалькуляции
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПоПодразделению
	|		ПО АналитикаПоПолучателю.Номенклатура = АналитикаПоПодразделению.Номенклатура
	|			И АналитикаПоПолучателю.Характеристика = АналитикаПоПодразделению.Характеристика
	|			И АналитикаПоПолучателю.Серия = АналитикаПоПодразделению.Серия
	|			И РеквизитыДокумента.Подразделение = АналитикаПоПодразделению.МестоХранения
	|			И АналитикаПоПолучателю.Назначение = АналитикаПоПодразделению.Назначение
	|			И АналитикаПоПолучателю.СтатьяКалькуляции = АналитикаПоПодразделению.СтатьяКалькуляции
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПоПодразделениюБезНазначения
	|		ПО АналитикаПоПодразделению.Номенклатура = АналитикаПоПодразделениюБезНазначения.Номенклатура
	|			И АналитикаПоПодразделению.Характеристика = АналитикаПоПодразделениюБезНазначения.Характеристика
	|			И АналитикаПоПодразделению.Серия = АналитикаПоПодразделениюБезНазначения.Серия
	|			И АналитикаПоПодразделению.МестоХранения = АналитикаПоПодразделениюБезНазначения.МестоХранения
	|			И ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) = АналитикаПоПодразделениюБезНазначения.Назначение
	|			И АналитикаПоПодразделению.СтатьяКалькуляции = АналитикаПоПодразделениюБезНазначения.СтатьяКалькуляции
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартий КАК АналитикиУчетаПартийТоваров
	|		ПО АналитикиУчетаПартийТоваров.ГруппаФинансовогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
	|			И АналитикиУчетаПартийТоваров.Поставщик           = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			И АналитикиУчетаПартийТоваров.Контрагент          = НЕОПРЕДЕЛЕНО
	|			И АналитикиУчетаПартийТоваров.СтавкаНДС           = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|			И АналитикиУчетаПартийТоваров.НалогообложениеНДС  = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			И АналитикиУчетаПартийТоваров.ВидЦенности         = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)
	|			И АналитикиУчетаПартийТоваров.КодСтроки           = ТаблицаТовары.КодСтроки
	|			И РеквизитыДокумента.Организация В (&ОрганизацииСФИФОСкользящая)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартий КАК АналитикиУчетаПартийРабот
	|		ПО АналитикиУчетаПартийРабот.ГруппаФинансовогоУчета = ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
	|			И АналитикиУчетаПартийРабот.Поставщик           = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			И АналитикиУчетаПартийРабот.Контрагент          = НЕОПРЕДЕЛЕНО
	|			И АналитикиУчетаПартийРабот.СтавкаНДС           = ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|			И АналитикиУчетаПартийРабот.НалогообложениеНДС  = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			И АналитикиУчетаПартийРабот.ВидЦенности         = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|			И АналитикиУчетаПартийРабот.КодСтроки           = ТаблицаТовары.КодСтроки
	|			И РеквизитыДокумента.Организация В (&ОрганизацииСФИФОСкользящая)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПартииМатериаловВНЗП КАК ПартииМатериаловВНЗП
	|		ПО ПартииМатериаловВНЗП.ПартияПроизводства = ПартииПроизводства.ПартияПроизводства
	|			И ПартииМатериаловВНЗП.ПартияМатериала = ПартииПроизводства.ДокументПартии
	|			И (ПартииМатериаловВНЗП.АналитикаУчетаПартий = АналитикиУчетаПартийТоваров.КлючАналитики
	|				ИЛИ ПартииМатериаловВНЗП.АналитикаУчетаПартий = АналитикиУчетаПартийРабот.КлючАналитики)
	|			И ПартииМатериаловВНЗП.Организация = СпрВидыЗапасов.Организация
	|
	|ГДЕ
	|	РеквизитыДокумента.Проведен
	|	И РеквизитыДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПартииПроизводства.РаспределениеЗатратНаВыпуск
	|
	|СГРУППИРОВАТЬ ПО
	|	СпрВидыЗапасов.Ссылка,
	|	СпрВидыЗапасов.ТипЗапасов,
	|	ВЫБОР
	|		КОГДА СпрВидыЗапасов.ТипЗапасов ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		КОГДА СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|		КОГДА СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ИЛИ СпрВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	КОНЕЦ,
	|	ПартииПроизводства.ПартияПроизводства,
	|	РеквизитыДокумента.Ссылка,
	|	РеквизитыДокумента.Дата,
	|	ВЫБОР
	|		КОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ЕСТЬNULL(АналитикиУчетаПартийРабот.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(АналитикиУчетаПартийТоваров.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка))
	|	КОНЕЦ,
	|	ПартииПроизводства.АналитикаФинансовогоУчета,
	|	ПартииПроизводства.Организация,
	|	РеквизитыДокумента.Подразделение,
	|	РеквизитыДокумента.ВыпускПодДеятельность,
	|	АналитикаПоПолучателю.Номенклатура,
	|	АналитикаПоПолучателю.Характеристика,
	|	АналитикаПоПолучателю.Серия,
	|	ТаблицаТовары.Спецификация,
	|	ТаблицаТовары.ИдентификаторСтроки,
	|	ТаблицаТовары.ИдентификаторФинЗаписи,
	|	ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	|		 И НЕ СпрСклады.ЦеховаяКладовая
	|		 И НЕ АналитикаПоПодразделению.КлючАналитики ЕСТЬ NULL
	|			ТОГДА АналитикаПоПодразделению.КлючАналитики
	|		КОГДА НЕ &УчитыватьСебестоимостьТоваровПоНазначениям
	|		 И НЕ АналитикаПоПодразделению.КлючАналитики ЕСТЬ NULL
	|		 И НЕ СпрСклады.ЦеховаяКладовая
	|			ТОГДА АналитикаПоПодразделениюБезНазначения.КлючАналитики
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ АналитикаПоПолучателюБезНазначения.КлючАналитики
	|	КОНЕЦ,
	|	ТаблицаТовары.Получатель,
	|	ТаблицаТовары.АналитикаРасходов,
	|	ТаблицаТовары.АналитикаАктивовПассивов";
	#КонецОбласти
	
	// план и факт по производству без заказов - работы
	#Область ТекствтПродукция_ПБЗ_Работы
	ТекствтПродукция_ПБЗ_Работы = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции)					КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)	КАК РазделУчета,
	|	ПартииПроизводства.ПартияПроизводства			КАК ПартияПроизводства,
	|	РеквизитыДокумента.Ссылка						КАК ПартияВыпуска,
	|	РеквизитыДокумента.Дата							КАК ДатаПроизводства,
	|	ЕСТЬNULL(АналитикиУчетаПартий.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)) КАК АналитикаУчетаПартий,
	|	ПартииПроизводства.АналитикаФинансовогоУчета	КАК АналитикаФинансовогоУчета,
	|	ПартииПроизводства.Организация					КАК Организация,
	|	РеквизитыДокумента.Подразделение				КАК Подразделение,
	|	РеквизитыДокумента.ВыпускПодДеятельность		КАК ВидДеятельностиНДС,
	|	АналитикаПоПолучателю.Номенклатура				КАК Номенклатура,
	|	АналитикаПоПолучателю.Характеристика			КАК Характеристика,
	|	АналитикаПоПолучателю.Серия						КАК Серия,
	|	ТаблицаТовары.Спецификация						КАК Спецификация,
	|	ТаблицаТовары.ИдентификаторСтроки				КАК ИдентификаторСтроки,
	|	ТаблицаТовары.ИдентификаторСтроки				КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)	КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ
	|			АналитикаПоПолучателюБезНазначения.КлючАналитики
	|	КОНЕЦ											КАК АналитикаУчетаНоменклатуры,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаТовары.Получатель) = ТИП(ПланВидовХарактеристик.СтатьиРасходов)
	|			ТОГДА ТаблицаТовары.Получатель
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ											КАК СтатьяРасходовСписания,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаТовары.Получатель) = ТИП(ПланВидовХарактеристик.СтатьиАктивовПассивов)
	|			ТОГДА ТаблицаТовары.Получатель
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ											КАК СтатьяАктивовПассивов,
	|	ТаблицаТовары.АналитикаРасходов					КАК АналитикаРасходов,
	|	ТаблицаТовары.АналитикаАктивовПассивов			КАК АналитикаАктивовПассивов,
	|	СУММА(ТаблицаТовары.Количество)					КАК Факт,
	|	СУММА(ТаблицаТовары.Количество)					КАК План,
	|	СУММА(ТаблицаТовары.Количество)					КАК КоличествоПродукции,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаТовары.ДоляСтоимости = 0
	|				ТОГДА ТаблицаТовары.Количество
	|			ИНАЧЕ ТаблицаТовары.ДоляСтоимости
	|		КОНЕЦ)										КАК ДоляСтоимостиФакт,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТаблицаТовары.ДоляСтоимости = 0
	|				ТОГДА ТаблицаТовары.Количество - ЕСТЬNULL(ПартииМатериаловВНЗП.Количество, 0)
	|			ИНАЧЕ ТаблицаТовары.ДоляСтоимости
	|					- ЕСТЬNULL(ПартииМатериаловВНЗП.Количество, 0)
	|						* ТаблицаТовары.ДоляСтоимости
	|						/ ТаблицаТовары.Количество
	|		КОНЕЦ КАК ЧИСЛО(23, 10)))					КАК ДоляСтоимости,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаТовары.ДоляСтоимости = 0
	|				ТОГДА ТаблицаТовары.Количество
	|			ИНАЧЕ ТаблицаТовары.ДоляСтоимости
	|		КОНЕЦ)										КАК ПолнаяДоляСтоимости
	|ИЗ
	|	ПартииПроизводстваПоЭтапам КАК ПартииПроизводства
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК РеквизитыДокумента
	|		ПО РеквизитыДокумента.Ссылка = ПартииПроизводства.Этап
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ТаблицаТовары
	|		ПО ТаблицаТовары.Ссылка = РеквизитыДокумента.Ссылка
	|			И ТаблицаТовары.НомерГруппыЗатрат = ПартииПроизводства.НомерГруппыЗатрат
	|			И ВЫБОР
	|				КОГДА ИСТИНА
	|					ТОГДА РеквизитыДокумента.Организация = ПартииПроизводства.Организация
	|			КОНЕЦ
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПоПолучателю
	|		ПО АналитикаПоПолучателю.Ссылка = ТаблицаТовары.АналитикаУчетаНоменклатуры
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПоПолучателюБезНазначения
	|		ПО АналитикаПоПолучателюБезНазначения.Номенклатура = АналитикаПоПолучателю.Номенклатура
	|			И АналитикаПоПолучателюБезНазначения.Характеристика = АналитикаПоПолучателю.Характеристика
	|			И АналитикаПоПолучателюБезНазначения.Серия = АналитикаПоПолучателю.Серия
	|			И АналитикаПоПолучателюБезНазначения.МестоХранения = АналитикаПоПолучателю.МестоХранения
	|			И АналитикаПоПолучателюБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			И АналитикаПоПолучателюБезНазначения.СтатьяКалькуляции = АналитикаПоПолучателю.СтатьяКалькуляции
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО СпрНоменклатура.Ссылка = ТаблицаТовары.Номенклатура
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартий КАК АналитикиУчетаПартий
	|		ПО АналитикиУчетаПартий.ГруппаФинансовогоУчета	= ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
	|			И АналитикиУчетаПартий.Поставщик				= ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|			И АналитикиУчетаПартий.Контрагент				= НЕОПРЕДЕЛЕНО
	|			И АналитикиУчетаПартий.СтавкаНДС				= ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	|			И АналитикиУчетаПартий.НалогообложениеНДС 		= ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|			И АналитикиУчетаПартий.ВидЦенности				= ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПрочиеРаботыИУслуги)
	|			И АналитикиУчетаПартий.КодСтроки				= ТаблицаТовары.КодСтроки
	|			И РеквизитыДокумента.Организация В (&ОрганизацииСФИФОСкользящая)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПартииМатериаловВНЗП КАК ПартииМатериаловВНЗП
	|		ПО ПартииМатериаловВНЗП.ПартияПроизводства = ПартииПроизводства.ПартияПроизводства
	|			И ПартииМатериаловВНЗП.ПартияМатериала = ПартииПроизводства.ДокументПартии
	|			И ПартииМатериаловВНЗП.АналитикаУчетаПартий = АналитикиУчетаПартий.КлючАналитики
	|			И ПартииМатериаловВНЗП.Организация = РеквизитыДокумента.Организация
	|
	|ГДЕ
	|	СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|	И НЕ СпрНоменклатура.ПрослеживаемыйТовар
	|	И РеквизитыДокумента.Проведен
	|	И РеквизитыДокумента.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПартииПроизводства.РаспределениеЗатратНаВыпуск
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииПроизводства.ПартияПроизводства,
	|	РеквизитыДокумента.Ссылка,
	|	РеквизитыДокумента.Дата,
	|	ЕСТЬNULL(АналитикиУчетаПартий.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)),
	|	ПартииПроизводства.АналитикаФинансовогоУчета,
	|	ПартииПроизводства.Организация,
	|	РеквизитыДокумента.Подразделение,
	|	РеквизитыДокумента.ВыпускПодДеятельность,
	|	АналитикаПоПолучателю.Номенклатура,
	|	АналитикаПоПолучателю.Характеристика,
	|	АналитикаПоПолучателю.Серия,
	|	ТаблицаТовары.Спецификация,
	|	ТаблицаТовары.ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	|			ТОГДА ТаблицаТовары.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ
	|			АналитикаПоПолучателюБезНазначения.КлючАналитики
	|	КОНЕЦ,
	|	ТаблицаТовары.Получатель,
	|	ТаблицаТовары.АналитикаРасходов,
	|	ТаблицаТовары.АналитикаАктивовПассивов";
	#КонецОбласти
	

	//++ Устарело_Переработка24
	
	// план и факт по отчетам переработчиков без этапов
	#Область ТекствтПродукция_ОтчетыПереработчиковБезЭтапов
	ТекствтПродукция_ОтчетыПереработчиковБезЭтапов = "
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) КАК ХозяйственнаяОперация,
	|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК РазделУчета,
	|	ПартииПроизводства.ПартияПроизводства			КАК ПартияПроизводства,
	|	РеквизитыОтчета.Ссылка							КАК ПартияВыпуска,
	|	РеквизитыОтчета.Дата							КАК ДатаПроизводства,
	|	ЕСТЬNULL(АналитикиУчетаПартий.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)) КАК АналитикаУчетаПартий,
	|	ПартииПроизводства.АналитикаФинансовогоУчета	КАК АналитикаФинансовогоУчета,
	|	РеквизитыОтчета.Организация						КАК Организация,
	|	РеквизитыОтчета.Подразделение					КАК Подразделение,
	|	РеквизитыОтчета.ЗакупкаПодДеятельность			КАК ВидДеятельностиНДС,
	|	ТаблицаТоваров.Номенклатура						КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика					КАК Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	ТаблицаТоваров.Спецификация						КАК Спецификация,
	|	ТаблицаТоваров.ИдентификаторСтроки				КАК ИдентификаторСтроки,
	|	ТаблицаТоваров.ИдентификаторСтроки				КАК ИдентификаторФинЗаписи,
	|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)	КАК ВидЗапасов,
	|	ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	|			ТОГДА ТаблицаТоваров.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ
	|			АналитикаБезНазначения.КлючАналитики
	|	КОНЕЦ											КАК АналитикаУчетаНоменклатуры,
	|	НЕОПРЕДЕЛЕНО									КАК СтатьяРасходовСписания,
	|	НЕОПРЕДЕЛЕНО									КАК СтатьяАктивовПассивов,
	|	НЕОПРЕДЕЛЕНО									КАК АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО									КАК АналитикаАктивовПассивов,
	|	СУММА(ТаблицаТоваров.Количество)				КАК Факт,
	|	СУММА(ТаблицаТоваров.Количество)				КАК План,
	|	СУММА(ТаблицаТоваров.Количество)				КАК КоличествоПродукции,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаТоваров.ДоляСтоимости = 0
	|				ТОГДА ТаблицаТоваров.Количество
	|			ИНАЧЕ ТаблицаТоваров.ДоляСтоимости
	|		КОНЕЦ)										КАК ДоляСтоимостиФакт,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаТоваров.ДоляСтоимости = 0
	|				ТОГДА ТаблицаТоваров.Количество
	|			ИНАЧЕ ТаблицаТоваров.ДоляСтоимости
	|		КОНЕЦ)										КАК ДоляСтоимости,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблицаТоваров.ДоляСтоимости = 0
	|				ТОГДА ТаблицаТоваров.Количество
	|			ИНАЧЕ ТаблицаТоваров.ДоляСтоимости
	|		КОНЕЦ)										КАК ПолнаяДоляСтоимости
	|ИЗ
	|	ПартииПроизводстваСводно КАК ПартииПроизводства
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика.Продукция КАК ТаблицаТоваров
	|		ПО ПартииПроизводства.ДокументПартии = ТаблицаТоваров.Ссылка
	|			И ПартииПроизводства.НомерГруппыЗатрат = ТаблицаТоваров.НомерГруппыЗатрат
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика КАК РеквизитыОтчета
	|		ПО РеквизитыОтчета.Ссылка = ТаблицаТоваров.Ссылка
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
	|		ПО Аналитика.Номенклатура = АналитикаБезНазначения.Номенклатура
	|			И Аналитика.Характеристика = АналитикаБезНазначения.Характеристика
	|			И Аналитика.Серия = АналитикаБезНазначения.Серия
	|			И Аналитика.МестоХранения = АналитикаБезНазначения.МестоХранения
	|			И ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) = АналитикаБезНазначения.Назначение
	|			И Аналитика.СтатьяКалькуляции = АналитикаБезНазначения.СтатьяКалькуляции
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартий КАК АналитикиУчетаПартий
	|		ПО АналитикиУчетаПартий.ГруппаФинансовогоУчета	= ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
	|			И АналитикиУчетаПартий.Поставщик				= РеквизитыОтчета.Партнер
	|			И АналитикиУчетаПартий.Контрагент				= РеквизитыОтчета.Контрагент
	|			И АналитикиУчетаПартий.СтавкаНДС				= РеквизитыОтчета.СтавкаНДС
	|			И АналитикиУчетаПартий.НалогообложениеНДС		= ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) // при ПУ 2.2 НалогообложениеНДС не заполняется
	|			И АналитикиУчетаПартий.ВидЦенности				= ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)
	|			И АналитикиУчетаПартий.КодСтроки				= ТаблицаТоваров.КодСтрокиПродукция
	|			И ПартииПроизводства.Организация В (&ОрганизацииСФИФОСкользящая)
	|
	|ГДЕ
	|	РеквизитыОтчета.Проведен
	|	И ПартииПроизводства.РаспределениеЗатратНаВыпуск
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииПроизводства.ПартияПроизводства,
	|	РеквизитыОтчета.Ссылка,
	|	РеквизитыОтчета.Дата,
	|	ЕСТЬNULL(АналитикиУчетаПартий.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)),
	|	ПартииПроизводства.АналитикаФинансовогоУчета,
	|	РеквизитыОтчета.Организация,
	|	РеквизитыОтчета.Подразделение,
	|	РеквизитыОтчета.ЗакупкаПодДеятельность,
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика,
	|	ТаблицаТоваров.Спецификация,
	|	ТаблицаТоваров.ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	|			ТОГДА ТаблицаТоваров.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ
	|			АналитикаБезНазначения.КлючАналитики
	|	КОНЕЦ";
	#КонецОбласти
	
	//-- Устарело_Переработка24
	
	// план и факт по отчетам переработчиков 2.5 без этапов по работам
	#Область ТекствтПродукция_ОтчетыПереработчиков25БезЭтапов_Работы
	//ТекствтПродукция_ОтчетыПереработчиков25БезЭтапов_Работы = "
	//|ВЫБРАТЬ
	//|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) КАК ХозяйственнаяОперация,
	//|	ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты) КАК РазделУчета,
	//|	ПартииПроизводства.ПартияПроизводства			КАК ПартияПроизводства,
	//|	РеквизитыОтчета.Ссылка							КАК ПартияВыпуска,
	//|	РеквизитыОтчета.Дата							КАК ДатаПроизводства,
	//|	ЕСТЬNULL(АналитикиУчетаПартий.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)) КАК АналитикаУчетаПартий,
	//|	ПартииПроизводства.АналитикаФинансовогоУчета	КАК АналитикаФинансовогоУчета,
	//|	РеквизитыОтчета.Организация						КАК Организация,
	//|	РеквизитыОтчета.Подразделение					КАК Подразделение,
	//|	РеквизитыОтчета.ЗакупкаПодДеятельность			КАК ВидДеятельностиНДС,
	//|	ТаблицаТоваров.Номенклатура						КАК Номенклатура,
	//|	ТаблицаТоваров.Характеристика					КАК Характеристика,
	//|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	//|	ТаблицаТоваров.Спецификация						КАК Спецификация,
	//|	ТаблицаТоваров.ИдентификаторСтроки				КАК ИдентификаторСтроки,
	//|	ТаблицаТоваров.ИдентификаторСтроки				КАК ИдентификаторФинЗаписи,
	//|	ЗНАЧЕНИЕ(Справочник.ВидыЗапасов.ПустаяСсылка)	КАК ВидЗапасов,
	//|	ВЫБОР
	//|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	//|			ТОГДА ТаблицаТоваров.АналитикаУчетаНоменклатуры
	//|		ИНАЧЕ
	//|			АналитикаБезНазначения.КлючАналитики
	//|	КОНЕЦ											КАК АналитикаУчетаНоменклатуры,
	//|	НЕОПРЕДЕЛЕНО									КАК СтатьяРасходовСписания,
	//|	НЕОПРЕДЕЛЕНО									КАК СтатьяАктивовПассивов,
	//|	НЕОПРЕДЕЛЕНО									КАК АналитикаРасходов,
	//|	НЕОПРЕДЕЛЕНО									КАК АналитикаАктивовПассивов,
	//|	СУММА(ТаблицаТоваров.Количество)				КАК Факт,
	//|	СУММА(ТаблицаТоваров.Количество)				КАК План,
	//|	СУММА(ТаблицаТоваров.Количество)				КАК КоличествоПродукции,
	//|	СУММА(ВЫБОР
	//|			КОГДА ТаблицаТоваров.ДоляСтоимости = 0
	//|				ТОГДА ТаблицаТоваров.Количество
	//|			ИНАЧЕ ТаблицаТоваров.ДоляСтоимости
	//|		КОНЕЦ)										КАК ДоляСтоимостиФакт,
	//|	СУММА(ВЫБОР
	//|			КОГДА ТаблицаТоваров.ДоляСтоимости = 0
	//|				ТОГДА ТаблицаТоваров.Количество
	//|			ИНАЧЕ ТаблицаТоваров.ДоляСтоимости
	//|		КОНЕЦ)										КАК ДоляСтоимости,
	//|	СУММА(ВЫБОР
	//|			КОГДА ТаблицаТоваров.ДоляСтоимости = 0
	//|				ТОГДА ТаблицаТоваров.Количество
	//|			ИНАЧЕ ТаблицаТоваров.ДоляСтоимости
	//|		КОНЕЦ)										КАК ПолнаяДоляСтоимости
	//|ИЗ
	//|	ПартииПроизводстваСводно КАК ПартииПроизводства
	//|
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика2_5.ВыходныеИзделия КАК ТаблицаТоваров
	//|		ПО ПартииПроизводства.ДокументПартии = ТаблицаТоваров.Ссылка
	//|			И ПартииПроизводства.НомерГруппыЗатрат = ТаблицаТоваров.НомерГруппыЗатрат
	//|
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика2_5 КАК РеквизитыОтчета
	//|		ПО РеквизитыОтчета.Ссылка = ТаблицаТоваров.Ссылка
	//|
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	//|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	//|
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
	//|		ПО Аналитика.Номенклатура = АналитикаБезНазначения.Номенклатура
	//|			И Аналитика.Характеристика = АналитикаБезНазначения.Характеристика
	//|			И Аналитика.Серия = АналитикаБезНазначения.Серия
	//|			И Аналитика.МестоХранения = АналитикаБезНазначения.МестоХранения
	//|			И ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) = АналитикаБезНазначения.Назначение
	//|			И Аналитика.СтатьяКалькуляции = АналитикаБезНазначения.СтатьяКалькуляции
	//|
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартий КАК АналитикиУчетаПартий
	//|		ПО АналитикиУчетаПартий.ГруппаФинансовогоУчета	= ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
	//|			И АналитикиУчетаПартий.Поставщик				= ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	//|			И АналитикиУчетаПартий.Контрагент				= НЕОПРЕДЕЛЕНО
	//|			И АналитикиУчетаПартий.СтавкаНДС				= ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	//|			И АналитикиУчетаПартий.НалогообложениеНДС		= ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) // при ПУ 2.2 НалогообложениеНДС не заполняется
	//|			И АналитикиУчетаПартий.ВидЦенности				= ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)
	//|			И АналитикиУчетаПартий.КодСтроки				= ТаблицаТоваров.КодСтрокиПродукция
	//|			И ПартииПроизводства.Организация В (&ОрганизацииСФИФОСкользящая)
	//|
	//|ГДЕ
	//|	ТаблицаТоваров.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	//|	И ПартииПроизводства.РаспределениеЗатратНаВыпуск
	//|	И НЕ ТаблицаТоваров.Номенклатура.ПрослеживаемыйТовар
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПартииПроизводства.ПартияПроизводства,
	//|	РеквизитыОтчета.Ссылка,
	//|	РеквизитыОтчета.Дата,
	//|	ЕСТЬNULL(АналитикиУчетаПартий.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)),
	//|	ПартииПроизводства.АналитикаФинансовогоУчета,
	//|	РеквизитыОтчета.Организация,
	//|	РеквизитыОтчета.Подразделение,
	//|	РеквизитыОтчета.ЗакупкаПодДеятельность,
	//|	ТаблицаТоваров.Номенклатура,
	//|	ТаблицаТоваров.Характеристика,
	//|	ТаблицаТоваров.Спецификация,
	//|	ВЫБОР
	//|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	//|			ТОГДА ТаблицаТоваров.АналитикаУчетаНоменклатуры
	//|		ИНАЧЕ
	//|			АналитикаБезНазначения.КлючАналитики
	//|	КОНЕЦ,
	//|	ТаблицаТоваров.ИдентификаторСтроки";
	#КонецОбласти
	
	// план и факт по отчетам переработчиков 2.5 без этапов по товарам
	#Область ТекствтПродукция_ОтчетыПереработчиков25БезЭтапов_Товары
	//ТекствтПродукция_ОтчетыПереработчиков25БезЭтапов_Товары = "
	//|ВЫБРАТЬ
	//|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции) КАК ХозяйственнаяОперация,
	//|	ВЫБОР
	//|		КОГДА ТаблицаТоваров.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработкуПереданныеПартнерам)
	//|		КОГДА ТаблицаТоваров.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	//|		  ИЛИ ТаблицаТоваров.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранениеПереданныеПартнерам)
	//|		КОГДА ТаблицаТоваров.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Работа)
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
	//|	КОНЕЦ КАК РазделУчета,
	//|	ПартииПроизводства.ПартияПроизводства			КАК ПартияПроизводства,
	//|	РеквизитыОтчета.Ссылка							КАК ПартияВыпуска,
	//|	РеквизитыОтчета.Дата							КАК ДатаПроизводства,
	//|	ЕСТЬNULL(АналитикиУчетаПартий.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)) КАК АналитикаУчетаПартий,
	//|	ПартииПроизводства.АналитикаФинансовогоУчета	КАК АналитикаФинансовогоУчета,
	//|	РеквизитыОтчета.Организация						КАК Организация,
	//|	РеквизитыОтчета.Подразделение					КАК Подразделение,
	//|	РеквизитыОтчета.ЗакупкаПодДеятельность			КАК ВидДеятельностиНДС,
	//|	Аналитика.Номенклатура							КАК Номенклатура,
	//|	Аналитика.Характеристика						КАК Характеристика,
	//|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	//|	ЗНАЧЕНИЕ(Справочник.РесурсныеСпецификации.ПустаяСсылка) КАК Спецификация,
	//|	ТаблицаТоваров.ИдентификаторСтроки				КАК ИдентификаторСтроки,
	//|	ТаблицаТоваров.ИдентификаторФинЗаписи			КАК ИдентификаторФинЗаписи,
	//|	ТаблицаТоваров.ВидЗапасов						КАК ВидЗапасов,
	//|	ВЫБОР
	//|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	//|			ТОГДА ТаблицаТоваров.АналитикаУчетаНоменклатуры
	//|		ИНАЧЕ
	//|			АналитикаБезНазначения.КлючАналитики
	//|	КОНЕЦ											КАК АналитикаУчетаНоменклатуры,
	//|	НЕОПРЕДЕЛЕНО									КАК СтатьяРасходовСписания,
	//|	НЕОПРЕДЕЛЕНО									КАК СтатьяАктивовПассивов,
	//|	НЕОПРЕДЕЛЕНО									КАК АналитикаРасходов,
	//|	НЕОПРЕДЕЛЕНО									КАК АналитикаАктивовПассивов,
	//|	СУММА(ТаблицаТоваров.Количество)				КАК Факт,
	//|	СУММА(ТаблицаТоваров.Количество)				КАК План,
	//|	СУММА(ТаблицаТоваров.Количество)				КАК КоличествоПродукции,
	//|	СУММА(ВЫБОР
	//|			КОГДА ТаблицаТоваров.ДоляСтоимости = 0
	//|				ТОГДА ТаблицаТоваров.Количество
	//|			ИНАЧЕ ТаблицаТоваров.ДоляСтоимости
	//|		КОНЕЦ)										КАК ДоляСтоимостиФакт,
	//|	СУММА(ВЫБОР
	//|			КОГДА ТаблицаТоваров.ДоляСтоимости = 0
	//|				ТОГДА ТаблицаТоваров.Количество
	//|			ИНАЧЕ ТаблицаТоваров.ДоляСтоимости
	//|		КОНЕЦ)										КАК ДоляСтоимости,
	//|	СУММА(ВЫБОР
	//|			КОГДА ТаблицаТоваров.ДоляСтоимости = 0
	//|				ТОГДА ТаблицаТоваров.Количество
	//|			ИНАЧЕ ТаблицаТоваров.ДоляСтоимости
	//|		КОНЕЦ)										КАК ПолнаяДоляСтоимости
	//|ИЗ
	//|	ПартииПроизводстваСводно КАК ПартииПроизводства
	//|
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика2_5.ВидыЗапасовИзделия КАК ТаблицаТоваров
	//|		ПО ПартииПроизводства.ДокументПартии = ТаблицаТоваров.Ссылка
	//|			И ПартииПроизводства.НомерГруппыЗатрат = ТаблицаТоваров.НомерГруппыЗатрат
	//|
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика2_5 КАК РеквизитыОтчета
	//|		ПО РеквизитыОтчета.Ссылка = ТаблицаТоваров.Ссылка
	//|
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	//|		ПО ТаблицаТоваров.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	//|
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаБезНазначения
	//|		ПО Аналитика.Номенклатура = АналитикаБезНазначения.Номенклатура
	//|			И Аналитика.Характеристика = АналитикаБезНазначения.Характеристика
	//|			И Аналитика.Серия = АналитикаБезНазначения.Серия
	//|			И Аналитика.МестоХранения = АналитикаБезНазначения.МестоХранения
	//|			И ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) = АналитикаБезНазначения.Назначение
	//|			И Аналитика.СтатьяКалькуляции = АналитикаБезНазначения.СтатьяКалькуляции
	//|
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПартий КАК АналитикиУчетаПартий
	//|		ПО АналитикиУчетаПартий.ГруппаФинансовогоУчета	= ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
	//|			И АналитикиУчетаПартий.Поставщик				= ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	//|			И АналитикиУчетаПартий.Контрагент				= НЕОПРЕДЕЛЕНО
	//|			И АналитикиУчетаПартий.СтавкаНДС				= ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка)
	//|			И АналитикиУчетаПартий.НалогообложениеНДС		= ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка) // при ПУ 2.2 НалогообложениеНДС не заполняется
	//|			И АналитикиУчетаПартий.ВидЦенности				= ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.Товары)
	//|			И АналитикиУчетаПартий.КодСтроки				= ТаблицаТоваров.КодСтрокиПродукция
	//|			И ПартииПроизводства.Организация В (&ОрганизацииСФИФОСкользящая)
	//|
	//|ГДЕ
	//|	НЕ ТаблицаТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)
	//|	И ПартииПроизводства.РаспределениеЗатратНаВыпуск
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВЫБОР
	//|		КОГДА ТаблицаТоваров.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.МатериалДавальца)
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработкуПереданныеПартнерам)
	//|		КОГДА ТаблицаТоваров.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	//|		  ИЛИ ТаблицаТоваров.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранениеПереданныеПартнерам)
	//|		КОГДА ТаблицаТоваров.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Работа)
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	//|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
	//|	КОНЕЦ,
	//|	ПартииПроизводства.ПартияПроизводства,
	//|	РеквизитыОтчета.Ссылка,
	//|	РеквизитыОтчета.Дата,
	//|	ЕСТЬNULL(АналитикиУчетаПартий.КлючАналитики, ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)),
	//|	ПартииПроизводства.АналитикаФинансовогоУчета,
	//|	РеквизитыОтчета.Организация,
	//|	РеквизитыОтчета.Подразделение,
	//|	РеквизитыОтчета.ЗакупкаПодДеятельность,
	//|	Аналитика.Номенклатура,
	//|	Аналитика.Характеристика,
	//|	ТаблицаТоваров.ВидЗапасов,
	//|	ВЫБОР
	//|		КОГДА &УчитыватьСебестоимостьТоваровПоНазначениям
	//|			ТОГДА ТаблицаТоваров.АналитикаУчетаНоменклатуры
	//|		ИНАЧЕ
	//|			АналитикаБезНазначения.КлючАналитики
	//|	КОНЕЦ,
	//|	ТаблицаТоваров.ИдентификаторСтроки,
	//|	ТаблицаТоваров.ИдентификаторФинЗаписи";
	#КонецОбласти
	
	
	ИндексвтПродукция = "
	|ИНДЕКСИРОВАТЬ ПО
	|	ПартияПроизводства";
	
	#Область ТекствтДолиИтог
	ТекствтДолиИтог = "ВЫБРАТЬ
	                  |	ДД.ПартияПроизводства КАК ПартияПроизводства,
	                  |	ДД.Организация КАК Организация,
	                  |	СУММА(ВЫБОР
	                  |			КОГДА ДД.ДоляСтоимости < 0
	                  |				ТОГДА 0
	                  |			ИНАЧЕ ДД.ДоляСтоимости
	                  |		КОНЕЦ) КАК СуммаДолейПоЭтапу,
	                  |	СУММА(ВЫБОР
	                  |			КОГДА ДД.ПолнаяДоляСтоимости < 0
	                  |				ТОГДА 0
	                  |			ИНАЧЕ ДД.ПолнаяДоляСтоимости
	                  |		КОНЕЦ) КАК СуммаПолныхДолейПоЭтапу,
	                  |	МИНИМУМ(ВЫБОР
	                  |			КОГДА ДД.Факт <> ДД.План
	                  |				ТОГДА ЛОЖЬ
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ) КАК ПроизводствоЗавершено
	                  |ПОМЕСТИТЬ втДолиИтог
	                  |ИЗ
	                  |	втПродукция КАК ДД
	                  |
	                  |СГРУППИРОВАТЬ ПО
	                  |	ДД.ПартияПроизводства,
	                  |	ДД.Организация
	                  |
	                  |ИНДЕКСИРОВАТЬ ПО
	                  |	Организация,
	                  |	ПартияПроизводства";
	#КонецОбласти
	
	#Область ТекстПродукция
	ТекстПродукция = "
	|ВЫБРАТЬ
	|	ДД.ХозяйственнаяОперация			КАК ХозяйственнаяОперация,
	|	(ВЫБОР
	|		КОГДА ВТУчетныеПолитикиФинУчета.УчетГотовойПродукцииПоПлановойСтоимости
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ВыпускПродукции)
	|		ИНАЧЕ ДД.РазделУчета КОНЕЦ) КАК РазделУчета,
	|	ДД.ПартияПроизводства				КАК ПартияПроизводства,
	|	ДД.ПартияВыпуска					КАК ПартияВыпуска,
	|	ДД.ДатаПроизводства					КАК ДатаПроизводства,
	|	ДД.АналитикаУчетаПартий				КАК АналитикаУчетаПартий,
	|	ДД.АналитикаФинансовогоУчета		КАК АналитикаФинансовогоУчета,
	|	ДД.Организация						КАК Организация,
	|	ДД.ВидДеятельностиНДС				КАК ВидДеятельностиНДС,
	|	ДД.Подразделение					КАК Подразделение,
	|	ДД.Номенклатура						КАК Номенклатура,
	|	ДД.Характеристика					КАК Характеристика,
	// При ценообразовании 2.5 не поддерживается указание плановой цены в разрезе упаковок.
	// Значение будет определяться по цене для единицы хранения.
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
	|	ДД.Серия							КАК Серия,
	|	ДД.Спецификация						КАК Спецификация,
	|	ДД.ВидЗапасов						КАК ВидЗапасов,
	|	ДД.АналитикаУчетаНоменклатуры		КАК АналитикаУчетаНоменклатуры,
	|	ДД.КоличествоПродукции				КАК КоличествоПродукции,
	|	ДД.СтатьяРасходовСписания			КАК СтатьяРасходовСписания,
	|	ДД.АналитикаРасходов				КАК АналитикаРасходов,
	|	ДД.СтатьяАктивовПассивов			КАК СтатьяАктивовПассивов,
	|	ДД.АналитикаАктивовПассивов			КАК АналитикаАктивовПассивов,
	|	ДД.ИдентификаторСтроки				КАК ИдентификаторСтроки,
	|	ДД.ИдентификаторФинЗаписи			КАК ИдентификаторФинЗаписи,
	|	ДД.Факт								КАК Факт,
	|	ДД.План								КАК План,
	|	ДД.ДоляСтоимости					КАК ДоляСтоимости,
	|	ДД.ПолнаяДоляСтоимости				КАК ПолнаяДоляСтоимости,
	|	ВЫБОР
	|		КОГДА ДолиИтог.СуммаПолныхДолейПоЭтапу = 0
	|			ИЛИ ДД.План = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ДД.ПолнаяДоляСтоимости / ДолиИтог.СуммаПолныхДолейПоЭтапу * (ДД.Факт / ДД.План) КАК ЧИСЛО(23,10))
	|	КОНЕЦ								КАК ПолнаяДоляНаименованияВсего,
	|	ВЫБОР
	|		КОГДА ДолиИтог.СуммаПолныхДолейПоЭтапу = 0
	|			ИЛИ ДД.План = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ДД.ПолнаяДоляСтоимости / ДолиИтог.СуммаПолныхДолейПоЭтапу * (ДД.КоличествоПродукции / ДД.План) КАК ЧИСЛО(23,10))
	|	КОНЕЦ								КАК ПолнаяДоляНаименованияМесяца,
	|	ВЫБОР
	|		КОГДА ДолиИтог.СуммаДолейПоЭтапу = 0
	|			ИЛИ ДД.План = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ДД.ДоляСтоимости / ДолиИтог.СуммаДолейПоЭтапу * (ДД.Факт / ДД.План) КАК ЧИСЛО(23,10))
	|	КОНЕЦ								КАК ДоляНаименованияВсего,
	|	ВЫБОР
	|		КОГДА ДолиИтог.СуммаДолейПоЭтапу = 0 
	|			ИЛИ ДД.План = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ДД.ДоляСтоимости / ДолиИтог.СуммаДолейПоЭтапу * (ДД.КоличествоПродукции / ДД.План) КАК ЧИСЛО(23,10))
	|	КОНЕЦ								КАК ДоляНаименованияМесяца,
	|	ДолиИтог.ПроизводствоЗавершено		КАК ПроизводствоЗавершено
	|ПОМЕСТИТЬ Продукция
	|ИЗ
	|	втПродукция КАК ДД
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДолиИтог КАК ДолиИтог
	|	ПО ДД.ПартияПроизводства = ДолиИтог.ПартияПроизводства
	|		И ДД.Организация = ДолиИтог.Организация
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУчетныеПолитикиФинУчета КАК ВТУчетныеПолитикиФинУчета
	|		ПО ДД.Организация = ВТУчетныеПолитикиФинУчета.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПартияПроизводства";
	#КонецОбласти
	
	#Область ТекстДолиВыпуска
	ТекстДолиВыпуска = "
	|ВЫБРАТЬ
	|	ДД.ПартияПроизводства					КАК ПартияПроизводства,
	|	ДД.ПроизводствоЗавершено				КАК ПроизводствоЗавершено,
	|	ДД.Организация							КАК Организация,
	|	СУММА(ДД.ДоляНаименованияВсего)			КАК ДоляВыпускаВсего,
	|	СУММА(ДД.ДоляНаименованияМесяца)		КАК ДоляВыпускаМесяца
	|ПОМЕСТИТЬ ДолиВыпуска
	|ИЗ
	|	Продукция КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.ПартияПроизводства,
	|	ДД.ПроизводствоЗавершено,
	|	ДД.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ПартияПроизводства";
	#КонецОбласти
	
	#Область ТекстЗамкнутыеПартии
	ТекстЗамкнутыеПартии = "
	|ВЫБРАТЬ
	|	ПартииМатериаловВНЗП.ПартияПроизводства			КАК ПартияПроизводства,
	|	Продукция.ПартияВыпуска							КАК ПартияВыпуска,
	|	ПартииМатериаловВНЗП.АналитикаУчетаНоменклатуры	КАК АналитикаУчетаНоменклатуры,
	|	СУММА(ПартииМатериаловВНЗП.Количество)			КАК Количество
	|ПОМЕСТИТЬ ЗамкнутыеПартии
	|ИЗ
	|	ПартииМатериаловВНЗП КАК ПартииМатериаловВНЗП
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Продукция КАК Продукция
	|		ПО ПартииМатериаловВНЗП.ПартияПроизводства = Продукция.ПартияПроизводства
	|		И ПартииМатериаловВНЗП.ПартияМатериала = Продукция.ПартияВыпуска
	|		И ПартииМатериаловВНЗП.АналитикаУчетаПартий = Продукция.АналитикаУчетаПартий
	|		И ПартииМатериаловВНЗП.Организация = Продукция.Организация
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииМатериаловВНЗП.ПартияПроизводства,
	|	Продукция.ПартияВыпуска,
	|	ПартииМатериаловВНЗП.АналитикаУчетаНоменклатуры";
	#КонецОбласти	
	
	ТекстывтПродукция = Новый Массив;
	ТекстывтПродукция.Добавить(ТекствтПродукция_ОписаниеДанных);
	ТекстывтПродукция.Добавить(ТекствтПродукция_ПБЗ_Товары);
	ТекстывтПродукция.Добавить(ТекствтПродукция_ПБЗ_Работы);
	
	
	//++ Устарело_Переработка24
	ТекстывтПродукция.Добавить(ТекствтПродукция_ОтчетыПереработчиковБезЭтапов);
	//-- Устарело_Переработка24
	//ТекстывтПродукция.Добавить(ТекствтПродукция_ОтчетыПереработчиков25БезЭтапов_Работы);
	//ТекстывтПродукция.Добавить(ТекствтПродукция_ОтчетыПереработчиков25БезЭтапов_Товары);
	ТекствтПродукция = 
		СтрСоединить(ТекстывтПродукция, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении()) + ИндексвтПродукция;

	ТекстыЗапроса = Новый Массив;
	
	ТекстыЗапроса.Добавить(ТекствтПродукция);
	ТекстыЗапроса.Добавить(ТекствтДолиИтог);
	ТекстыЗапроса.Добавить(ТекстПродукция);
	ТекстыЗапроса.Добавить(ТекстДолиВыпуска);
	ТекстыЗапроса.Добавить(ТекстЗамкнутыеПартии);
	ТекстыЗапроса.Добавить("");

	Возврат СтрСоединить(ТекстыЗапроса, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	
КонецФункции

// Таблицы: ДанныеПоПродукции
// 
// Возвращаемое значение:
// 	Строка - текст запроса
Функция ТекстДанныеПоВыпущеннойПродукции() Экспорт
	
	ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25();
	ТекстыЗапросов = Новый Массив;
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаТоваров.ДатаПроизводства					КАК ДатаПроизводства,
	|	ТаблицаТоваров.Организация						КАК Организация,
	|	ТаблицаТоваров.Подразделение					КАК Подразделение,
	|	ТаблицаТоваров.Номенклатура						КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика					КАК Характеристика,
	|	ПартииПроизводства.АналитикаФинансовогоУчета	КАК ГруппаПродукции,
	|	ТаблицаТоваров.ПартияПроизводства				КАК ПартияПроизводства,
	|	ПартииПроизводства.ВидДеятельностиНДС			КАК ВидДеятельностиНДС,
	|	ПартииПроизводства.Назначение					КАК Назначение,
	|	ПартииПроизводства.НаправлениеДеятельности		КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО									КАК ЗаказНаПроизводство,
	|	0												КАК КодСтрокиПродукция,
	|	&ПоляДляЦенообразования,
	|	ТаблицаТоваров.КоличествоПродукции				КАК Количество,
	|	ТаблицаТоваров.План - ТаблицаТоваров.Факт		КАК КоличествоПлан
	|ПОМЕСТИТЬ ДанныеПоПродукцииБезЦен
	|ИЗ
	|	Продукция КАК ТаблицаТоваров
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПартииПроизводстваСводно КАК ПартииПроизводства
	|	ПО ПартииПроизводства.ПартияПроизводства = ТаблицаТоваров.ПартияПроизводства
	|	И ПартииПроизводства.Организация = ТаблицаТоваров.Организация
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|	ПО ВидыНоменклатуры.Ссылка = ТаблицаТоваров.Номенклатура.ВидНоменклатуры
	|	
	|ГДЕ
	|	ТаблицаТоваров.ПолнаяДоляНаименованияМесяца > 0 ИЛИ &УчитыватьБудущиеВыпуски";
	
	НастройкаЦенообразования = ЦенообразованиеКлиентСервер.НастройкиДляВременнойТаблицыСДополнениемДляЦенообразования();
	НастройкаЦенообразования.ИсточникТоваров = "ТаблицаТоваров";
	ТекстЗамены = ЦенообразованиеКлиентСервер.ТекстПолейДляЦенообразования(НастройкаЦенообразования);
	Если ЗначениеЗаполнено(ТекстЗамены) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляДляЦенообразования", ТекстЗамены);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляДляЦенообразования,", "");
	КонецЕсли;
		
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	//++ Устарело_Производство21

	// производство без заказов 2.1
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Реквизиты.Дата													КАК ДатаПроизводства,
	|	Реквизиты.Организация											КАК Организация,
	|	Реквизиты.Подразделение											КАК Подразделение,
	|	ДД.Номенклатура													КАК Номенклатура,
	|	ДД.Характеристика												КАК Характеристика,
	|	ВЫБОР
	|		КОГДА &АналитическийУчетПоГруппамПродукции
	|			ТОГДА ДД.Номенклатура.ГруппаАналитическогоУчета
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ															КАК ГруппаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)			КАК ПартияПроизводства,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)		КАК ВидДеятельностиНДС,
	|	ДД.Назначение													КАК Назначение,
	|	ЕСТЬNULL(ДД.Назначение.НаправлениеДеятельности, 
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))	КАК НаправлениеДеятельности,
	|	ДД.Ссылка														КАК ЗаказНаПроизводство,
	|	ДД.КодСтроки													КАК КодСтрокиПродукция,
	|	&ПоляДляЦенообразования,
	|	ДД.Количество													КАК Количество,
	|	0																КАК КоличествоПлан
	|ИЗ
	|	Документ.ВыпускПродукции.Товары КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции КАК Реквизиты
	|			ПО (Реквизиты.Ссылка = ДД.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|			ПО ВидыНоменклатуры.Ссылка = ДД.Номенклатура.ВидНоменклатуры
	|
	|ГДЕ
	|	Реквизиты.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Реквизиты.Организация В (&МассивОрганизаций)
	|	И ДД.ТипСтоимости = ЗНАЧЕНИЕ(Перечисление.ТипыСтоимостиВыходныхИзделий.Рассчитывается)
	|	И Реквизиты.Проведен
	|	И НЕ Реквизиты.ВыпускПоРаспоряжениям
	|	И &ВключатьДанныеПроизводства21
	|";

	НастройкаЦенообразования.ИсточникТоваров = "ДД";
	ТекстЗамены = ЦенообразованиеКлиентСервер.ТекстПолейДляЦенообразования(НастройкаЦенообразования);
	Если ЗначениеЗаполнено(ТекстЗамены) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляДляЦенообразования", ТекстЗамены);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляДляЦенообразования,", "");
	КонецЕсли;
		
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	

	//-- Устарело_Производство21

	
	ВТ_ДанныеПоПродукцииБезЦен = СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении()) 
		+ ОбщегоНазначения.РазделительПакетаЗапросов();
		
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДД.ДатаПроизводства									КАК ДатаПроизводства,
	|	ДД.Организация										КАК Организация,
	|	ДД.Подразделение									КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)	КАК СтатьяКалькуляции,
	|	ДД.Номенклатура										КАК Продукция,
	|	ДД.ГруппаПродукции												КАК ГруппаПродукции,
	|	ДД.ПартияПроизводства								КАК ПартияПроизводства,
	|	ДД.ВидДеятельностиНДС								КАК ВидДеятельностиНДС,
	|	ДД.Назначение										КАК Назначение,
	|	ДД.НаправлениеДеятельности							КАК НаправлениеДеятельности,
	|	ДД.ЗаказНаПроизводство								КАК ЗаказНаПроизводство,
	|	ДД.КодСтрокиПродукция								КАК КодСтрокиПродукция,
	|	ДД.Количество										КАК Количество,
	|	&Объем * ДД.Количество								КАК Объем,
	|	&Вес * ДД.Количество								КАК Вес,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) 
	|		* ДД.Количество									КАК Стоимость,
	|	ДД.КоличествоПлан									КАК КоличествоПлан,
	|	&Объем * ДД.КоличествоПлан							КАК ОбъемПлан,
	|	&Вес * ДД.КоличествоПлан							КАК ВесПлан,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) 
	|		* ДД.КоличествоПлан								КАК СтоимостьПлан
	|ПОМЕСТИТЬ ДанныеПоПродукции
	|ИЗ
	|	ДанныеПоПродукцииБезЦен КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СН
	|			ПО (СН.Ссылка = ДД.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СХ
	|			ПО СХ.Ссылка = ДД.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			&ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО 
	|			&УсловиеСоединенияЦеныНоменклатуры
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&ЦеныНоменклатуры",
		ЦенообразованиеКлиентСервер.ТекстЗапросаРегистрСведенийЦеныНоменклатуры(
			"ДанныеПоПродукцииБезЦен",
			"&КонецПериода",
			Новый Структура("Параметр", "&ВидПлановыхЦен"),
			ИспользуетсяЦенообразование25)
	);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&УсловиеСоединенияЦеныНоменклатуры",
		ЦенообразованиеКлиентСервер.ТекстЗапросаРегистрСведенийЦеныНоменклатурыУсловиеСоединения(
			"ДД",
			"ЦеныНоменклатуры",
			,
			ИспользуетсяЦенообразование25)
	);
	
	Возврат ВТ_ДанныеПоПродукцииБезЦен 
		+ ТекстЗапроса
		+ ОбщегоНазначения.РазделительПакетаЗапросов();
	
КонецФункции

// Таблицы: ДанныеПоТрудозатратам
// 
// Параметры:
// 	ПараметрыРасчета - Структура - параметры расчета
// Возвращаемое значение:
// 	Строка - текст запроса
Функция ТекстДанныеПоТрудозатратам(ПараметрыРасчета = Неопределено) Экспорт
	
	ДляРасшифровки 				= РасчетСебестоимостиПрикладныеАлгоритмы.РасчетВызванДляРасшифровки(ПараметрыРасчета);
	РасчетСебестоимостиВыполнен = РасчетСебестоимостиПрикладныеАлгоритмы.РасчетСебестоимостиВыполненДляРасшифровки(ПараметрыРасчета);
	
	// Данные по трудозатратам выбираются в одну таблицу т.к. источники данных для плана и факта одинаковые.
	// Исключением являются выпуски без заказа 2.1, для них данные выбираются из документов производства без заказов.
	Текст = "
	|ВЫБРАТЬ
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.СтатьяКалькуляции,
	|	ДД.ВидРабот,
	|	СУММА(ДД.Количество) КАК Количество,
	|	СУММА(ДД.Стоимость) КАК Стоимость,
	|	СУММА(ДД.СтоимостьРегл) КАК СтоимостьРегл,
	//++ Локализация
	|	СУММА(ДД.СтоимостьРегл - ДД.ПостояннаяРазница - ДД.ВременнаяРазница)	КАК СтоимостьНУ,
	//-- Локализация
	|	СУММА(ДД.СтоимостьНДД) КАК СтоимостьНДД
	|ПОМЕСТИТЬ ТекущиеТрудозатратыНЗП
	|ИЗ
	|	ВТКэшРасчетныеОборотыТрудозатратыНезавершенногоПроизводства КАК ДД
	|ГДЕ
	|	ДД.ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	//++ Устарело_Производство21


	//-- Устарело_Производство21
	|	И ДД.СлужебноеВидДвиженияПриход
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.СтатьяКалькуляции,
	|	ДД.ВидРабот
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Подразделение,
	|	СтатьяКалькуляции,
	|	ВидРабот
	|;
	// производство 2.2
	|ВЫБРАТЬ
	|	ДД.Организация								КАК Организация,
	|	ДД.Подразделение							КАК Подразделение,
	|	ДД.СтатьяКалькуляции						КАК СтатьяКалькуляции,
	|	ДД.ВидРабот									КАК ВидРабот,
	|	ПартииПроизводства.АналитикаФинансовогоУчета КАК ГруппаПродукции,
	|	ПартииПроизводства.Назначение				КАК Назначение,
	|	ДД.ПартияПроизводства						КАК ПартияПроизводства,
	|	ПартииПроизводства.ВидДеятельностиНДС		КАК ВидДеятельностиНДС,
	|	НЕОПРЕДЕЛЕНО								КАК ЗаказНаПроизводство,
	|	0											КАК КодСтрокиПродукция,
	|	ПартииПроизводства.НаправлениеДеятельности	КАК НаправлениеДеятельности,
	|	СУММА(ВЫБОР
	|			КОГДА ДД.СлужебноеВидДвиженияПриход
	|				ТОГДА ДД.Количество
	|			ИНАЧЕ -ДД.Количество
	|		КОНЕЦ)						КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА ДД.СлужебноеВидДвиженияПриход
	|				ТОГДА ДД.НормативнаяСтоимость
	|			ИНАЧЕ -ДД.НормативнаяСтоимость
	|		КОНЕЦ)				КАК НормативнаяСтоимость,
	|	СУММА(ВЫБОР
	|			КОГДА ДД.СлужебноеВидДвиженияПриход
	|				ТОГДА ДД.Стоимость
	|			ИНАЧЕ -ДД.Стоимость
	|		КОНЕЦ)							КАК Стоимость,
	|	СУММА(ВЫБОР
	|			КОГДА ДД.СлужебноеВидДвиженияПриход
	|				ТОГДА ДД.СтоимостьРегл
	|			ИНАЧЕ -ДД.СтоимостьРегл
	|		КОНЕЦ)						КАК СтоимостьРегл,
	//++ Локализация
	|	СУММА(ВЫБОР
	|			КОГДА ДД.СлужебноеВидДвиженияПриход
	|				ТОГДА ДД.СтоимостьРегл
	|			ИНАЧЕ -ДД.СтоимостьРегл
	|		КОНЕЦ
	|		- ВЫБОР
	|			КОГДА ДД.СлужебноеВидДвиженияПриход
	|				ТОГДА ДД.ПостояннаяРазница
	|			ИНАЧЕ -ДД.ПостояннаяРазница
	|		КОНЕЦ
	|		- ВЫБОР
	|			КОГДА ДД.СлужебноеВидДвиженияПриход
	|				ТОГДА ДД.ВременнаяРазница
	|			ИНАЧЕ -ДД.ВременнаяРазница
	|		КОНЕЦ)	КАК СтоимостьНУ,
	//-- Локализация
	|	СУММА(ВЫБОР
	|			КОГДА ДД.СлужебноеВидДвиженияПриход
	|				ТОГДА ДД.СтоимостьНДД
	|			ИНАЧЕ -ДД.СтоимостьНДД
	|		КОНЕЦ)						КАК СтоимостьНДД
	|ПОМЕСТИТЬ ДанныеПоТрудозатратам
	|ИЗ
	|	ВТКэшРасчетныеОборотыТрудозатратыНезавершенногоПроизводства КАК ДД
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПартииПроизводстваСводно КАК ПартииПроизводства
	|	ПО ПартииПроизводства.ПартияПроизводства = ДД.ПартияПроизводства
	|	И ПартииПроизводства.Организация = ДД.Организация
	|	И ПартииПроизводства.РаспределениеЗатратНаВыпуск
	|
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (НЕ ДД.РасчетПартий
	// Добавляем сторно-движения текущего периода.
	|		ИЛИ ДД.Сторно)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДД.Подразделение,
	|	ДД.СтатьяКалькуляции,
	|	ДД.ВидРабот,
	|	ПартииПроизводства.Назначение,
	|	ПартииПроизводства.ВидДеятельностиНДС,
	|	ПартииПроизводства.НаправлениеДеятельности,
	|	ДД.Организация,
	|	ДД.ПартияПроизводства,
	|	ПартииПроизводства.АналитикаФинансовогоУчета
	|";
	
	РасчетСебестоимостиЛокализация.ДополнитьЗапросДаннымиПоТрудозатратам(Текст);
	
	Текст = Текст + ";";
	
	Если РасчетСебестоимостиВыполнен ИЛИ ДляРасшифровки Тогда
		Текст = СтрЗаменить(Текст,
			"ВТКэшРасчетныеОборотыТрудозатратыНезавершенногоПроизводства",
			"РегистрНакопления.ТрудозатратыНезавершенногоПроизводства");
		Текст = СтрЗаменить(Текст,
			"ДД.СлужебноеВидДвиженияПриход",
			"ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И ДД.Активность");
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

Функция ОтборПоМатериаламИерархия(ПараметрыРасчета) Экспорт
	
	Контекст = ПараметрыРасчета.РаспределениеПартий.ОписаниеДвижений.Контекст;
	
	Материалы = Новый ТаблицаЗначений;
	Материалы.Колонки.Добавить("Регистратор", РасчетСебестоимостиУниверсальныеАлгоритмы.ОписаниеТиповДокументов());
	Материалы.Колонки.Добавить("Материал",    Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	Запрос = Новый Запрос;
	РасчетСебестоимостиПрикладныеАлгоритмы.ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	Если Контекст = "РаспределениеНоменклатурыНаПроизводство"
		ИЛИ Контекст = "РаспределениеМатериаловИРаботПоБазе" Тогда
		
		// Этап 2
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Д.Ссылка КАК Регистратор,
		|	ТЧ.Материал КАК Материал,
		|	ТЧ.Материал.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Документ.РаспределениеПроизводственныхЗатрат.ОтборПоМатериалам КАК ТЧ
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПроизводственныхЗатрат КАК Д
		|		ПО ТЧ.Ссылка = Д.Ссылка
		|
		|ГДЕ
		|	Д.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Д.Организация В (&МассивОрганизаций)
		|	И Д.Проведен
		|	И Д.КоличествоКРаспределениюПоПравилу <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Д.Ссылка КАК Регистратор,
		|	ТЧ.Материал КАК Материал,
		|	ТЧ.Материал.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Документ.РаспределениеВозвратныхОтходов.ОтборПоМатериалам КАК ТЧ
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеВозвратныхОтходов КАК Д
		|		ПО ТЧ.Ссылка = Д.Ссылка
		|
		|ГДЕ
		|	Д.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Д.Организация В (&МассивОрганизаций)
		|	И Д.Проведен
		|	И Д.КоличествоПоПравилу <> 0
		|";
		
	ИначеЕсли Контекст = "ПрочиеРасходыНЗППоБазе_КРаспределению"
	 ИЛИ Контекст = "ПрочиеРасходыНЗППоБазе_ПоПодразделениям" 
	 ИЛИ Контекст = "ПрочиеРасходыНЗППоБазе_ПоЭтапам" Тогда
		
		// Этап 15
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Д.Ссылка КАК Регистратор,
		|	ТЧ.Материал КАК Материал,
		|	ТЧ.Материал.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Документ.РаспределениеПрочихЗатрат.ОтборПоМатериалам КАК ТЧ
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Д
		|		ПО ТЧ.Ссылка = Д.Ссылка
		|
		|ГДЕ
		|	Д.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Д.Организация В (&МассивОрганизаций)
		|	И Д.Проведен";
		
	Иначе
		
		ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Для контекста %1 не предусмотрено формирование отбора по материалам с иерархией'", ОбщегоНазначения.КодОсновногоЯзыка()),
			Контекст);
		
		РасчетСебестоимостиПротоколРасчета.ЗафиксироватьОшибкуРасчета(
			ПараметрыРасчета,
			Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаРаспределенияПартий,
			ТекстДляПротокола);
			
		ВызватьИсключение РасчетСебестоимостиПрикладныеАлгоритмы.ТекстИсключениеДляРегистрацииПроблемы(ТекстДляПротокола);
		
	КонецЕсли;

	Результат = Запрос.Выполнить().Выбрать();
	
	ЗапросИерархия = Новый Запрос;
	ЗапросИерархия.Текст =
	"ВЫБРАТЬ
	|	Н.Ссылка КАК Материал
	|ИЗ
	|	Справочник.Номенклатура КАК Н
	|ГДЕ
	|	Н.Ссылка В ИЕРАРХИИ(&Номенклатура)
	|	И НЕ Н.ЭтоГруппа";
		
	Пока Результат.Следующий() Цикл
		
		Если Результат.ЭтоГруппа Тогда
			
			ЗапросИерархия.УстановитьПараметр("Номенклатура", Результат.Материал);
			
			РезультатИерархия = ЗапросИерархия.Выполнить().Выбрать();
			
			Пока РезультатИерархия.Следующий() Цикл
				
				НоваяСтрока = Материалы.Добавить();
				НоваяСтрока.Регистратор = Результат.Регистратор;
				НоваяСтрока.Материал 	= РезультатИерархия.Материал;
				
			КонецЦикла;
			
		Иначе
			
			НоваяСтрока = Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Материалы;
	
КонецФункции

Функция ТекстРаспаковкаНаборов(ИсточникСпискаСпецификаций) Экспорт // вт МатериалыИУслугиСпецификаций
	
	ТекстыЗапросов = Новый Массив;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсточникСпискаСпецификаций.Спецификация КАК Спецификация
	|ПОМЕСТИТЬ ВТСпецификации
	|ИЗ
	|	&ИсточникСпискаСпецификаций КАК ИсточникСпискаСпецификаций
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Спецификация";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИсточникСпискаСпецификаций", ИсточникСпискаСпецификаций);
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	ТекстыЗапросов.Добавить(
		Справочники.РесурсныеСпецификации.ТекстЗапросаМатериалыСпецификацийВключаяСоставНаборов("ВТСпецификации"));
	
	ТекстЗапроса =
		"УНИЧТОЖИТЬ ВТСпецификации";
	ТекстыЗапросов.Добавить(ТекстЗапроса);
	
	Возврат СтрСоединить(ТекстыЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
КонецФункции

#КонецОбласти

#КонецОбласти