
&ИзменениеИКонтроль("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи")
Процедура асп_ПроверитьЗаполнитьОбеспечениеВДокументеПродажи(ТекущаяСтрока, Действия, КэшированныеЗначения)

	Перем ПараметрыДействия;
	Если Действия.Свойство("ПроверитьЗаполнитьОбеспечениеВДокументеПродажи", ПараметрыДействия) Тогда

		ДанныеДляОбработки = ДанныеДляОбработкиСтроки("ОбеспечениеВДокументах", КэшированныеЗначения);
		ДанныеЗаполнения = ДанныеДляОбработки[0];
		Если Не ЗначениеЗаполнено(ДанныеЗаполнения.Номенклатура) Тогда
			Возврат;
		КонецЕсли;

		ТипНоменклатуры = ДанныеЗаполнения.ТипНоменклатуры;
		Если ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
			ИмяСвойства = "Товар";
		ИначеЕсли ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа Тогда
			ИмяСвойства = "Работа";
		ИначеЕсли ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			ИмяСвойства = "Услуга";
		ИначеЕсли ТипНоменклатуры = Перечисления.ТипыНоменклатуры.МногооборотнаяТара Тогда
			ИмяСвойства = "Тара";
		#Вставка
		ИначеЕсли ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор Тогда
			ИмяСвойства = "Набор";
		#КонецВставки
		КонецЕсли;

		// Заполнение варианта обеспечения.
		ВариантОбеспеченияИФлагОбособленно = ПараметрыДействия.ВариантОбеспеченияИФлагОбособленно;

		Если ВариантОбеспеченияИФлагОбособленно = Неопределено Тогда

			ВариантИФлагВременный = ОбеспечениеВДокументахКлиентСервер.ВариантОбеспеченияИФлагОбособленноПоУмолчанию(
			ДанныеЗаполнения.ОбособленнаяЗакупкаПродажа);

			ВариантОбеспечения = ВариантИФлагВременный[ИмяСвойства].ВариантОбеспечения;
			Обособленно = ВариантИФлагВременный[ИмяСвойства].Обособленно;

		ИначеЕсли ВариантОбеспеченияИФлагОбособленно[ИмяСвойства].Обособленно = Неопределено Тогда // случай, когда вариант обеспечения переопределяется а флаг нет.

			ВариантИФлагВременный = ОбеспечениеВДокументахКлиентСервер.ВариантОбеспеченияИФлагОбособленноПоУмолчанию(
			ДанныеЗаполнения.ОбособленнаяЗакупкаПродажа);
			ВариантОбеспечения = ВариантОбеспеченияИФлагОбособленно[ИмяСвойства].ВариантОбеспечения;
			Обособленно = ВариантИФлагВременный[ИмяСвойства].Обособленно;
			Если ИмяСвойства = "Работа" Тогда
				Если Обособленно И ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется Тогда
					ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению
				ИначеЕсли Не Обособленно И ВариантОбеспечения = Перечисления.ВариантыОбеспечения.КОбеспечению Тогда
					ВариантОбеспечения = Перечисления.ВариантыОбеспечения.НеТребуется;
				КонецЕсли;
			КонецЕсли;

		Иначе

			ВариантОбеспечения = ВариантОбеспеченияИФлагОбособленно[ИмяСвойства].ВариантОбеспечения;
			Обособленно = ВариантОбеспеченияИФлагОбособленно[ИмяСвойства].Обособленно;

		КонецЕсли;

		ТекущаяСтрока.ВариантОбеспечения = ВариантОбеспечения;
		ТекущаяСтрока.Обособленно = Обособленно;

	КонецЕсли;

КонецПроцедуры
