
&После("ПередЗаписью")
Процедура асп_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// ВРЕМЕННО!!!
	//Программист = Справочники.Пользователи.НайтиПоНаименованию("Программист");
	//Если ПараметрыСеанса.ТекущийПользователь = Программист Тогда		
	//	Отказ = ложь;	                                        		
	//КонецЕсли;
	// ВРЕМЕННО!!!
КонецПроцедуры


&После("ОбработкаПроведения")
Процедура асп_ОбработкаПроведения(Отказ, РежимПроведения)
	
	//ДатаКонтроля = Константы.ДатаКонтроляВыгрузкиДокументовВБП.Получить();
	//ОбъектМодифицирован = ASP_Добавленный.СравнитьВерсииОбъекта(ЭтотОбъект); //000026792
	//Если НЕ Отказ и ЭтотОбъект.Проведен и ЭтотОбъект.Дата > ДатаКонтроля и ОбъектМодифицирован Тогда
	//	узел = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятия30.НайтиПоКоду("002");
	//	ПланыОбмена.ЗарегистрироватьИзменения(узел, ЭтотОбъект);
	//КонецЕсли;

	//++ASP Коваленко 14,03,25 000025898 Согласно задаче необходимо запретить проведение 
	Для каждого СтрокаТЧ Из ВидыЗапасов Цикл 
		Если СтрокаТЧ.АналитикаУчетаНоменклатуры.Номенклатура.ASP_Прослеживаемый И СтрокаТЧ.НомерГТД.Пустая() Тогда		
			Отказ = Истина; 
		КонецЕсли;
		Если Отказ Тогда 
			ОбщегоНазначения.СообщитьПользователю("У прослеживаемого товара " + СтрокаТЧ.АналитикаУчетаНоменклатуры.Номенклатура + " Отсутствует номер ГТД ",,,,Отказ); 
		КонецЕсли;
	КонецЦикла;  
	//--ASP Коваленко 14,03,25 000025898
КонецПроцедуры


&После("ПриЗаписи")
Процедура асп_ПриЗаписи(Отказ)
	//++ASP_Kalyanin 000027461 09.07.25
	//Перенес данную доработку из обработки проведения тк при отметке на удаление документ не проводится и не попадает в обмен
	УстановитьПривилегированныйРежим(Истина);
	ДатаКонтроля = Константы.ДатаКонтроляВыгрузкиДокументовВБП.Получить();
	ОбъектМодифицирован = ASP_Добавленный.СравнитьВерсииОбъекта(ЭтотОбъект); //000026792
	Если НЕ Отказ и ЭтотОбъект.Дата > ДатаКонтроля и ОбъектМодифицирован Тогда
		узел = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятия30.НайтиПоКоду("002");
		ПланыОбмена.ЗарегистрироватьИзменения(узел, ЭтотОбъект);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	//--ASP_Kalyanin 000027461 09.07.25
КонецПроцедуры

