
&ИзменениеИКонтроль("СообщитьОРезультатахКонтроляИзменений")
Процедура асп_СообщитьОРезультатахКонтроляИзменений(РезультатыКонтроля, Документ, Отказ)

	#Область ТоварыКОформлениюДокументовИмпорта

	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияТоварыКОформлениюДокументовИмпортаИзменение") Тогда
		
		#Вставка
		Если Документ.ДополнительныеСвойства.Свойство("ПропуститьПроверкуТоварыКОформлениюДокументовИмпорта") Тогда
			Возврат;
		КонецЕсли;
		#КонецВставки
		ШаблонСообщенияБезПоступления = НСтр("ru = 'Номенклатура %1
		|Количество товара к оформлению не соответствует количеству в документе поступления на %2 %3'");
		ШаблонСообщенияСПоступлением = ШаблонСообщенияБезПоступления + " " + НСтр("ru = '(см. документ %4)'");

		ШаблонСообщенияБезПоступленияАренда = НСтр("ru = 'Сумма услуг к оформлению не соответствует сумме в документе поступления на %1 %2'");
		ШаблонСообщенияСПоступлениемАренда = ШаблонСообщенияБезПоступленияАренда + " " + НСтр("ru = '(см. документ %3)'");

		Для каждого СтрокаОшибки Из РезультатыКонтроля.ОшибкиТоварыКОформлениюДокументовИмпорта Цикл


			ПредставлениеНоменклатуры = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(СтрокаОшибки.Номенклатура,
			СтрокаОшибки.Характеристика);

			Если ЗначениеЗаполнено(СтрокаОшибки.ДокументПоступления) Тогда
				ТекстСообщения = СтрШаблон(ШаблонСообщенияСПоступлением, ПредставлениеНоменклатуры,
				-СтрокаОшибки.Количество, СтрокаОшибки.ЕдиницаИзмерения, СтрокаОшибки.ДокументПоступления);
			Иначе
				ТекстСообщения = СтрШаблон(ШаблонСообщенияБезПоступления, ПредставлениеНоменклатуры,
				-СтрокаОшибки.Количество, СтрокаОшибки.ЕдиницаИзмерения);
			КонецЕсли;


			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ,,, Отказ);

		КонецЦикла;

	КонецЕсли;

	#КонецОбласти

	#Область ТоварыКОформлениюЗаявленийОВвозе

	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ТоварыКОформлениюЗаявленийОВвозеИзменение") Тогда

		ШаблонСообщенияБезПоступления = НСтр("ru = 'Номенклатура %1
		|Количество товара к оформлению не соответствует количеству в документе поступления на %2 %3'");
		ШаблонСообщенияСПоступлением = ШаблонСообщенияБезПоступления + " " + НСтр("ru = '(см. документ %4)'");

		Для каждого СтрокаОшибки Из РезультатыКонтроля.ОшибкиТоварыКОформлениюЗаявленийОВвозе Цикл

			ПредставлениеНоменклатуры = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(СтрокаОшибки.Номенклатура,
			СтрокаОшибки.Характеристика);

			Если ЗначениеЗаполнено(СтрокаОшибки.ДокументПоступления) Тогда
				ТекстСообщения = СтрШаблон(ШаблонСообщенияСПоступлением, ПредставлениеНоменклатуры,
				-СтрокаОшибки.КОформлению, СтрокаОшибки.ЕдиницаИзмерения, СтрокаОшибки.ДокументПоступления);
			Иначе
				ТекстСообщения = СтрШаблон(ШаблонСообщенияБезПоступления, ПредставлениеНоменклатуры,
				-СтрокаОшибки.КОформлению, СтрокаОшибки.ЕдиницаИзмерения);
			КонецЕсли;

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Документ,,, Отказ);

		КонецЦикла;

	КонецЕсли;

	#КонецОбласти

КонецПроцедуры
