
&ИзменениеИКонтроль("РегистраторыСДвижениямиПриВыключенномУчетеСебестоимости")
Функция асп_РегистраторыСДвижениямиПриВыключенномУчетеСебестоимости()
	
	ПереченьРегистраторов = Новый Соответствие;
	
	ПереченьРегистраторов.Вставить(Метаданные.Документы.ВводОстатков       , Истина);
	ПереченьРегистраторов.Вставить(Метаданные.Документы.ВводОстатковТоваров, Истина);
	ПереченьРегистраторов.Вставить(Метаданные.Документы.ВводОстатковПрочиеРасходы, Истина);
	ПереченьРегистраторов.Вставить(Метаданные.Документы.РасчетСебестоимостиТоваров, Истина);

	//++ НЕ УТ
	ПереченьРегистраторов.Вставить(Метаданные.Документы.ВводОстатковВнеоборотныхАктивов2_4, Истина);
	//-- НЕ УТ
	#Вставка
	ПереченьРегистраторов.Вставить(Метаданные.Документы.ТаможеннаяДекларацияИмпорт, Истина);
	#КонецВставки
	
	Возврат ПереченьРегистраторов;
	
КонецФункции
