
&НаКлиенте
Функция ТаблицуИнтерваловВМассив()
    Рез=Новый Массив();
    Для Каждого Стр из ТаблицаИнтервалов Цикл
        Рез.Добавить(Новый Структура("Наименование,Начало,Конец",Стр.Наименование,Стр.Начало,Стр.Конец));
    КонецЦикла;
    Возврат Рез;
КонецФункции

&НаКлиенте
Процедура КомандаНастройкаИнтервалов(Команда)
    Мас=ТаблицуИнтерваловВМассив();
	ОткрытьФорму("Отчет.ВыручкаИСебестоимостьПоГруппамКонтрагентов.Форма.ФормаНастройкиИнтервалов",Новый Структура("ТаблицаИнтервалов",Мас),ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиИнтерваловОтчета()
	СтруктураПП=Новый Структура();
	СтруктураПП.Вставить("ПроцентОтОбъемаПродаж",Неопределено);
	СтруктураПП.Вставить("ПроцентОтПрибыли",Неопределено);
	СтруктураПП.Вставить("КоличествоПартнеров",Неопределено);
	СтруктураПП.Вставить("КоличествоКлиентовПроцент",Неопределено);
	СтруктураПП.Вставить("СуммаАнализаДиаграмма",Неопределено);
	СтруктураПП.Вставить("ПроцентОтОбъемаПродажДиаграмма",Неопределено);
	СтруктураПП.Вставить("СредниеПродажиНаЗаказДиаграмма",Неопределено);
	
	СтрокиУдаления=Новый Массив();
	Для Каждого Стр из Отчет.КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы Цикл
	    Попытка
	    	ЕстьСвойство=СтруктураПП.Свойство(Стр.Заголовок);
	    Исключение
	        ЕстьСвойство=Ложь;
	    КонецПопытки;
	    Если ЕстьСвойство Тогда
	        СтруктураПП.Вставить(Стр.Заголовок,Стр);
	    Иначе
	        СтрокиУдаления.Добавить(Стр);
	    КонецЕсли;
	КонецЦикла;
	Для Каждого Стр из СтрокиУдаления Цикл
    	Отчет.КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы.Удалить(Стр);
    КонецЦикла;
    
    ОсновнаяТаблица=Неопределено;
    ДиаграммаОбъемПродаж=Неопределено;
    ДиаграммаОбъемПродажПроцент=Неопределено;
    ДиаграммаКоличествоПартнеров=Неопределено;
    ДиаграммаПроцентКлиентов=Неопределено;
    ДиаграммаСредниеПродажиНаЗаказ=Неопределено;
    Для Каждого Стр из Отчет.КомпоновщикНастроек.Настройки.Структура Цикл
        Если ТипЗнч(Стр)=Тип("ТаблицаКомпоновкиДанных") и Стр.Имя="ОсновнаяТаблица" Тогда
            ОсновнаяТаблица=Стр;
            ОсновнаяТаблица.Колонки.Очистить();
        КонецЕсли;
        Если ТипЗнч(Стр)=Тип("ДиаграммаКомпоновкиДанных") и Стр.Имя="ДиаграммаОбъемПродаж" Тогда
            ДиаграммаОбъемПродаж=Стр;
            ДиаграммаОбъемПродаж.Точки.Очистить();
        КонецЕсли;
        Если ТипЗнч(Стр)=Тип("ДиаграммаКомпоновкиДанных") и Стр.Имя="ДиаграммаОбъемПродажПроцент" Тогда
            ДиаграммаОбъемПродажПроцент=Стр;
            ДиаграммаОбъемПродажПроцент.Точки.Очистить();
        КонецЕсли;
        Если ТипЗнч(Стр)=Тип("ДиаграммаКомпоновкиДанных") и Стр.Имя="ДиаграммаКоличествоПартнеров" Тогда
            ДиаграммаКоличествоПартнеров=Стр;
            ДиаграммаКоличествоПартнеров.Точки.Очистить();
        КонецЕсли;
        Если ТипЗнч(Стр)=Тип("ДиаграммаКомпоновкиДанных") и Стр.Имя="ДиаграммаПроцентКлиентов" Тогда
            ДиаграммаПроцентКлиентов=Стр;
            ДиаграммаПроцентКлиентов.Точки.Очистить();
        КонецЕсли;
        Если ТипЗнч(Стр)=Тип("ДиаграммаКомпоновкиДанных") и Стр.Имя="ДиаграммаСредниеПродажиНаЗаказ" Тогда
            ДиаграммаСредниеПродажиНаЗаказ=Стр;
            ДиаграммаСредниеПродажиНаЗаказ.Точки.Очистить();
        КонецЕсли;
    КонецЦикла;
    
    ТекстДетальныхЗаписей="
      					   |Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец Тогда 0 Иначе
    					   |Выбор
						   |	Когда Идн = ""ОбъемПродаж""
						   |		Тогда СуммаАнализа
						   |	Когда Идн = ""ОбъемПрибыли""
						   |		Тогда СуммаАнализа2
						   |	Когда Идн = ""ОбъемПродажПроцент""
						   |		Тогда 100*СуммаАнализа/СуммаАнализаИтог
						   |	Когда Идн = ""ОбъемПрибылиПроцент""
						   |		Тогда 100*СуммаАнализа2/СуммаАнализаИтог2
						   |	Когда Идн = ""КоличествоКлиентов""
						   |		Тогда 1
						   |	Когда Идн = ""КоличествоКлиентовПроцент""
						   |		Тогда 1
						   |	Когда Идн = ""СредниеПродажи""
						   |		Тогда СуммаАнализа
						   |	Когда Идн = ""КоличествоЗаказов""
						   |		Тогда 1
						   |	Когда Идн = ""КоличествоЗаказовПроцент""
						   |		Тогда 1
						   |	Когда Идн = ""СредниеПродажиНаЗаказ""
						   |		Тогда СуммаАнализа
						   |    Иначе 0
						   |Конец Конец";
	ТекстИтоговыхЗаписей="
						   |Выбор
						   |	Когда Идн = ""ОбъемПродаж""
						   |		Тогда Сумма(Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец Тогда 0 Иначе СуммаАнализа Конец)
						   |	Когда Идн = ""ОбъемПрибыли""
						   |		Тогда Сумма(Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец Тогда 0 Иначе СуммаАнализа2 Конец)
						   |	Когда Идн = ""ОбъемПродажПроцент""
						   |		Тогда 100*Сумма(Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец Тогда 0 Иначе СуммаАнализа Конец)/Максимум(СуммаАнализаИтог)
						   |	Когда Идн = ""ОбъемПрибылиПроцент""
						   |		Тогда 100*Сумма(Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец Тогда 0 Иначе СуммаАнализа2 Конец)/Максимум(СуммаАнализаИтог2)
						   
						   |	Когда Идн = ""КоличествоКлиентов""
						   |		Тогда Количество(Различные Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец Тогда 1 Иначе Партнер Конец)-Максимум(Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец Тогда 1 Иначе 0 Конец)
						   |	Когда Идн = ""КоличествоКлиентовПроцент""
						   |		Тогда 100*(Количество(Различные Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец Тогда 1 Иначе Партнер Конец)-Максимум(Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец Тогда 1 Иначе 0 Конец))/Максимум(КоличествоПартнеровИтог)
						   |	Когда Идн = ""СредниеПродажи""
						   |		Тогда Сумма(Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец Тогда 0 Иначе СуммаАнализа Конец)/(Количество(Различные Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец Тогда 1 Иначе Партнер Конец)-Максимум(Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец Тогда 1 Иначе 0 Конец))
						   
						   |	Когда Идн = ""КоличествоЗаказов""
						   |		Тогда Количество(Различные Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец или ЗаказКлиента=Неопределено Тогда 1 Иначе ЗаказКлиента Конец)-Максимум(Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец или ЗаказКлиента=Неопределено Тогда 1 Иначе 0 Конец)
						   |	Когда Идн = ""КоличествоЗаказовПроцент""
						   |		Тогда 100*(Количество(Различные Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец или ЗаказКлиента=Неопределено Тогда 1 Иначе ЗаказКлиента Конец)-Максимум(Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец или ЗаказКлиента=Неопределено Тогда 1 Иначе 0 Конец))/Максимум(КоличествоЗаказовИтог)
						   |	Когда Идн = ""СредниеПродажиНаЗаказ""
						   |		Тогда Сумма(Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец Тогда 0 Иначе СуммаАнализа Конец)/(Количество(Различные Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец или ЗаказКлиента=Неопределено Тогда 1 Иначе ЗаказКлиента Конец)-Максимум(Выбор Когда СуммаАнализаПартнер<#Начало или СуммаАнализаПартнер>#Конец или ЗаказКлиента=Неопределено Тогда 1 Иначе 0 Конец))
						   
						   |    Иначе 0
						   |Конец Конец";
    
	УслОформлениеСумм=Отчет.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Получить(0);
	УслОформлениеСумм.Поля.Элементы.Очистить();
    Для Каждого Стр из ТаблицаИнтервалов Цикл
        НовоеПоле=Отчет.КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы.Добавить(Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных"));
        НовоеПоле.Заголовок=Стр.Наименование;
        НовоеПоле.Использование=Истина;
        НовоеПоле.УстановитьВыражениеДетальныхЗаписей(СтрЗаменить(СтрЗаменить(ТекстДетальныхЗаписей,"#Начало",Формат(Стр.Начало,"ЧРД=.; ЧН=0; ЧГ=")),"#Конец",Формат(Стр.Конец,"ЧРД=.; ЧН=0; ЧГ=")));
        НовоеПоле.УстановитьВыражениеИтоговыхЗаписей(СтрЗаменить(СтрЗаменить(ТекстИтоговыхЗаписей,"#Начало",Формат(Стр.Начало,"ЧРД=.; ЧН=0; ЧГ=")),"#Конец",Формат(Стр.Конец,"ЧРД=.; ЧН=0; ЧГ=")));
        
        НовоеПолеТ=Отчет.КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы.Добавить(Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных"));
        НовоеПолеТ.Заголовок="Текст: "+Стр.Наименование;
        НовоеПолеТ.Использование=Истина;
        НовоеПолеТ.УстановитьВыражениеДетальныхЗаписей(""""+Стр.Наименование+"""");
        НовоеПолеТ.УстановитьВыражениеИтоговыхЗаписей(""""+Стр.Наименование+"""");
        
        НоваяГруппировка=ОсновнаяТаблица.Колонки.Добавить();
        
		//НовоеПолеГруппировки=НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		//НовоеПолеГруппировки.Использование=Истина;
        
        НовоеПолеВыбора=НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
        НовоеПолеВыбора.Поле=Новый ПолеКомпоновкиДанных(НовоеПоле.ПутьКДанным);
        НовоеПолеВыбора.Использование=Истина;
        
        НовыйОтбор=НоваяГруппировка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        НовыйОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
        НовыйОтбор.Использование=Истина;
        НовыйОтбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("СуммаАнализаПартнер");
        НовыйОтбор.ПравоеЗначение=Стр.Начало;
        
        НовыйОтбор=НоваяГруппировка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        НовыйОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
        НовыйОтбор.Использование=Истина;
        НовыйОтбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("СуммаАнализаПартнер");
        НовыйОтбор.ПравоеЗначение=Стр.Конец;
        
        ПолеОформления=УслОформлениеСумм.Поля.Элементы.Добавить();
        ПолеОформления.Поле=Новый ПолеКомпоновкиДанных(НовоеПоле.ПутьКДанным);
        ПолеОформления.Использование=Истина;
        
        //Диаграмма Объем продаж
        НоваяГруппировка=ДиаграммаОбъемПродаж.Точки.Добавить();
        НовоеПолеВыбора=НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
        НовоеПолеВыбора.Поле=Новый ПолеКомпоновкиДанных(НовоеПолеТ.ПутьКДанным);
        НовоеПолеВыбора.Использование=Истина;
        
        НовыйОтбор=НоваяГруппировка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        НовыйОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
        НовыйОтбор.Использование=Истина;
        НовыйОтбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("СуммаАнализаПартнер");
        НовыйОтбор.ПравоеЗначение=Стр.Начало;
        
        НовыйОтбор=НоваяГруппировка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        НовыйОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
        НовыйОтбор.Использование=Истина;
        НовыйОтбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("СуммаАнализаПартнер");
        НовыйОтбор.ПравоеЗначение=Стр.Конец;
        
        //Диаграмма ДиаграммаОбъемПродажПроцент
        НоваяГруппировка=ДиаграммаОбъемПродажПроцент.Точки.Добавить();
        НовоеПолеВыбора=НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
        НовоеПолеВыбора.Поле=Новый ПолеКомпоновкиДанных(НовоеПолеТ.ПутьКДанным);
        НовоеПолеВыбора.Использование=Истина;
        
        НовыйОтбор=НоваяГруппировка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        НовыйОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
        НовыйОтбор.Использование=Истина;
        НовыйОтбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("СуммаАнализаПартнер");
        НовыйОтбор.ПравоеЗначение=Стр.Начало;
        
        НовыйОтбор=НоваяГруппировка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        НовыйОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
        НовыйОтбор.Использование=Истина;
        НовыйОтбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("СуммаАнализаПартнер");
        НовыйОтбор.ПравоеЗначение=Стр.Конец;
        
        //Диаграмма ДиаграммаКоличествоПартнеров
        НоваяГруппировка=ДиаграммаКоличествоПартнеров.Точки.Добавить();
        НовоеПолеВыбора=НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
        НовоеПолеВыбора.Поле=Новый ПолеКомпоновкиДанных(НовоеПолеТ.ПутьКДанным);
        НовоеПолеВыбора.Использование=Истина;
        
        НовыйОтбор=НоваяГруппировка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        НовыйОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
        НовыйОтбор.Использование=Истина;
        НовыйОтбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("СуммаАнализаПартнер");
        НовыйОтбор.ПравоеЗначение=Стр.Начало;
        
        НовыйОтбор=НоваяГруппировка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        НовыйОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
        НовыйОтбор.Использование=Истина;
        НовыйОтбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("СуммаАнализаПартнер");
        НовыйОтбор.ПравоеЗначение=Стр.Конец;
        
        //Диаграмма ДиаграммаПроцентКлиентов
        НоваяГруппировка=ДиаграммаПроцентКлиентов.Точки.Добавить();
        НовоеПолеВыбора=НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
        НовоеПолеВыбора.Поле=Новый ПолеКомпоновкиДанных(НовоеПолеТ.ПутьКДанным);
        НовоеПолеВыбора.Использование=Истина;
        
        НовыйОтбор=НоваяГруппировка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        НовыйОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
        НовыйОтбор.Использование=Истина;
        НовыйОтбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("СуммаАнализаПартнер");
        НовыйОтбор.ПравоеЗначение=Стр.Начало;
        
        НовыйОтбор=НоваяГруппировка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        НовыйОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
        НовыйОтбор.Использование=Истина;
        НовыйОтбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("СуммаАнализаПартнер");
        НовыйОтбор.ПравоеЗначение=Стр.Конец;
        
        //Диаграмма ДиаграммаСредниеПродажиНаЗаказ
		Если ДиаграммаСредниеПродажиНаЗаказ<>Неопределено Тогда
			НоваяГруппировка=ДиаграммаСредниеПродажиНаЗаказ.Точки.Добавить();
			НовоеПолеВыбора=НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			НовоеПолеВыбора.Поле=Новый ПолеКомпоновкиДанных(НовоеПолеТ.ПутьКДанным);
			НовоеПолеВыбора.Использование=Истина;
			
			НовыйОтбор=НоваяГруппировка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
			НовыйОтбор.Использование=Истина;
			НовыйОтбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("СуммаАнализаПартнер");
			НовыйОтбор.ПравоеЗначение=Стр.Начало;
			
			НовыйОтбор=НоваяГруппировка.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйОтбор.ВидСравнения=ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
			НовыйОтбор.Использование=Истина;
			НовыйОтбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("СуммаАнализаПартнер");
			НовыйОтбор.ПравоеЗначение=Стр.Конец;
		КонецЕсли;
    КонецЦикла;
    
    
    //Итоги
	НовоеПоле=Отчет.КомпоновщикНастроек.Настройки.ПользовательскиеПоля.Элементы.Добавить(Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных"));
	НовоеПоле.Заголовок="Итого";
	НовоеПоле.Использование=Истина;
	НовоеПоле.УстановитьВыражениеДетальныхЗаписей(СтрЗаменить(СтрЗаменить(ТекстДетальныхЗаписей,"#Начало",Формат(0,"ЧРД=.; ЧН=0; ЧГ=")),"#Конец",Формат(9999999999999999999999,"ЧРД=.; ЧН=0; ЧГ=")));
	НовоеПоле.УстановитьВыражениеИтоговыхЗаписей(СтрЗаменить(СтрЗаменить(ТекстИтоговыхЗаписей,"#Начало",Формат(0,"ЧРД=.; ЧН=0; ЧГ=")),"#Конец",Формат(9999999999999999999999,"ЧРД=.; ЧН=0; ЧГ=")));
	
	НоваяГруппировка=ОсновнаяТаблица.Колонки.Добавить();
	
	НовоеПолеВыбора=НоваяГруппировка.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
	НовоеПолеВыбора.Поле=Новый ПолеКомпоновкиДанных(НовоеПоле.ПутьКДанным);
	НовоеПолеВыбора.Использование=Истина;
	
	ПолеОформления=УслОформлениеСумм.Поля.Элементы.Добавить();
	ПолеОформления.Поле=Новый ПолеКомпоновкиДанных(НовоеПоле.ПутьКДанным);
	ПолеОформления.Использование=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение)=Тип("Структура") и ВыбранноеЗначение.Свойство("Команда") и ВыбранноеЗначение.Команда="Интервал" Тогда
		ТаблицаИнтервалов.Очистить();
		Для Каждого Стр из ВыбранноеЗначение.Данные Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаИнтервалов.Добавить(),Стр);
		КонецЦикла;
		
		ЗаполнитьНастройкиИнтерваловОтчета();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииВариантаНаСервере(Настройки)
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДополнительныеДанные", Новый ХранилищеЗначения(Новый Структура("ТаблицаИнтервалов",РеквизитФормыВЗначение("ТаблицаИнтервалов"))));
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	Если Настройки<>Неопределено Тогда
		Пар=Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДополнительныеДанные"));	
		Если ТипЗнч(Пар.Значение)=Тип("ХранилищеЗначения") и ТипЗнч(Пар.Значение.Получить())=Тип("Структура") Тогда
			ЗначениеВРеквизитФормы(Пар.Значение.Получить().ТаблицаИнтервалов,"ТаблицаИнтервалов");
			ЗаполнитьНастройкиИнтерваловОтчета();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСтандартныеНастройкиНаСервере()
	ОтчетОбъект=РеквизитФормыВЗначение("Отчет");
	СКД=ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
    ЗаполнитьНастройкиИнтерваловОтчета();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСтандартныеНастройки(Команда)
	ЗагрузитьСтандартныеНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	ВариантыОтчетов.ПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
КонецПроцедуры
