
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	#Область СтандартныеМеханизмы
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаГлобальныеКоманды);
	// Конец ИнтеграцияС1СДокументооборотом
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	#КонецОбласти

	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	
	ДоступныеХозяйственныеОперации = Новый Массив;
	ДоступныеХозяйственныеОперации.Добавить(Перечисления.ХозяйственныеОперации.СписаниеЗадолженностиПодотчетногоЛица);
	ДоступныеХозяйственныеОперации.Добавить(Перечисления.ХозяйственныеОперации.ОтнесениеНаДоходыЗадолженностиПередПодотчетнымЛицом);
	
	ПолноеИмяДокумента = "Документ.КорректировкаРасчетовСПодотчетнымиЛицами";
	ТипДокумента       = Тип("ДокументСсылка.КорректировкаРасчетовСПодотчетнымиЛицами");
	ИдентификаторДокумента =
			ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяДокумента);
	
	Для Каждого ДоступнаяХозОперация Из ДоступныеХозяйственныеОперации Цикл
		
		Строка = ХозяйственныеОперацииИДокументы.Добавить();
		Строка.ДобавитьКнопкуСоздать    = Истина;
		Строка.ПравоДоступаДобавление   = Истина;
		Строка.ПравоДоступаИзменение    = Истина;
		Строка.Отбор                    = Истина;
		Строка.ТипДокумента             = ТипДокумента;
		Строка.ПолноеИмяДокумента       = ПолноеИмяДокумента;
		Строка.ХозяйственнаяОперация    = ДоступнаяХозОперация;
		Строка.ИдентификаторОбъектаМетаданных = ИдентификаторДокумента;
		
		СтруктураПараметров =
			ОбщегоНазначенияУТ.СтруктураПараметровНастройкиКнопокУправленияДокументами();
		СтруктураПараметров.Форма = ЭтотОбъект;
		ОбщегоНазначенияУТ.НастроитьКнопкиУправленияДокументами(СтруктураПараметров);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_СоздатьДокумент(Команда)
	ОбщегоНазначенияУТКлиент.СоздатьДокументЧерезКоманду(Команда.Имя, Новый Структура);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти