&НаКлиенте
Процедура СформироватьДокументы(Команда)
	СформироватьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьДокументыНаСервере()
	Объект.ДатаФормирования = ТекущаяДата();
	Если  Объект.СкладПроизводства.Пустая() Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Надо выбрать склад!";
		Сообщение.Сообщить();
	Возврат; 
	КонецЕсли;

    Если  Объект.Организация.Пустая() Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана организация!";
		Сообщение.Сообщить();
	Возврат; 
	КонецЕсли;

     Если  Объект.СборкаПодДеятельность.Пустая() Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Поле Сборка под деятельность не заполнено!";
		Сообщение.Сообщить();
		Возврат; 
	 КонецЕсли;

		Для Каждого Продукт из Объект.Продукция Цикл
			Док 					= Документы.СборкаТоваров.СоздатьДокумент();
			Док.Дата 				= Объект.ДатаФормирования;
			//ASP_Dante 07/10/19Док.ТипОперации 		= Перечисления.ТипыОперацийЗаказаНаСборку.СборкаИзКомплектующих;
			Док.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СборкаТоваров;
			//ASP_Dante 07/10/19
			Док.Организация			= Объект.Организация;
			Док.Склад				= Объект.СкладПроизводства;
			Док.Номенклатура		= Продукт.Номенклатура;
			Док.ВариантКомплектации	= Продукт.Комплектация;
			Док.Количество			= Продукт.Количество;
			Док.КоличествоУпаковок 	= Продукт.Количество;
			Док.Ответственный 		= Пользователи.ТекущийПользователь();
			Док.Статус				= Перечисления.СтатусыСборокТоваров.СобраноРазобрано;
			Док.Подразделение 		= Док.Ответственный.Подразделение;
			Док.СборкаПодДеятельность = Объект.СборкаПодДеятельность;
			Док.Комментарий			= "### Создан АвтоматическимСозданиемКомплектаций  "+ТекущаяДата();
			Док.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным;
		   	Для Каждого Компонент из Док.ВариантКомплектации.Товары Цикл
				СтрокаДокумента						= Док.Товары.Добавить();
				СтрокаДокумента.Номенклатура 		= Компонент.Номенклатура;
				СтрокаДокумента.Количество 			= Компонент.Количество*Продукт.Количество;
				СтрокаДокумента.КоличествоУпаковок 			= Компонент.КоличествоУпаковок*Продукт.Количество;
			КонецЦикла;
			//СтрокаДокумента.Номенклатура 		= Продукт.Комп1;
			//СтрокаДокумента.Характеристика 		= Продукт.ХарактеристикаКомп1;
			//СтрокаДокумента.КоличествоУпаковок 	= Продукт.КоличествоКомпл1;
			//СтрокаДокумента.Количество 			= Продукт.КоличествоКомпл1;
			//СтрокаДокумента						= Док.Товары.Добавить();
			//СтрокаДокумента.Номенклатура 		= Продукт.Комп2;
			//СтрокаДокумента.Характеристика 		= Продукт.ХарактеристикаКомп2;
			//СтрокаДокумента.КоличествоУпаковок 	= Продукт.КоличествоКомпл2;
			//СтрокаДокумента.Количество 			= Продукт.КоличествоКомпл2;
			//
			Попытка
				//Док.Записать(РежимЗаписиДокумента.Запись);
				Док.Записать(РежимЗаписиДокумента.Проведение);
				СообщитьПользователю(Строка(Док)+" записан и проведен",Док);
			Исключение
				СообщитьПользователю("Документ не проведен " +ОписаниеОшибки());
			КонецПопытки;
			СтрокаОбработки   = Объект.Результат.Добавить();
			СтрокаОбработки.Документ   = Док.Ссылка;
			СтрокаОбработки.Номенклатура = Док.Номенклатура;
			СтрокаОбработки.Проведен   = Док.Проведен;
		КонецЦикла;
	
КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ДатаФормирования = ТекущаяДата();
	ЭтаФорма.УсловноеОформление.Элементы.Очистить();
	Объект.Организация = Справочники.Организации.НайтиПоНаименованию("ООО ""Горторгснаб""",1,,);
	Объект.СборкаПодДеятельность = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
КонецПроцедуры

&НаКлиенте
Процедура ПродукцияНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
	ТекущаяСтрока.Комплектация = ПолучитьКомплектацию(ТекущаяСтрока.Номенклатура);
	КонецПроцедуры

&НаСервере
Процедура СообщитьПользователю(ТекстCообщения, ОбъектСообщения = Неопределено);
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстCообщения;
	Сообщение.УстановитьДанные(ОбъектСообщения);
	Сообщение.Сообщить();
КонецПроцедуры

&НаСервере
Функция ПолучитьКомплектацию(Номенклатура);
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатуры.Ссылка,
		|	ВариантыКомплектацииНоменклатуры.Основной
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
		|ГДЕ
		|	ВариантыКомплектацииНоменклатуры.Владелец = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Основной = Истина 
			Тогда 
			
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
			Иначе Комплектация = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
	КонецЦикла;
	Возврат Комплектация;
	 сообщить(Комплектация);
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
КонецФункции

&НаКлиенте
Процедура РезультатДокументНажатие(Элемент, СтандартнаяОбработка)
	ПоказатьЗначение(,Элементы.Результат.ТекущиеДанные.Документ);
КонецПроцедуры

&НаКлиенте
Процедура ПодборТоваров(Команда)
ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор",Ложь,Истина);
ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, ЭтаФорма)

КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл      
НоваяСтрока = Объект.Продукция.Добавить();
НоваяСтрока.Номенклатура = ВыбранныйЭлемент;
НоваяСтрока.Комплектация = ПолучитьКомплектацию(ВыбранныйЭлемент);
КонецЦикла;

КонецПроцедуры







