
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГиперссылкаПерейтиНаСайтЯндексНажатие(Элемент)
	
	Адрес = АдресАвторизации();
		
	#Если НЕ ВебКлиент Тогда
		ЗапуститьПриложение(Адрес);
	#КонецЕсли
	#Если ВебКлиент Тогда
		ПерейтиПоНавигационнойСсылке(Адрес);
   	#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Функция АдресАвторизации()
	
	Адрес = ИнтеграцияСЯндексМаркетСервер.АдресАвторизации();
	
	Возврат Адрес;

КонецФункции

&НаКлиенте
Процедура ОтменаПодключения(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ПодключитьНаСервере(Результат)
	
	ДанныеАвторизацииУстановлены = Ложь;
	Сервер = ИнтеграцияСЯндексМаркетСервер.СерверАвторизации();
	
	Попытка			
		ИнтернетПрокси = Неопределено;
		Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
			МодульПолучениеФайловИзИнтернета = ОбщегоНазначения.ОбщийМодуль("ПолучениеФайловИзИнтернета");
			ИнтернетПрокси = МодульПолучениеФайловИзИнтернета.ПолучитьПрокси("https");
		КонецЕсли;
		СоединениеOpenSSL = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
		HTTP = Новый HTTPСоединение(Сервер,,,,ИнтернетПрокси,60,СоединениеOpenSSL);
	Исключение
		ТекстОшибки = НСтр("ru = 'Отсутствует соединение с сервером '" + Сервер);		
		ТекстОписанияСобытия = НСтр("ru = 'Отсутствует соединение с сервером '"+Сервер);
		ЗаписьЖурналаРегистрации(ТекстОписанияСобытия, УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
	
	КонецПопытки;
	
	HTTPЗапрос = ИнтеграцияСЯндексМаркетСервер.ЗапросПолучитьТокеныПоКоду(ВременныйКод);
	
	Попытка
		HTTPОтвет = HTTP.ОтправитьДляОбработки(HTTPЗапрос);  
		СтрокаОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
    	ЧтениеJSON = Новый ЧтениеJSON;
    	ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
    	СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
		КодСостояния = HTTPОтвет.КодСостояния; 
	Исключение 
		ТекстОшибки = НСтр("ru = 'Ошибка выполнения запроса '");	
		ТекстОписанияСобытия = НСтр("ru = 'Ошибка выполнения запроса '; "+HTTPЗапрос.ПолучитьТелоКакСтроку());
		ЗаписьЖурналаРегистрации(ТекстОписанияСобытия, УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
	КонецПопытки;	
	
	Если КодСостояния = 200  Тогда
		// обработать раздел errors в структуре ответа
		ДанныеАвторизации = ИнтеграцияСЯндексМаркетСервер.ДанныеАвторизации(СтруктураОтвета);
		Если ИнтеграцияСЯндексМаркетСервер.УстановитьНастройкиАвторизации(ДанныеАвторизации, Организация, НомерМагазина) Тогда	
			ДанныеАвторизацииУстановлены = Истина;
		Иначе 
			ДанныеАвторизацииУстановлены = Ложь;
		КонецЕсли;
	Иначе
		ТекстОшибки = НСтр("ru = 'Ошибка выполнения запроса '");	
		ТекстОписанияСобытия = НСтр("ru = 'Ошибка выполнения запроса: '; "+КодСостояния + ", "+HTTPЗапрос.ПолучитьТелоКакСтроку());
		ЗаписьЖурналаРегистрации(ТекстОписанияСобытия, УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);		
	КонецЕсли;
	
	Если Не ДанныеАвторизацииУстановлены Тогда
		
		HTTPЗапрос = ИнтеграцияСЯндексМаркетСервер.ЗапросОбновитьТокеныДоступа(Организация);
		
		Попытка
			HTTPОтвет = HTTP.ОтправитьДляОбработки(HTTPЗапрос);  
			СтрокаОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(СтрокаОтвета);
			СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
			КодСостояния = HTTPОтвет.КодСостояния; 
		Исключение 
			ТекстОшибки = НСтр("ru = 'Ошибка выполнения запроса '");	
			ТекстОписанияСобытия = НСтр("ru = 'Ошибка выполнения запроса '; "+HTTPЗапрос.ПолучитьТелоКакСтроку());
			ЗаписьЖурналаРегистрации(ТекстОписанияСобытия, УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
		КонецПопытки;	   
		
		Если КодСостояния = 200 И СтруктураОтвета.status = "OK" Тогда
			// обработать раздел errors в структуре ответа
			ДанныеАвторизации = ИнтеграцияСЯндексМаркетСервер.ДанныеАвторизации(СтруктураОтвета);
			Если ИнтеграцияСЯндексМаркетСервер.УстановитьНастройкиАвторизации(ДанныеАвторизации, Организация, НомерМагазина) Тогда	
				ДанныеАвторизацииУстановлены = Истина;
			Иначе 
				ДанныеАвторизацииУстановлены = Ложь;
			КонецЕсли;
		Иначе
			ТекстОшибки = НСтр("ru = 'Ошибка выполнения запроса '");	
			ТекстОписанияСобытия = НСтр("ru = 'Ошибка выполнения запроса: '; "+КодСостояния + ", "+HTTPЗапрос.ПолучитьТелоКакСтроку());
			ЗаписьЖурналаРегистрации(ТекстОписанияСобытия, УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);		
		КонецЕсли;

	КонецЕсли;
	
	Результат = ДанныеАвторизацииУстановлены;
	
	УчетнаяЗаписьЯндексМаркет = ИнтеграцияСЯндексМаркетСервер.УчетнаяЗаписьЯндексМаркет();
	НачатьТранзакцию();
	Попытка                   
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.УчетныеЗаписиМаркетплейсов");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", УчетнаяЗаписьЯндексМаркет);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Блокировка.Заблокировать();
		УчетнаяЗаписьЯндексМаркетобъект = УчетнаяЗаписьЯндексМаркет.ПолучитьОбъект();
		УчетнаяЗаписьЯндексМаркетобъект.ИдентификаторКабинета = ИдентификаторКабинета;
		УчетнаяЗаписьЯндексМаркетобъект.Записать();
	Исключение    
		ОтменитьТранзакцию();
		Результат = Ложь;
		ТекстОшибки = ОписаниеОшибки();	
		ТекстОписанияСобытия = НСтр("ru = 'Ошибка записи элемента справочника ""Учетные записи маркетплейсов""'");
		ЗаписьЖурналаРегистрации(ТекстОписанияСобытия, УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);		
	КонецПопытки;
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписьВЖурналРегистрации(ПутьКФайлу)
	
	ТекстОшибки = НСтр("ru = 'Не удалось открыть приложение по адресу .'" +ПутьКФайлу+" по причине:" + ОписаниеОшибки());		
	ТекстОписанияСобытия = НСтр("ru = 'Ошибка запуска приложения .'");
	ЗаписьЖурналаРегистрации(ТекстОписанияСобытия, УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
	
КонецПроцедуры

&НаСервере
Функция ТекстСтраницы(ПутьКФайлу, АвторизацияУспешна)
	
	Если АвторизацияУспешна Тогда
		ТекстСтраницы = ПолучитьОбщийМакет("УспешнаяАвторизация").ПолучитьТекст();
	Иначе
		ТекстСтраницы = ПолучитьОбщийМакет("НеУспешнаяАвторизация").ПолучитьТекст();
	КонецЕсли;
	ТекстСтраницы = СтрЗаменить(ТекстСтраницы,"Все права защищены","© ООО 1С-Софт, " + Формат(Год(ТекущаяДата()),"ЧГ=0") + ". Все права защищены");
	
	Возврат ТекстСтраницы;
	
КонецФункции


&НаКлиенте
Процедура ПоказатьСтраницуСРезультатамиАвторизации(АвторизацияУспешна)
	
	КаталогВременныхФайлов = КаталогВременныхФайлов();	
	
	Если АвторизацияУспешна Тогда
		ИмяФайла = "УспешнаяАвторизация.html";
	Иначе
		ИмяФайла = "НеУспешнаяАвторизация.html";
	КонецЕсли;

	ПутьКФайлу = КаталогВременныхФайлов + ИмяФайла;
	
	МассивНайденныхФайлов = НайтиФайлы(КаталогВременныхФайлов, ИмяФайла, Ложь);
	
	Если МассивНайденныхФайлов.Количество()=0 Тогда   
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстСтраницы = ТекстСтраницы(ПутьКФайлу, АвторизацияУспешна);	
		ТекстовыйДокумент.УстановитьТекст(ТекстСтраницы);
		ТекстовыйДокумент.Записать(ПутьКФайлу);
	КонецЕсли;
	
	Попытка
		ЗапуститьПриложение(ПутьКФайлу);
		ЭтаФорма.Закрыть();
	Исключение
		ДобавитьЗаписьВЖурналРегистрации(ПутьКФайлу);	
	КонецПопытки;	
	
КонецПроцедуры

&НаКлиенте
Функция ОбязательныеПоляЗаполнены()
	
	Результат = Истина;
	ОчиститьСообщения();
	
	Если НЕ ЗначениеЗаполнено(НомерМагазина) 
		ИЛИ НЕ ЗначениеЗаполнено(ВременныйКод) 
		ИЛИ НЕ ЗначениеЗаполнено(ИдентификаторКабинета)
		ИЛИ НЕ ЗначениеЗаполнено(Организация) Тогда	
		ОбщегоНазначенияКлиент.СообщитьПользователю("Заполните обязательные поля");
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

&НаКлиенте
Процедура Подключить(Команда)
	
	Если ОбязательныеПоляЗаполнены() Тогда
		
		Результат  = Ложь;
		ПодключитьНаСервере(Результат);  
		#Если ВебКлиент ИЛИ МобильныйКлиент Тогда
			Если Результат Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю("Авторизация пройдена");	
			Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка авторизации");	
            КонецЕсли;
		#Иначе                
			ПоказатьСтраницуСРезультатамиАвторизации(Результат);
		#КонецЕсли
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Оповестить("ЗакрытьФормуОчисткиНастроек",,);
	
КонецПроцедуры

#КонецОбласти

