
&ИзменениеИКонтроль("ИсправитьПроблемыВДвиженияхИДокументах")
Процедура асп_ИсправитьПроблемыВДвиженияхИДокументах(ПараметрыРасчета)
	
	ПротоколРасчетаПартийИСебестоимости.НачалоЭтапаРасчета(ПараметрыРасчета, "ИсправитьПроблемыВДвиженияхИДокументах");
	
	Запрос = Новый Запрос;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);
	
	#Область ПоляПартионногоУчетаВерсии22
	
	// Проверим в первичных движениях документов корректность заполнения полей:
	// Партия, КорПартия, ТипЗаписи, аналитика учета партий, вид деятельности НДС.
	// Если поля заполнены некорректно, то, видимо, документ был проведен до перехода на партионный учет версии 2.2 -
	// надо перепровести документ по регистру, содержащему некорректные движения.
	// Если после перепроведения документа поля все равно заполнены некорректно, значит ошибка кроется
	// в процедурах формирования движений документа или в макете описания движений (для регистра себестоимости товаров).
	
	// Подготовим вспомогательные данные.
	ОписаниеЦепочек 		= ОписаниеЦепочекПартийТоваров(ПараметрыРасчета);
	ИспользуемыеТипыЗаписей = ИспользуемыеТипыЗаписейВЦепочках(ОписаниеЦепочек);
	
	Запрос.УстановитьПараметр("ИспользуемыеТипыЗаписей", ИспользуемыеТипыЗаписей);
	
	// Подготовим запрос для формирования ВТРегистраторыСНекорректнымиДвижениями.
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.ВидДвижения				 КАК ВидДвижения,
	|	Т.Регистратор 				 КАК Регистратор,
	|	Т.Организация 				 КАК Организация,
	|	Т.КорОрганизация 			 КАК КорОрганизация,
	|	Т.Партия 	  				 КАК Партия,
	|	Т.КорПартия 	  			 КАК КорПартия,
	|	Т.ХозяйственнаяОперация 	 КАК ХозяйственнаяОперация,
	|	Т.ТипЗаписи					 КАК ТипЗаписи,
	|	Т.АналитикаУчетаПартий		 КАК АналитикаУчетаПартий,
	|	Т.КорАналитикаУчетаПартий	 КАК КорАналитикаУчетаПартий,
	|	Т.РазделУчета				 КАК РазделУчета,
	|	Т.КорРазделУчета			 КАК КорРазделУчета,
	|	Т.АналитикаУчетаНоменклатуры	КАК АналитикаУчетаНоменклатуры,
	|	Т.КорАналитикаУчетаНоменклатуры	КАК КорАналитикаУчетаНоменклатуры,
	|	Т.АналитикаФинансовогоУчета	КАК АналитикаФинансовогоУчета,
	|	Т.КорАналитикаФинансовогоУчета	КАК КорАналитикаФинансовогоУчета,
	|	Т.ВидДеятельностиНДС		 КАК ВидДеятельностиНДС,
	|	Т.КорВидДеятельностиНДС		 КАК КорВидДеятельностиНДС,
	|	Т.АналитикаУчетаПоПартнерам	 КАК АналитикаУчетаПоПартнерам,
	|	Т.ГруппаПродукции			 КАК ГруппаПродукции,
	|	Т.ДокументИсточник			 КАК ДокументИсточник,
	|	Т.ПериодПродажи				 КАК ПериодПродажи,
	|	ВЫБОР КОГДА Т.Количество > 0
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ 						 КАК ПоложительноеКоличество
	|ПОМЕСТИТЬ ВТДвиженияСебестоимостьТоваров
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|	И НЕ ТИПЗНАЧЕНИЯ(Т.Регистратор) В (ТИП(Документ.РасчетСебестоимостиТоваров),
	|									ТИП(Документ.КорректировкаРегистров))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор 			 КАК Регистратор,
	|	Т.Организация 			 КАК Организация,
	|	Т.АналитикаУчетаПартий	 КАК АналитикаУчетаПартий,
	|	Т.ВидДеятельностиНДС	 КАК ВидДеятельностиНДС
	|ПОМЕСТИТЬ ВТДвиженияПартииПрочихРасходов
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И НЕ Т.РасчетПартий
	|	И НЕ Т.Регистратор ССЫЛКА Документ.РаспределениеНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор КАК Регистратор,
	|	Т.Организация КАК Организация,
	|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ПОМЕСТИТЬ ВозвратыТоваровНаДругойСклад
	|ИЗ
	|	ВТДвиженияСебестоимостьТоваров КАК Т
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Т.Регистратор) В (ТИП(Документ.ВозвратТоваровОтКлиента), ТИП(Документ.ВозвратТоваровМеждуОрганизациями))
	|	И Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратНаДругойСклад)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.ИмяРегистра КАК ИмяРегистра,
	|	Т.Ссылка 	  КАК Ссылка,
	|	Т.Организация КАК Организация,
	|	Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Т.КодОшибки   КАК КодОшибки
	|ПОМЕСТИТЬ ВТРегистраторыСНекорректнымиДвижениями
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"" КАК ИмяРегистра,
	|		Т.Регистратор КАК Ссылка,
	|		Т.Организация КАК Организация,
	|		Т.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		ВЫБОР
	|			КОГДА Правила.ПустоеЗначениеРегистратора ЕСТЬ NULL 
	|				ТОГДА 1
	|			КОГДА Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА ВЫБОР
	|						КОГДА Т.ТипЗаписи В
	|							(ВЫБРАТЬ
	|								ТипыЗаписей.ТипЗаписиПриход
	|							 ИЗ
	|								ВТПравилаЗаполненияПоляТипЗаписи КАК ТипыЗаписей
	|							 ГДЕ
	|								ТИПЗНАЧЕНИЯ(Т.Регистратор) = ТИПЗНАЧЕНИЯ(ТипыЗаписей.ПустоеЗначениеРегистратора)
	|								И (ТипыЗаписей.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|									ИЛИ Т.ХозяйственнаяОперация = ТипыЗаписей.ХозяйственнаяОперация)
	|								И (ТипыЗаписей.ПоложительноеКоличество = НЕОПРЕДЕЛЕНО
	|									ИЛИ Т.ПоложительноеКоличество = ТипыЗаписей.ПоложительноеКоличество))
	|							ТОГДА 0
	|						ИНАЧЕ 2
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|						КОГДА Т.ТипЗаписи В
	|							(ВЫБРАТЬ
	|								ТипыЗаписей.ТипЗаписиРасход
	|							 ИЗ
	|								ВТПравилаЗаполненияПоляТипЗаписи КАК ТипыЗаписей
	|							 ГДЕ
	|								ТИПЗНАЧЕНИЯ(Т.Регистратор) = ТИПЗНАЧЕНИЯ(ТипыЗаписей.ПустоеЗначениеРегистратора)
	|								И (ТипыЗаписей.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|									ИЛИ Т.ХозяйственнаяОперация = ТипыЗаписей.ХозяйственнаяОперация)
	|								И (ТипыЗаписей.ПоложительноеКоличество = НЕОПРЕДЕЛЕНО
	|									ИЛИ Т.ПоложительноеКоличество = ТипыЗаписей.ПоложительноеКоличество))
	|						ТОГДА 0
	|					ИНАЧЕ 3
	|				КОНЕЦ
	|		КОНЕЦ КАК КодОшибки
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПравилаЗаполненияПоляТипЗаписи КАК Правила
	|			ПО ТИПЗНАЧЕНИЯ(Т.Регистратор) = ТИПЗНАЧЕНИЯ(Правила.ПустоеЗначениеРегистратора)
	|				И (Правила.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|					ИЛИ Т.ХозяйственнаяОперация = Правила.ХозяйственнаяОперация)
	|				И (Правила.ПоложительноеКоличество = НЕОПРЕДЕЛЕНО
	|					ИЛИ Т.ПоложительноеКоличество = Правила.ПоложительноеКоличество)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		Т.ХозяйственнаяОперация,
	|		ВЫБОР
	|			КОГДА Т.Организация В (&ОрганизацииСФИФОСкользящая) И Т.Партия = НЕОПРЕДЕЛЕНО
	|				ТОГДА 4
	|			КОГДА НЕ (Т.Организация В (&ОрганизацииСФИФОСкользящая)) И Т.Партия <> НЕОПРЕДЕЛЕНО
	|			  И Т.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|			  И Т.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
	|			  И Т.РазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)
	|				ТОГДА 5
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|	ГДЕ
	|		Т.ТипЗаписи В (&ТипыЗаписейПервичныхПартий)
	|		ИЛИ Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.КорректировкаПриобретения)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		Т.ХозяйственнаяОперация,
	|		ВЫБОР
	// Проверка кор. партии в расходных движениях при заполненной кор. организации (схема Интеркампани).
	|			КОГДА Т.Организация В (&ОрганизацииСФИФОСкользящая)
	|				И Т.КорОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|				И НЕ Т.КорОрганизация В (&ОрганизацииСФИФОСкользящая)
	|				И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА
	|					ВЫБОР
	|						КОГДА Т.КорПартия = НЕОПРЕДЕЛЕНО
	|							ТОГДА 0
	|						ИНАЧЕ 5
	|					КОНЕЦ
	|			КОГДА НЕ Т.Организация В (&ОрганизацииСФИФОСкользящая)
	|				И Т.КорОрганизация В (&ОрганизацииСФИФОСкользящая)
	|				И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И Т.КорРазделУчета <> ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка)
	|				ТОГДА
	|					ВЫБОР
	|						КОГДА Т.КорПартия = Т.Регистратор
	|							ТОГДА 0
	|						ИНАЧЕ 6
	|					КОНЕЦ
	// Проверка кор. партии в расходных движениях без кор. организации (изменение документа партии внутри одной организации).
	|			КОГДА Т.Организация В (&ОрганизацииСФИФОСкользящая)
	|				И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И НЕ Т.КорРазделУчета В (ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку),
	|										ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение),
	|										ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПустаяСсылка))
	|				И (
	// При списании на партии производства кор. партия должна быть заполнена
	|					(
	|						(ЕСТЬNULL(Правила.КорПартияВРасходе, ЛОЖЬ)
	|							И Т.КорПартия = НЕОПРЕДЕЛЕНО
	|						ИЛИ НЕ ЕСТЬNULL(Правила.КорПартияВРасходе, ЛОЖЬ)
	|							И НЕ Т.КорПартия = НЕОПРЕДЕЛЕНО)
	|					)
	|				)
	|				ТОГДА 6
	|			КОГДА НЕ Т.Организация В (&ОрганизацииСФИФОСкользящая)
	|				И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И Т.КорПартия = Т.Регистратор
	|				И НЕ Т.КорРазделУчета В (ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку),
	|										ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение),
	|										ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство))
	|				ТОГДА 5
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПравилаЗаполненияПоляТипЗаписи КАК Правила
	|			ПО ТИПЗНАЧЕНИЯ(Т.Регистратор) = ТИПЗНАЧЕНИЯ(Правила.ПустоеЗначениеРегистратора)
	|				И (Правила.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|					ИЛИ Т.ХозяйственнаяОперация = Правила.ХозяйственнаяОперация)
	|				И (Правила.ПоложительноеКоличество = НЕОПРЕДЕЛЕНО
	|					ИЛИ Т.ПоложительноеКоличество = Правила.ПоложительноеКоличество)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		Т.ХозяйственнаяОперация,
	|		7
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|	ГДЕ
	|		НЕ (Т.ТипЗаписи В (&ИспользуемыеТипыЗаписей))
	|		И НЕ (Т.ТипЗаписи В (&НепересчитываемыеТипыЗаписей))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		Т.ХозяйственнаяОперация,
	|		8
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПартий КАК Аналитики
	|			ПО Т.АналитикаУчетаПартий = Аналитики.Ссылка
	|	ГДЕ
	|		Аналитики.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		Т.ХозяйственнаяОперация,
	|		9
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПартий КАК Аналитики
	|			ПО Т.КорАналитикаУчетаПартий = Аналитики.Ссылка
	|	ГДЕ
	|		Аналитики.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""ПартииПрочихРасходов"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		НЕОПРЕДЕЛЕНО,
	|		8
	|	ИЗ
	|		ВТДвиженияПартииПрочихРасходов КАК Т
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПартий КАК Аналитики
	|			ПО Т.АналитикаУчетаПартий = Аналитики.Ссылка
	|	ГДЕ
	|		Аналитики.ВидЦенности = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ПустаяСсылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""ПартииПрочихРасходов"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		НЕОПРЕДЕЛЕНО,
	|		10
	|	ИЗ
	|		ВТДвиженияПартииПрочихРасходов КАК Т
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПартий КАК Аналитики
	|			ПО Т.АналитикаУчетаПартий = Аналитики.Ссылка
	|	ГДЕ
	|		Т.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		Т.ХозяйственнаяОперация,
	|		12
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|	ГДЕ
	|		Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|		И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Т.КорАналитикаУчетаНоменклатуры = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Возвраты.Регистратор,
	|		Возвраты.Организация,
	|		Возвраты.ХозяйственнаяОперация,
	|		13
	|	ИЗ
	|		ВозвратыТоваровНаДругойСклад КАК Возвраты
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТДвиженияСебестоимостьТоваров КАК Т
	|			ПО Т.Регистратор = Возвраты.Регистратор
	|			И Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.СторноВозвратНаДругойСклад)
	|	ГДЕ
	|		Т.Регистратор ЕСТЬ NULL
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		НЕОПРЕДЕЛЕНО,
	|		14
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|	ГДЕ
	|		Т.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|		И НЕ Т.РазделУчета В (
	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку),
	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи))
	|
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		Т.ХозяйственнаяОперация,
	|		17
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|	ГДЕ
	|		Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ДополнительныеРасходыСПартией)
	|		И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией)
	|		И Т.ДокументИсточник = НЕОПРЕДЕЛЕНО
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		Т.ХозяйственнаяОперация,
	|		ВЫБОР
	|			КОГДА Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					И Правила.ДокументИсточникВПриходе И Т.ДокументИсточник = НЕОПРЕДЕЛЕНО
	|			  ТОГДА 18
	|			КОГДА Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					И Правила.ДокументИсточникВРасходе И Т.ДокументИсточник = НЕОПРЕДЕЛЕНО
	|			  ТОГДА 19
	|			  ИНАЧЕ 0
	|		КОНЕЦ
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТПравилаЗаполненияПоляТипЗаписи КАК Правила
	|			ПО ТИПЗНАЧЕНИЯ(Т.Регистратор) = ТИПЗНАЧЕНИЯ(Правила.ПустоеЗначениеРегистратора)
	|				И (Правила.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|					ИЛИ Т.ХозяйственнаяОперация = Правила.ХозяйственнаяОперация)
	|				И (Правила.ПоложительноеКоличество = НЕОПРЕДЕЛЕНО
	|					ИЛИ Т.ПоложительноеКоличество = Правила.ПоложительноеКоличество)
	|				И (Правила.ДокументИсточникВПриходе И Т.ТипЗаписи = Правила.ТипЗаписиПриход
	|					ИЛИ Правила.ДокументИсточникВРасходе И Т.ТипЗаписи = Правила.ТипЗаписиРасход)
	|	ГДЕ
	|		ВЫБОР
	|			КОГДА Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					И Правила.ДокументИсточникВПриходе И Т.ДокументИсточник = НЕОПРЕДЕЛЕНО
	|			  ТОГДА 18
	|			КОГДА Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					И Правила.ДокументИсточникВРасходе И Т.ДокументИсточник = НЕОПРЕДЕЛЕНО
	|			  ТОГДА 19
	|			  ИНАЧЕ 0
	|		КОНЕЦ <> 0
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		НЕОПРЕДЕЛЕНО,
	|		20
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|	ГДЕ
	|		НЕ Т.Организация В (&ОрганизацииСФИФОСкользящая)
	|		И Т.КорАналитикаУчетаПартий = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|		И Т.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)
	|		И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|		И Т.РазделУчета В (
	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах),
	|			ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты))
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		НЕОПРЕДЕЛЕНО,
	|		21
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|	ГДЕ
	|		Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиентаПрошлыхПериодов)
	|		И Т.ПериодПродажи = ДАТАВРЕМЯ(1,1,1)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		НЕОПРЕДЕЛЕНО,
	|		22
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|	ГДЕ
	|		Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет)
	|		И Т.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		НЕОПРЕДЕЛЕНО,
	|		24
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ВыручкаИСебестоимостьПродаж
	|			ПО ВыручкаИСебестоимостьПродаж.Регистратор = Т.Регистратор
	|	ГДЕ
	|		Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Т.Организация = ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
	|		И Т.АналитикаУчетаПоПартнерам = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|		И Т.ТипЗаписи <> ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратНаДругойСклад)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		НЕОПРЕДЕЛЕНО,
	|		25
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|	ГДЕ
	|		(Т.КорАналитикаУчетаПартий = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|			ИЛИ Т.КорАналитикаУчетаПартий = Т.АналитикаУчетаПартий) // По ошибке перезаполнился реквизит КорАналитикаУчетаПартий
	|		И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И Т.ТипЗаписи В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией))
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""ВыручкаИСебестоимостьПродаж"",
	|		Т.Регистратор,
	|		Аналитика.Организация,
	|		НЕОПРЕДЕЛЕНО,
	|		28
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК Аналитика
	|			ПО Аналитика.Ссылка = Т.АналитикаУчетаПоПартнерам
	|	ГДЕ
	|		Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И Аналитика.Организация В (&МассивОрганизаций)
	|		И Т.Активность
	|		И НЕ Т.РасчетПартий
	|		И НЕ Т.РасчетСебестоимости
	|		И ТИПЗНАЧЕНИЯ(Т.Регистратор) = ТИП(Документ.ОтчетПоКомиссииМеждуОрганизациями)
	|		И Т.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		НЕОПРЕДЕЛЕНО,
	|		29
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровМеждуОрганизациями КАК Возврат
	|			ПО Возврат.Ссылка = Т.Регистратор
	|			И Возврат.Организация = Т.Организация
	|	ГДЕ
	|		Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями)
	|		И Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|		И Т.КорВидДеятельностиНДС = Возврат.НалогообложениеНДС
	|		И Возврат.НалогообложениеНДС В (&ТипыНалогообложенияНДСНеУчитываетсяВСтоимости)
	|		И Т.Организация В (&ОрганизацииНаУСН)
	|		И Возврат.ОрганизацияПолучатель НЕ В (&ОрганизацииНаУСН)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	#Удаление
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		НЕОПРЕДЕЛЕНО,
	|		30
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТаможеннаяДекларацияИмпорт КАК Декларация
	|			ПО Декларация.Ссылка = Т.Регистратор
	|	ГДЕ
	|		Т.КорВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	#КонецУдаления
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		""СебестоимостьТоваров"",
	|		Т.Регистратор,
	|		Т.Организация,
	|		НЕОПРЕДЕЛЕНО,
	|		31
	|	ИЗ
	|		ВТДвиженияСебестоимостьТоваров КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК СборкаТоваров
	|			ПО СборкаТоваров.Ссылка = Т.Регистратор
	|	ГДЕ
	|		Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И ЕСТЬNULL(Т.АналитикаУчетаНоменклатуры.Назначение.ВидДеятельностиНДС, ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка))
	|			<> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|		И Т.ВидДеятельностиНДС <> Т.АналитикаУчетаНоменклатуры.Назначение.ВидДеятельностиНДС
	|	
	|	) КАК Т
	|
	|ГДЕ
	|	Т.КодОшибки <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДвиженияСебестоимостьТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДвиженияПартииПрочихРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВозвратыТоваровНаДругойСклад
	|";
	
	// Сформируем описание возможных кодов ошибок в движениях.
	РасшифровкаКодовОшибок = Новый Соответствие;
	РасшифровкаКодовОшибок.Вставить(1, НСтр("ru='Для движения не найдено соответствующее ему правило заполнения типа записи'"));
	РасшифровкаКодовОшибок.Вставить(2, НСтр("ru='Тип записи приходного движения не соответствует правилу'"));
	РасшифровкаКодовОшибок.Вставить(3, НСтр("ru='Тип записи расходного движения не соответствует правилу'"));
	РасшифровкаКодовОшибок.Вставить(4, НСтр("ru='Для организаций с методом оценки ""ФИФО (скользящая)"" не заполнена первичная партия'"));
	РасшифровкаКодовОшибок.Вставить(5, НСтр("ru='Для организаций с методом оценки, отличным от ""ФИФО (скользящая)"", заполнена первичная партия или кор. партия'"));
	РасшифровкаКодовОшибок.Вставить(6, НСтр("ru='Для организаций с методом оценки ""ФИФО (скользящая)"" некорректно заполнена кор. партия в расходном движении'"));
	РасшифровкаКодовОшибок.Вставить(7, НСтр("ru='Тип записи, указанный в движении, не используется при распределении партий'"));
	РасшифровкаКодовОшибок.Вставить(8, НСтр("ru='Аналитика учета партий не содержит вида ценности'"));
	РасшифровкаКодовОшибок.Вставить(9, НСтр("ru='Кор. аналитика учета партий не содержит вида ценности'"));
	РасшифровкаКодовОшибок.Вставить(10, НСтр("ru='Не заполнен вид деятельности НДС при заполненной аналитике учета партий'"));
	РасшифровкаКодовОшибок.Вставить(11, НСтр("ru='Для аналитики учета партий выпуска изделий не заполнен код строки (продукции)'"));
	РасшифровкаКодовОшибок.Вставить(12, НСтр("ru='Не заполнена кор. аналитика учета номенклатуры для операции ""Реализация (товары в пути)""'"));
	РасшифровкаКодовОшибок.Вставить(13, НСтр("ru='Для документов возврата товаров от клиента/организации на склад, отличный от склада реализации, используются неправильные хозяйственные операции и типы записей'"));
	РасшифровкаКодовОшибок.Вставить(14, НСтр("ru='Не заполнен вид деятельности НДС у приходных движений с типом записи ""Партия""'"));
	РасшифровкаКодовОшибок.Вставить(17, НСтр("ru='Не заполнен документ - источник для операции ""Дополнительные расходы с указанием документа партии"".'"));
	РасшифровкаКодовОшибок.Вставить(18, НСтр("ru='Заполнение документа-источника в приходном движении не соответствует правилу.'"));
	РасшифровкаКодовОшибок.Вставить(19, НСтр("ru='Заполнение документа-источника в расходном движении не соответствует правилу.'"));
	РасшифровкаКодовОшибок.Вставить(20, НСтр("ru='Не заполнена кор. аналитика учета партий приходных движений с типом записи ""Партия"" для организаций с методом оценки, отличным от ""ФИФО (скользящая)""'"));
	РасшифровкаКодовОшибок.Вставить(21, НСтр("ru='Не заполнен период продажи для операции ""Возврат товаров от клиента прошлых периодов""'"));
	РасшифровкаКодовОшибок.Вставить(22, НСтр("ru='Не заполнены кор. реквизиты для операции ""Закупка по регл. учету""'"));
	РасшифровкаКодовОшибок.Вставить(24, НСтр("ru='Не заполнена аналитика учета по партнерам в движениях документов продажи'"));
	РасшифровкаКодовОшибок.Вставить(25, НСтр("ru='Не заполнена кор. аналитика учета партий в приходных движениях с типом записей ""Доп. расходы (не указана партия)"" и ""Доп. расходы (указана партия)""'"));
	РасшифровкаКодовОшибок.Вставить(28, НСтр("ru='Не корректно заполнен раздел учета для операции ""Отчет по комиссии между организациями""'"));
	РасшифровкаКодовОшибок.Вставить(29, НСтр("ru='Не корректно заполнен кор. вид деятельности НДС для операции ""Возврат товаров между организациями"" для организации на УСН'"));
	РасшифровкаКодовОшибок.Вставить(30, НСтр("ru='Не корректно заполнен кор. вид деятельности НДС для документа ""Таможенная декларация на импорт"".'"));
	РасшифровкаКодовОшибок.Вставить(31, НСтр("ru='Не корректно заполнен вид деятельности НДС для документа ""Сборка (разборка) товаров"".'"));
	РасшифровкаКодовОшибок.Вставить(32, НСтр("ru='Не корректно заполнен тип записи в приходном движении для документа ""Производство без заказа"".'"));
	РасшифровкаКодовОшибок.Вставить(33, НСтр("ru='Не корректные движения по изменению назначения работ для документа ""Этап производства"".'"));
	РасшифровкаКодовОшибок.Вставить(34, НСтр("ru='Некорректные движения по разделу учета ""Производственные затраты"".'"));
	
	ДополнительныеПоля = Новый Структура("ХозяйственнаяОперация", НСтр("ru = 'операция'"));
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='переход на партионный учет версии 2.2'"),
		ДополнительныеПоля);
	
	#КонецОбласти
	

	#Область ВыручкаИСебестоимостьПродаж
	
	// Исправление некорректных движений в регистре "Выручка и себестоимость продаж".
	РасшифровкаКодовОшибок = Новый Соответствие;
	РасшифровкаКодовОшибок.Вставить(1, НСтр("ru='Дублирование расчетной себестоимости в первичных движениях'"));
	
	СуществующиеВТ = УниверсальныеМеханизмыПартийИСебестоимости.ПолучитьПереченьСуществующихВременныхТаблиц(Запрос);
	
	Запрос.Текст = ПартионныйУчет.ТекстЗапросаДокументыСДублямиДвиженийПоВыручкеИСебестоимостиПродаж();
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='ошибка 00-00071689'"));
	
	НовыеВТ = УниверсальныеМеханизмыПартийИСебестоимости.ПолучитьПереченьСуществующихВременныхТаблиц(Запрос, СуществующиеВТ);
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
	#КонецОбласти

	#Область НекорректнаяАналитикаФинансовогоУчета
	
	// Исправление некорректной пустой аналитики финансового учета в регистре "Себестоимость товаров".
	РасшифровкаКодовОшибок = Новый Соответствие;
	РасшифровкаКодовОшибок.Вставить(1, НСтр("ru='Пустая аналитика финансового учет в первичных движениях имеет значение отличное от НЕОПРЕДЕЛЕНО'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СебестоимостьТоваров"" КАК ИмяРегистра,
	|	Т.Регистратор 			 КАК Ссылка,
	|	Т.Организация 			 КАК Организация,
	|	1 						 КАК КодОшибки
	|ПОМЕСТИТЬ ВТРегистраторыСНекорректнымиДвижениями
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.Активность
	|	И НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|	И Т.АналитикаФинансовогоУчета В
	|		(ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|		 ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка),
	|		 ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка),
	|		 ЗНАЧЕНИЕ(Справочник.ГруппыАналитическогоУчетаНоменклатуры.ПустаяСсылка))";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='ошибка 00-00098117'"));
	
	#КонецОбласти

	#Область СуммыВДвижениях
	
	// Проверка соответствия заполненности суммы упр./регл. значениям функциональных опций.
	РасшифровкаКодовОшибок = Новый Соответствие;
	РасшифровкаКодовОшибок.Вставить(1, НСтр("ru='Заполнение упр. сумм в движениях не соответствует значению функциональной опции ""ВестиУправленческийУчетОрганизаций""'"));
	РасшифровкаКодовОшибок.Вставить(2, НСтр("ru='Заполнение регл. сумм в движениях не соответствует значению функциональной опции ""ИспользоватьУчетПрочихДоходовРасходовРегл""'"));
	
	#Область ИсключаемыеТипыДокументов
	
	Запрос.УстановитьПараметр("ТипыДокументовОСиНМА", УниверсальныеМеханизмыПартийИСебестоимости.ТипыДокументовОСиНМА());
	
	ТипыРегистраторов = Новый Массив;
	ТипыРегистраторов.Добавить(Тип("ДокументСсылка.РаспределениеНДС"));
	ТипыРегистраторов.Добавить(Тип("ДокументСсылка.РаспределениеДоходовПоНаправлениямДеятельности"));
	ТипыРегистраторов.Добавить(Тип("ДокументСсылка.РаспределениеПрочихЗатрат"));
	ТипыРегистраторов.Добавить(Тип("ДокументСсылка.РаспределениеРасходовБудущихПериодов"));
	ТипыРегистраторов.Добавить(Тип("ДокументСсылка.РасчетКурсовыхРазниц"));
	ТипыРегистраторов.Добавить(Тип("ДокументСсылка.РегистраторРасчетов"));
	ТипыРегистраторов.Добавить(Тип("ДокументСсылка.ПрочиеДоходыРасходы"));
	ТипыРегистраторов.Добавить(Тип("ДокументСсылка.ДвижениеПрочихАктивовПассивов"));
	ТипыРегистраторов.Добавить(Тип("ДокументСсылка.КорректировкаПриобретения"));
	
	Запрос.УстановитьПараметр("ТипыРегламентныхДокументов", ТипыРегистраторов);
	
	#КонецОбласти
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СебестоимостьТоваров"" КАК ИмяРегистра,
	|	Т.Регистратор 			 КАК Ссылка,
	|	Т.Организация 			 КАК Организация,
	|	1 						 КАК КодОшибки
	|ПОМЕСТИТЬ ВТРегистраторыСНекорректнымиДвижениями
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.Активность
	|	И НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|	И (Т.ТипЗаписи В (&НепересчитываемыеТипыЗаписей)
	|		ИЛИ Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Потребление)
	|		  И Т.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|	И (Т.Стоимость <> 0 ИЛИ Т.КорСтоимость <> 0 ИЛИ Т.ДопРасходы <> 0 ИЛИ Т.Трудозатраты <> 0
	|		ИЛИ Т.ПостатейныеПостоянныеСНДС <> 0 ИЛИ Т.ПостатейныеПеременныеСНДС <> 0
	|		ИЛИ Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|	И НЕ Т.РазделУчета В (
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи))
	|	И ((&УправленческийУчетОрганизаций И (Т.Стоимость <> 0 ИЛИ Т.КорСтоимость <> 0
	|			ИЛИ Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|		И Т.СтоимостьУпр = 0 И Т.ДопРасходыУпр = 0 И Т.ТрудозатратыУпр = 0
	|		И Т.ПостатейныеПостоянныеУпр = 0 И Т.ПостатейныеПеременныеУпр = 0)
	|	ИЛИ (НЕ &УправленческийУчетОрганизаций
	|		И (Т.СтоимостьУпр <> 0 ИЛИ Т.ДопРасходыУпр <> 0 ИЛИ Т.ТрудозатратыУпр <> 0
	|		ИЛИ Т.ПостатейныеПостоянныеУпр <> 0 ИЛИ Т.ПостатейныеПеременныеУпр <> 0)))
	|	И НЕ (Т.СтоимостьБезНДС = 0	И Т.ДопРасходы <> 0 И Т.ДопРасходыУпр = 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""ПрочиеДоходы"" 		 КАК ИмяРегистра,
	|	Т.Регистратор 			 КАК Ссылка,
	|	Т.Организация 			 КАК Организация,
	|	ВЫБОР
	|		КОГДА Т.Сумма <> 0
	|			И Т.СуммаРегл = 0
	|			И &ИспользоватьУчетПрочихДоходовРасходовРегл
	|			И НЕ ТИПЗНАЧЕНИЯ(Т.Регистратор) В (&ТипыДокументовОСиНМА)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ					 КАК КодОшибки
	|ИЗ
	|	РегистрНакопления.ПрочиеДоходы КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.Активность
	|	И НЕ Т.РасчетСебестоимости
	|	И НЕ ТИПЗНАЧЕНИЯ(Т.Регистратор) В (&ТипыРегламентныхДокументов)
	|	И ((&УправленческийУчетОрганизаций
	|			И Т.СуммаУпр = 0
	|			И Т.Сумма <> 0
	|			И НЕ ТИПЗНАЧЕНИЯ(Т.Регистратор) В (&ТипыДокументовОСиНМА))
	|		ИЛИ (НЕ &УправленческийУчетОрганизаций
	|			И Т.СуммаУпр <> 0)
	|		ИЛИ (Т.Сумма <> 0
	|			И Т.СуммаРегл = 0
	|			И &ИспользоватьУчетПрочихДоходовРасходовРегл
	|			И НЕ ТИПЗНАЧЕНИЯ(Т.Регистратор) В (&ТипыДокументовОСиНМА)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""ПрочиеРасходы"" 		 КАК ИмяРегистра,
	|	Т.Регистратор 			 КАК Ссылка,
	|	Т.Организация 			 КАК Организация,
	|	1 						 КАК КодОшибки
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.Активность
	|	И НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|	И НЕ ТИПЗНАЧЕНИЯ(Т.Регистратор) В (&ТипыРегламентныхДокументов)
	|	И ((&УправленческийУчетОрганизаций И Т.СуммаУпр = 0 И Т.Сумма <> 0
	|			И НЕ ТИПЗНАЧЕНИЯ(Т.Регистратор) В (&ТипыДокументовОСиНМА))
	|		ИЛИ (НЕ &УправленческийУчетОрганизаций И Т.СуммаУпр <> 0
	|			И НЕ ТИПЗНАЧЕНИЯ(Т.Регистратор) В (&ТипыДокументовОСиНМА)))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""ПартииПрочихРасходов"" КАК ИмяРегистра,
	|	Т.Регистратор 			 КАК Ссылка,
	|	Т.Организация 			 КАК Организация,
	|	1 						 КАК КодОшибки
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.Активность
	|	И НЕ Т.РасчетПартий
	|	И НЕ ТИПЗНАЧЕНИЯ(Т.Регистратор) В (&ТипыРегламентныхДокументов)
	|	И ((&УправленческийУчетОрганизаций И Т.Стоимость <> 0 И Т.НДСРегл <> 0 И Т.НДСУпр = 0
	|			И НЕ ТИПЗНАЧЕНИЯ(Т.Регистратор) В (&ТипыДокументовОСиНМА))
	|		ИЛИ (НЕ &УправленческийУчетОрганизаций И Т.НДСУпр <> 0))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""ВыручкаИСебестоимостьПродаж"" КАК ИмяРегистра,
	|	Т.Регистратор 			        КАК Ссылка,
	|	Аналитика.Организация 			КАК Организация,
	|	1 						        КАК КодОшибки
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК Аналитика
	|		ПО Аналитика.Ссылка = Т.АналитикаУчетаПоПартнерам
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Аналитика.Организация В (&МассивОрганизаций)
	|	И Т.Активность
	|	И НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|	И НЕ ТИПЗНАЧЕНИЯ(Т.Регистратор) В (&ТипыРегламентныхДокументов)
	|	И ((&УправленческийУчетОрганизаций И Т.Стоимость <> 0 И Т.СтоимостьУпр = 0)
	|		ИЛИ (НЕ &УправленческийУчетОрганизаций И Т.СтоимостьУпр <> 0))
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='некорректное заполнение сумм упр. учета'"));
	
	#КонецОбласти

	#Область НДСПредъявленный
	
	// Исправление некорректного НДСУпр в регистре НДСПредъявленный.
	РасшифровкаКодовОшибок = Новый Соответствие;
	РасшифровкаКодовОшибок.Вставить(1, НСтр("ru='Различается заполненность ресурсов НДС (упр.) и НДС (регл.) в регистре НДСПредъявленный'"));
	РасшифровкаКодовОшибок.Вставить(2, НСтр("ru='При отключенном управленческом учете заполнен ресурс НДС (упр.) в регистре НДСПредъявленный'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""НДСПредъявленный"" 	 КАК ИмяРегистра,
	|	Т.Регистратор 			 КАК Ссылка,
	|	Т.Организация 			 КАК Организация,
	|	1 						 КАК КодОшибки
	|ПОМЕСТИТЬ ВТРегистраторыСНекорректнымиДвижениями
	|ИЗ
	|	РегистрНакопления.НДСПредъявленный КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.Активность
	|	И НЕ Т.РегламентнаяОперация
	|	И &УправленческийУчетОрганизаций
	|	И ((Т.НДС = 0 И Т.НДСУпр <> 0) ИЛИ (Т.НДС <> 0 И Т.НДСУпр = 0))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""НДСПредъявленный"" 	 КАК ИмяРегистра,
	|	Т.Регистратор 			 КАК Ссылка,
	|	Т.Организация 			 КАК Организация,
	|	2 						 КАК КодОшибки
	|ИЗ
	|	РегистрНакопления.НДСПредъявленный КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.Активность
	|	И НЕ Т.РегламентнаяОперация
	|	И НЕ &УправленческийУчетОрганизаций
	|	И Т.НДСУпр <> 0";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='некорректное заполнение НДС (упр.)'"));
	
	#КонецОбласти


	#Область ПартииПрочихРасходов
	
	// Отражение статей с вариантом распределения НаПроизводственныеЗатраты в регистре накопления ПартииПрочихРасходов.
	РасшифровкаКодовОшибок = Новый Соответствие;
	РасшифровкаКодовОшибок.Вставить(1, НСтр("ru='Отражение статей с вариантом распределения НаПроизводственныеЗатраты в регистре ПартииПрочихРасходов не соответствует учетной политике организации'"));
	
	СуществующиеВТ = УниверсальныеМеханизмыПартийИСебестоимости.ПолучитьПереченьСуществующихВременныхТаблиц(Запрос);
	
	Запрос.Текст = ПартионныйУчет.ТекстЗапросаСтатьиНаПроизводственныеЗатратыВРегистреПартииПрочихРасходов();
	ПартионныйУчет.ПараметрыОтбораДокументовЗапросаСтатьиНаПроизводственныеЗатратыВРегистреПартииПрочихРасходов(Запрос);
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='некорректные движения по регистру ""Партии прочих расходов""'"));
		
	НовыеВТ = УниверсальныеМеханизмыПартийИСебестоимости.ПолучитьПереченьСуществующихВременныхТаблиц(Запрос, СуществующиеВТ);
	УниверсальныеМеханизмыПартийИСебестоимости.УничтожитьВременныеТаблицы(ПараметрыРасчета, НовыеВТ);
	
	#КонецОбласти


	#Область НекорректныеДвиженияДокументаВводОстатковПоПартиямНДС
	
	// Исправление движений по регистрам ДетализацияПартийТоваровДляНДСиУСН и ДетализацияПартийТоваровДляНДСиУСН2_4
	РасшифровкаКодовОшибок = Новый Соответствие;
	РасшифровкаКодовОшибок.Вставить(1, НСтр("ru='Некорректные движения документа ""Ввод начальных остатков"" по регистру ""ДетализацияПартийТоваровДляНДСиУСН2_4""'"));
	РасшифровкаКодовОшибок.Вставить(2, НСтр("ru='Некорректные движения документа ""Ввод начальных остатков"" по регистру ""ДетализацияПартийТоваровДляНДСиУСН""'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор КАК Регистратор,
	|	Т.Организация КАК Организация,
	|	Т.Партия КАК Партия,
	|	Т.ДокументПоступления КАК ДокументПоступления,
	|	Т.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Т.АналитикаУчетаДокументаПоступления КАК АналитикаУчетаДокументаПоступления
	|ПОМЕСТИТЬ ВТДвиженияНДС2_4
	|ИЗ
	|	РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4 КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.Регистратор ССЫЛКА Документ.ВводОстатков
	|	И НЕ Т.РасчетПартий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор КАК Регистратор,
	|	Т.Организация КАК Организация
	|ПОМЕСТИТЬ ВТДвиженияНДС
	|ИЗ
	|	РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.Регистратор ССЫЛКА Документ.ВводОстатков
	|	И НЕ Т.РасчетПартий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Регистратор КАК Ссылка,
	|	Т.Организация КАК Организация,
	|	Т.ИмяРегистра КАК ИмяРегистра,
	|	Т.КодОшибки КАК КодОшибки
	|ПОМЕСТИТЬ ВТРегистраторыСНекорректнымиДвижениями
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Регистратор КАК Регистратор,
	|		Т.Организация КАК Организация,
	|		""ДетализацияПартийТоваровДляНДСиУСН2_4"" КАК ИмяРегистра,
	|		1 КАК КодОшибки
	|	ИЗ
	|		ВТДвиженияНДС2_4 КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикиУчетаПартийНДС2_4 КАК АналитикиУчетаПартий
	|			ПО Т.АналитикаУчетаДокументаПоступления = АналитикиУчетаПартий.Ссылка
	|	ГДЕ
	|		Т.ДокументПоступления = Т.Партия
	|		И Т.АналитикаУчетаПартий = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПартий.ПустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Регистратор,
	|		Т.Организация,
	|		""ДетализацияПартийТоваровДляНДСиУСН2_4"",
	|		1
	|	ИЗ
	|		ВТДвиженияНДС2_4 КАК Т
	|	ГДЕ
	|		НЕ Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Регистратор,
	|		Т.Организация,
	|		""ДетализацияПартийТоваровДляНДСиУСН"",
	|		2
	|	ИЗ
	|		ВТДвиженияНДС2_4 КАК Т
	|	ГДЕ
	|		НЕ Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии24)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Регистратор,
	|		Т.Организация,
	|		""ДетализацияПартийТоваровДляНДСиУСН"",
	|		2
	|	ИЗ
	|		ВТДвиженияНДС КАК Т
	|	ГДЕ
	|		НЕ Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Регистратор,
	|		Т.Организация,
	|		""ДетализацияПартийТоваровДляНДСиУСН2_4"",
	|		1
	|	ИЗ
	|		ВТДвиженияНДС КАК Т
	|	ГДЕ
	|		НЕ Т.Организация В (&ОрганизацииСУчетомПартийНДСВерсии22)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		Т.Регистратор,
	|		Т.Организация,
	|		""ДетализацияПартийТоваровДляНДСиУСН2_4"",
	|		1
	|ИЗ
	|	РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4 КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&ОрганизацииСУчетомПартийНДСВерсии24)
	|	И Т.Регистратор ССЫЛКА Документ.ВводОстатков
	|	И НЕ Т.РасчетПартий
	|	И Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Партия)
	|	И Т.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|) КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДвиженияНДС2_4
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТДвиженияНДС";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='некорректные движения по регистрами партий НДС'"));
	
	#КонецОбласти

	#Область ПартнерВКлючеАналитикиУчетаНоменклатуры
	
	// Замена ключей аналитики учета номенклатуры с партнером на ключи с договором контрагента.
	РасшифровкаКодовОшибок = Новый Соответствие;
	РасшифровкаКодовОшибок.Вставить(1, НСтр("ru='В ключе аналитики учета номенклатуры в регистре ""Себестоимость товаров"" указан партнер, а не договор контрагента.'"));
	РасшифровкаКодовОшибок.Вставить(2, НСтр("ru='В ключе аналитики учета номенклатуры в регистре ""Закупки"" указан партнер, а не договор контрагента.'"));
	РасшифровкаКодовОшибок.Вставить(3, НСтр("ru='В ключе аналитики учета номенклатуры в регистре ""Движения Номенклатура - Номенклатура"" указан партнер, а не договор контрагента.'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СебестоимостьТоваров""	КАК ИмяРегистра,
	|	Т.Регистратор				КАК Ссылка,
	|	Т.Организация				КАК Организация,
	|	1							КАК КодОшибки
	|ПОМЕСТИТЬ ВТРегистраторыСНекорректнымиДвижениями
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.РазделУчета В (
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки))
	|	И Т.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер)
	|	И НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""Закупки""	  КАК ИмяРегистра,
	|	Т.Регистратор КАК Ссылка,
	|	Т.Организация КАК Организация,
	|	2			  КАК КодОшибки
	|ИЗ
	|	РегистрНакопления.Закупки КАК Т
	|
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.ТипЗапасов В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварВПути),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварПоНеотфактурованнойПоставке))
	|	И Т.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер)
	|	И НЕ Т.РасчетСебестоимости
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""ДвиженияНоменклатураНоменклатура"" КАК ИмяРегистра,
	|	Т.Регистратор						 КАК Ссылка,
	|	Т.Организация						 КАК Организация,
	|	3									 КАК КодОшибки
	|ИЗ
	|	РегистрНакопления.ДвиженияНоменклатураНоменклатура КАК Т
	|
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В(&МассивОрганизаций)
	|	И Т.ТипЗапасов В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварВПути),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.СобственныйТоварПоНеотфактурованнойПоставке))
	|	И Т.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер)
	|	И НЕ Т.РасчетСебестоимости
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='исправление ключей аналитики учета номенклатуры в регистрах (замена партнера на договор)'"));
	
	#КонецОбласти

	#Область НетТаможеннойПошлиныВДвиженияхДокументаТаможеннаяДекларацияИмпорт
	
	#Удаление
	// Исправление движений по регистру "Себестоимость товаров" для документов "Таможенная декларация на импорт".
	РасшифровкаКодовОшибок = Новый Соответствие;
	РасшифровкаКодовОшибок.Вставить(1, НСтр("ru='В движения таможенной декларации на импорт по регистру ""Себестоимость товаров"" отсутствует сумма пошлины. Требуется перепровести документ по регистру ""Себестоимость товаров""'"));
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СебестоимостьТоваров"" КАК ИмяРегистра,
	|	Декларация.Ссылка 		 КАК Ссылка,
	|	Декларация.Организация 	 КАК Организация,
	|	1 						 КАК КодОшибки
	|ПОМЕСТИТЬ ВТРегистраторыСНекорректнымиДвижениями
	|ИЗ
	|	Документ.ТаможеннаяДекларацияИмпорт КАК Декларация
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК Движения
	|		ПО Декларация.Ссылка = Движения.Регистратор
	|		И Движения.ТипЗаписи В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыСПартией),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ДопРасходыБезПартии))
	|ГДЕ
	|	Декларация.Проведен
	|	И Декларация.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Декларация.Организация В (&МассивОрганизаций)
	|	И (Декларация.СуммаДокумента - Декларация.ТаможенныйСбор - Декларация.ТаможенныйШтраф) <> 0
	|	И Движения.Регистратор ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	""СебестоимостьТоваров"" КАК ИмяРегистра,
	|	Движения.Регистратор	 КАК Ссылка,
	|	Движения.Организация 	 КАК Организация,
	|	1 						 КАК КодОшибки
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Движения
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='не отражена таможенная пошлина в движениях по регистру ""Себестоимость товаров""'"));
    #КонецУдаления

	
	#КонецОбласти

	#Область АналитикаОтгрузкиВВозвратеТоваровМеждуОрганизациями
	
	// Заполнение нового реквизита табличной части ВидыЗапасов
	РасшифровкаКодовОшибок = Новый Соответствие;
	РасшифровкаКодовОшибок.Вставить(1, НСтр("ru='Не заполнена аналитика номенклатуры отгрузки в документе возврата товаров между организациями.'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Ссылка				КАК Ссылка,
	|	Т.Ссылка.Организация	КАК Организация,
	|	1						КАК КодОшибки
	|ПОМЕСТИТЬ ВТРегистраторыДляПерепроведения
	|ИЗ
	|	Документ.ВозвратТоваровМеждуОрганизациями.ВидыЗапасов КАК Т
	|
	|ГДЕ
	|	Т.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Ссылка.Организация В(&МассивОрганизаций)
	|	И Т.Ссылка.Проведен
	|	И Т.СпособОпределенияСебестоимости = ЗНАЧЕНИЕ(Перечисление.СпособыОпределенияСебестоимости.ИзДокументаПередачи)
	|	И Т.АналитикаУчетаНоменклатурыОтгрузки = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументы(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='исправление ключей аналитики учета номенклатуры отгрузки в документе возврата товаров между организациями'"));
	
	#КонецОбласти
	
	#Область ВключениеУчетаСебестоимостиПоНазначениям
	
	РасшифровкаКодовОшибок = Новый Соответствие;
	РасшифровкаКодовОшибок.Вставить(1, НСтр("ru='Включение учета себестоимости по назначениям'"));
	
	Запрос.Текст = ПартионныйУчет.ТекстЗапросаВключениеУчетаСебестоимостиПоНазначениям();
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='включение учета себестоимости по назначениям'"));
		
	Запрос.Текст = ПартионныйУчет.ТекстЗапросаВключениеУчетаВыручкиИСебестоимостиПродажПоНазначениям();
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='включение учета выручки и себестоимости продаж по назначениям'"));
	
	#КонецОбласти
	
	#Область ВыключениеУчетаСебестоимостиПоНазначениям
	
	РасшифровкаКодовОшибок = Новый Соответствие;
	РасшифровкаКодовОшибок.Вставить(1, НСтр("ru='Выключение учета себестоимости по назначениям'"));
	
	Запрос.Текст = ПартионныйУчет.ТекстЗапросаВыключениеУчетаСебестоимостиПоНазначениям();
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='выключение учета себестоимости по назначениям'"));
		
	Запрос.Текст = ПартионныйУчет.ТекстЗапросаВыключениеУчетаВыручкиИСебестоимостиПродажПоНазначениям();
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='выключение учета выручки и себестоимости продаж по назначениям'"));
		
	#КонецОбласти
		
	#Область ВключениеУчетаСебестоимостиПоВидамЗапасов
	
	РасшифровкаКодовОшибок = Новый Соответствие;	
	РасшифровкаКодовОшибок.Вставить(1, НСтр("ru='Включение учета себестоимости по видам запасов'"));
	
	Запрос.Текст = ПартионныйУчет.ТекстЗапросаВключениеУчетаСебестоимостиПоВидамЗапасов();
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='включение учета себестоимости по видам запасов'"));
		
	Запрос.Текст = ПартионныйУчет.ТекстЗапросаВключениеУчетаВыручкиИСебестоимостиПродажПоВидамЗапасов();
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='включение учета выручки и себестоимости продаж по видам запасов'"));
	
	#КонецОбласти
	
	#Область КорректировкаПриобретения
	
	РасшифровкаКодовОшибок = Новый Соответствие;
	РасшифровкаКодовОшибок.Вставить(1, НСтр("ru='Не правильный вид движения для документа ""Корректировка приобретения"".'"));
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаРасхождения.Ссылка КАК Ссылка,
	|	ТаблицаРасхождения.Ссылка.Организация КАК Организация,
	|	ТаблицаРасхождения.АналитикаУчетаНоменклатуры,
	|	ТаблицаРасхождения.ВидЗапасов,
	|	СУММА(ТаблицаРасхождения.Количество) КАК Количество
	|ПОМЕСТИТЬ ВтКорректировкиПриобретения
	|ИЗ
	|	Документ.КорректировкаПриобретения.Расхождения КАК ТаблицаРасхождения
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК Приобретение
	|		ПО Приобретение.Ссылка = ТаблицаРасхождения.Ссылка.ДокументОснование
	|ГДЕ
	|	ТаблицаРасхождения.Ссылка.Проведен
	|	И ТаблицаРасхождения.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Приобретение.Дата < &НачалоПериода
	|	И ТаблицаРасхождения.ВариантОтражения В (
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОтраженияКорректировокПоступлений.УменьшитьЗакупкуУменьшитьСкладскиеОстатки),
	|		ЗНАЧЕНИЕ(Перечисление.ВариантыОтраженияКорректировокПоступлений.УменьшитьЗакупкуУчестьПриИнвентаризации))
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасхождения.Ссылка,
	|	ТаблицаРасхождения.Ссылка.Организация,
	|	ТаблицаРасхождения.АналитикаУчетаНоменклатуры,
	|	ТаблицаРасхождения.ВидЗапасов
	|;
	|ВЫБРАТЬ
	|	ОстаткиТоваров.АналитикаУчетаНоменклатуры,
	|	ОстаткиТоваров.ВидЗапасов,
	|	ОстаткиТоваров.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ ВтНеНулевыеОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(&ГраницаНачалоПериода,
	|		(АналитикаУчетаНоменклатуры, Организация, ВидЗапасов) В (
	|			ВЫБРАТЬ
	|				Корректировки.АналитикаУчетаНоменклатуры,
	|				Корректировки.Организация,
	|               Корректировки.ВидЗапасов
	|			ИЗ
	|				ВтКорректировкиПриобретения КАК Корректировки
	|		)
	|	) КАК ОстаткиТоваров
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Себестоимость.Регистратор,
	|	Себестоимость.АналитикаУчетаНоменклатуры,
	|	Себестоимость.ВидЗапасов
	|ПОМЕСТИТЬ ВтВозвратыПоставщикам
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтКорректировкиПриобретения КАК Корректировки
	|		ПО Корректировки.Ссылка = Себестоимость.Регистратор
	|		И Корректировки.АналитикаУчетаНоменклатуры = Себестоимость.АналитикаУчетаНоменклатуры
	|		И Корректировки.ВидЗапасов = Себестоимость.ВидЗапасов
	|ГДЕ
	|	Себестоимость.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Себестоимость.Активность
	|	И Себестоимость.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровПоставщику)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""СебестоимостьТоваров""  КАК ИмяРегистра,
	|	Корректировки.Ссылка 	  КАК Ссылка,
	|	Корректировки.Организация КАК Организация,
	|	1 						  КАК КодОшибки
	|ПОМЕСТИТЬ ВТРегистраторыСНекорректнымиДвижениями
	|ИЗ
	|	ВтКорректировкиПриобретения КАК Корректировки
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтВозвратыПоставщикам КАК Возвраты
	|		ПО Возвраты.Регистратор = Корректировки.Ссылка
	|		И Возвраты.АналитикаУчетаНоменклатуры = Корректировки.АналитикаУчетаНоменклатуры
	|		И Возвраты.ВидЗапасов = Корректировки.ВидЗапасов
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВтНеНулевыеОстатки КАК Остатки
	|		ПО Остатки.АналитикаУчетаНоменклатуры = Корректировки.АналитикаУчетаНоменклатуры
	|		И Остатки.ВидЗапасов = Корректировки.ВидЗапасов
	|ГДЕ
	|	Возвраты.Регистратор ЕСТЬ NULL
	|	И ЕСТЬNULL(Остатки.Количество, 0) <= -Корректировки.Количество
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ПЕРВЫЕ 0
	|	""СебестоимостьТоваров"" КАК ИмяРегистра,
	|	Движения.Регистратор	 КАК Ссылка,
	|	Движения.Организация 	 КАК Организация,
	|	1 						 КАК КодОшибки
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Движения
	|";

	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='исправление движений документа ""Корректировка приобретения""'"));
	
	#КонецОбласти
	
	#Область ОприходованиеЗаСчетРасходов
	
	РасшифровкаКодовОшибок = Новый Соответствие;
	РасшифровкаКодовОшибок.Вставить(1, НСтр("ru='Некорректные движения документа ""Оприходование (за счет расходов)"" по регистру ""Прочие расходы""'"));
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	""ПрочиеРасходы"" 		 КАК ИмяРегистра,
	|	Т.Регистратор 			 КАК Ссылка,
	|	Т.Организация 			 КАК Организация,
	|	1 						 КАК КодОшибки
	|ПОМЕСТИТЬ ВТРегистраторыСНекорректнымиДвижениями
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК Т
	|ГДЕ
	|	Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Т.Организация В (&МассивОрганизаций)
	|	И Т.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОприходованиеЗаСчетРасходов)
	|	И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Т.Активность
	|	И НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|";
	
	УниверсальныеМеханизмыПартийИСебестоимости.ПерепровестиДокументыПоОтдельнымРегистрамНакопления(
		ПараметрыРасчета,
		Запрос,
		РасшифровкаКодовОшибок,
		НСтр("ru='некорректные движения по регистру ""Прочие расходы""'"));
	
	#КонецОбласти
	
КонецПроцедуры
