//+++ASP_yulia_l_04/10/2021_ 000012681
&НаКлиенте
Процедура асп_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбработкаВыбораНазначения" Тогда
		
		ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
		
		Если ТекущиеДанные.КоличествоУпаковок > Параметр Тогда     //разбиваем строку
			
			НовСтрока = Объект.Товары.Добавить() ;
			КодСтроки = ПолучитьМаксимальныйКОдСтроки();
			ЗаполнитьЗначенияСвойств(НовСтрока,ТекущиеДанные);
			Разница = НовСтрока.Количество - Параметр;
			ТекущиеДанные.Количество = Разница;
			ТекущиеДанные.КоличествоУпаковок = ТекущиеДанные.Количество;
			НовСтрока.Количество = Параметр;
			НовСтрока.КоличествоУпаковок = НовСтрока.Количество;
			НовСтрока.КодСтроки = КодСтроки; 
			//пересчитать сумму (типовое)
			СтруктураДействий = Новый Структура;
			ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий);
			
			ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, КэшированныеЗначения);
			ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НовСтрока, СтруктураДействий, КэшированныеЗначения);

		КонецЕсли;	
	КонецЕсли;	
 
КонецПроцедуры
//---ASP_yulia_l_04/10/2021_ 000012681

//ASP_Petrov 01.11.2021 + 000013050
&НаСервере
Функция ПолучитьМаксимальныйКОдСтроки()
	ТЗКод = Объект.Товары.Выгрузить(,"КодСтроки");
	ТзКод.Сортировать("КодСтроки Убыв");
	КодСтроки = ТзКод[0].КодСтроки; 
	Объект.МаксимальныйКодСтроки = КодСтроки + 1;
	Возврат КодСтроки + 1;

КонецФункции

&НаКлиенте
Процедура асп_ТоварыНазначениеОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтрокаНов = ПолучитьМаксимальныйНомерСтроки();
	Если не Объект.Товары.Количество() = СтрокаНов тогда
		СтрокаТЧ = Объект.Товары[Объект.Товары.Количество() - 1];
		СтрокаТч.Назначение = ВыбранноеЗначение;
		ВыбранноеЗначение = "";
	КонецЕсли;
КонецПроцедуры

&НаСервере
функция ПолучитьМаксимальныйНомерСтроки()
	
	Возврат Объект.Ссылка.Товары.Количество();
	
КонецФункции	
//ASP_Petrov 01.11.2021 -  