#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру с описаниями типов различных реквизитов.
//
// Возвращаемое значение:
//   Структура - содержит описания типов для различных реквизитов, используемых в системе.
Функция Типы() Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИмяРеквизита", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(40)));
	
	Результат.Вставить("Строка", Новый ОписаниеТипов("Строка"));
	Результат.Вставить("Дата", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Результат.Вставить("Булево", Новый ОписаниеТипов("Булево"));
	Результат.Вставить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)));
	Результат.Вставить("ДенежнаяСумма", Метаданные.ОпределяемыеТипы.ДенежнаяСуммаНеотрицательная.Тип);
	Результат.Вставить("ДенежнаяСуммаЛюбогоЗнака", Метаданные.ОпределяемыеТипы.ДенежнаяСуммаЛюбогоЗнака.Тип);
	
	Результат.Вставить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Результат.Вставить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Результат.Вставить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	Результат.Вставить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
	Результат.Вставить("БанковскиеСчетаКонтрагентов", Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчетаКонтрагентов")); 
	Результат.Вставить("БанковскиеСчетаОрганизаций", Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчетаОрганизаций"));
	Результат.Вставить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Результат.Вставить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	Результат.Вставить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));  
	Результат.Вставить("СоглашениеСКлиентом", Новый ОписаниеТипов("СправочникСсылка.СоглашенияСКлиентами"));
	Результат.Вставить("СоглашениеСПоставщиком", Новый ОписаниеТипов("СправочникСсылка.СоглашенияСПоставщиками")); 
	Результат.Вставить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
    Результат.Вставить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	Результат.Вставить("СтатьяДоходов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиДоходов"));
	Результат.Вставить("СтатьяРасходов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	Результат.Вставить("Статья", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиДоходов, ПланВидовХарактеристикСсылка.СтатьиРасходов, ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов"));
	Результат.Вставить("СписатьНаРасходы", Новый ОписаниеТипов("Булево"));
	Результат.Вставить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
	Результат.Вставить("ДокументОснованиеКорректировки", Метаданные.ОпределяемыеТипы.ДокументОснованиеКорректировкиБРД.Тип);
	
	Результат.Вставить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	Результат.Вставить("СтраныМира", Новый ОписаниеТипов("СправочникСсылка.СтраныМира"));
	Результат.Вставить("НомераГТД", Новый ОписаниеТипов("СправочникСсылка.НомераГТД"));
	Результат.Вставить("Банк", Новый ОписаниеТипов("СправочникСсылка.КлассификаторБанков"));
	Результат.Вставить("ВидСкидки", Новый ОписаниеТипов("Число"));
	Результат.Вставить("ВидДокумента", Новый ОписаниеТипов("Строка"));

	Возврат Результат;
	
КонецФункции

// Проверяет, относится ли указанный тип документа к типу "Приобретение товаров и услуг" и
// "Приобретение услуг и прочих активов".
//
// Параметры:
//   ТипДокумента - Тип - проверяемый тип документа
//
// Возвращаемое значение:
//   Булево - Истина, если тип документа относится к "Поступление товаров и услуг", иначе Ложь
Функция ЭтоПоступлениеТоваровУслуг(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.ПоступлениеТоваровУслугБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

// Проверяет, относится ли тип документа к реализации.
//
// Параметры:
//   ТипДокумента - Тип - проверяемый тип документа
//
// Возвращаемое значение:
//   Булево - Истина, если тип документа относится к реализации, иначе Ложь
Функция ЭтоРеализацияТоваровУслуг(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.РеализацияТоваровУслугБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

// Проверяет, относится ли документ к типу "Счет-фактура полученный".
//
// Параметры:
//   ТипДокумента - Тип - проверяемый тип документа
//
// Возвращаемое значение:
//   Булево - Истина, если документ относится к типу "Счет-фактура полученный", иначе Ложь
Функция ЭтоСчетФактураПолученный(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.СчетФактураПолученныйБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

// Проверяет, относится ли документ к типу "Счет-фактура выданный".
//
// Параметры:
//   ТипДокумента - Тип - проверяемый тип документа
//
// Возвращаемое значение:
//   Булево - Истина, если документ относится к типу "Счет-фактура выданный", иначе Ложь
Функция ЭтоСчетФактураВыданный(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.СчетФактураВыданныйБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

// Проверяет, относится ли указанный тип документа к типу "Заказ клиента".
//
// Параметры:
//   ТипДокумента - Тип - проверяемый тип документа
//
// Возвращаемое значение:
//   Булево - Истина, если тип документа относится к "Заказ клиента", иначе Ложь
Функция ЭтоЗаказКлиента(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.ЗаказКлиентаБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

// Проверяет, относится ли указанный тип документа к типу "ЗаказПоставщику".
//
// Параметры:
//   ТипДокумента - Тип - проверяемый тип документа
//
// Возвращаемое значение:
//   Булево - Истина, если тип документа относится к "ЗаказПоставщику", иначе Ложь
Функция ЭтоЗаказПоставщику(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.ЗаказПоставщикуБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

// Проверяет, относится ли указанный тип документа к типу "Акт выполненных работ".
//
// Параметры:
//   ТипДокумента - Тип - проверяемый тип документа
//
// Возвращаемое значение:
//   Булево - Истина, если тип документа является "Актом выполненных работ", иначе Ложь
Функция ЭтоАктВыполненныхРабот(ТипДокумента) Экспорт
	
	Возврат Метаданные.ОпределяемыеТипы.АктВыполненныхРаботБРД.Тип.СодержитТип(ТипДокумента);
	
КонецФункции

#КонецОбласти
