#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.НачисленныеСуммыАкцизов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "НачисленныеСуммыАкцизов");
	ОписаниеВарианта.Описание = НСтр("ru= 'Информация о суммах акцизов, начисленных в выбранном периоде.'");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

//++ Локализация

// Формирует текст, выводимый в заголовке отчета.
//
// Параметры:
//  ПараметрыОтчета - Структура - см. ПодготовитьПараметрыОтчета() в ФормаОтчета.
//
// Возвращаемое значение:
//   Строка      - текст заголовка с учетом периода.
//
Функция ПолучитьТекстЗаголовка(ПараметрыОтчета) Экспорт
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Начисленные суммы акцизов %1'"),
		БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
			ПараметрыОтчета.НачалоПериода,
			ПараметрыОтчета.КонецПериода,
			Истина));
			
КонецФункции

//-- Локализация
#КонецОбласти
//++ Локализация


// Не требуется в УТ.

//-- Локализация

#Область СлужебныйПрограммныйИнтерфейс

// Добавляет информационное сообщение в шапку отчета.
//
// Параметры:
//	ДокументРезультат - ТабличныйДокумент - Результат отчета.
//	ЗначенияОтбораДанных - Структура - см. ПолучитьЗначенияОтбораДанных().
//
Процедура ДобавитьИнформационноеСообщениеВШапку(ДокументРезультат, ЗначенияОтбораДанных) Экспорт
	
	Если ДанныеОтчетаАктуальны(ЗначенияОтбораДанных) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Данные в отчете могут быть неактуальны:
	|Имеются невыполненные задания неоперативного допроведения документов по акцизам.'");
	
	ДокументРезультат.Область("R1C1").Текст = ТекстСообщения;
	ДокументРезультат.Область("R1C1").ЦветТекста = Метаданные.ЭлементыСтиля.ЦветТекстаПроблема.Значение;
	ДокументРезультат.Область(1, 1, 1, ).ВысотаСтроки = 0;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеОтчетаАктуальны(ЗначенияОтбораДанных)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПРЕДСТАВЛЕНИЕ(ЗаданияКРасчету.Организация) КАК ОрганизацияПредставление
	|ИЗ
	|	РегистрСведений.ЗаданияНеоперативногоДопроведенияДокументов КАК ЗаданияКРасчету
	|ГДЕ
	|	ЗаданияКРасчету.ВидЗадания = ЗНАЧЕНИЕ(Справочник.ВидыНеоперативныхЗаданий.ОтражениеДвиженийПоАкцизам)
	|	И ВЫБОР КОГДА &БезОтбораПоОрганизации ТОГДА ИСТИНА ИНАЧЕ ЗаданияКРасчету.Организация В (&СписокОрганизаций) КОНЕЦ
	|	И ВЫБОР КОГДА &Период = ДАТАВРЕМЯ(1, 1, 1) ТОГДА ИСТИНА ИНАЧЕ ЗаданияКРасчету.ПериодЗадания <= &Период КОНЕЦ
	|СГРУППИРОВАТЬ ПО
	|	ПРЕДСТАВЛЕНИЕ(ЗаданияКРасчету.Организация)";
	
	Запрос.УстановитьПараметр("БезОтбораПоОрганизации", ЗначенияОтбораДанных.СписокОрганизаций.Количество() = 0);
	Запрос.УстановитьПараметр("СписокОрганизаций", ЗначенияОтбораДанных.СписокОрганизаций);
	Запрос.УстановитьПараметр("Период", ЗначенияОтбораДанных.Период);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат.Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли