
&НаСервере
&ИзменениеИКонтроль("ДалееКШагуЗаказы")
Функция асп_ДалееКШагуЗаказы(Результат)
	
	Таблица = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	Если Не ЗначениеЗаполнено(Таблица) Тогда
		Возврат Ложь;
	КонецЕсли;      
		
	#Вставка
	//++//ASP_Crow 18.03.2026 000029567 В расширение
	//ASP_Hlopkov 26.04.21+ 
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Таблица.Артикул КАК Артикул,
	//	|	Таблица.ВалютаСоглашения КАК ВалютаСоглашения,
	//	|	Таблица.Вес КАК Вес,
	//	|	Таблица.ВидЦены КАК ВидЦены,
	//	//|	Таблица.ГраницаОбеспечиваемогоПериода КАК ГраницаОбеспечиваемогоПериода,
	//	|	Таблица.ДатаБлижайшейПоставкиПоГрафику КАК ДатаБлижайшейПоставкиПоГрафику,
	//	|	Таблица.ДатаВозможнойПоставки КАК ДатаВозможнойПоставки,
	//	|	Таблица.ДатаЗаказа КАК ДатаЗаказа,
	//	|	Таблица.ДатаОтгрузки КАК ДатаОтгрузки,
	//	//|	Таблица.ДатаЗаказаНаступила как ДатаЗаказаНаступила,
	//	|	Таблица.ДатаОтгрузкиЗаказа КАК ДатаОтгрузкиЗаказа,
	//	|	Таблица.ДатаПоставки КАК ДатаПоставки,
	//	|	Таблица.ДатаПоставкиРассчитанаПоДатеОтгрузки КАК ДатаПоставкиРассчитанаПоДатеОтгрузки,
	//	|	Таблица.ДатаСледующейПоставкиПоГрафику КАК ДатаСледующейПоставкиПоГрафику,
	//	|	Таблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//	|	Таблица.Заказ КАК Заказ,
	//	|	Таблица.ЗнаменательУпаковки КАК ЗнаменательУпаковки,
	//	|	Таблица.ИспользоватьУпаковки КАК ИспользоватьУпаковки,
	//	|	Таблица.ИсточникОбеспечения КАК ИсточникОбеспечения,
	//	|	Таблица.ИсточникОбеспеченияТолькоПросмотр КАК ИсточникОбеспеченияТолькоПросмотр,
	//	|	Таблица.КЗаказу КАК КЗаказу,
	//	|	Таблица.КРезервированию КАК КРезервированию,
	//	|	Таблица.КалендарьПредприятия КАК КалендарьПредприятия,
	//	|	Таблица.КалендарьСклада КАК КалендарьСклада,
	//	|	Таблица.Код КАК Код,
	//	|	Таблица.МинимальнаяПартияПоставки как МинимальнаяПартияПоставки,
	//	|	Таблица.МинимальнаяСуммаЗаказа как МинимальнаяСуммаЗаказа,
	//	|	Таблица.Назначение КАК Назначение,
	//	|	Таблица.НазначениеНаименование как НазначениеНаименование,
	//	|	Таблица.Номенклатура КАК Номенклатура,
	//	|	Таблица.НоменклатураНаименование КАК НоменклатураНаименование,
	//	|	Таблица.ОбеспечиваемыйПериод КАК ОбеспечиваемыйПериод,
	//	//|	Таблица.ОтгрузкаВнутриПериода как ОтгрузкаВнутриПериода,
	//	|	Таблица.Отметка как Отметка,
	//	|	Таблица.ОбеспечиватьНезависимоОтЗапасов КАК ОбеспечиватьНезависимоОтЗапасов,
	//	|	Таблица.ОшибкаНеЗаполненКалендарьПредприятия КАК ОшибкаНеЗаполненКалендарьПредприятия,
	//	|	Таблица.ОшибкаНеЗаполненКалендарьСклада КАК ОшибкаНеЗаполненКалендарьСклада,
	//	|	Таблица.ПеремещениеРазрешено КАК ПеремещениеРазрешено,
	//	|	Таблица.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	//	|	Таблица.Приоритет КАК Приоритет,
	//	|	Таблица.ПриоритетРеквизитДопУпорядочивания КАК ПриоритетРеквизитДопУпорядочивания,
	//	//|	Таблица.РазмещатьЗаказыНаОтгрузку КАК РазмещатьЗаказыНаОтгрузку,
	//	|	Таблица.РаспределительныйЦентр КАК РаспределительныйЦентр,
	//	|	Таблица.РаспределительныйЦентрЕстьВТаблице КАК РаспределительныйЦентрЕстьВТаблице,
	//	|	Таблица.Склад КАК Склад,
	//	|	Таблица.СкладНаименование КАК СкладНаименование,
	//	|	Таблица.СкладОтгрузкиЗаказа КАК СкладОтгрузкиЗаказа,
	//	|	Таблица.Соглашение КАК Соглашение,
	//	|	Таблица.СпособОбеспечения КАК СпособОбеспечения,
	//	|	Таблица.СрокПоставки КАК СрокПоставки,
	//	|	Таблица.ТипЕдиницыИзмерения КАК ТипЕдиницыИзмерения,
	//	|	Таблица.ТипОбеспечения КАК ТипОбеспечения,
	//	|	Таблица.Требуется КАК Требуется,
	//	|	Таблица.УпаковкаЗаказа КАК УпаковкаЗаказа,
	//	|	Таблица.УпаковкаЗаказаПоставщика как УпаковкаЗаказаПоставщика,
	//	|	Таблица.ФормироватьПлановыеЗаказы КАК ФормироватьПлановыеЗаказы,
	//	|	Таблица.Характеристика КАК Характеристика,
	//	|	Таблица.ХарактеристикаНаименование КАК ХарактеристикаНаименование,
	//	|	Таблица.ЦенаВВалютеСоглашения КАК ЦенаВВалютеСоглашения,
	//	|	Таблица.ЦенаВВалютеУправленческогоУчета КАК ЦенаВВалютеУправленческогоУчета,
	//	|	Таблица.ЧислительУпаковки КАК ЧислительУпаковки,
	//	|	Таблица.ЭтоРабота КАК ЭтоРабота
	//	|ПОМЕСТИТЬ ВТТаблица
	//	|ИЗ
	//	|	&Таблица КАК Таблица
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТТаблица.Артикул КАК Артикул,
	//	|	ВТТаблица.ВалютаСоглашения КАК ВалютаСоглашения,
	//	|	ВТТаблица.Вес КАК Вес,
	//	|	ВТТаблица.ВидЦены КАК ВидЦены,
	//	//|	ВТТаблица.ГраницаОбеспечиваемогоПериода КАК ГраницаОбеспечиваемогоПериода,
	//	|	ВТТаблица.ДатаБлижайшейПоставкиПоГрафику КАК ДатаБлижайшейПоставкиПоГрафику,
	//	|	ВТТаблица.ДатаВозможнойПоставки КАК ДатаВозможнойПоставки,
	//	|	ВТТаблица.ДатаЗаказа КАК ДатаЗаказа,
	//	|	ВТТаблица.ДатаОтгрузки КАК ДатаОтгрузки,
	//	|	ВТТаблица.ДатаОтгрузкиЗаказа КАК ДатаОтгрузкиЗаказа,
	//	|	ВТТаблица.ДатаПоставки КАК ДатаПоставки,
	//	|	ВТТаблица.ДатаПоставкиРассчитанаПоДатеОтгрузки КАК ДатаПоставкиРассчитанаПоДатеОтгрузки,
	//	|	ВТТаблица.ДатаСледующейПоставкиПоГрафику КАК ДатаСледующейПоставкиПоГрафику,
	//	|	ВТТаблица.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//	|	ВТТаблица.Заказ КАК Заказ,
	//	|	ВТТаблица.ЗнаменательУпаковки КАК ЗнаменательУпаковки,
	//	|	ВТТаблица.ИспользоватьУпаковки КАК ИспользоватьУпаковки,
	//	|	ВТТаблица.ИсточникОбеспечения КАК ИсточникОбеспечения,
	//	|	ВТТаблица.ИсточникОбеспеченияТолькоПросмотр КАК ИсточникОбеспеченияТолькоПросмотр,
	//	|	ВТТаблица.КРезервированию КАК КРезервированию,
	//	|	ВТТаблица.КалендарьПредприятия КАК КалендарьПредприятия,
	//	|	ВТТаблица.КалендарьСклада КАК КалендарьСклада,
	//	|	ВТТаблица.Код КАК Код,
	//	|	ВТТаблица.Назначение КАК Назначение,
	//	|	ВТТаблица.Номенклатура КАК Номенклатура,
	//	|	ВТТаблица.НоменклатураНаименование КАК НоменклатураНаименование,
	//	|	ВТТаблица.ОбеспечиваемыйПериод КАК ОбеспечиваемыйПериод,
	//	|	ВТТаблица.ОбеспечиватьНезависимоОтЗапасов КАК ОбеспечиватьНезависимоОтЗапасов,
	//	|	ВТТаблица.ОшибкаНеЗаполненКалендарьПредприятия КАК ОшибкаНеЗаполненКалендарьПредприятия,
	//	|	ВТТаблица.ОшибкаНеЗаполненКалендарьСклада КАК ОшибкаНеЗаполненКалендарьСклада,
	//	|	ВТТаблица.ПеремещениеРазрешено КАК ПеремещениеРазрешено,
	//	|	ВТТаблица.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	//	|	ВТТаблица.Приоритет КАК Приоритет,
	//	|	ВТТаблица.ПриоритетРеквизитДопУпорядочивания КАК ПриоритетРеквизитДопУпорядочивания,
	//	//|	ВТТаблица.РазмещатьЗаказыНаОтгрузку КАК РазмещатьЗаказыНаОтгрузку,
	//	|	ВТТаблица.РаспределительныйЦентр КАК РаспределительныйЦентр,
	//	|	ВТТаблица.РаспределительныйЦентрЕстьВТаблице КАК РаспределительныйЦентрЕстьВТаблице,
	//	|	ВТТаблица.Склад КАК Склад,
	//	|	ВТТаблица.СкладНаименование КАК СкладНаименование,
	//	|	ВТТаблица.СкладОтгрузкиЗаказа КАК СкладОтгрузкиЗаказа,
	//	|	ВТТаблица.Соглашение КАК Соглашение,
	//	|	ВТТаблица.СпособОбеспечения КАК СпособОбеспечения,
	//	|	ВТТаблица.СрокПоставки КАК СрокПоставки,
	//	|	ВТТаблица.ТипЕдиницыИзмерения КАК ТипЕдиницыИзмерения,
	//	|	ВТТаблица.ТипОбеспечения КАК ТипОбеспечения,
	//	|	ВТТаблица.Требуется КАК Требуется,
	//	|	ВТТаблица.УпаковкаЗаказа КАК УпаковкаЗаказа,
	//	|	ВТТаблица.ФормироватьПлановыеЗаказы КАК ФормироватьПлановыеЗаказы,
	//	|	ВТТаблица.Характеристика КАК Характеристика,
	//	|	ВТТаблица.ХарактеристикаНаименование КАК ХарактеристикаНаименование,
	//	|	ВТТаблица.ЦенаВВалютеСоглашения КАК ЦенаВВалютеСоглашения,
	//	|	ВТТаблица.ЦенаВВалютеУправленческогоУчета КАК ЦенаВВалютеУправленческогоУчета,
	//	|	ВТТаблица.ЧислительУпаковки КАК ЧислительУпаковки,
	//	|	ВТТаблица.ЭтоРабота КАК ЭтоРабота,
	//	//ASP_Hlopkov 03.09.21+
	//	|	ВТТаблица.Отметка КАК Отметка,
	//	|	ВТТаблица.КЗаказу КАК КЗаказу,
	//	//|	ВТТаблица.ДатаЗаказаНаступила как ДатаЗаказаНаступила,
	//	|	ВТТаблица.МинимальнаяПартияПоставки как МинимальнаяПартияПоставки,
	//	|	ВТТаблица.МинимальнаяСуммаЗаказа как МинимальнаяСуммаЗаказа, 
	//	|	ВТТаблица.УпаковкаЗаказаПоставщика как УпаковкаЗаказаПоставщика,
	//	//ASP_Hlopkov 03.09.21-
	//	|	ПеремещениеТоваровТовары.Ссылка КАК СсылкаПеремещение,
	//	|	ЕСТЬNULL(ПеремещениеТоваровТовары.Количество, 0) КАК КоличествоВПеремещении
	//	|ПОМЕСТИТЬ ВТПеремещения
	//	|ИЗ
	//	|	ВТТаблица КАК ВТТаблица
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	//	|		ПО ВТТаблица.Назначение = ПеремещениеТоваровТовары.Назначение
	//	|			И ВТТаблица.Номенклатура = ПеремещениеТоваровТовары.Номенклатура
	//	|			И ВТТаблица.Характеристика = ПеремещениеТоваровТовары.Характеристика
	//	|ГДЕ
	//	|	ПеремещениеТоваровТовары.Ссылка.Проведен
	//	|	И ПеремещениеТоваровТовары.Ссылка.Статус = &Статус
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТПеремещения.Артикул КАК Артикул,
	//	|	ВТПеремещения.ВалютаСоглашения КАК ВалютаСоглашения,
	//	|	ВТПеремещения.Вес КАК Вес,
	//	|	ВТПеремещения.ВидЦены КАК ВидЦены,
	//	//|	ВТПеремещения.ГраницаОбеспечиваемогоПериода КАК ГраницаОбеспечиваемогоПериода,
	//	|	ВТПеремещения.ДатаБлижайшейПоставкиПоГрафику КАК ДатаБлижайшейПоставкиПоГрафику,
	//	|	ВТПеремещения.ДатаВозможнойПоставки КАК ДатаВозможнойПоставки,
	//	|	ВТПеремещения.ДатаЗаказа КАК ДатаЗаказа,
	//	|	ВТПеремещения.ДатаОтгрузки КАК ДатаОтгрузки,
	//	|	ВТПеремещения.ДатаОтгрузкиЗаказа КАК ДатаОтгрузкиЗаказа,
	//	|	ВТПеремещения.ДатаПоставки КАК ДатаПоставки,
	//	|	ВТПеремещения.ДатаПоставкиРассчитанаПоДатеОтгрузки КАК ДатаПоставкиРассчитанаПоДатеОтгрузки,
	//	|	ВТПеремещения.ДатаСледующейПоставкиПоГрафику КАК ДатаСледующейПоставкиПоГрафику,
	//	|	ВТПеремещения.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//	|	ВТПеремещения.Заказ КАК Заказ,
	//	|	ВТПеремещения.ЗнаменательУпаковки КАК ЗнаменательУпаковки,
	//	|	ВТПеремещения.ИспользоватьУпаковки КАК ИспользоватьУпаковки,
	//	|	ВТПеремещения.ИсточникОбеспечения КАК ИсточникОбеспечения,
	//	|	ВТПеремещения.ИсточникОбеспеченияТолькоПросмотр КАК ИсточникОбеспеченияТолькоПросмотр,
	//	|	ВТПеремещения.КРезервированию КАК КРезервированию,
	//	|	ВТПеремещения.КалендарьПредприятия КАК КалендарьПредприятия,
	//	|	ВТПеремещения.КалендарьСклада КАК КалендарьСклада,
	//	|	ВТПеремещения.Код КАК Код,
	//	|	ВТПеремещения.Назначение КАК Назначение,
	//	|	ВТПеремещения.Номенклатура КАК Номенклатура,
	//	|	ВТПеремещения.НоменклатураНаименование КАК НоменклатураНаименование,
	//	|	ВТПеремещения.ОбеспечиваемыйПериод КАК ОбеспечиваемыйПериод,
	//	|	ВТПеремещения.ОбеспечиватьНезависимоОтЗапасов КАК ОбеспечиватьНезависимоОтЗапасов,
	//	|	ВТПеремещения.ОшибкаНеЗаполненКалендарьПредприятия КАК ОшибкаНеЗаполненКалендарьПредприятия,
	//	|	ВТПеремещения.ОшибкаНеЗаполненКалендарьСклада КАК ОшибкаНеЗаполненКалендарьСклада,
	//	|	ВТПеремещения.ПеремещениеРазрешено КАК ПеремещениеРазрешено,
	//	|	ВТПеремещения.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	//	|	ВТПеремещения.Приоритет КАК Приоритет,
	//	|	ВТПеремещения.ПриоритетРеквизитДопУпорядочивания КАК ПриоритетРеквизитДопУпорядочивания,
	//	//|	ВТПеремещения.РазмещатьЗаказыНаОтгрузку КАК РазмещатьЗаказыНаОтгрузку,
	//	|	ВТПеремещения.РаспределительныйЦентр КАК РаспределительныйЦентр,
	//	|	ВТПеремещения.РаспределительныйЦентрЕстьВТаблице КАК РаспределительныйЦентрЕстьВТаблице,
	//	|	ВТПеремещения.Склад КАК Склад,
	//	|	ВТПеремещения.СкладНаименование КАК СкладНаименование,
	//	|	ВТПеремещения.СкладОтгрузкиЗаказа КАК СкладОтгрузкиЗаказа,
	//	|	ВТПеремещения.Соглашение КАК Соглашение,
	//	|	ВТПеремещения.СпособОбеспечения КАК СпособОбеспечения,
	//	|	ВТПеремещения.СрокПоставки КАК СрокПоставки,
	//	|	ВТПеремещения.ТипЕдиницыИзмерения КАК ТипЕдиницыИзмерения,
	//	|	ВТПеремещения.ТипОбеспечения КАК ТипОбеспечения,
	//	|	ВЫБОР
	//	|		КОГДА ВТПеремещения.СсылкаПеремещение ЕСТЬ NULL
	//	|			ТОГДА ВТПеремещения.Требуется
	//	|		ИНАЧЕ ВТПеремещения.Требуется - ВТПеремещения.КоличествоВПеремещении
	//	|	КОНЕЦ КАК Требуется,
	//	|	ВТПеремещения.УпаковкаЗаказа КАК УпаковкаЗаказа,
	//	|	ВТПеремещения.ФормироватьПлановыеЗаказы КАК ФормироватьПлановыеЗаказы,
	//	|	ВТПеремещения.Характеристика КАК Характеристика,
	//	|	ВТПеремещения.ХарактеристикаНаименование КАК ХарактеристикаНаименование,
	//	|	ВТПеремещения.ЦенаВВалютеСоглашения КАК ЦенаВВалютеСоглашения,
	//	|	ВТПеремещения.ЦенаВВалютеУправленческогоУчета КАК ЦенаВВалютеУправленческогоУчета,
	//	|	ВТПеремещения.ЧислительУпаковки КАК ЧислительУпаковки,
	//	|	ВТПеремещения.ЭтоРабота КАК ЭтоРабота,
	//	//ASP_Hlopkov 03.09.21+
	//	|	ВТПеремещения.Отметка КАК Отметка,
	//	|	ВТПеремещения.КЗаказу КАК КЗаказу,
	//	//|	ВТПеремещения.ДатаЗаказаНаступила как ДатаЗаказаНаступила,
	//	|	ВТПеремещения.МинимальнаяПартияПоставки как МинимальнаяПартияПоставки,
	//	|	ВТПеремещения.МинимальнаяСуммаЗаказа как МинимальнаяСуммаЗаказа, 
	//	|	ВТПеремещения.УпаковкаЗаказаПоставщика как УпаковкаЗаказаПоставщика
	//	//ASP_Hlopkov 03.09.21-
	//	|ПОМЕСТИТЬ ВТПослеПересчета
	//	|ИЗ
	//	|	ВТПеремещения КАК ВТПеремещения
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТПослеПересчета.Артикул КАК Артикул,
	//	|	ВТПослеПересчета.ВалютаСоглашения КАК ВалютаСоглашения,
	//	|	ВТПослеПересчета.Вес КАК Вес,
	//	|	ВТПослеПересчета.ВидЦены КАК ВидЦены,
	//	//|	ВТПослеПересчета.ГраницаОбеспечиваемогоПериода КАК ГраницаОбеспечиваемогоПериода,
	//	|	ВТПослеПересчета.ДатаБлижайшейПоставкиПоГрафику КАК ДатаБлижайшейПоставкиПоГрафику,
	//	|	ВТПослеПересчета.ДатаВозможнойПоставки КАК ДатаВозможнойПоставки,
	//	|	ВТПослеПересчета.ДатаЗаказа КАК ДатаЗаказа,
	//	|	ВТПослеПересчета.ДатаОтгрузки КАК ДатаОтгрузки,
	//	|	ВТПослеПересчета.ДатаОтгрузкиЗаказа КАК ДатаОтгрузкиЗаказа,
	//	|	ВТПослеПересчета.ДатаПоставки КАК ДатаПоставки,
	//	|	ВТПослеПересчета.ДатаПоставкиРассчитанаПоДатеОтгрузки КАК ДатаПоставкиРассчитанаПоДатеОтгрузки,
	//	|	ВТПослеПересчета.ДатаСледующейПоставкиПоГрафику КАК ДатаСледующейПоставкиПоГрафику,
	//	|	ВТПослеПересчета.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//	|	ВТПослеПересчета.Заказ КАК Заказ,
	//	|	ВТПослеПересчета.ЗнаменательУпаковки КАК ЗнаменательУпаковки,
	//	|	ВТПослеПересчета.ИспользоватьУпаковки КАК ИспользоватьУпаковки,
	//	|	ВТПослеПересчета.ИсточникОбеспечения КАК ИсточникОбеспечения,
	//	|	ВТПослеПересчета.ИсточникОбеспеченияТолькоПросмотр КАК ИсточникОбеспеченияТолькоПросмотр,
	//	|	ВТПослеПересчета.КРезервированию КАК КРезервированию,
	//	|	ВТПослеПересчета.КалендарьПредприятия КАК КалендарьПредприятия,
	//	|	ВТПослеПересчета.КалендарьСклада КАК КалендарьСклада,
	//	|	ВТПослеПересчета.Код КАК Код,
	//	|	ВТПослеПересчета.Назначение КАК Назначение,
	//	|	ВТПослеПересчета.Номенклатура КАК Номенклатура,
	//	|	ВТПослеПересчета.НоменклатураНаименование КАК НоменклатураНаименование,
	//	|	ВТПослеПересчета.ОбеспечиваемыйПериод КАК ОбеспечиваемыйПериод,
	//	|	ВТПослеПересчета.ОбеспечиватьНезависимоОтЗапасов КАК ОбеспечиватьНезависимоОтЗапасов,
	//	|	ВТПослеПересчета.ОшибкаНеЗаполненКалендарьПредприятия КАК ОшибкаНеЗаполненКалендарьПредприятия,
	//	|	ВТПослеПересчета.ОшибкаНеЗаполненКалендарьСклада КАК ОшибкаНеЗаполненКалендарьСклада,
	//	|	ВТПослеПересчета.ПеремещениеРазрешено КАК ПеремещениеРазрешено,
	//	|	ВТПослеПересчета.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	//	|	ВТПослеПересчета.Приоритет КАК Приоритет,
	//	|	ВТПослеПересчета.ПриоритетРеквизитДопУпорядочивания КАК ПриоритетРеквизитДопУпорядочивания,
	//	//|	ВТПослеПересчета.РазмещатьЗаказыНаОтгрузку КАК РазмещатьЗаказыНаОтгрузку,
	//	|	ВТПослеПересчета.РаспределительныйЦентр КАК РаспределительныйЦентр,
	//	|	ВТПослеПересчета.РаспределительныйЦентрЕстьВТаблице КАК РаспределительныйЦентрЕстьВТаблице,
	//	|	ВТПослеПересчета.Склад КАК Склад,
	//	|	ВТПослеПересчета.СкладНаименование КАК СкладНаименование,
	//	|	ВТПослеПересчета.СкладОтгрузкиЗаказа КАК СкладОтгрузкиЗаказа,
	//	|	ВТПослеПересчета.Соглашение КАК Соглашение,
	//	|	ВТПослеПересчета.СпособОбеспечения КАК СпособОбеспечения,
	//	|	ВТПослеПересчета.СрокПоставки КАК СрокПоставки,
	//	|	ВТПослеПересчета.ТипЕдиницыИзмерения КАК ТипЕдиницыИзмерения,
	//	|	ВТПослеПересчета.ТипОбеспечения КАК ТипОбеспечения,
	//	|	ВТПослеПересчета.Требуется КАК Требуется,
	//	|	ВТПослеПересчета.УпаковкаЗаказа КАК УпаковкаЗаказа,
	//	|	ВТПослеПересчета.ФормироватьПлановыеЗаказы КАК ФормироватьПлановыеЗаказы,
	//	|	ВТПослеПересчета.Характеристика КАК Характеристика,
	//	|	ВТПослеПересчета.ХарактеристикаНаименование КАК ХарактеристикаНаименование,
	//	|	ВТПослеПересчета.ЦенаВВалютеСоглашения КАК ЦенаВВалютеСоглашения,
	//	|	ВТПослеПересчета.ЦенаВВалютеУправленческогоУчета КАК ЦенаВВалютеУправленческогоУчета,
	//	|	ВТПослеПересчета.ЧислительУпаковки КАК ЧислительУпаковки,
	//	|	ВТПослеПересчета.ЭтоРабота КАК ЭтоРабота,
	//	//ASP_Hlopkov 03.09.21+
	//	|	ВТПослеПересчета.Отметка КАК Отметка,
	//	|	ВТПослеПересчета.КЗаказу КАК КЗаказу,
	//	//|	ВТПослеПересчета.ДатаЗаказаНаступила как ДатаЗаказаНаступила,
	//	|	ВТПослеПересчета.МинимальнаяПартияПоставки как МинимальнаяПартияПоставки,
	//	|	ВТПослеПересчета.МинимальнаяСуммаЗаказа как МинимальнаяСуммаЗаказа, 
	//	|	ВТПослеПересчета.УпаковкаЗаказаПоставщика как УпаковкаЗаказаПоставщик
	//	//ASP_Hlopkov 03.09.21-
	//	|ИЗ
	//	|	ВТПослеПересчета КАК ВТПослеПересчета
	//	|ГДЕ
	//	|	ВТПослеПересчета.Требуется > 0
	//	|
	//	|ОБЪЕДИНИТЬ ВСЕ
	//	|
	//	|ВЫБРАТЬ
	//	|	ВТТаблица.Артикул,
	//	|	ВТТаблица.ВалютаСоглашения,
	//	|	ВТТаблица.Вес,
	//	|	ВТТаблица.ВидЦены,
	//	//|	ВТТаблица.ГраницаОбеспечиваемогоПериода,
	//	|	ВТТаблица.ДатаБлижайшейПоставкиПоГрафику,
	//	|	ВТТаблица.ДатаВозможнойПоставки,
	//	|	ВТТаблица.ДатаЗаказа,
	//	|	ВТТаблица.ДатаОтгрузки,
	//	|	ВТТаблица.ДатаОтгрузкиЗаказа,
	//	|	ВТТаблица.ДатаПоставки,
	//	|	ВТТаблица.ДатаПоставкиРассчитанаПоДатеОтгрузки,
	//	|	ВТТаблица.ДатаСледующейПоставкиПоГрафику,
	//	|	ВТТаблица.ЕдиницаИзмерения,
	//	|	ВТТаблица.Заказ,
	//	|	ВТТаблица.ЗнаменательУпаковки,
	//	|	ВТТаблица.ИспользоватьУпаковки,
	//	|	ВТТаблица.ИсточникОбеспечения,
	//	|	ВТТаблица.ИсточникОбеспеченияТолькоПросмотр,
	//	|	ВТТаблица.КРезервированию,
	//	|	ВТТаблица.КалендарьПредприятия,
	//	|	ВТТаблица.КалендарьСклада,
	//	|	ВТТаблица.Код,
	//	|	ВТТаблица.Назначение,
	//	|	ВТТаблица.Номенклатура,
	//	|	ВТТаблица.НоменклатураНаименование,
	//	|	ВТТаблица.ОбеспечиваемыйПериод,
	//	|	ВТТаблица.ОбеспечиватьНезависимоОтЗапасов,
	//	|	ВТТаблица.ОшибкаНеЗаполненКалендарьПредприятия,
	//	|	ВТТаблица.ОшибкаНеЗаполненКалендарьСклада,
	//	|	ВТТаблица.ПеремещениеРазрешено,
	//	|	ВТТаблица.ПодразделениеПолучатель,
	//	|	ВТТаблица.Приоритет,
	//	|	ВТТаблица.ПриоритетРеквизитДопУпорядочивания,
	//	//|	ВТТаблица.РазмещатьЗаказыНаОтгрузку,
	//	|	ВТТаблица.РаспределительныйЦентр,
	//	|	ВТТаблица.РаспределительныйЦентрЕстьВТаблице,
	//	|	ВТТаблица.Склад,
	//	|	ВТТаблица.СкладНаименование,
	//	|	ВТТаблица.СкладОтгрузкиЗаказа,
	//	|	ВТТаблица.Соглашение,
	//	|	ВТТаблица.СпособОбеспечения,
	//	|	ВТТаблица.СрокПоставки,
	//	|	ВТТаблица.ТипЕдиницыИзмерения,
	//	|	ВТТаблица.ТипОбеспечения,
	//	|	ВТТаблица.Требуется,
	//	|	ВТТаблица.УпаковкаЗаказа,
	//	|	ВТТаблица.ФормироватьПлановыеЗаказы,
	//	|	ВТТаблица.Характеристика,
	//	|	ВТТаблица.ХарактеристикаНаименование,
	//	|	ВТТаблица.ЦенаВВалютеСоглашения,
	//	|	ВТТаблица.ЦенаВВалютеУправленческогоУчета,
	//	|	ВТТаблица.ЧислительУпаковки,
	//	|	ВТТаблица.ЭтоРабота,
	//	//ASP_Hlopkov 03.09.21+
	//	|	ВТТаблица.Отметка КАК Отметка,
	//	|	ВТТаблица.КЗаказу КАК КЗаказу,
	//	//|	ВТТаблица.ДатаЗаказаНаступила как ДатаЗаказаНаступила,
	//	|	ВТТаблица.МинимальнаяПартияПоставки как МинимальнаяПартияПоставки,
	//	|	ВТТаблица.МинимальнаяСуммаЗаказа как МинимальнаяСуммаЗаказа, 
	//	|	ВТТаблица.УпаковкаЗаказаПоставщика как УпаковкаЗаказаПоставщик
	//	//ASP_Hlopkov 03.09.21-
	//	|ИЗ
	//	|	ВТТаблица КАК ВТТаблица
	//	|ГДЕ
	//	|	НЕ (ВТТаблица.Номенклатура, ВТТаблица.Характеристика, ВТТаблица.Назначение) В
	//	|				(ВЫБРАТЬ
	//	|					ВТПеремещения.Номенклатура КАК Номенклатура,
	//	|					ВТПеремещения.Характеристика КАК Характеристика,
	//	|					ВТПеремещения.Назначение КАК Назначение
	//	|				ИЗ
	//	|					ВТПеремещения КАК ВТПеремещения)";
	//	
	////ASP_Hlopkov 03.09.21+	
	//НовТаблица = Таблица.Скопировать(); 
	//МассивОтметок = НовТаблица.ВыгрузитьКолонку("Отметка");
	//МассивКЗаказу = НовТаблица.ВыгрузитьКолонку("КЗаказу");
	//НовТаблица.Колонки.Удалить("Отметка");
	//НовТаблица.Колонки.Удалить("КЗаказу");
	//
	//НовТаблица.Колонки.Добавить("Отметка", Новый ОписаниеТипов("Булево"));
	//НовТаблица.Колонки.Добавить("КЗаказу", Новый ОписаниеТипов("Число"));
	//
	//НовТаблица.ЗагрузитьКолонку(МассивОтметок, "Отметка");
	//НовТаблица.ЗагрузитьКолонку(МассивКЗаказу, "КЗаказу");
	////ASP_Hlopkov 03.09.21-
	////--//ASP_Crow 18.03.2026 000029567 В расширение
	//
	//Запрос.УстановитьПараметр("Таблица", НовТаблица);
	//Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыПеремещенийТоваров.Отгружено);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Таблица = РезультатЗапроса.Выгрузить();

	////ASP_Hlopkov 26.04.21-
	#КонецВставки
	Если Не ИспользоватьЗаказыПоставщикам Тогда
		ЕстьОшибки = Ложь;
		ПустыеСпособы = Объект.Запасы.НайтиСтроки(Новый Структура("СпособОбеспечения", Справочники.СпособыОбеспеченияПотребностей.ПустаяСсылка()));
		Для Каждого Строка Из ПустыеСпособы Цикл
			Если Строка.КЗаказу > 0 И Строка.Отметка Тогда
				ЕстьОшибки = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьОшибки Тогда
			СообщитьОбОшибкеНезаполненногоСпособаОбеспечения(ПустыеСпособы);
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Объект.ЗаказыКОбеспечению.Загрузить(Таблица);
	
	// Итоговый расчет рекомендации к заказу.
	ЕстьРаботы = Ложь;
	ЕстьТовары = Ложь;
	Для Каждого СтрокаЗаказы Из Объект.ЗаказыКОбеспечению Цикл
		
		РезультатРасчета = Обработки.ОбеспечениеПотребностей.КоличествоКЗаказуДляОбеспеченияЗаказов(СтрокаЗаказы);
		ЗаполнитьЗначенияСвойств(СтрокаЗаказы, РезультатРасчета);
	
		СтрокаЗаказы.КЗаказуРекомендуется = СтрокаЗаказы.КЗаказу;
		СтрокаЗаказы.Обеспечено = СтрокаЗаказы.КРезервированию;
	
		СтрокаЗаказы.Получатель = ?(СтрокаЗаказы.ЭтоРабота, СтрокаЗаказы.ПодразделениеПолучатель, СтрокаЗаказы.Склад);
		ЗаполнитьРасчетныеПоляСтрокиЗаказы(СтрокаЗаказы, КэшированныеЗначения);  
		//++//ASP_Crow 18.03.2026 000029567 В расширение
	    //ГТС добавляем доп.колонки
	 	СтрокаЗаказы.РезервыНаСкладе=ПолучитьРезервыТекущегоСклада(СтрокаЗаказы.Номенклатура, СтрокаЗаказы.Характеристика, СтрокаЗаказы.Склад);
		СтрокаЗаказы.СвободныйОстатокНаСкладе=ПолучитьОстаткиТалдом(СтрокаЗаказы.Номенклатура, СтрокаЗаказы.Характеристика);
		СтрокаЗаказы.СвободныйОстатокНаСкладеБ=ПолучитьОстаткиБоровское(СтрокаЗаказы.Номенклатура, СтрокаЗаказы.Характеристика);
		СтрокаЗаказы.КратностьПаллетам = ПолучитьКратностьПаллетам(СтрокаЗаказы.Номенклатура, СтрокаЗаказы.Характеристика);   
		//--//ASP_Crow 18.03.2026 000029567 В расширение
		СтрокаЗаказы.ИсточникОбеспечения = ОбработатьПустойИсточникОбеспечения(СтрокаЗаказы.ИсточникОбеспечения, ТекстНеЗаполнено);
		
		ЕстьРаботы = ЕстьРаботы Или СтрокаЗаказы.ЭтоРабота;
		ЕстьТовары = ЕстьТовары Или Не СтрокаЗаказы.ЭтоРабота;
	
	КонецЦикла;
	
	ОчиститьОтборыЗаказы();
	
	Элементы.Получатель.Заголовок = ?(ЕстьРаботы И ЕстьТовары, НСтр("ru = 'Получатель'"),
		?(ЕстьРаботы, НСтр("ru = 'Подразделение-получатель'"), НСтр("ru = 'Склад'")));
		
	Элементы.Получатель.Видимость = ИспользоватьНесколькоСкладов Или ЕстьРаботы;
	
	ЗаполнитьДеревоИндексов(Ложь);
	
	СоответствиеСтрок = Новый Соответствие();
	Коллекция = ИндексыПоиска.ПолучитьЭлементы(); 
	Для Каждого Корень Из Коллекция Цикл
		
		СоответствиеСтрок.Очистить();
		Строки = Корень.ПолучитьЭлементы();
		Для Каждого СтрокаДерева Из Строки Цикл
			
			ТаблицаФормы = ?(СтрокаДерева.ТаблицаЗапасы, Объект.Запасы, Объект.ЗаказыКОбеспечению);
			СтрокаТаблицы = ТаблицаФормы.НайтиПоИдентификатору(СтрокаДерева.ИДСтроки);
			
			Если СтрокаТаблицы.Отметка Тогда
				СоответствиеСтрок.Вставить(СтрокаТаблицы, СтрокаДерева.ТаблицаЗапасы);
			КонецЕсли;
			
		КонецЦикла;
		
		ОкруглитьСоответствиеСтрок(СоответствиеСтрок, ИспользоватьУпаковки);
		
	КонецЦикла;
	
	РассчитатьИтогиНаСервере();
	
	ЗаполнитьКорзинуЗаказов("ЗаказыКОбеспечению");//ASP_Crow 18.03.2026 000029567 В расширение
	
	УстановитьСтраницыПомощника("ШагЗаказы");
	
	Возврат Истина;
	
КонецФункции
