
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
	//		"Документ.РеализацияТоваровУслуг",
	//		"Накладная",
	//		//ПараметрКоманды,
	//		Неопределено,
	//		Новый Структура("ВыводитьКомплектующие", Истина)
	//	);
	//

	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	Документы.ЗаявкаНаВывоз.Печать(ТабДок, ПараметрКоманды);
КонецПроцедуры
