&НаКлиенте
Перем	Разработка	Экспорт;


&НаКлиенте
Процедура Отправить(Команда)
	
	ФайлПараметров		=	ПолучитьИмяВременногоФайла(".txt");
 
	ФайлРезультата		=	ПолучитьИмяВременногоФайла(".html");
 
 
	ТекстовыйДокумент	=	Новый	ТекстовыйДокумент;
	
	ТекстовыйДокумент.ДобавитьСтроку("&product=" + Разработка + "&text=" + ТекстОтзыва);
 
	ТекстовыйДокумент.Записать(ФайлПараметров);
 
 
 
	Соединение	=	Новый	HTTPСоединение("1-sys.ru", , , );
 
	Соединение.ОтправитьДляОбработки(ФайлПараметров, "/_scripts/FeedbackFrom1C.php",  ФайлРезультата, "Content-Type: application/x-www-form-urlencoded");
	
	Закрыть();

КонецПроцедуры
