
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов  
	
	
	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
		ГиперссылкаФайлов = МодульРаботаСФайлами.ГиперссылкаФайлов();
		ГиперссылкаФайлов.Размещение = "КоманднаяПанель";
		МодульРаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ГиперссылкаФайлов);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами

	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
   	ЗаполнитьВидыНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
    ЗаполнитьВидыНоменклатуры();
КонецПроцедуры


// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры



&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);

КонецПроцедуры        

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ТиповыеУсловияПриИзменении(Элемент)
	Если Объект.ТиповыеУсловия = Ложь Тогда
		Элементы.СрокГарантииМесяцев.ТолькоПросмотр=Ложь;
		Элементы.МЧ.ТолькоПросмотр=Ложь;
		Элементы.СрокРеакцииЧасы.ТолькоПросмотр=Ложь;
	Иначе
		Элементы.СрокГарантииМесяцев.ТолькоПросмотр=Истина;
		Элементы.МЧ.ТолькоПросмотр=Истина;
		Элементы.СрокРеакцииЧасы.ТолькоПросмотр=Истина;  
		Объект.МЧ=2000;
		Объект.СрокГарантииМесяцев=12;
		Объект.СрокРеакцииЧасы=0;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТоварПриИзмененииНаСервере(Номенклатура)
	Возврат Номенклатура.ВидНоменклатуры;
КонецФункции

&НаКлиенте
Процедура ТоварПриИзменении(Элемент)   
	ТекДанные = Элементы.Товар.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат; //если пустая таблица
	КонецЕсли;
	ТекДанные.ВидНоменклатуры = ТоварПриИзмененииНаСервере(ТекДанные.Номенклатура);
КонецПроцедуры

&НаКлиенте
Процедура ТоварСерийныйНомерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
  СтандартнаяОбработка = Ложь;
    //получение списка контрагентов выносим в отдельную функцию, выполняемую &НаСервере
     ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаВыбора", Новый Структура("ВидНоменклатуры", Элементы.Товар.ТекущиеДанные.ВидНоменклатуры,"Номенклатура",Элементы.Товар.ТекущиеДанные.Номенклатура), Элемент);
КонецПроцедуры

Процедура ЗаполнитьВидыНоменклатуры()           
	Для каждого Стр из Объект.Товар Цикл 
		Если значениеЗаполнено(Стр.Номенклатура) Тогда
		Стр.ВидНоменклатуры = Стр.Номенклатура.ВидНоменклатуры;
		КонецЕсли;
	КонецЦикла	
КонецПроцедуры


&НаКлиенте
Процедура ТоварДатаНачалаПриИзменении(Элемент)
	    Элементы.Товар.ТекущиеДанные.ДатаКонец=ДобавитьМесяц(Элементы.Товар.ТекущиеДанные.ДатаНачала,Объект.СрокГарантииМесяцев);
КонецПроцедуры


&НаКлиенте
Процедура ПеределкаПриИзменении(Элемент)
	Если Объект.Переделка = Истина Тогда
		Элементы.ПеределаноВ.ТолькоПросмотр=Ложь;
		Иначе
		Элементы.ПеределаноВ.ТолькоПросмотр=Истина;
	    КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ТОВПодарокПриИзменении(Элемент)
	Если Объект.ТОВПодарок=Истина Тогда
		Элементы.ТОВПодарокКомментарий.Доступность=Истина;
	Иначе 
		Объект.ТОВПодарокКомментарий="";
		Элементы.ТОВПодарокКомментарий.Доступность=Ложь;
	КонецЕсли;
	КонецПроцедуры

