////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ (НА СЕРВЕРЕ БЕЗ КОНТЕКСТА)

// Процедура обновляет состояние заказа на форме.
//
&НаСервереБезКонтекста
Процедура ОбновитьСостояниеСервер(ЗаказКлиента,
	                              Состояние,
	                              СостояниеПросрочено,
	                              Картинка,
	                              СуммаОплаты,
	                              СуммаОтгрузки,
	                              ПроцентОплаты,
	                              ПроцентОтгрузки,
	                              СуммаПросроченнойОплаты,
	                              СуммаДолга)
	
	Документы.ЗаказКлиента.РассчитатьСостояние(
		ЗаказКлиента,
		Состояние,
		СостояниеПросрочено,
		Картинка,
		СуммаОплаты,
		СуммаОтгрузки,
		ПроцентОплаты,
		ПроцентОтгрузки,
		СуммаПросроченнойОплаты,
		СуммаДолга
	);
	
КонецПроцедуры // ОбновитьСостояниеСервер()

// Возвращает заголовок суммы долга в зависимости от суммы долга
//
// Параметры:
// СуммаДолга - Число - остаток расчетов
//
&НаСервереБезКонтекста
Функция ПолучитьЗаголовокСуммыДолга(СуммаДолга)

	Если СуммаДолга = 0 Тогда
		ЗаголовокСуммыДолга = НСтр("ru='Долг'");
	ИначеЕсли СуммаДолга > 0 Тогда
		ЗаголовокСуммыДолга = НСтр("ru='Долг клиента'");
	Иначе
		ЗаголовокСуммыДолга = НСтр("ru='Наш долг'");
	КонецЕсли;
	
	Возврат ЗаголовокСуммыДолга;

КонецФункции // ПолучитьЗаголовокСуммыДолга()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаказКлиента               = Параметры.ЗаказКлиента;
	СуммаЗаказано              = Параметры.СуммаЗаказанныхСтрок;
	СуммаОтменено              = Параметры.СуммаОтмененныхСтрок;
	Валюта                     = Параметры.Валюта;
	СуммаАвансаДоОбеспечения   = Параметры.СуммаАвансаДоОбеспечения;
	СуммаПредоплатыДоОтгрузки  = Параметры.СуммаПредоплатыДоОтгрузки;
	
	Если СуммаЗаказано > 0 Тогда
		ПроцентАвансаДоОбеспечения  = СуммаАвансаДоОбеспечения * 100 / СуммаЗаказано;
		ПроцентПредоплатыДоОтгрузки = СуммаПредоплатыДоОтгрузки * 100 / СуммаЗаказано;
	КонецЕсли;
	
	Заголовок = ОбщегоНазначенияУТ.ПолучитьПредставлениеДокумента(ЗаказКлиента, Параметры.Номер, Параметры.Дата);
	
	ОбновитьСостояниеСервер(
		ЗаказКлиента,
		Состояние,
		СостояниеПросрочено,
		Элементы.КартинкаСостояния.Картинка,
		СуммаОплаты,
		СуммаОтгрузки,
		ПроцентОплаты,
		ПроцентОтгрузки,
		СуммаПросроченнойОплаты,
		СуммаДолга
	);
	
	Элементы.СуммаДолга.Заголовок = ПолучитьЗаголовокСуммыДолга(СуммаДолга);
	Если СуммаДолга < 0 Тогда
		СуммаДолга = - СуммаДолга;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ КОМАНД

// Процедура - обработчик команды "ОбновитьСостояние".
//
&НаКлиенте
Процедура ОбновитьСостояние(Команда)
	
	ОбновитьСостояниеСервер(
		ЗаказКлиента,
		Состояние,
		СостояниеПросрочено,
		Элементы.КартинкаСостояния.Картинка,
		СуммаОплаты,
		СуммаОтгрузки,
		ПроцентОплаты,
		ПроцентОтгрузки,
		СуммаПросроченнойОплаты,
		СуммаДолга
	);
	
	Элементы.СуммаДолга.Заголовок = ПолучитьЗаголовокСуммыДолга(СуммаДолга);
	Если СуммаДолга < 0 Тогда
		СуммаДолга = - СуммаДолга;
	КонецЕсли;
	
КонецПроцедуры // ОбновитьСостояние()
