
//#Область ОписаниеПеременных

//&НаКлиенте
//Перем ФормаМодифицирована; // используется для отработки события изменения модифицированности формы

//&НаКлиенте
//Перем ОтветПередЗаписью;

//&НаКлиенте
//Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

//&НаКлиенте
//Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

//&НаКлиенте
//Перем ПараметрыДляЗаписи Экспорт;

//#КонецОбласти

//#Область ОбработчикиСобытийФормы

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	УстановитьУсловноеОформление();
//	
//	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
//		Возврат;
//	КонецЕсли;
//	
//	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
//	
//	// Обработчик механизма "Назначения"
//	Справочники.Назначения.ФормаДокументаПриСозданииНаСервере(ЭтаФорма);
//	
//	СкладПоУмолчанию = ОбщегоНазначенияУТ.ПолучитьПроверитьСкладПоУмолчанию();
//	
//	
//	//ПараметрыВстраивания = ДоступныеОстаткиПараметрыВстраивания();
//	//ОбеспечениеВДокументахСервер.ДоступныеОстаткиПриСозданииНаСервере(ЭтотОбъект, ПараметрыВстраивания);
//	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
//		
//		ПриЧтенииСозданииНаСервере();
//		
//		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
//		СтатусДокумента = Перечисления.СтатусыЗаказовПереработчикам.ПустаяСсылка();
//		
//	КонецЕсли;
//	
//	ИспользоватьПодразделения = ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения");
//	
//	//ЗаполнитьСписокВыбораГруппировкиЗатрат();
//	
//	ИспользоватьПричиныОтменыЗаказовПоставщикам = ПолучитьФункциональнуюОпцию("ИспользоватьПричиныОтменыЗаказовПоставщикам");
//	
//	Если КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_2 Тогда
//		Элементы.ГруппаИтогоПродукция.ЦветФона = Новый Цвет();
//	КонецЕсли;
//	
//	НастроитьЭлементыФормыПоФункциональнымОпциям(ЭтаФорма);
//	
//	УстановитьВидимостьВидаЦен();
//	ЗаполнятьВидыЦенПоУмолчанию = ЗначениеЗаполнено(Объект.ВидЦены);

//	НастроитьВидимостьИЗаполнениеУслуг(ЭтаФорма);
//	
//	Элементы.ЗакрытьЗаказ.Доступность = ПравоДоступа("Изменение", Метаданные.Документы.ЗаказПереработчику);
//	
//	УстановитьДоступностьКомандБуфераОбмена(ЭтаФорма, РаботаСТабличнымиЧастями.ЕстьСтрокиВБуфереОбмена());
//	
//	Элементы.ВозвратныеОтходыВидЦены.БыстрыйВыбор = Не ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВидовЦен");

//	// ПараметрыВыбораСтатейИАналитик
//	ПараметрыВыбораСтатейИАналитик = Документы.ЗаказПереработчику.ПараметрыВыбораСтатейИАналитик();
//	ДоходыИРасходыСервер.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
//	// Конец ПараметрыВыбораСтатейИАналитик
//	
//	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиС);
//	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиПо);
//	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиС1);
//	ДоставкаТоваровКлиентСервер.ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяДоставкиПо1);
//	
//	ВзаиморасчетыСервер.ФормаПриСозданииНаСервере(ЭтаФорма);
//	
//	#Область СтандартныеМеханизмы
//	// Обработчик механизма "ВерсионированиеОбъектов"
//	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
//	
//	// Обработчик механизма "Свойства"
//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("Объект", Объект);
//	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
//	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
//	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);
//	
//	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма, "Продукция,ВозвратныеОтходы,Материалы");
//	
//	// СтандартныеПодсистемы.ПодключаемыеКоманды
//	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
//	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
//	
//	// ИнтеграцияС1СДокументооборотом
//	ИнтеграцияС1СДокументооборотБазоваяФункциональность.ПриСозданииНаСервере(ЭтаФорма);
//	// Конец ИнтеграцияС1СДокументооборотом
//	
//	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
//	
//	#КонецОбласти

//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриЧтенииНаСервере(ТекущийОбъект)

//	// СтандартныеПодсистемы.УправлениеДоступом
//	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
//		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
//		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
//	КонецЕсли;
//	// Конец СтандартныеПодсистемы.УправлениеДоступом
//	
//	
//	
//	//ПараметрыВстраивания = ДоступныеОстаткиПараметрыВстраивания();
//	//ОбеспечениеВДокументахСервер.ДоступныеОстаткиПриЧтенииНаСервере(ЭтотОбъект, ПараметрыВстраивания);
//	
//	ПриЧтенииСозданииНаСервере();
//	
//	// ПараметрыВыбораСтатейИАналитик
//	ПараметрыВыбораСтатейИАналитик = Документы.ЗаказПереработчику.ПараметрыВыбораСтатейИАналитик();
//	ДоходыИРасходыСервер.ПриЧтенииНаСервере(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);
//	// Конец ПараметрыВыбораСтатейИАналитик
//	
//	ВзаиморасчетыСервер.ФормаПриЧтенииНаСервере(ЭтаФорма);
//	
//	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
//	
//	Если Объект.Проведен Тогда
//		СтатусДокумента = Объект.Статус;
//	Иначе
//		СтатусДокумента = Перечисления.СтатусыЗаказовПереработчикам.ПустаяСсылка();
//	КонецЕсли;

//	Если Объект.ПереработкаПоЗаказу Тогда
//		ИсходныеРаспоряжения.Очистить();
//		Для каждого ДанныеСтроки Из Объект.Услуги Цикл
//			ИсходныеРаспоряжения.Добавить(ДанныеСтроки.Распоряжение);
//		КонецЦикла;
//	КонецЕсли;
//	
//	СобытияФорм.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

//	ТребуетсяЗаполнитьДанныеРаспоряжения = Ложь;
//	ТребуетсяУточнитьДанныеРаспоряжения = Ложь;
//	
//	// СтандартныеПодсистемы.ПодключаемыеКоманды
//	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
//	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
//КонецПроцедуры

//&НаСервере
//Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
//	
//	ПроверитьЗаполнениеГруппыЗатрат(Отказ);
//	
//	
//	// СтандартныеПодсистемы.Свойства
//	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
//	// Конец СтандартныеПодсистемы.Свойства
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
//	
//	Если НеВыполнятьПроверкуПередЗаписью Тогда
//		НеВыполнятьПроверкуПередЗаписью = Ложь;
//		Возврат;
//	КонецЕсли;
//	
//	// Если документ проводится, заполним пустые даты поступления в тч Продукция
//	// и пустые даты отгрузки в тч Материалы, рассчитаем скидки, заполним график оплаты.
//	
//	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
//		
//		ДополнительныеПараметры = Новый Структура;
//		ДополнительныеПараметры.Вставить("ПараметрыЗаписи", ПараметрыЗаписи);
//		
//		Отказ = Истина;
//		МногооборотнаяТараКлиент.ПредложитьПодобратьМногооборотнуюТару(
//			ЭтаФорма,
//			"Материалы",
//			"Номенклатура,Характеристика,Количество,Склад,ДатаОтгрузки",
//			Новый ОписаниеОповещения("ПередЗаписьюПредложитьПодобратьМногооборотнуюТаруЗавершение", ЭтотОбъект, ДополнительныеПараметры));
//		Возврат;
//		
//	КонецЕсли;
//	
//	ОбщегоНазначенияУТКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ПараметрыЗаписи, Отказ);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//	
//	
//	// Обработчик механизма "Свойства"
//	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);

//	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

//	// ИнтеграцияС1СДокументооборотом
//	ИнтеграцияС1СДокументооборот.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
//	// Конец ИнтеграцияС1СДокументооборотом
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

//	// СтандартныеПодсистемы.УправлениеДоступом
//	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
//	// Конец СтандартныеПодсистемы.УправлениеДоступом
//	
//	УстановитьДоступностьЭлементовПоСтатусуСервер();
//	
//	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
//		СтатусДокумента = Объект.Статус;
//	Иначе
//		СтатусДокумента = Перечисления.СтатусыЗаказовПереработчикам.ПустаяСсылка();
//	КонецЕсли;
//	
//	ЗаполнитьСлужебныеРеквизиты();
//	ЗаполнитьСлужебныеРеквизитыТабличныхЧастей();
//	
//	ИспользоватьУправлениеПроизводством2_2 = ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2");
//	
//	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(
//		Объект.Материалы,
//		ЗависимыеРеквизитыМатериалы());
//	
//	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(
//		Объект.ВозвратныеОтходы,
//		ЗависимыеРеквизитыВозвратныеОтходы());
//		
//	
//	//бновитьСостояниеСервер();
//	
//	// ПараметрыВыбораСтатейИАналитик
//	ДоходыИРасходыСервер.ПослеЗаписиНаСервере(ЭтотОбъект);
//	// Конец ПараметрыВыбораСтатейИАналитик
//	
//	ВзаиморасчетыСервер.ФормаПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект.ДополнительныеСвойства);
//	
//	СобытияФорм.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
//	
//	ТребуетсяЗаполнитьДанныеРаспоряжения = Ложь;
//	ТребуетсяУточнитьДанныеРаспоряжения = Ложь;
//	ОбеспечениеВДокументахСервер.ПослеЗаписиНаСервере(ЭтотОбъект);
//	УстановитьВидимостьОбеспечения();
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
//	
//	СкрыватьОтмененныеСтрокиМатериалы = Настройки.Получить("СкрыватьОтмененныеСтрокиМатериалы");
//	
//	Если СкрыватьОтмененныеСтрокиМатериалы Тогда
//		Элементы.Материалы.ОтборСтрок = Новый ФиксированнаяСтруктура("Отменено", Ложь);
//	Иначе
//		Элементы.Материалы.ОтборСтрок = Неопределено;
//	КонецЕсли;
//	
//	СкрыватьОтмененныеСтрокиПродукция = Настройки.Получить("СкрыватьОтмененныеСтрокиПродукция");
//	
//	Если СкрыватьОтмененныеСтрокиПродукция Тогда
//		Элементы.Продукция.ОтборСтрок = Новый ФиксированнаяСтруктура("Отменено", Ложь);
//	Иначе
//		Элементы.Продукция.ОтборСтрок = Неопределено;
//	КонецЕсли;
//	
//	Элементы.МатериалыСкрыватьОтмененныеСтроки.Пометка = СкрыватьОтмененныеСтрокиМатериалы;
//	Элементы.ПродукцияСкрыватьОтмененныеСтроки.Пометка = СкрыватьОтмененныеСтрокиПродукция;
//	
//	
//	Если Не Объект.Ссылка.Пустая() Тогда
//		Настройки.Удалить("Объект.НеОтгружатьЧастями");
//		Настройки.Удалить("Объект.ПоступлениеОднойДатой");
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
//	
//	УстановитьВидимостьЭлементовФормыДатОтгрузки();
//	УстановитьВидимостьЭлементовФормыДатПоступления();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
//	
//	// Обработчик механизма "Свойства"
//	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
//		ОбновитьЭлементыДополнительныхРеквизитов();
//		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
//	КонецЕсли;
//	
//	// ПодключаемоеОборудование
//	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
//		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
//			Данные = МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
//			Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМатериалы Тогда
//				ОбработатьШтрихкоды(Данные, "Материалы");
//			Иначе
//				ОбработатьШтрихкоды(Данные, "Продукция");
//			КонецЕсли;
//		КонецЕсли;
//	КонецЕсли;
//	// Конец ПодключаемоеОборудование
//	
//	// Неизвестные штрихкоды
//	Если Источник = "ПодключаемоеОборудование"
//		И ИмяСобытия = "НеизвестныеШтрихкоды"
//		И Параметр.ФормаВладелец = УникальныйИдентификатор Тогда
//		
//		КэшированныеЗначения.Штрихкоды.Очистить();
//		ДанныеШтрихкодов = Новый Массив;
//		Для Каждого ПолученныйШтрихкод Из Параметр.ПолученыНовыеШтрихкоды Цикл
//			ДанныеШтрихкодов.Добавить(ПолученныйШтрихкод);
//		КонецЦикла;
//		Для Каждого ПолученныйШтрихкод Из Параметр.ЗарегистрированныеШтрихкоды Цикл
//			ДанныеШтрихкодов.Добавить(ПолученныйШтрихкод);
//		КонецЦикла;
//		
//		Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМатериалы Тогда
//			ОбработатьШтрихкоды(ДанныеШтрихкодов, "Материалы");
//		Иначе
//			ОбработатьШтрихкоды(ДанныеШтрихкодов, "Продукция");
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Если ВзаиморасчетыКлиент.НуженВызовОбработкиОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
//		ИзмененаОплатаСервер();
//	КонецЕсли;
//	
//	Если ИмяСобытия = "ИзмененРеквизитЗависящийОтСтатуса"
//		И Параметр.УникальныйИдентификатор = УникальныйИдентификатор Тогда
//		Если Объект.Согласован Тогда
//			Объект.Согласован = Ложь;
//		КонецЕсли;
//		ПодключитьОбработчикОжидания("Подключаемый_ПриИзмененииРеквизитаЗависящегоОтСтатуса", 0.1, Истина);
//	КонецЕсли;
//	
//	Если ИмяСобытия = "КопированиеСтрокВБуферОбмена" Тогда
//		УстановитьДоступностьКомандБуфераОбмена(ЭтаФорма, Истина);
//	КонецЕсли;
//	
//	СобытияФормКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
//	
//	СобытияФормКлиент.ОбработкаНавигационнойСсылки(ЭтотОбъект, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ) 
//	
//	ПодключитьОбработчикОжидания("Подключаемый_ПриИзмененииМодифицированностиФормы", 1);
//	
//	// СтандартныеПодсистемы.Свойства
//	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
//	// Конец СтандартныеПодсистемы.Свойства
//	
//	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
//	
//	// СтандартныеПодсистемы.ПодключаемыеКоманды
//	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
//	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
//КонецПроцедуры

//&НаКлиенте
//Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
//	
//	ПринудительноЗакрытьФорму = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриЗакрытии(ЗавершениеРаботы)
//	
//	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПослеЗаписи(ПараметрыЗаписи)
//	
//	ФормаМодифицирована = Неопределено;
//	Подключаемый_ПриИзмененииМодифицированностиФормы();
//	
//	ПараметрыОповещения = Новый Массив;
//	Если Объект.ПереработкаПоЗаказу Тогда
//		Для каждого ДанныеСтроки Из Объект.Услуги Цикл
//			ПараметрыОповещения.Добавить(ДанныеСтроки.Распоряжение);
//		КонецЦикла;
//		Для каждого ЭлементСписка Из ИсходныеРаспоряжения Цикл
//			Если ПараметрыОповещения.Найти(ЭлементСписка.Значение) = Неопределено Тогда
//				ПараметрыОповещения.Добавить(ЭлементСписка.Значение);
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;
//	Оповестить("Запись_ЗаказПереработчику", ПараметрыОповещения, Объект.Ссылка);
//	ОповеститьОбИзменении(Объект.Ссылка);
//	ОбеспечениеВДокументахКлиент.ПослеЗаписи(ЭтотОбъект, "Подключаемый_ПроверитьВыполнениеЗаданияРаспределенияЗапасов");
//	ВзаиморасчетыКлиент.ФормаПослеЗаписи(ЭтаФорма);
//	
//	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
//	
//	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
//	
//	// СтандартныеПодсистемы.ПодключаемыеКоманды
//	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
//		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
//		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
//	КонецЕсли;
//	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
//	
//	// &ЗамерПроизводительности
//	ОценкаПроизводительностиКлиент.ЗамерВремени(
//		"Документ.ЗаказПереработчику.Форма.ФормаДокумента.Событие.ОбработкаВыбора");
//	
//	Если ИсточникВыбора.ИмяФормы = "Обработка.СостояниеОбеспеченияЗаказов.Форма.Форма" Тогда
//		
//		Если Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства") Тогда
//			
//				
//		Иначе
//			
//			АдресТаблицыДвижений = ЗаполнитьОбеспечениеИзФормыСостоянияОбеспечения(
//				ВыбранноеЗначение.КодДействия,
//				ВыбранноеЗначение.АдресАналитик,
//				ВыбранноеЗначение.ПараметрыЗаполнения);
//				
//		КонецЕсли;
//			
//		// Возврат управления в форму обработки состояния обеспечения.
//		ВыполнитьОбработкуОповещения(ВыбранноеЗначение.ВыполняемоеОповещение, АдресТаблицыДвижений);
//		
//	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПодборМногооборотнойТары.Форма.Форма" Тогда
//		
//		ЗаполнитьМногооборотнуюТаруИзХранилищаСервер(ВыбранноеЗначение.АдресМногооборотнойТарыВХранилище);
//		МногооборотнаяТараКлиент.ОповеститьПользователяОЗаполненииМногооборотнойТарой();
//		
//	ИначеЕсли НоменклатураКлиент.ЭтоУказаниеСерий(ИсточникВыбора) Тогда
//		
//		Если ВыбранноеЗначение.ИмяТЧ = "ОбеспечениеМатериаламиИРаботами" Тогда
//		Иначе
//			НоменклатураКлиент.ОбработатьУказаниеСерии(
//					ЭтаФорма, 
//					ПараметрыУказанияСерий, 
//					ВыбранноеЗначение);
//		КонецЕсли;
//		
//	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда
//		
//		Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМатериалы Тогда
//		
//			ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение,"Материалы");
//			
//		ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМатериалыЭтапов Тогда
//			
//			ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение,"РедактированиеЭтаповОбеспечениеМатериаламиИРаботами");
//			
//		КонецЕсли;
//		
//	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПомощникЗакрытияЗаказов.Форма.ФормаЗакрытия" Тогда
//		
//		РезультатОтмены = СкорректироватьСтрокиЗаказа(ВыбранноеЗначение);
//		ПоказатьОповещениеПользователя(НСтр("ru = 'Отмена неотработанных строк'"), , РезультатОтмены.Оповещение);
//		
//	ИначеЕсли ИсточникВыбора <> Неопределено 
//		И ТипЗнч(ИсточникВыбора) = Тип("ФормаКлиентскогоПриложения") 
//		И ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ВводДолиСтоимости" Тогда
//		
//		ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
//		Если ТекущиеДанные = Неопределено Тогда 
//			Возврат;
//		КонецЕсли;
//		
//		Модифицированность = Истина;
//		ОбработкаВводаДолиСтоимости(ТекущийЭлемент, ТекущиеДанные, ВыбранноеЗначение);
//		
//	КонецЕсли;
//	
//	ОбеспечениеВДокументахКлиентСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Материалы, ДатаОтгрузкиОбязательна, СкладОбязателен);
//	
//	Если Окно <> Неопределено Тогда
//		Окно.Активизировать();
//	КонецЕсли;	
//КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовШапкиФормы

//&НаКлиенте
//Процедура ВидЦеныПриИзменении(Элемент)
//	
//	Если ЗначениеЗаполнено(Объект.ВидЦены)
//		И (Объект.ВозвратныеОтходы.Количество() + Объект.Материалы.Количество()) > 0 Тогда
//		ПоказатьВопрос(Новый ОписаниеОповещения("ВидЦеныПриИзмененииЗавершение", ЭтотОбъект), НСтр("ru = 'Перезаполнить цены в табличных частях документа?'"), РежимДиалогаВопрос.ДаНет);
//	КонецЕсли
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВидЦеныПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
//    
//    КодОтвета = РезультатВопроса;
//    
//    Если КодОтвета = КодВозвратаДиалога.Да Тогда
//        
//        ЦеныРассчитаны = Ложь;
//        ПриИзмененииВидаЦеныСервер(ЦеныРассчитаны);
//        
//        ПродажиКлиент.ОповеститьОбОкончанииЗаполненияЦенПоВидуЦен(ЦеныРассчитаны, Объект.ВидЦены);
//        
//    КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнятьВидЦенПоУмолчаниюПриИзменении(Элемент)
//	
//	Если ЗаполнятьВидыЦенПоУмолчанию Тогда
//		
//		ДоступныеВидыЦен = ОпределитьДоступныеВидыЦен();
//		
//		Если ДоступныеВидыЦен.Количество() = 1 Тогда
//			
//			Объект.ВидЦены = ДоступныеВидыЦен[0];
//			
//		Иначе
//			
//			ЗаполнятьВидыЦенПоУмолчанию = Ложь;
//			ПоказатьПредупреждение(Неопределено, НСтр("ru='Не найден вид цен по умолчанию'"));
//			Возврат;
//			
//		КонецЕсли;
//		
//		Если (Объект.ВозвратныеОтходы.Количество() + Объект.Материалы.Количество()) > 0 Тогда
//			ПоказатьВопрос(
//				Новый ОписаниеОповещения("ЗаполнятьВидЦенПоУмолчаниюПриИзмененииЗавершение", ЭтотОбъект),
//				НСтр("ru = 'Перезаполнить цены в табличных частях документа?'"),
//				РежимДиалогаВопрос.ДаНет);
//		КонецЕсли;
//		
//	ИначеЕсли ЗначениеЗаполнено(Объект.ВидЦены) Тогда
//		
//		Объект.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнятьВидЦенПоУмолчаниюПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
//    
//    КодОтвета = РезультатВопроса;
//    
//    Если КодОтвета = КодВозвратаДиалога.Да Тогда
//        
//        ЦеныРассчитаны = Ложь;
//        ПриИзмененииВидаЦеныСервер(ЦеныРассчитаны);
//        
//        ПродажиКлиент.ОповеститьОбОкончанииЗаполненияЦенПоВидуЦен(ЦеныРассчитаны, Объект.ВидЦены);
//        
//    КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура ПартнерПриИзменении(Элемент)
//	
//	Если Не ЗначениеЗаполнено(Объект.Партнер) Тогда
//		ДоставкаТоваровКлиентСервер.ОчиститьРеквизитыДоставки(Элементы, Объект);
//		Возврат;
//	КонецЕсли;
//	
//	ПриИзмененииПартнераСервер();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура КонтактноеЛицоПриИзменении(Элемент)
//	
//	Если Объект.КонтактноеЛицо.Пустая() Тогда
//		Возврат;
//	ИначеЕсли Не Объект.Партнер.Пустая() Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ПартнерИзменился = Ложь;
//	ПриИзмененииКонтактногоЛицаСервер(ПартнерИзменился);
//	
//	Если ПартнерИзменился И Не ЗначениеЗаполнено (Объект.Партнер) Тогда
//		ДоставкаТоваровКлиентСервер.ОчиститьРеквизитыДоставки(Элементы, Объект);
//		Возврат;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура НомерВходящегоДокументаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
//	
//	ПроверитьНаличиеЗаказовПоДаннымПереработчика(Текст);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура КонтрагентПриИзменении(Элемент)
//	
//	ПриИзмененииКонтрагентаСервер();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ДоговорПриИзменении(Элемент)
//	
//	ПриИзмененииДоговораСервер();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СтатусПриИзменении(Элемент)
//	
//	Если Объект.Согласован 
//		И Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПереработчикам.КОбеспечению")
//		И Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПереработчикам.КИсполнению")
//		И Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПереработчикам.Закрыт") Тогда
//		
//		Объект.Согласован = Ложь;
//		
//	КонецЕсли;
//	
//	ПриИзмененииСтатусаСервер();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВалютаПриИзменении(Элемент)
//	
//	Если ЗначениеЗаполнено(Объект.Валюта) Тогда
//		
//		ПересчитатьСуммы = Истина;
//		
//		Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
//			Объект.Валюта = ВалютаДокумента;
//			ПересчитатьСуммы = Ложь;
//			
//		ИначеЕсли Не ЗначениеЗаполнено(ВалютаДокумента) Тогда
//			ПересчитатьСуммы = Ложь;
//			
//		ИначеЕсли ВалютаДокумента = Объект.Валюта Тогда
//			ПересчитатьСуммы = Ложь;
//			
//		ИначеЕсли Объект.Сумма = 0
//				И Объект.ВозвратныеОтходы.Итог("Цена") = 0
//				И Объект.Материалы.Итог("Цена") = 0 
//				И Объект.Услуги.Итог("Сумма") = 0 Тогда
//				
//			ПересчитатьСуммы = Ложь;
//			
//		КонецЕсли;
//		
//		Если ПересчитатьСуммы Тогда
//			
//			ТекстВопроса = НСтр("ru='Пересчитать суммы в документе в валюту ""%Валюта%""?'");
//			ТекстВопроса = СтрЗаменить(ТекстВопроса, "%Валюта%", Объект.Валюта);
//			ОписаниеОповещения = Новый ОписаниеОповещения("ПересчитатьСуммыПриИзмененииВалюты", ЭтотОбъект);
//			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
//			Возврат;
//		КонецЕсли;
//		
//		ВалютаПриИзмененииЗавершение(ПересчитатьСуммы);
//		
//	Иначе
//		
//		ВалютаДокумента = Объект.Валюта;
//		
//	КонецЕсли;
//	
//	ЗаполнитьПорядокОплатыПоУмолчанию();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОрганизацияПриИзменении(Элемент)
//	
//	ПриИзмененииОрганизацииСервер();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ДатаПриИзменении(Элемент)
//	
//	ПриИзмененииДатыСервер();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЖелаемаяДатаПоступленияНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	МаксДатаАванса = МаксимальнаяДатаАванса();
//	
//	Если ЗначениеЗаполнено(МаксДатаАванса) Тогда
//		
//		ПредставлениеМаксДатаАванса = НСтр("ru='%МаксДатаАванса%'");
//		ПредставлениеМаксДатаАванса = СтрЗаменить(ПредставлениеМаксДатаАванса, "%МаксДатаАванса%", Формат(МаксДатаАванса,"ДЛФ=DD"));
//		
//		СписокВыбора = Новый СписокЗначений;
//		СписокВыбора.Добавить(МаксДатаАванса, ПредставлениеМаксДатаАванса);
//		
//		ВыбранноеЗначение = Неопределено;

//		
//		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ЖелаемаяДатаПоступленияНачалоВыбораИзСпискаЗавершение", ЭтотОбъект), СписокВыбора, Элемент);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ДатаОтгрузкиПриИзменении(Элемент)
//	
//	ЗаполнитьДатуОтгрузкиСервер(Объект.ДатаОтгрузки, "Материалы");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура НеОтгружатьЧастямиПриИзменении(Элемент)
//	
//	НеОтгружатьЧастямиПриИзмененииСервер();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПоступлениеОднойДатойПриИзменении(Элемент)
//	
//	ПриИзмененииПоступлениеОднойДатойСервер();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ДатаПоступленияПриИзменении(Элемент)
//	
//	ЗаполнитьДатыПоступленияСервер(Объект.ДатаПоступления);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВернутьМногооборотнуюТаруПриИзменении(Элемент)
//	
//	ОбновитьДоступностьЭлементовВозвратнойТары(ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МенеджерПриИзменении(Элемент)
//	ЗаполнитьПодчиненныеСвойстваПоСтатистике("Менеджер");
//КонецПроцедуры

//&НаКлиенте
//Процедура СуммаПриИзменении(Элемент)
//	
//	ПриИзмененииСуммыУслугиСервер();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СтавкаНДСПриИзменении(Элемент)
//	
//	ПриИзмененииСуммыУслугиСервер();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СуммаНДСПриИзменении(Элемент)
//	
//	ПриИзмененииСтавкиНДССервер();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура НоменклатураПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Новый Структура("Номенклатура, Характеристика, ХарактеристикиИспользуются, СтавкаНДС, Сумма, СуммаНДС, СуммаСНДС");
//	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Объект);
//	ТекущаяСтрока.ХарактеристикиИспользуются = ХарактеристикиИспользуются;
//	
//	СтруктураПересчетаСуммы = ПараметрыПересчетаСуммыНДСВТЧ(ЭтаФорма);
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", Объект.Характеристика);
//	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(Объект));
//	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
//	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	
//	Объект.СтавкаНДС = ТекущаяСтрока.СтавкаНДС;
//	Объект.СуммаНДС = ТекущаяСтрока.СуммаНДС;
//	Объект.СуммаСНДС = ТекущаяСтрока.СуммаСНДС;
//	ХарактеристикиИспользуются = ТекущаяСтрока.ХарактеристикиИспользуются;
//	Элементы.Характеристика.Доступность = ХарактеристикиИспользуются;
//	
//	Объект.ПроверятьУказаниеРаботы = Истина;
//	
//	ОбновитьДанныеТаблицыУслуг(Объект);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ХарактеристикаПриИзменении(Элемент)
//	
//	ОбновитьДанныеТаблицыУслуг(Объект);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СтатьяКалькуляцииПриИзменении(Элемент)
//	
//	ОбновитьДанныеТаблицыУслуг(Объект);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ГруппировкаЗатратПриИзменении(Элемент)
//	
//	Если ГруппировкаЗатратДоИзменения = Объект.ГруппировкаЗатрат Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если (Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЗаказамНаПроизводство")
//			ИЛИ Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства")
//			ИЛИ ГруппировкаЗатратДоИзменения = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЗаказамНаПроизводство")
//			ИЛИ ГруппировкаЗатратДоИзменения = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства"))
//		И (Объект.Продукция.Количество() <> 0 
//			ИЛИ Объект.ВозвратныеОтходы.Количество() <> 0
//			ИЛИ Объект.Материалы.Количество() <> 0
//			)
//			Тогда
//		
//		ТекстВопроса = НСтр("ru = 'Продукция, возвратные отходы, сырье и материалы будут очищены.
//			|Изменить группировку затрат?'");
//		ОписаниеОповещения = Новый ОписаниеОповещения("ГруппировкаЗатратПриИзмененииЗавершение", ЭтотОбъект);
//		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
//	Иначе
//		ГруппировкаЗатратПриИзмененииЗавершение(КодВозвратаДиалога.Да, Неопределено);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СпособМестоДоставкиПеревозчикПриИзменении(Элемент)
//	
//	ЗаполнитьУстановитьРеквизитыДоставкиСервер(Элемент.Имя);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура АдресДоставкиПриИзменении(Элемент)
//	
//	ИменаРеквизитовАдресовДоставки = ДоставкаТоваровКлиентСервер.ИменаРеквизитовАдресовДоставки("АдресДоставки");
//	
//	ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
//		Элемент,
//		Объект[ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставки],
//		Объект[ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставкиЗначенияПолей]);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
//	
//	ИменаРеквизитовАдресовДоставки = ДоставкаТоваровКлиентСервер.ИменаРеквизитовАдресовДоставки("АдресДоставки");
//	
//	ДоставкаТоваровКлиент.ОчиститьПредставлениеАдреса(
//		Объект[ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставки],
//		Объект[ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставкиЗначенияПолей],
//		Объект[ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставкиЗначение]);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	ИмяРеквизитаАдресаДоставки = ПолучитьИмяРеквизитаАдресаДоставки(Элемент);
//	
//	ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
//	    Элемент,
//		Объект,
//		ИмяРеквизитаАдресаДоставки,
//		СтандартнаяОбработка);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	АдресДоставкиПриИзменении(Элемент);
//	
//	ДоставкаТоваровКлиент.АдресДоставкиОбработкаВыбора(Элементы, Объект, Элемент.Имя, ВыбранноеЗначение);
//	
//	Модифицированность = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
//	
//	// СтандартныеПодсистемы.Свойства
//	Если ТекущаяСтраница.Имя = "ГруппаДополнительно"
//		И Не ЭтотОбъект.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
//		
//		СвойстваВыполнитьОтложеннуюИнициализацию();
//		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
//	КонецЕсли;
//	// Конец СтандартныеПодсистемы.Свойства
//	
//	ВзаиморасчетыКлиент.ОбновитьТекстГиперссылкиЭтапыОплаты(ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура НаправлениеДеятельностиПриИзменении(Элемент)
//	
//	НаправлениеДеятельностиПриИзмененииСервер();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура НадписьЗаголовокЗаказыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
//	
//	Если НавигационнаяСсылкаФорматированнойСтроки = "#ДобавитьРаспоряжения" Тогда
//		СтандартнаяОбработка = Ложь;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПроизводствоОднойДатойПриИзменении(Элемент)
//	
//	
//	Возврат; // В КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповДатаПроизводстваПриИзменении(Элемент)
//	
//	
//	Возврат; // В КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповНеОтгружатьЧастямиПриИзменении(Элемент)
//	
//	
//	Возврат; // В КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповДатаОтгрузкиПриИзменении(Элемент)
//	
//	
//	Возврат; // В КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповЖелаемаяДатаОтгрузкиПриИзменении(Элемент)
//	
//	
//	Возврат; // В КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СпособРаспределенияЗатратНаВыходныеИзделияПриИзменении(Элемент)
//	
//	СпособРаспределенияЗатратНаВыходныеИзделияПриИзмененииНаСервере();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗакупкаПодДеятельностьОчистка(Элемент, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыПродукция

//&НаКлиенте
//Процедура ПродукцияПриИзменении(Элемент)
//	
//	ОпределитьКоличествоВыходныхИзделий(ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияПередУдалением(Элемент, Отказ)
//	
//	РаботаСТабличнымиЧастямиКлиент.КэшироватьТекущуюСтроку(Элементы.Продукция, ЭтотОбъект);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияПослеУдаления(Элемент)
//	
//	ПродукцияПослеУдаленияСервер();

//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	
//	ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение, "Продукция");
//	
//	Если Окно <> Неопределено Тогда
//		Окно.Активизировать();
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
//	РаботаСТабличнымиЧастямиКлиент.КэшироватьТекущуюСтроку(Элементы.Продукция, ЭтотОбъект);
//	
//	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
//	
//	Если НоваяСтрока Тогда
//		ТекущиеДанные.КодСтроки = 0;
//	КонецЕсли;
//	
//	ДоходыИРасходыКлиентСервер.ПриДобавленииСтрокиВТаблицу(ЭтотОбъект, ТекущиеДанные, "Объект.Продукция");
//	
//	ОграничениеТипаПолучателя(ТекущиеДанные, "ПродукцияПолучатель");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	
//	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
//	
//	Если Поле = Элементы.МатериалыЦена Тогда
//		
//		Если ЗначениеЗаполнено(ТекущиеДанные.ВидЦены) И Не Объект.Согласован Тогда
//			
//			ОчиститьСообщения();
//			
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//			НСтр("ru='Для редактирования цены необходимо выбрать вид цены ""<произвольная>""'"),
//			Объект.Ссылка,
//			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Продукция", ТекущиеДанные.НомерСтроки, "ВидЦены"));
//			
//		КонецЕсли;
//		
//	ИначеЕсли (Поле = Элементы.ПродукцияДоляСтоимости
//			Или Поле = Элементы.ПродукцияДоляСтоимостиПроцент
//			Или Поле = Элементы.ПродукцияЕстьОшибкиЗаполненияДолиСтоимости)
//		И Объект.СпособРаспределенияЗатратНаВыходныеИзделия <> ПредопределенноеЗначение("Перечисление.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоДолямСтоимости") Тогда
//		
//		СтандартнаяОбработка = Ложь;
//		ОткрытьФормуВводаДолиСтоимости(ТекущиеДанные);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
//	
//	Если НоваяСтрока
//		И ОтменаРедактирования Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
//	КэшСтроки = РаботаСТабличнымиЧастямиКлиентСервер.КэшСтроки(Элементы.Продукция, ЭтотОбъект);
//	
//	Если ТекущиеДанные <> Неопределено И Объект.ПоступлениеОднойДатой Тогда
//		ТекущиеДанные.ДатаПоступления = Объект.ДатаПоступления;
//	КонецЕсли;
//	
//	Если Не ОтменаРедактирования Тогда
//		
//		ЗаполнитьНомерГруппыЗатратВСтрокеПродукцииПередОкончаниемРедактирования(ТекущиеДанные, Объект, КэшСтроки, НоваяСтрока);
//		
//		//РезультатЗаполнения = ЗаполнитьУслугиПоПродукции(Объект);
//		ПриИзмененииСуммыУслуг(ЭтаФорма);
//		Если РезультатЗаполнения.УдаленыСтрокиМатериалов Тогда
//			ОбновитьКолонкуДоступноСервер();
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	Если НоваяСтрока Тогда
//		
//		Если Не ОтменаРедактирования Тогда
//			ЗаполнитьПолучателяПоУмолчанию(ТекущиеДанные);
//		КонецЕсли;
//		
//		ТребуетсяЗаполнитьДанныеРаспоряжения = Истина;
//		
//	КонецЕсли;
//	
//	Если ПроизводствоКлиент.НеобходимоРассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия(
//			Элемент, ПараметрыРаспределенияЗатрат, КэшСтроки, НоваяСтрока) Тогда
//		ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
//		Группировки = Новый Массив;
//		Группировки.Добавить(КэшСтроки.НомерГруппыЗатрат);
//		Группировки.Добавить(ТекущиеДанные.НомерГруппыЗатрат);
//		РассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия(Группировки);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияНоменклатураПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
//	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", ПроизводствоКлиентСервер.ПараметрыПересчетаКоличестваЕдиниц());
//	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
//	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
//	СтруктураДействий.Вставить("ПроверитьЗаполнитьДолюСтоимости", ПараметрыРаспределенияЗатрат);
//	
//	НаправленияДеятельностиКлиентСервер.СтруктураДействийВставитьПриДобавленииСтроки(ЭтаФорма, СтруктураДействий);
//	
//	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
//		ЭтаФорма.ИмяФормы, "Продукция"));

//	ПроизводствоКлиентСервер.ДобавитьВСтруктуруДействияПроверитьЗаполнитьСкладПроизводства(Объект.Подразделение, СтруктураДействий, "Получатель");
//	
//	ДоходыИРасходыКлиентСервер.ВставитьДействиеЗаполнитьСтатьюАналитикуРасходовНоменклатуры(
//		СтруктураДействий,
//		ЭтотОбъект,
//		ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию"),
//		Объект.Организация,
//		"Объект.Продукция");
//	
//	ПродукцияНоменклатураПриИзмененииНаСервере(ТекущаяСтрока.ПолучитьИдентификатор(), СтруктураДействий, КэшированныеЗначения);
//	
//	ПриИзмененииСписатьНаРасходы("Продукция");
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	ТребуетсяЗаполнитьДанныеРаспоряжения = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияХарактеристикаПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	
//	СтруктураДействий.Вставить("ХарактеристикаПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
//		ЭтаФорма.ИмяФормы, "Продукция"));
//	СтруктураДействий.Вставить("ПроверитьЗаполнитьДолюСтоимости", ПараметрыРаспределенияЗатрат);
//	НаправленияДеятельностиКлиентСервер.СтруктураДействийВставитьПриДобавленииСтроки(ЭтаФорма, СтруктураДействий);
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	Если Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции")
//		ИЛИ Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоСпецификациям") Тогда
//		
//		ПродукцияХарактеристикаПриИзмененииНаСервере(Элементы.Продукция.ТекущаяСтрока);
//		
//	КонецЕсли;
//	
//	ТребуетсяЗаполнитьДанныеРаспоряжения = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияУпаковкаПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", ПроизводствоКлиентСервер.ПараметрыПересчетаКоличестваЕдиниц());
//	СтруктураДействий.Вставить("ПересчитатьДолюСтоимости", ПараметрыРаспределенияЗатрат);
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	ТребуетсяЗаполнитьДанныеРаспоряжения = Истина;	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияКоличествоУпаковокПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", ПроизводствоКлиентСервер.ПараметрыПересчетаКоличестваЕдиниц());
//	СтруктураДействий.Вставить("ПересчитатьДолюСтоимости", ПараметрыРаспределенияЗатрат);
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	ТребуетсяЗаполнитьДанныеРаспоряжения = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияОтмененоПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
//	
//	Если Не ТекущаяСтрока.Отменено Тогда
//		ТекущаяСтрока.ПричинаОтмены = ПредопределенноеЗначение("Справочник.ПричиныОтменыЗаказовПоставщикам.ПустаяСсылка");
//	КонецЕсли;
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияГруппаЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	ВыбратьГруппуЗатрат("Продукция");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияГруппаЗатратОткрытие(Элемент, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
//	ОткрытьРаспоряжениеГруппы(ТекущиеДанные);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияГруппаЗатратОчистка(Элемент, СтандартнаяОбработка)
//	
//	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
//	ТекущиеДанные.НомерГруппыЗатрат = 0;

//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияПолучательПриИзменении(Элемент)

//	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
//	ПриИзмененииПолучателя(ТекущиеДанные);
//	
//	ТребуетсяУточнитьДанныеРаспоряжения = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияСписатьНаРасходыПриИзменении(Элемент)
//	
//	ПриИзмененииСписатьНаРасходы("Продукция");

//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияСтатьяРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	СтатьяРасходовВыбор(Элемент, СтандартнаяОбработка);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияСтатьяРасходовПриИзменении(Элемент)
//	
//	СтатьяРасходовПриИзменении(Элемент);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияАналитикаРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	ДоходыИРасходыКлиент.НачалоВыбораАналитикиРасходов(ЭтотОбъект, Элемент, СтандартнаяОбработка);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияАналитикаРасходовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	
//	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
//	
//	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
//		
//		СтандартнаяОбработка = Ложь;
//		Модифицированность   = Истина;
//		
//		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ВыбранноеЗначение);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияАналитикаРасходовАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
//	
//	ДоходыИРасходыКлиент.АвтоПодборАналитикиРасходов(ЭтотОбъект, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияАналитикаРасходовОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
//	
//	ДоходыИРасходыКлиент.ОкончаниеВводаТекстаАналитикиРасходов(ЭтотОбъект, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
//	
//КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыВозвратныеОтходы

//&НаКлиенте
//Процедура ВозвратныеОтходыПриИзменении(Элемент)
//	
//	ОпределитьКоличествоВыходныхИзделий(ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыПередУдалением(Элемент, Отказ)
//	
//	ОбщегоНазначенияУТКлиент.КешироватьТекущуюСтроку(ЭтотОбъект, "ВозвратныеОтходы");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыПослеУдаления(Элемент)
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	ТребуетсяУточнитьДанныеРаспоряжения = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	
//	ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение, "ВозвратныеОтходы");
//	
//	Если Окно <> Неопределено Тогда
//		Окно.Активизировать();
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
//	
//	ТекущиеДанные = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//	
//	Если НоваяСтрока Тогда
//		
//		ТекущиеДанные.КодСтроки = 0;
//		
//		Если Не Копирование Тогда
//			ТекущиеДанные.ВидЦены = Объект.ВидЦены;
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	ДоходыИРасходыКлиентСервер.ПриДобавленииСтрокиВТаблицу(ЭтотОбъект, ТекущиеДанные, "Объект.ВозвратныеОтходы");
//	
//	ОграничениеТипаПолучателя(ТекущиеДанные, "ВозвратныеОтходыПолучатель");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	
//	Если Поле = Элементы.ВозвратныеОтходыЦена Тогда
//		
//		ТекущиеДанные = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//		
//		Если ЗначениеЗаполнено(ТекущиеДанные.ВидЦены) И Не Объект.Согласован Тогда
//			
//			ОчиститьСообщения();
//			
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//				НСтр("ru='Для редактирования цены необходимо выбрать вид цены ""<произвольная>""'"),
//				Объект.Ссылка,
//				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.ВозвратныеОтходы", ТекущиеДанные.НомерСтроки, "ВидЦены"));
//			
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
//	
//	Если НоваяСтрока
//		И ОтменаРедактирования Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ТекущиеДанные = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//	Если ТекущиеДанные <> Неопределено И Объект.ПоступлениеОднойДатой Тогда
//		ТекущиеДанные.ДатаПоступления = Объект.ДатаПоступления;
//	КонецЕсли;
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	Если НоваяСтрока Тогда
//		
//		Если Не ОтменаРедактирования Тогда
//			ЗаполнитьПолучателяПоУмолчанию(ТекущиеДанные);
//		КонецЕсли;
//		
//		ТребуетсяУточнитьДанныеРаспоряжения = Истина;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыНоменклатураПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
//	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", ПроизводствоКлиентСервер.ПараметрыПересчетаКоличестваЕдиниц());
//	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект));
//	СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыВозвратныеОтходы());
//	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
//	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
//	ПроизводствоКлиентСервер.ДобавитьВСтруктуруДействияПроверитьЗаполнитьСкладПроизводства(Объект.Подразделение, СтруктураДействий, "Получатель");
//	НаправленияДеятельностиКлиентСервер.СтруктураДействийВставитьПриДобавленииСтроки(ЭтаФорма, СтруктураДействий);
//	
//	ДоходыИРасходыКлиентСервер.ВставитьДействиеЗаполнитьСтатьюАналитикуРасходовНоменклатуры(
//		СтруктураДействий,
//		ЭтотОбъект,
//		ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию"),
//		Объект.Организация,
//		"Объект.ВозвратныеОтходы");
//	
//	ВозвратныеОтходыНоменклатураПриИзмененииНаСервере(ТекущаяСтрока.ПолучитьИдентификатор(), СтруктураДействий, КэшированныеЗначения);
//	
//	ПриИзмененииСписатьНаРасходы("ВозвратныеОтходы");
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	ТребуетсяУточнитьДанныеРаспоряжения = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыХарактеристикаПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект));
//	СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыВозвратныеОтходы());
//	НаправленияДеятельностиКлиентСервер.СтруктураДействийВставитьПриДобавленииСтроки(ЭтаФорма, СтруктураДействий);
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	ТребуетсяУточнитьДанныеРаспоряжения = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыУпаковкаПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	Если ТекущаяСтрока.Количество > 0 Тогда
//		СтруктураДействий.Вставить("ПересчитатьЦенуЗаУпаковку", ТекущаяСтрока.Количество);
//	ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.ВидЦены) Тогда
//		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект));
//	КонецЕсли;
//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", ПроизводствоКлиентСервер.ПараметрыПересчетаКоличестваЕдиниц());
//	СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыВозвратныеОтходы());
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	ТребуетсяУточнитьДанныеРаспоряжения = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыКоличествоУпаковокПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок("ВозвратныеОтходы", СтруктураДействий);
//	СтруктураДействий.Вставить("ПересчитатьСумму");
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	ТребуетсяУточнитьДанныеРаспоряжения = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыВидЦеныПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
//	СтруктураДействий.Вставить("ПересчитатьСумму");
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыВозвратныеОтходы());
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыЦенаПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыВозвратныеОтходы());
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	
//	Если ЗначениеЗаполнено(ТекущаяСтрока.ВидЦены) И ТекущаяСтрока.Цена <> 0 Тогда
//		ТекущаяСтрока.ВидЦены = Неопределено;
//	КонецЕсли;
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыСуммаПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПересчитатьЦенуПоСумме", "КоличествоУпаковок");
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыВозвратныеОтходы());
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыОтмененоПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//	
//	Если Не ТекущаяСтрока.Отменено Тогда
//		ТекущаяСтрока.ПричинаОтмены = ПредопределенноеЗначение("Справочник.ПричиныОтменыЗаказовПоставщикам.ПустаяСсылка");
//	КонецЕсли;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыВозвратныеОтходы());
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыГруппаЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	ВыбратьГруппуЗатрат("ВозвратныеОтходы");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыГруппаЗатратОткрытие(Элемент, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	ТекущиеДанные = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//	ОткрытьРаспоряжениеГруппы(ТекущиеДанные);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыГруппаЗатратОчистка(Элемент, СтандартнаяОбработка)
//	
//	ТекущиеДанные = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//	ТекущиеДанные.НомерГруппыЗатрат = 0;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыПолучательПриИзменении(Элемент)

//	ТекущиеДанные = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//	ПриИзмененииПолучателя(ТекущиеДанные);

//	ТребуетсяУточнитьДанныеРаспоряжения = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыСписатьНаРасходыПриИзменении(Элемент)
//	
//	ПриИзмененииСписатьНаРасходы("ВозвратныеОтходы");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыСтатьяРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	СтатьяРасходовВыбор(Элемент, СтандартнаяОбработка);

//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыСтатьяРасходовПриИзменении(Элемент)
//	
//	СтатьяРасходовПриИзменении(Элемент);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыАналитикаРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	ДоходыИРасходыКлиент.НачалоВыбораАналитикиРасходов(ЭтотОбъект, Элемент, СтандартнаяОбработка);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыАналитикаРасходовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	
//	ТекущиеДанные = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//	
//	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
//		
//		СтандартнаяОбработка = Ложь;
//		Модифицированность   = Истина;
//		
//		ЗаполнитьЗначенияСвойств(ТекущиеДанные, ВыбранноеЗначение);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыАналитикаРасходовАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
//	
//	ДоходыИРасходыКлиент.АвтоПодборАналитикиРасходов(ЭтотОбъект, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыАналитикаРасходовОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
//	
//	ДоходыИРасходыКлиент.ОкончаниеВводаТекстаАналитикиРасходов(ЭтотОбъект, Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
//	
//КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыСырьеИМатериалы

//&НаКлиенте
//Процедура МатериалыПослеУдаления(Элемент) 
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	МногооборотнаяТараКлиент.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);
//	ОбеспечениеВДокументахКлиентСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Материалы, ДатаОтгрузкиОбязательна, СкладОбязателен);
//	
//	ТребуетсяУточнитьДанныеРаспоряжения = Истина;
//	ОбновитьКолонкуДоступноСервер();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
//	
//	Если НоваяСтрока
//		И ОтменаРедактирования Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
//	
//	Если ТекущиеДанные <> Неопределено И Объект.НеОтгружатьЧастями Тогда
//		ТекущиеДанные.ДатаОтгрузки = Объект.ДатаОтгрузки;
//	КонецЕсли;
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	МногооборотнаяТараКлиент.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);
//	
//	Если НоваяСтрока Тогда
//		ТребуетсяУточнитьДанныеРаспоряжения = Истина;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
//	
//	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
//	РаботаСТабличнымиЧастямиКлиент.КэшироватьТекущуюСтроку(Элементы.Материалы, ЭтотОбъект);
//	
//	Если НоваяСтрока И Не Копирование Тогда
//		ТекущиеДанные.ВидЦены = Объект.ВидЦены;
//	КонецЕсли;
//	
//	Если НоваяСтрока Тогда
//		
//		ТекущиеДанные.КодСтроки = 0;
//		
//		СкладыКлиентСервер.ЗаполнитьСкладПоУмолчанию(
//				ИспользоватьНесколькоСкладов, 
//				СкладПоУмолчанию, 
//				ТекущиеДанные);
//				
//	КонецЕсли;
//	
//	Если Копирование Тогда
//		СтруктураДействий = Новый Структура;
//		ДобавитьДействияОбеспеченияНаКлиенте(СтруктураДействий, "ВариантОбеспечения,Доступно,СкладОбязателен,ДатаОтгрузкиОбязательна");
//		СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущиеДанные.Склад, ПараметрыУказанияСерий));
//		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущиеДанные, СтруктураДействий, КэшированныеЗначения);
//		ОбеспечениеВДокументахКлиентСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Материалы, ДатаОтгрузкиОбязательна, СкладОбязателен);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	
//	// &ЗамерПроизводительности
//	ОценкаПроизводительностиКлиент.ЗамерВремени(
//		"Документ.ЗаказПереработчику.Форма.ФормаДокумента.Элементы.Материалы.Выбор");
//	
//	Если Элемент.ТекущийЭлемент = Элементы.МатериалыДоступно И Не ТолькоПросмотр Тогда
//		
//		СтандартнаяОбработка = Ложь;
//		
//		ПараметрыФормы = ПараметрыФормыЗапросаКоличестваИСерийМатериалы();
//			
//		Если ПараметрыФормы <> Неопределено Тогда
//			ОткрытьФорму("Обработка.ЗапросКоличестваИСерий.Форма", ПараметрыФормы, ЭтотОбъект);
//		КонецЕсли;
//		
//	ИначеЕсли Поле = Элементы.МатериалыЦена Тогда
//		
//		ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
//		
//		Если ЗначениеЗаполнено(ТекущиеДанные.ВидЦены) И Не Объект.Согласован Тогда
//			
//			ОчиститьСообщения();
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//				НСтр("ru='Для редактирования цены очистите вид цены'"),
//				Объект.Ссылка,
//				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Материалы", ТекущиеДанные.НомерСтроки, "ВидЦены"));
//			
//		КонецЕсли;
//		
//	ИначеЕсли Поле = Элементы.ПродукцияГруппаЗатрат Тогда
//		
//		ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
//		Если ТекущиеДанные.НомерГруппыЗатрат = 0 Тогда
//			СтандартнаяОбработка = Ложь;
//			ВыбратьГруппуЗатрат("Продукция");
//		КонецЕсли;
//		
//	ИначеЕсли Поле = Элементы.ВозвратныеОтходыГруппаЗатрат Тогда
//		
//		ТекущиеДанные = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//		Если ТекущиеДанные.НомерГруппыЗатрат = 0 Тогда
//			СтандартнаяОбработка = Ложь;
//			ВыбратьГруппуЗатрат("ВозвратныеОтходы");
//		КонецЕсли;
//		
//	ИначеЕсли Поле = Элементы.МатериалыГруппаЗатрат Тогда
//		
//		ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
//		Если ТекущиеДанные.НомерГруппыЗатрат = 0 Тогда
//			СтандартнаяОбработка = Ложь;
//			ВыбратьГруппуЗатрат("Материалы");
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыНоменклатураПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
//	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыМатериалы());
//	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
//	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
//	
//	СтруктураСкладМатериалов = Новый Структура("Склад", СкладПоУмолчанию);
//	СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад",
//		ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияСкладаВСтрокеТЧ(СтруктураСкладМатериалов, Ложь));
//	
//	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект));
//	СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", ПроизводствоКлиентСервер.ПараметрыПересчетаКоличестваЕдиниц());
//	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
//	ДобавитьДействияОбеспеченияНаКлиенте(СтруктураДействий, "ВариантОбеспечения,ДоступноВДругихСтроках,СкладОбязателен,ДатаОтгрузкиОбязательна");

//	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
//		ЭтаФорма.ИмяФормы, "Материалы"));

//	ДобавитьДействиеПроверитьЗаполнитьСклад("Материалы", ЭтаФорма, СтруктураДействий);
//		
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

//	Если ОбеспечениеВДокументахКлиент.ТребуетсяОбновитьКолонкуДоступно(СтруктураДействий) Тогда
//		ОбновитьКолонкуДоступноСервер();
//	КонецЕсли;
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	ТребуетсяУточнитьДанныеРаспоряжения = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыХарактеристикаПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект));
//	СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыМатериалы());
//	ДобавитьДействияОбеспеченияНаКлиенте(СтруктураДействий, "ВариантОбеспечения,ДоступноВДругихСтроках,СкладОбязателен,ДатаОтгрузкиОбязательна");
//	
//	СтруктураДействий.Вставить("ХарактеристикаПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
//		ЭтаФорма.ИмяФормы, "Материалы"));

//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	
//	Если ОбеспечениеВДокументахКлиент.ТребуетсяОбновитьКолонкуДоступно(СтруктураДействий) Тогда
//		ОбновитьКолонкуДоступноСервер();
//	КонецЕсли;
//	
//	ОбеспечениеВДокументахКлиентСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Материалы, ДатаОтгрузкиОбязательна, СкладОбязателен);
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	ТребуетсяУточнитьДанныеРаспоряжения = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыУпаковкаПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", ПроизводствоКлиентСервер.ПараметрыПересчетаКоличестваЕдиниц());
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыМатериалы());
//	Если ТекущаяСтрока.Количество > 0 Тогда
//		СтруктураДействий.Вставить("ПересчитатьЦенуЗаУпаковку", ТекущаяСтрока.Количество);
//	ИначеЕсли ЗначениеЗаполнено(ТекущаяСтрока.ВидЦены) Тогда
//		СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияЦеныВСтрокеТЧ(Объект));
//	КонецЕсли;
//	СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
//	ДобавитьДействияОбеспеченияНаКлиенте(СтруктураДействий, "ДоступноВДругихСтроках");
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	
//	Если ОбеспечениеВДокументахКлиент.ТребуетсяОбновитьКолонкуДоступно(СтруктураДействий) Тогда
//		ОбновитьКолонкуДоступноСервер();
//	КонецЕсли;
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	ТребуетсяУточнитьДанныеРаспоряжения = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыКоличествоУпаковокПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок("Материалы", СтруктураДействий);
//	ДобавитьДействияОбеспеченияНаКлиенте(СтруктураДействий, "ДоступноВДругихСтроках");
//	СтруктураДействий.Вставить("ПересчитатьСумму");
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	Если ОбеспечениеВДокументахКлиент.ТребуетсяОбновитьКолонкуДоступно(СтруктураДействий) Тогда
//		ОбновитьКолонкуДоступноСервер();
//	КонецЕсли;
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыВидЦеныПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
//	СтруктураДействий.Вставить("ПересчитатьСумму");
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыМатериалы());
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыЦенаПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПересчитатьСумму");
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыМатериалы());
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыОтмененоПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыМатериалы());
//	ДобавитьДействияОбеспеченияНаКлиенте(СтруктураДействий, "ДоступноВДругихСтроках,СкладОбязателен,ДатаОтгрузкиОбязательна");
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	
//	Если ОбеспечениеВДокументахКлиент.ТребуетсяОбновитьКолонкуДоступно(СтруктураДействий) Тогда
//		ОбновитьКолонкуДоступноСервер();
//	КонецЕсли;
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	ОбеспечениеВДокументахКлиентСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Материалы, ДатаОтгрузкиОбязательна, СкладОбязателен);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыСуммаПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПересчитатьЦенуПоСумме", "КоличествоУпаковок");
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыМатериалы());
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	ОткрытьПодборСерий(Элемент.ТекстРедактирования);
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыСкладПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", ТекущаяСтрока.Склад, ПараметрыУказанияСерий));
//	ДобавитьДействияОбеспеченияНаКлиенте(СтруктураДействий, "ВариантОбеспечения,ДоступноВДругихСтроках,СкладОбязателен,ДатаОтгрузкиОбязательна");
//	
//	СтруктураДействий.Вставить("ЗаполнитьПризнакЦеховаяКладовая");
//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", ПроизводствоКлиентСервер.ПараметрыПересчетаКоличестваЕдиниц());
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	Если ОбеспечениеВДокументахКлиент.ТребуетсяОбновитьКолонкуДоступно(СтруктураДействий) Тогда
//		ОбновитьКолонкуДоступноСервер();
//	КонецЕсли;
//	
//	ОбеспечениеВДокументахКлиентСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Материалы, ДатаОтгрузкиОбязательна, СкладОбязателен);
//	
//	ТребуетсяУточнитьДанныеРаспоряжения = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыСерияПриИзменении(Элемент)
//	
//	ВыбранноеЗначение = НоменклатураКлиентСервер.ВыбраннаяСерия();
//	
//	ВыбранноеЗначение.Значение            		 = Элементы.Материалы.ТекущиеДанные.Серия;
//	ВыбранноеЗначение.ИдентификаторТекущейСтроки = Элементы.Материалы.ТекущиеДанные.ПолучитьИдентификатор();
//	
//	НоменклатураКлиент.ОбработатьУказаниеСерии(ЭтаФорма, ПараметрыУказанияСерий, ВыбранноеЗначение);

//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыГруппаЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	ВыбратьГруппуЗатрат("Материалы");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыГруппаЗатратОткрытие(Элемент, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
//	ОткрытьРаспоряжениеГруппы(ТекущиеДанные);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыГруппаЗатратОчистка(Элемент, СтандартнаяОбработка)
//	
//	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
//	ТекущиеДанные.НомерГруппыЗатрат = 0;
//	
//КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

//&НаКлиенте
//Процедура УслугиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	
//	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
//	
//	Если Поле = Элементы.УслугиГруппаЗатрат Тогда
//		СтандартнаяОбработка = Ложь;
//		Если ЗначениеЗаполнено(ТекущиеДанные.Распоряжение) Тогда
//			ПоказатьЗначение(, ТекущиеДанные.Распоряжение);
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура УслугиНоменклатураПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
//	
//	СтруктураПересчетаСуммы = ПараметрыПересчетаСуммыНДСВТЧ(ЭтаФорма);
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
//	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС",
//		Новый Структура("НалогообложениеНДС, Дата", ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС"), Объект.Дата));
//	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
//	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);

//	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
//		ЭтаФорма.ИмяФормы, "Услуги"));

//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	Объект.ПроверятьУказаниеРаботы = Истина;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура УслугиСуммаПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
//	
//	СтруктураПересчетаСуммы = ПараметрыПересчетаСуммыНДСВТЧ(ЭтаФорма);
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
//	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	
//	ПриИзмененииСуммыУслуг(ЭтаФорма);
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура УслугиСтавкаНДСПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
//	
//	СтруктураПересчетаСуммы = ПараметрыПересчетаСуммыНДСВТЧ(ЭтаФорма);
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
//	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

//	ПриИзмененииСуммыУслуг(ЭтаФорма);
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура УслугиСуммаНДСПриИзменении(Элемент)
//	
//	ТекущаяСтрока = Элементы.Услуги.ТекущиеДанные;
//	
//	СтруктураПересчетаСуммы = ПараметрыПересчетаСуммыНДСВТЧ(ЭтаФорма);
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//	
//	ПриИзмененииСуммыУслуг(ЭтаФорма);
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыРедактированиеЭтаповВыходныеИзделия

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияПриИзменении(Элемент)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияПередНачаломИзменения(Элемент, Отказ)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияПередУдалением(Элемент, Отказ)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияПослеУдаления(Элемент)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияНоменклатураПриИзменении(Элемент)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияХарактеристикаПриИзменении(Элемент)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияУпаковкаПриИзменении(Элемент)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияКоличествоУпаковокПриИзменении(Элемент)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияПолучательПриИзменении(Элемент)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияГруппаЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияГруппаЗатратОчистка(Элемент, СтандартнаяОбработка)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияГруппаЗатратОткрытие(Элемент, СтандартнаяОбработка)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияОтмененоПриИзменении(Элемент)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияЭтапПотребительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияСписатьНаРасходыПриИзменении(Элемент)
//	
//	
//	Возврат; // пустой обработчик

//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияСтатьяРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	
//	Возврат; // пустой обработчик

//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияСтатьяРасходовПриИзменении(Элемент)
//	
//	
//	Возврат; // пустой обработчик

//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияАналитикаРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	
//	Возврат; // пустой обработчик

//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияАналитикаРасходовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	
//	
//	Возврат; // пустой обработчик

//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияАналитикаРасходовАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
//	
//	
//	Возврат; // пустой обработчик

//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповВыходныеИзделияАналитикаРасходовОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
//	
//	
//	Возврат; // пустой обработчик

//КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыРедактированиеЭтаповПобочныеИзделия

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияПриИзменении(Элемент)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияПередНачаломИзменения(Элемент, Отказ)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияПередУдалением(Элемент, Отказ)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияНоменклатураПриИзменении(Элемент)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияХарактеристикаПриИзменении(Элемент)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияУпаковкаПриИзменении(Элемент)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияКоличествоУпаковокПриИзменении(Элемент)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияПолучательПриИзменении(Элемент)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияГруппаЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияГруппаЗатратОчистка(Элемент, СтандартнаяОбработка)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияГруппаЗатратОткрытие(Элемент, СтандартнаяОбработка)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияОтмененоПриИзменении(Элемент)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияЭтапПотребительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияСписатьНаРасходыПриИзменении(Элемент)
//	
//	
//	Возврат; // пустой обработчик

//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияСтатьяРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	
//	Возврат; // пустой обработчик

//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияСтатьяРасходовПриИзменении(Элемент)
//	
//	
//	Возврат; // пустой обработчик

//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияАналитикаРасходовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	
//	Возврат; // пустой обработчик

//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияАналитикаРасходовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	
//	
//	Возврат; // пустой обработчик

//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияАналитикаРасходовАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
//	
//	
//	Возврат; // пустой обработчик

//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповПобочныеИзделияАналитикаРасходовОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
//	
//	
//	Возврат; // пустой обработчик

//КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыРедактированиеЭтаповОбеспечениеМатериаламиИРаботами

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиПередНачаломИзменения(Элемент, Отказ)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиПередУдалением(Элемент, Отказ)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиНоменклатураПриИзменении(Элемент)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиХарактеристикаПриИзменении(Элемент)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиУпаковкаПриИзменении(Элемент)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиКоличествоУпаковокПриИзменении(Элемент)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиСерияПриИзменении(Элемент)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиСерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиПроизводитсяПриИзменении(Элемент)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиСпецификацияПриИзменении(Элемент)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиСкладПриИзменении(Элемент)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиГруппаЗатратНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиГруппаЗатратОчистка(Элемент, СтандартнаяОбработка)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиГруппаЗатратОткрытие(Элемент, СтандартнаяОбработка)
//	
//	
//	Возврат; // в КА пустой обработчик
//	
//КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКомандФормы

//#Область КомандыТЧ_Продукция

//&НаКлиенте
//Процедура ПродукцияЗаполнитьДатуПоступления(Команда)
//	
//	Если Элементы.Продукция.ВыделенныеСтроки.Количество() > 0 Тогда
//		ЗаполнитьДатуПоступления("Продукция", Элементы.Продукция.ВыделенныеСтроки);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияКопированиеВставитьСтроки(Команда)
//	
//	КоличествоТоваровДоВставки = Объект.Продукция.Количество();
//	
//	ПолучитьСтрокиИзБуфераОбмена("Продукция");
//	
//	КоличествоВставленных = Объект.Продукция.Количество() - КоличествоТоваровДоВставки;
//	КопированиеСтрокКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоВставленных);
//		
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияКопированиеСкопироватьСтроки(Команда)
//	
//	Если КопированиеСтрокКлиент.ВозможноКопированиеСтрок(Элементы.Продукция.ТекущаяСтрока) Тогда
//		СкопироватьСтрокиНаСервере("Продукция");
//		КопированиеСтрокКлиент.ОповеститьПользователяОКопированииСтрок(Элементы.Продукция.ВыделенныеСтроки.Количество());
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияОбщееЗагрузитьДанныеИзТСД(Команда)
//	
//	ОчиститьСообщения();
//	
//	МенеджерОборудованияКлиент.НачатьЗагрузкуДанныеИзТСД(
//		Новый ОписаниеОповещения("ПродукцияОбщееЗагрузитьИзТСДЗавершение", ЭтотОбъект),
//		УникальныйИдентификатор);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияОбщееЗагрузитьИзТСДЗавершение(Результат, Параметры) Экспорт
//	
//	Если Результат.Результат Тогда
//		Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Материалы Тогда
//			ОбработатьШтрихкоды(Результат.ТаблицаТоваров, "Материалы");
//		Иначе
//			ОбработатьШтрихкоды(Результат.ТаблицаТоваров, "Продукция");
//		КонецЕсли;
//	Иначе
//		МенеджерОборудованияУТКлиент.СообщитьОбОшибке(Результат);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияОбщееПодобратьТовары(Команда)
//	
//	ПодобратьТовар("Продукция");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияОбщееПоискПоШтрихкоду(Команда)
//	
//	ОчиститьСообщения();
//	Оповещение = Новый ОписаниеОповещения("ПродукцияОбщееПоискПоШтрихкодуЗавершение", ЭтотОбъект);
//	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияОбщееПоискПоШтрихкодуЗавершение(ДанныхШтрихкода, ДополнительныеПараметры) Экспорт
//	
//	ОбработатьШтрихкоды(ДанныхШтрихкода, "Продукция");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияОбщееРазбитьСтроку(Команда)
//	
//	ТаблицаФормы  = Элементы.Продукция;
//	ДанныеТаблицы = Объект.Продукция;
//	
//	Оповещение = Новый ОписаниеОповещения("ПродукцияОбщееРазбитьСтрокуЗавершение", ЭтотОбъект);
//	ОбщегоНазначенияУТКлиент.РазбитьСтрокуТЧ(ДанныеТаблицы, ТаблицаФормы, Оповещение);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияОбщееРазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры) Экспорт 
//	
//	ТекущаяСтрока = Элементы.Продукция.ТекущиеДанные;
//	
//	Если НоваяСтрока <> Неопределено Тогда
//		
//		НоваяСтрока.КодСтроки = 0;
//		
//		СтруктураДействий = Новый Структура;
//		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок("Продукция", СтруктураДействий);
//		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, КэшированныеЗначения);
//		
//		ПроизводствоКлиентСервер.ПересчитатьДолюСтоимостиПриРазбиенииСтроки(НоваяСтрока, ТекущаяСтрока, Объект.СпособРаспределенияЗатратНаВыходныеИзделия);
//		
//		Группировки = Новый Массив;
//		Группировки.Добавить(ТекущаяСтрока.НомерГруппыЗатрат);
//		РассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия(Группировки);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияОтменаСтрокОтменитьВыделенныеСтроки(Команда)
//	
//	Если Не ПродажиКлиент.НеобходимоЗаполнениеПричиныОтменыВыделенныхСтрок(Объект.Продукция,
//		НСтр("ru='Выпускаемая продукция'"), Элементы.Продукция.ВыделенныеСтроки) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ПричинаОтмены = ПредопределенноеЗначение("Справочник.ПричиныОтменыЗаказовПоставщикам.ПустаяСсылка");
//	Если ИспользоватьПричиныОтменыЗаказовПоставщикам Тогда
//		ОткрытьФорму("Справочник.ПричиныОтменыЗаказовПоставщикам.ФормаВыбора",,,,,,
//			Новый ОписаниеОповещения("ПродукцияОтменитьВыделенныеСтрокиЗавершение", ЭтотОбъект),
//			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//		Возврат;
//	КонецЕсли;
//	
//	ПродукцияОтменитьВыделенныеСтрокиФрагмент(ПричинаОтмены);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияОтменитьВыделенныеСтрокиЗавершение(Результат, ДополнительныеПараметры) Экспорт
//	
//	ПричинаОтмены = Результат;
//	Если ПричинаОтмены = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ПродукцияОтменитьВыделенныеСтрокиФрагмент(ПричинаОтмены);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияОтменитьВыделенныеСтрокиФрагмент(ПричинаОтмены)
//	
//	Группировки = Новый Массив;
//	
//	Для Каждого ТекСтрока Из Элементы.Продукция.ВыделенныеСтроки Цикл
//		
//		СтрокаТаблицы = Объект.Продукция.НайтиПоИдентификатору(ТекСтрока);
//		
//		Если СтрокаТаблицы <> Неопределено Тогда
//			СтрокаТаблицы.ПричинаОтмены = ПричинаОтмены;
//			СтрокаТаблицы.Отменено = Истина;
//			Группировки.Добавить(СтрокаТаблицы.НомерГруппыЗатрат);
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	РассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия(Группировки);
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	ПоказатьОповещениеПользователя(
//		НСтр("ru = 'Выделенные строки отменены'"),
//		,
//		НСтр("ru='Выделенные строки отменены.'"),
//		БиблиотекаКартинок.Информация32);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияОтменаСтрокОтменитьНепоставленныеСтроки(Команда)
//	
//	// &ЗамерПроизводительности
//	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
//		"Документ.ЗаказПереработчику.Форма.ФормаДокумента.Команда.ПродукцияОтменитьНеотработанные");
//	
//	Если Объект.Продукция.Количество() = 0 Тогда
//		
//		ТекстПредупреждения = НСтр("ru='В документе не заполнен список Выпускаемая продукция. Строки не могут быть отменены.'");
//		ПоказатьПредупреждение(,ТекстПредупреждения);
//		Возврат;
//		
//	ИначеЕсли Объект.Продукция.НайтиСтроки(Новый Структура("Отменено", Ложь)).Количество() = 0 Тогда
//		
//		ТекстПредупреждения = НСтр("ru='В документе для списка Выпускаемая продукция все строки уже отменены.'");
//		ПоказатьПредупреждение(,ТекстПредупреждения);
//		Возврат;
//		
//	КонецЕсли;
//	
//	ПричинаОтмены = ПредопределенноеЗначение("Справочник.ПричиныОтменыЗаказовПоставщикам.ПустаяСсылка");
//	Если ИспользоватьПричиныОтменыЗаказовПоставщикам Тогда
//		ОткрытьФорму("Справочник.ПричиныОтменыЗаказовПоставщикам.ФормаВыбора",,,,,,
//			Новый ОписаниеОповещения("ПродукцияОтменитьНепоставленныеСтрокиЗавершение", ЭтотОбъект),
//			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//		Возврат;
//	КонецЕсли;
//	
//	ПродукцияОтменитьНепоставленныеСтрокиСервер(ПричинаОтмены);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияОтменитьНепоставленныеСтрокиЗавершение(Результат, ДополнительныеПараметры) Экспорт
//	
//	ПричинаОтмены = Результат;
//	Если ПричинаОтмены = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	РезультатОтмены = ПродукцияОтменитьНепоставленныеСтрокиСервер(ПричинаОтмены);
//	ПоказатьОповещениеПользователя(НСтр("ru = 'Отмена неотработанных строк'"), , РезультатОтмены.Оповещение);
//	
//КонецПроцедуры

//&НаСервере
//Функция ПродукцияОтменитьНепоставленныеСтрокиСервер(ПричинаОтмены)
//	
//	СтруктураКорректировкиСтрокЗаказа = ЗаказыСервер.СтруктураКорректировкиСтрокЗаказа();
//	СтруктураКорректировкиСтрокЗаказа.ОтменитьНеотработанныеСтроки = Истина;
//	СтруктураКорректировкиСтрокЗаказа.ИмяТабличнойЧасти = "Продукция";
//	СтруктураКорректировкиСтрокЗаказа.ПричинаОтмены = ПричинаОтмены;
//	
//	Возврат СкорректироватьСтрокиЗаказа(СтруктураКорректировкиСтрокЗаказа);
//	
//КонецФункции

//&НаКлиенте
//Процедура ПродукцияОтменаСтрокСкрыватьОтмененныеСтроки(Команда)
//	
//	СкрыватьОтмененныеСтрокиПродукция = Не СкрыватьОтмененныеСтрокиПродукция;
//	
//	Если СкрыватьОтмененныеСтрокиПродукция Тогда
//		Элементы.Продукция.ОтборСтрок = Новый ФиксированнаяСтруктура("Отменено", Ложь);
//	Иначе
//		Элементы.Продукция.ОтборСтрок = Неопределено;
//	КонецЕсли;
//	
//	Элементы.ПродукцияСкрыватьОтмененныеСтроки.Пометка = СкрыватьОтмененныеСтрокиПродукция;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Продукция_ПодобратьПоЗаказамНаПроизводство(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Продукция_Заполнение_Перезаполнить(Команда)
//	
//	ЗаполнитьВозвратныеОтходыИМатериалы();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПродукцияЗаполнитьПолучателя(Команда)
//	
//	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
//		"Документ.ЗаказПереработчику.Форма.ФормаДокумента.Команда.Продукция_Заполнить_ЗаполнитьПолучателя");

//	ПараметрыТЧ = Новый Структура;
//	ПараметрыТЧ.Вставить("ИмяТЧФорма"      , "Продукция");
//	ПараметрыТЧ.Вставить("ИмяТЧОбъект"     , "Продукция");
//	ПараметрыТЧ.Вставить("ПредставлениеТЧ" , НСтр("ru = 'Продукция'"));
//	
//	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПолучателяЗавершение", 
//												   ЭтотОбъект, Новый Структура("ПараметрыТЧ", ПараметрыТЧ));
//	
//	ПроизводствоКлиент.ОткрытьФормуВыбораПолучателя(ЭтаФорма, Объект, ПараметрыТЧ,, ОписаниеОповещения); 
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьПолучателяЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
//	
//	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ПараметрыТЧ      = ДополнительныеПараметры.ПараметрыТЧ;
//	ВыделенныеСтроки = Элементы[ПараметрыТЧ.ИмяТЧФорма].ВыделенныеСтроки;
//	
//	ЗаполнитьПолучателяНаСервере(ПараметрыТЧ, ВыделенныеСтроки, ВыбранноеЗначение);
//	
//	ОповеститьОбОкончанииЗаполненияПолучателей();
//	
//КонецПроцедуры	

//&НаСервере
//Процедура ЗаполнитьПолучателяНаСервере(ПараметрыТЧ, ВыделенныеСтроки, Получатель)
//	
//	ИмяТЧОбъект = ПараметрыТЧ.ИмяТЧОбъект;
//	ИмяТЧФорма  = ПараметрыТЧ.ИмяТЧФорма;
//	
//	Для каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
//		
//		ДанныеСтроки = Объект[ИмяТЧОбъект].НайтиПоИдентификатору(ИдентификаторСтроки);
//		
//		ДанныеСтроки.Получатель = Получатель;
//		
//	КонецЦикла;
//	
//	ТребуетсяУточнитьДанныеРаспоряжения = Истина;
//	
//	ПослеИзмененияСтрокТЧПрограммноНаСервере(ИмяТЧФорма, ВыделенныеСтроки);
//	
//КонецПроцедуры

//#КонецОбласти

//#Область КомандыТЧ_ВозвратныеОтходы

//&НаКлиенте
//Процедура ВозвратныеОтходыЗаполнитьДатуПоступления(Команда)
//	
//	Если Элементы.ВозвратныеОтходы.ВыделенныеСтроки.Количество() > 0 Тогда
//		ЗаполнитьДатуПоступления("ВозвратныеОтходы", Элементы.ВозвратныеОтходы.ВыделенныеСтроки);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыЗаполнитьЦеныПоВидуЦен(Команда)
//	
//	Если Элементы.ВозвратныеОтходы.ВыделенныеСтроки.Количество() = 0 Тогда
//		
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//			НСтр("ru = 'В таблице отсутствуют выделенные строки. Выделите строки для заполнения цен'"),
//			Объект.Ссылка,
//			"Объект.ВозвратныеОтходы");
//		
//		Возврат;
//		
//	КонецЕсли;
//	
//	Если ПродажиКлиент.НеобходимоЗаполнениеЦенПоВидуЦен(Объект, "ВозвратныеОтходы", НСтр("ru='Возвратные отходы'")) Тогда
//		
//		ДополнительныеПараметры = Новый Структура;
//		ПродажиКлиент.ВыбратьВидЦен(
//			Новый ОписаниеОповещения("ВозвратныеОтходыЗаполнитьЦеныПоВидуЦенЗавершение", ЭтотОбъект, ДополнительныеПараметры),
//			Ложь);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыЗаполнитьЦеныПоВидуЦенЗавершение(ВидЦен, ДополнительныеПараметры) Экспорт
//	
//	Если ЗначениеЗаполнено(ВидЦен) Тогда
//		
//		ЦеныРассчитаны = ЗаполнитьЦеныПоВидуЦенСервер(ВидЦен, "ВозвратныеОтходы", Истина);
//		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияЦенПоВидуЦен(ЦеныРассчитаны, ВидЦен);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыКопированиеВставитьСтроки(Команда)
//	
//	КоличествоТоваровДоВставки = Объект.ВозвратныеОтходы.Количество();
//	
//	ПолучитьСтрокиИзБуфераОбмена("ВозвратныеОтходы");
//	
//	КоличествоВставленных = Объект.ВозвратныеОтходы.Количество() - КоличествоТоваровДоВставки;
//	КопированиеСтрокКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоВставленных);
//		
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыКопированиеСкопироватьСтроки(Команда)
//	
//	Если КопированиеСтрокКлиент.ВозможноКопированиеСтрок(Элементы.ВозвратныеОтходы.ТекущаяСтрока) Тогда
//		СкопироватьСтрокиНаСервере("ВозвратныеОтходы");
//		КопированиеСтрокКлиент.ОповеститьПользователяОКопированииСтрок(Элементы.ВозвратныеОтходы.ВыделенныеСтроки.Количество());
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыЗагрузитьДанныеИзТСД(Команда)
//	
//	ОчиститьСообщения();
//	
//	МенеджерОборудованияКлиент.НачатьЗагрузкуДанныеИзТСД(
//		Новый ОписаниеОповещения("ВозвратныеОтходыЗагрузитьИзТСДЗавершение", ЭтотОбъект),
//		УникальныйИдентификатор);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыЗагрузитьИзТСДЗавершение(Результат, Параметры) Экспорт
//	
//	Если Результат.Результат Тогда
//		ОбработатьШтрихкоды(Результат.ТаблицаТоваров, "ВозвратныеОтходы");
//	Иначе
//		МенеджерОборудованияУТКлиент.СообщитьОбОшибке(Результат);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыОбщееПодобратьТовары(Команда)
//	
//	ПодобратьТовар("ВозвратныеОтходы");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыОбщееПоискПоШтрихкоду(Команда)
//	
//	ОчиститьСообщения();
//	Оповещение = Новый ОписаниеОповещения("ВозвратныеОтходыОбщееПоискПоШтрихкодуЗавершение", ЭтотОбъект);
//	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыОбщееПоискПоШтрихкодуЗавершение(ДанныхШтрихкода, ДополнительныеПараметры) Экспорт
//	
//	ОбработатьШтрихкоды(ДанныхШтрихкода, "ВозвратныеОтходы");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыОбщееРазбитьСтроку(Команда)
//	
//	ТаблицаФормы  = Элементы.ВозвратныеОтходы;
//	ДанныеТаблицы = Объект.ВозвратныеОтходы;
//	
//	Оповещение = Новый ОписаниеОповещения("ВозвратныеОтходыОбщееРазбитьСтрокуЗавершение", ЭтотОбъект);
//	ОбщегоНазначенияУТКлиент.РазбитьСтрокуТЧ(ДанныеТаблицы, ТаблицаФормы, Оповещение);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыОбщееРазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры) Экспорт
//	
//	ТекущаяСтрока = Элементы.ВозвратныеОтходы.ТекущиеДанные;
//	
//	Если НоваяСтрока <> Неопределено Тогда
//		
//		НоваяСтрока.КодСтроки = 0;
//		
//		СтруктураДействий = Новый Структура;
//		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок("ВозвратныеОтходы", СтруктураДействий);
//		СтруктураДействий.Вставить("ПересчитатьСумму");
//		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//		
//		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок("ВозвратныеОтходы", СтруктураДействий);
//		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, КэшированныеЗначения);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыОтменаСтрокОтменитьВыделенныеСтроки(Команда)
//	
//	Если Не ПродажиКлиент.НеобходимоЗаполнениеПричиныОтменыВыделенныхСтрок(Объект.ВозвратныеОтходы,
//		НСтр("ru='Возвратные отходы'"), Элементы.ВозвратныеОтходы.ВыделенныеСтроки) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ПричинаОтмены = ПредопределенноеЗначение("Справочник.ПричиныОтменыЗаказовПоставщикам.ПустаяСсылка");
//	Если ИспользоватьПричиныОтменыЗаказовПоставщикам Тогда
//		ОткрытьФорму("Справочник.ПричиныОтменыЗаказовПоставщикам.ФормаВыбора",,,,,,
//			Новый ОписаниеОповещения("ВозвратныеОтходыОтменитьВыделенныеСтрокиЗавершение", ЭтотОбъект),
//			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//		Возврат;
//	КонецЕсли;
//	
//	ВозвратныеОтходыОтменитьВыделенныеСтрокиФрагмент(ПричинаОтмены);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыОтменитьВыделенныеСтрокиЗавершение(Результат, ДополнительныеПараметры) Экспорт
//	
//	ПричинаОтмены = Результат;
//	Если ПричинаОтмены = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ВозвратныеОтходыОтменитьВыделенныеСтрокиФрагмент(ПричинаОтмены);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыОтменитьВыделенныеСтрокиФрагмент(ПричинаОтмены)
//	
//	СтруктураДействий = Новый Структура();
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыВозвратныеОтходы());
//	
//	Для Каждого ТекСтрока Из Элементы.ВозвратныеОтходы.ВыделенныеСтроки Цикл
//		
//		СтрокаТаблицы = Объект.ВозвратныеОтходы.НайтиПоИдентификатору(ТекСтрока);
//		
//		Если СтрокаТаблицы <> Неопределено Тогда
//			
//			СтрокаТаблицы.ПричинаОтмены = ПричинаОтмены;
//			СтрокаТаблицы.Отменено = Истина;
//			
//			ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, КэшированныеЗначения);
//			
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	ПоказатьОповещениеПользователя(
//		НСтр("ru = 'Выделенные строки отменены'"),
//		,
//		НСтр("ru='Выделенные строки отменены.'"),
//		БиблиотекаКартинок.Информация32);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыОтменаСтрокОтменитьНепоставленныеСтроки(Команда)
//	
//	// &ЗамерПроизводительности
//	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
//		"Документ.ЗаказПереработчику.Форма.ФормаДокумента.Команда.ВозвратныеОтходыОтменитьНеотработанные");
//	
//	Если Объект.ВозвратныеОтходы.Количество() = 0 Тогда
//		
//		ТекстПредупреждения = НСтр("ru='В документе не заполнен список Возвратные отходы. Строки не могут быть отменены.'");
//		ПоказатьПредупреждение(,ТекстПредупреждения);
//		Возврат;
//		
//	ИначеЕсли Объект.ВозвратныеОтходы.НайтиСтроки(Новый Структура("Отменено", Ложь)).Количество() = 0 Тогда
//		
//		ТекстПредупреждения = НСтр("ru='В документе для списка Возвратные отходы все строки уже отменены.'");
//		ПоказатьПредупреждение(,ТекстПредупреждения);
//		Возврат;
//		
//	КонецЕсли;
//	
//	ПричинаОтмены = ПредопределенноеЗначение("Справочник.ПричиныОтменыЗаказовПоставщикам.ПустаяСсылка");
//	Если ИспользоватьПричиныОтменыЗаказовПоставщикам Тогда
//		ОткрытьФорму("Справочник.ПричиныОтменыЗаказовПоставщикам.ФормаВыбора",,,,,,
//			Новый ОписаниеОповещения("ВозвратныеОтходыОтменитьНепоставленныеСтрокиЗавершение", ЭтотОбъект),
//			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//		Возврат;
//	КонецЕсли;
//	
//	ВозвратныеОтходыОтменитьНепоставленныеСтрокиСервер(ПричинаОтмены);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыОтменитьНепоставленныеСтрокиЗавершение(Результат, ДополнительныеПараметры) Экспорт
//	
//	ПричинаОтмены = Результат;
//	Если ПричинаОтмены = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	РезультатОтмены = ВозвратныеОтходыОтменитьНепоставленныеСтрокиСервер(ПричинаОтмены);
//	ПоказатьОповещениеПользователя(НСтр("ru = 'Отмена неотработанных строк'"), , РезультатОтмены.Оповещение);
//	
//КонецПроцедуры

//&НаСервере
//Функция ВозвратныеОтходыОтменитьНепоставленныеСтрокиСервер(ПричинаОтмены)
//	
//	СтруктураКорректировкиСтрокЗаказа = ЗаказыСервер.СтруктураКорректировкиСтрокЗаказа();
//	СтруктураКорректировкиСтрокЗаказа.ОтменитьНеотработанныеСтроки = Истина;
//	СтруктураКорректировкиСтрокЗаказа.ИмяТабличнойЧасти = "ВозвратныеОтходы";
//	СтруктураКорректировкиСтрокЗаказа.ПричинаОтмены = ПричинаОтмены;
//	
//	Возврат СкорректироватьСтрокиЗаказа(СтруктураКорректировкиСтрокЗаказа);
//	
//КонецФункции

//&НаКлиенте
//Процедура ВозвратныеОтходыОтменаСтрокСкрыватьОтмененныеСтроки(Команда)
//	
//	СкрыватьОтмененныеСтрокиПродукция = Не СкрыватьОтмененныеСтрокиПродукция;
//	
//	Если СкрыватьОтмененныеСтрокиПродукция Тогда
//		Элементы.ВозвратныеОтходы.ОтборСтрок = Новый ФиксированнаяСтруктура("Отменено", Ложь);
//	Иначе
//		Элементы.ВозвратныеОтходы.ОтборСтрок = Неопределено;
//	КонецЕсли;
//	
//	Элементы.ВозвратныеОтходыСкрыватьОтмененныеСтроки.Пометка = СкрыватьОтмененныеСтрокиПродукция;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходы_Заполнить_ЗаполнитьГруппуЗатрат(Команда)
//	
//	ВыбратьГруппуЗатрат("ВозвратныеОтходы");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВозвратныеОтходыЗаполнитьПолучателя(Команда)
//	
//	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
//		"Документ.ЗаказПереработчику.Форма.ФормаДокумента.Команда.ВозвратныеОтходы_Заполнить_ЗаполнитьПолучателя");

//	ПараметрыТЧ = Новый Структура;
//	ПараметрыТЧ.Вставить("ИмяТЧФорма"      , "ВозвратныеОтходы");
//	ПараметрыТЧ.Вставить("ИмяТЧОбъект"     , "ВозвратныеОтходы");
//	ПараметрыТЧ.Вставить("ПредставлениеТЧ" , НСтр("ru = 'Возвратные отходы'"));
//	
//	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПолучателяЗавершение", 
//												   ЭтотОбъект, Новый Структура("ПараметрыТЧ", ПараметрыТЧ));
//	
//	ПроизводствоКлиент.ОткрытьФормуВыбораПолучателя(ЭтаФорма, Объект, ПараметрыТЧ,, ОписаниеОповещения); 
//	
//КонецПроцедуры

//#КонецОбласти

//#Область КомандыТЧ_Материалы

//&НаКлиенте
//Процедура МатериалыЗаполнитьДатуОтгрузки(Команда)
//	
//	ЗаполнитьДатуОтгрузки("Материалы");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыЗаполнитьСклад(Команда)
//	
//	ВыделенныеСтроки = Элементы.Материалы.ВыделенныеСтроки;
//	ТребуетсяЗаполнение = СкладыКлиент.ПроверитьВозможностьЗаполненияСкладовВТабличнойЧасти(
//		Объект,
//		Объект.Материалы,
//		НСтр("ru='Сырье и материалы для производства'"),
//		ВыделенныеСтроки);
//	
//	Если ТребуетсяЗаполнение Тогда
//		
//		МассивОтбора = Новый Массив();
//		МассивОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказах"));
//		МассивОтбора.Добавить(ПредопределенноеЗначение("Перечисление.ВыборГруппыСкладов.РазрешитьВЗаказахИНакладных"));
//		
//		СтруктураОтбора = Новый Структура("ЭтоГруппа", Ложь);
//		
//		СтруктураПараметров = Новый Структура("Отбор", СтруктураОтбора);
//		СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);
//		СтруктураПараметров.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
//		
//		ВыбранныйСклад = Неопределено;
//		
//		ОписаниеОповещения = Новый ОписаниеОповещения(
//			"МатериалыЗаполнитьСкладЗавершение",
//			ЭтотОбъект,
//			Новый Структура("ВыделенныеСтроки", ВыделенныеСтроки));
//		
//		ОткрытьФорму(
//			"Справочник.Склады.ФормаВыбора",
//			СтруктураПараметров,
//			ЭтаФорма,,,,
//			ОписаниеОповещения,
//			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыЗаполнитьСкладЗавершение(Результат, ДополнительныеПараметры) Экспорт
//    
//    ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
//    
//    
//    ВыбранныйСклад      = Результат;
//    
//    Если ЗначениеЗаполнено(ВыбранныйСклад) Тогда
//        
//        ЗаполненоСтрок = ЗаполнитьСкладВВыделенныхСтрокахНаСервере("Материалы", ВыделенныеСтроки, ВыбранныйСклад);
//        
//        СкладыКлиент.ПоказатьОповещениеОЗаполненииСкладаВТабличнойЧасти(
//        ВыбранныйСклад,
//        ЗаполненоСтрок,
//        ВыделенныеСтроки.Количество());
//        
//    КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыЗаполнитьЦеныПоВидуЦен(Команда)
//	
//	Если Элементы.Материалы.ВыделенныеСтроки.Количество() = 0 Тогда
//		
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//			НСтр("ru = 'В таблице отсутствуют выделенные строки. Выделите строки для заполнения цен'"),
//			Объект.Ссылка,
//			"Объект.Материалы");
//		
//		Возврат;
//		
//	КонецЕсли;
//	
//	Если ПродажиКлиент.НеобходимоЗаполнениеЦенПоВидуЦен(Объект, "Материалы", НСтр("ru='Сырье и материалы для производства'")) Тогда
//		
//		ДополнительныеПараметры = Новый Структура;
//		ПродажиКлиент.ВыбратьВидЦен(
//			Новый ОписаниеОповещения("МатериалыЗаполнитьЦеныПоВидуЦенЗавершение", ЭтотОбъект, ДополнительныеПараметры),
//			Ложь);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыЗаполнитьЦеныПоВидуЦенЗавершение(ВидЦен, ДополнительныеПараметры) Экспорт
//	
//	Если ЗначениеЗаполнено(ВидЦен) Тогда
//		
//		ЦеныРассчитаны = ЗаполнитьЦеныПоВидуЦенСервер(ВидЦен, "Материалы", Истина);
//		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияЦенПоВидуЦен(ЦеныРассчитаны, ВидЦен);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыКопированиеВставитьСтроки(Команда)
//	
//	КоличествоТоваровДоВставки = Объект.Материалы.Количество();
//	
//	ПолучитьСтрокиИзБуфераОбмена("Материалы");
//	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Материалы, ДатаОтгрузкиОбязательна);
//	
//	КоличествоВставленных = Объект.Материалы.Количество() - КоличествоТоваровДоВставки;
//	КопированиеСтрокКлиент.ОповеститьПользователяОВставкеСтрок(КоличествоВставленных);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыКопированиеСкопироватьСтроки(Команда)
//	
//	Если КопированиеСтрокКлиент.ВозможноКопированиеСтрок(Элементы.Материалы.ТекущаяСтрока) Тогда
//		СкопироватьСтрокиНаСервере("Материалы");
//		КопированиеСтрокКлиент.ОповеститьПользователяОКопированииСтрок(Элементы.Материалы.ВыделенныеСтроки.Количество());
//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыОбщееЗагрузитьДанныеИзТСД(Команда)
//	
//	ОчиститьСообщения();
//	
//	МенеджерОборудованияКлиент.НачатьЗагрузкуДанныеИзТСД(
//		Новый ОписаниеОповещения("МатериалыОбщееЗагрузитьИзТСДЗавершение", ЭтотОбъект),
//		УникальныйИдентификатор);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыОбщееЗагрузитьИзТСДЗавершение(Результат, Параметры) Экспорт
//	
//	Если Результат.Результат Тогда
//		Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Материалы Тогда
//			ОбработатьШтрихкоды(Результат.ТаблицаТоваров, "Материалы");
//		Иначе
//			ОбработатьШтрихкоды(Результат.ТаблицаТоваров, "Продукция");
//		КонецЕсли;
//	Иначе
//		МенеджерОборудованияУТКлиент.СообщитьОбОшибке(Результат);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыОбщееПодобратьТовары(Команда)
//	
//	ПодобратьТовар("Материалы");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыОбщееПоискПоШтрихкоду(Команда)
//	
//	ОчиститьСообщения();
//	Оповещение = Новый ОписаниеОповещения("МатериалыОбщееПоискПоШтрихкодуЗавершение", ЭтотОбъект);
//	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыОбщееПоискПоШтрихкодуЗавершение(ДанныхШтрихкода, ДополнительныеПараметры) Экспорт
//	
//	ОбработатьШтрихкоды(ДанныхШтрихкода, "Материалы");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ДополнитьМногооборотнойТарой(Команда)

//	МногооборотнаяТараКлиент.ПодобратьМногооборотнуюТару(
//		ЭтаФорма,
//		"Материалы",
//		"Номенклатура,Характеристика,Количество,Склад,ДатаОтгрузки");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыОбщееРазбитьСтроку(Команда)
//	
//	ТаблицаФормы  = Элементы.Материалы;
//	ДанныеТаблицы = Объект.Материалы;
//	
//	Оповещение = Новый ОписаниеОповещения("МатериалыОбщееРазбитьСтрокуЗавершение", ЭтотОбъект);
//	ОбщегоНазначенияУТКлиент.РазбитьСтрокуТЧ(ДанныеТаблицы, ТаблицаФормы, Оповещение);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыОбщееРазбитьСтрокуЗавершение(НоваяСтрока, ДополнительныеПараметры) Экспорт
//	
//	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
//	
//	Если НоваяСтрока <> Неопределено Тогда
//		
//		НоваяСтрока.КодСтроки = 0;
//		
//		СтруктураДействий = Новый Структура;
//		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок("Материалы", СтруктураДействий);
//		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//		
//		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок("Материалы", СтруктураДействий);
//		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, КэшированныеЗначения);
//		
//		РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыОтменаСтрокОтменитьВыделенныеСтроки(Команда)
//	
//	Если Не ПродажиКлиент.НеобходимоЗаполнениеПричиныОтменыВыделенныхСтрок(Объект.Материалы,
//		НСтр("ru='Сырье и материалы'"), Элементы.Материалы.ВыделенныеСтроки) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	МатериалыОтменитьВыделенныеСтрокиСервер();
//	ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Материалы, ДатаОтгрузкиОбязательна);
//	
//	ПоказатьОповещениеПользователя(НСтр("ru = 'Отмена выделенных строк'"), , НСтр("ru = 'Выделенные строки отменены'"));
//	
//КонецПроцедуры

//&НаСервере
//Процедура МатериалыОтменитьВыделенныеСтрокиСервер()
//	
//	ВыделенныеСтроки = Элементы.Материалы.ВыделенныеСтроки;
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыМатериалы());
//	СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
//		Новый Структура("ЕстьРаботы, ЕстьОтменено, ДоступноОбеспечение", Ложь, Истина, ДоступноОбеспечение(ЭтаФорма)));
//	КэшированныеЗначения = Неопределено;
//	
//	Для Каждого Идентификатор Из ВыделенныеСтроки Цикл
//		
//		Строка = Объект.Материалы.НайтиПоИдентификатору(Идентификатор);
//		Строка.Отменено = Истина;
//		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(Строка, СтруктураДействий, КэшированныеЗначения);
//		
//	КонецЦикла;
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыОтменаСтрокОтменитьНеотработанныеСтроки(Команда)
//	
//	// &ЗамерПроизводительности
//	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
//		"Документ.ЗаказПереработчику.Форма.ФормаДокумента.Команда.МатериалыОтменитьНеотработанные");
//	
//	РезультатОтмены = МатериалыОтменитьНеотработанныеСервер();
//	ПоказатьОповещениеПользователя(НСтр("ru = 'Отмена неотработанных строк'"), , РезультатОтмены.Оповещение);
//	
//КонецПроцедуры

//&НаСервере
//Функция МатериалыОтменитьНеотработанныеСервер()
//	
//	СтруктураКорректировкиСтрокЗаказа = ЗаказыСервер.СтруктураКорректировкиСтрокЗаказа();
//	СтруктураКорректировкиСтрокЗаказа.ОтменитьНеотработанныеСтроки = Истина;
//	СтруктураКорректировкиСтрокЗаказа.ИмяТабличнойЧасти = "Материалы";
//	
//	Возврат СкорректироватьСтрокиЗаказа(СтруктураКорректировкиСтрокЗаказа);
//	
//КонецФункции

//&НаКлиенте
//Процедура МатериалыОтменаСтрокСкрыватьОтмененныеСтроки(Команда)
//	
//	СкрыватьОтмененныеСтрокиМатериалы = Не СкрыватьОтмененныеСтрокиМатериалы;
//	
//	Если СкрыватьОтмененныеСтрокиМатериалы Тогда
//		Элементы.Материалы.ОтборСтрок = Новый ФиксированнаяСтруктура("Отменено", Ложь);
//	Иначе
//		Элементы.Материалы.ОтборСтрок = Неопределено;
//	КонецЕсли;
//	
//	Элементы.МатериалыСкрыватьОтмененныеСтроки.Пометка = СкрыватьОтмененныеСтрокиМатериалы;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Материалы_Заполнить_ЗаполнитьГруппуЗатрат(Команда)
//	
//	ВыбратьГруппуЗатрат("Материалы", Истина);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Материалы_Заполнить_ЗаполнитьСтатьюКалькуляции(Команда)
//	
//	ЗаполнитьСтатьюКалькуляции("Материалы", ПредопределенноеЗначение("Перечисление.ТипыЗатрат.Материальные"));
//	
//КонецПроцедуры

//#КонецОбласти

//#Область КомандыТЧ_Услуги

//&НаКлиенте
//Процедура Услуги_ВыбратьИЗаполнитьУслугу(Команда)
//	
//	Если Элементы.Услуги.ВыделенныеСтроки.Количество() = 0 Тогда
//		ПоказатьПредупреждение(, НСтр("ru = 'Для заполнения услуги необходимо выбрать строки.'"));
//		Возврат;
//	КонецЕсли;
//	
//	ОписаниеОповещения = Новый ОписаниеОповещения("Услуги_ВыбратьИЗаполнитьУслугуЗавершение", ЭтотОбъект);
//	ПараметрыОтбора = Новый Структура("ТипНоменклатуры", ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа"));
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
//	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
//	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы,,,,, ОписаниеОповещения);
//	
//КонецПроцедуры

//#КонецОбласти

//#Область КомандыТЧ_РедактированиеЭтаповПродукция

//&НаКлиенте
//Процедура РедактированиеЭтапов_Продукция_РазбитьСтроку(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Продукция_ВставитьСтроки(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Продукция_СкопироватьСтроки(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Продукция_ОтменитьВыделенныеСтроки(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Продукция_СкрыватьОтмененныеСтроки(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Продукция_ЗаполнитьПолучателя(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЭтапыЗаполнитьПолучателяЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры


//#КонецОбласти

//#Область КомандыТЧ_РедактированиеЭтаповОтходы

//&НаКлиенте
//Процедура РедактированиеЭтапов_Отходы_РазбитьСтроку(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Отходы_ВставитьСтроки(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Отходы_СкопироватьСтроки(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Отходы_ОтменитьВыделенныеСтроки(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Отходы_СкрыватьОтмененныеСтроки(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Отходы_ЗаполнитьПолучателя(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//#КонецОбласти

//#Область КомандыТЧ_РедактированиеЭтаповОбеспечениеМатериаламиИРаботами

//&НаКлиенте
//Процедура РедактированиеЭтапов_Обеспечение_ПодобратьТовары(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Обеспечение_ЗаполнитьГруппуЗатрат(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Обеспечение_ЗаполнитьДатуОтгрузки(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Обеспечение_ВставитьСтроки(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Обеспечение_СкопироватьСтроки(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Обеспечение_РазбитьСтроку(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Обеспечение_СостояниеОбеспечения(Команда)
//	
//	
//	Возврат; // пустой обработчик
//	
//КонецПроцедуры

//#КонецОбласти

//#Область Обеспечение

//&НаКлиенте
//Процедура МатериалыЗаполнитьОбеспечение(Команда)

//	ПараметрыПроверки = ОбеспечениеКлиентСервер.ИнициализироватьПараметрыПроверкиЗаполнения("Материалы",
//		НСтр("ru = 'Сырье и материалы для производства'"));
//	ПараметрыПроверки.Поля.Склад   = "Объект.Материалы[%1].Склад";
//	Текст = НСтр("ru = 'Не заполнена колонка ""Склад"" в строке %1 списка ""Сырье и материалы для производства""'");

//	Если ОбеспечениеКлиент.ПроверитьЗаполнение(
//		Объект, Объект.Материалы, Элементы.Материалы.ВыделенныеСтроки, ПараметрыПроверки) Тогда

//		ПараметрыФормы = ОбеспечениеКлиентСервер.ПараметрыФормыИсполнениеЗаказа(ТипЗнч(Объект.Ссылка));
//		ОткрытьФорму("Перечисление.ВариантыОбеспечения.Форма.ИсполнениеЗаказа", ПараметрыФормы,
//			ЭтаФорма, УникальныйИдентификатор);

//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура РедактированиеЭтапов_Обеспечение_ЗаполнитьОбеспечение(Команда)
//	
//	
//	Возврат;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура МатериалыСостояниеОбеспечения(Команда)

//	ТекстПредупреждения = НСтр("ru = 'Не введено ни одной строки в список ""Сырье и материалы"".
//		|Просмотр состояния обеспечения списка сырья и материалов невозможен.'");
//		
//	Если ОбеспечениеКлиент.ПроверитьВозможностьВыполненияКомандыСостояниеОбеспеченияВДокументе(ЭтаФорма, "Материалы", ТекстПредупреждения) Тогда
//		
//		ДанныеДляОбеспечения = ПодготовитьДанныеДляОбеспеченияЗаказа();
//		ОткрытьФорму("Обработка.СостояниеОбеспечения.Форма", ДанныеДляОбеспечения, ЭтаФорма, УникальныйИдентификатор);
//		
//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура СоздатьКорректировкуНазначенияРезервирование(Команда)
//	
//	ОбъектыОснований = Новый Массив();
//	ОбъектыОснований.Добавить(Объект.Ссылка);
//	
//	ОписаниеКоманды = Новый Структура();
//	ОписаниеКоманды.Вставить("ОбъектыОснований", ОбъектыОснований);
//	ОписаниеКоманды.Вставить("Форма", ЭтаФорма);
//	
//	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПереработчикам.НеСогласован") Тогда
//		МинимальныйСтатус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПереработчикам.КИсполнению");
//		ОбеспечениеКлиент.СообщитьОНеобходимомМинимальномСтатусеДокумента(Истина, Строка(МинимальныйСтатус));
//	ИначеЕсли Не Объект.Проведен Или Модифицированность Тогда
//		ДополнительныеПараметры = Новый Структура();
//		ДополнительныеПараметры.Вставить("Резервирование", Истина);
//		ДополнительныеПараметры.Вставить("ОписаниеКоманды", ОписаниеКоманды);
//		
//		ТекстВопроса = НСтр("ru = 'Для резервирования под назначение необходимо предварительно провести документ. Выполнить проведение документа и продолжить?'");
//		ПоказатьВопрос(
//			Новый ОписаниеОповещения("СоздатьКорректировкуНазначенияЗавершение", ЭтотОбъект, ДополнительныеПараметры), 
//				ТекстВопроса, РежимДиалогаВопрос.ДаНет);
//	Иначе
//		
//		НаличиеТоваровКОбособленномуОбеспечению = ЕстьТоварыКОбособленномуОбеспечению();
//		
//		Если НаличиеТоваровКОбособленномуОбеспечению = "ЕстьТоварыКОбособленномуОбеспечению" Тогда
//			СозданиеНаОснованииУТКлиент.ОткрытьМастерРезервирования(ОписаниеКоманды);
//		ИначеЕсли НаличиеТоваровКОбособленномуОбеспечению = "ЕстьТоварыКСтороннемуОбособленномуОбеспечению" Тогда
//			ОбеспечениеКлиент.СообщитьОбОтсутствииТовараКОбособленномуОбеспечениюПоТекущемуЗаказу(Истина);
//		Иначе
//			ОбеспечениеКлиент.СообщитьОбОтсутствииТовараКОбособленномуОбеспечению();
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СоздатьКорректировкуНазначенияСнятиеРезерва(Команда)
//	
//	ОбъектыОснований = Новый Массив();
//	ОбъектыОснований.Добавить(Объект.Ссылка);
//	
//	ОписаниеКоманды = Новый Структура();
//	ОписаниеКоманды.Вставить("ОбъектыОснований", ОбъектыОснований);
//	ОписаниеКоманды.Вставить("Форма", ЭтаФорма);
//	
//	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПереработчикам.НеСогласован") Тогда
//		МинимальныйСтатус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПереработчикам.КИсполнению");
//		ОбеспечениеКлиент.СообщитьОНеобходимомМинимальномСтатусеДокумента(Ложь, Строка(МинимальныйСтатус));
//	ИначеЕсли Не Объект.Проведен Или Модифицированность Тогда
//		ДополнительныеПараметры = Новый Структура();
//		ДополнительныеПараметры.Вставить("Резервирование", Ложь);
//		ДополнительныеПараметры.Вставить("ОписаниеКоманды", ОписаниеКоманды);
//		
//		ТекстВопроса = НСтр("ru = 'Для снятия резерва под назначение необходимо предварительно провести документ. Выполнить проведение документа и продолжить?'");
//		ПоказатьВопрос(
//			Новый ОписаниеОповещения("СоздатьКорректировкуНазначенияЗавершение", ЭтотОбъект, ДополнительныеПараметры), 
//				ТекстВопроса, РежимДиалогаВопрос.ДаНет);
//	Иначе
//		
//		НаличиеТоваровКОбособленномуОбеспечению = ЕстьТоварыКОбособленномуОбеспечению();
//		
//		Если НаличиеТоваровКОбособленномуОбеспечению = "ЕстьТоварыКОбособленномуОбеспечению" Тогда
//			СозданиеНаОснованииУТКлиент.ОткрытьМастерСнятияРезерва(ОписаниеКоманды);
//		ИначеЕсли НаличиеТоваровКОбособленномуОбеспечению = "ЕстьТоварыКСтороннемуОбособленномуОбеспечению" Тогда
//			ОбеспечениеКлиент.СообщитьОбОтсутствииТовараКОбособленномуОбеспечениюПоТекущемуЗаказу(Ложь);
//		Иначе
//			ОбеспечениеКлиент.СообщитьОбОтсутствииТовараКОбособленномуОбеспечению();
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Функция ЕстьТоварыКОбособленномуОбеспечению()
//	
//	НазначениеДокумента = Документы.КорректировкаНазначенияТоваров.НазначениеЗаказа(Объект.Ссылка);
//	ЕстьТоварыКОбособленномуОбеспечению = Документы.КорректировкаНазначенияТоваров.ЕстьТоварыКОбособленномуОбеспечению(НазначениеДокумента);
//	ЕстьТоварыКСтороннемуОбособленномуОбеспечению = Ложь;
//	
//	Если Не ЕстьТоварыКОбособленномуОбеспечению Тогда
//		
//		Для Каждого Строка Из Объект.Материалы Цикл
//			Если Не Строка.Отменено
//				И Строка.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Обособленно
//				И Не Строка.Назначение.Пустая()
//				И Строка.Назначение <> НазначениеДокумента Тогда
//				ЕстьТоварыКСтороннемуОбособленномуОбеспечению = Истина;
//				Прервать;
//			КонецЕсли;
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//	Если ЕстьТоварыКОбособленномуОбеспечению Тогда
//		Ответ = "ЕстьТоварыКОбособленномуОбеспечению";
//	ИначеЕсли ЕстьТоварыКСтороннемуОбособленномуОбеспечению Тогда
//		Ответ = "ЕстьТоварыКСтороннемуОбособленномуОбеспечению";
//	Иначе
//		Ответ = "НетТоваровКОбособленномуОбеспечению";
//	КонецЕсли;
//	
//	Возврат Ответ;
//	
//КонецФункции

//#КонецОбласти

//#Область ПрочиеКоманды

//&НаКлиенте
//Процедура ПровестиИЗакрыть(Команда)
//	
//	Если Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства") Тогда
//		
//		ОчиститьСообщения();
//		
//		ПринудительноЗакрытьФорму = Истина;
//		
//		ПараметрыЗаписи = Новый Структура;
//		ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
//		ПараметрыЗаписи.Вставить("РежимПроведения", РежимПроведенияДокумента.Неоперативный);
//		ПараметрыЗаписи.Вставить("ПринудительноЗакрытьФорму", Истина);
//		ПараметрыЗаписи.Вставить("НовыйОбъект", Не ЗначениеЗаполнено(Объект.Ссылка));
//		
//		Если ПровестиИЗакрытьНаСервере(ПараметрыЗаписи) Тогда
//			ПослеЗаписи(ПараметрыЗаписи);
//		Иначе
//			ТекстИсключения = СтрШаблон(
//				НСтр("ru='Не удалось провести ""%1""'"),
//				?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, НСтр("ru='Заказ переработчику'")));
//			ВызватьИсключение ТекстИсключения;
//		КонецЕсли;
//		
//	Иначе
//		
//		ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма, Истина);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПометкаУдаления(Команда)
//	
//	ТекстВопроса = НСтр("ru='Пометить ""%1"" на удаление?'");
//	Если Объект.ПометкаУдаления Тогда
//		ТекстВопроса = НСтр("ru='Снять с ""%1"" пометку на удаление?'");
//	КонецЕсли;
//	
//	ТекстВопроса = СтрШаблон(ТекстВопроса, Объект.Ссылка);
//	
//	ПоказатьВопрос(
//		Новый ОписаниеОповещения("ПометкаУдаленияОбработчикОповещения", ЭтаФорма),
//		ТекстВопроса,
//		РежимДиалогаВопрос.ДаНет);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПометкаУдаленияОбработчикОповещения(Результат, ДополнительныеПараметры) Экспорт
//	
//	Если Результат <> КодВозвратаДиалога.Да Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Объект.ПометкаУдаления = Не Объект.ПометкаУдаления;
//	
//	ПринудительноЗакрытьФорму = Ложь;
//	ПараметрыЗаписи = Новый Структура;
//	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения);
//	ПараметрыЗаписи.Вставить("РежимПроведения", РежимПроведенияДокумента.Неоперативный);
//	ПараметрыЗаписи.Вставить("ПринудительноЗакрытьФорму", Ложь);
//	ПараметрыЗаписи.Вставить("НовыйОбъект", Не ЗначениеЗаполнено(Объект.Ссылка));
//	
//	Записать(ПараметрыЗаписи);
//	
//КонецПроцедуры

//#КонецОбласти

//#Область ПодключаемыеКоманды

//&НаКлиенте
//Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
//	
//	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
//	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
//КонецПроцедуры

//// СтандартныеПодсистемы.ПодключаемыеКоманды
//&НаКлиенте
//Процедура Подключаемый_ВыполнитьКоманду(Команда)
//	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
//КонецПроцедуры

//&НаСервере
//Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
//	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_ОбновитьКоманды()
//	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
//КонецПроцедуры
//// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//// ИнтеграцияС1СДокументооборотом
//&НаКлиенте
//Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
//	
//	ИнтеграцияС1СДокументооборотКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Объект);
//	
//КонецПроцедуры
//// Конец ИнтеграцияС1СДокументооборотом

//#КонецОбласти

//&НаКлиенте
//Процедура ЗаписатьДокумент(Команда)
//	
//	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма, Истина);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПровестиДокумент(Команда)
//	
//	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма, Истина);
//	
//КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

//#Область ПриИзмененииРеквизитов

//&НаСервере
//Процедура ПриИзмененииСуммыУслугиСервер()
//	
//	ТекущаяСтрока = Объект;
//	
//	СтруктураПересчетаСуммы = ПараметрыПересчетаСуммыНДСВТЧ(ЭтаФорма);
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
//	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
//	
//	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриИзмененииСтатусаСервер()
//	
//	ПодготовитьЗаполнитьУстановитьВидимостьСерий();
//	УстановитьДоступностьЭлементовПоСтатусуСервер();
//	
//	ПараметрыЗаполнения = Новый Структура("ЕстьРаботы, ЕстьОтменено", Ложь, Истина);
//	ПараметрыЗаполнения.Вставить("ДоступноОбеспечение", ДоступноОбеспечение(ЭтаФорма));
//	ОбеспечениеСервер.ЗаполнитьСлужебныеРеквизиты(Объект.Материалы, ПараметрыЗаполнения, ДатаОтгрузкиОбязательна);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриИзмененииСтавкиНДССервер()
//	
//	ТекущаяСтрока = Объект;
//	
//	СтруктураПересчетаСуммы = ПараметрыПересчетаСуммыНДСВТЧ(ЭтаФорма);
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
//	
//	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриИзмененииПартнераСервер()
//	
//	Документы.ЗаказПереработчику.ЗаполнитьУсловияЗакупокПоУмолчанию(Объект);
//	
//	ВалютаДокумента = Объект.Валюта;
//	
//	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер, Объект.Контрагент);
//	
//	ОбновитьФорму = Ложь;
//	ВзаиморасчетыСервер.ЗаполнитьПорядокРасчетовВФорме(ЭтаФорма, Ложь, , ОбновитьФорму);
//	Если ОбновитьФорму Тогда
//		УстановитьСвойстваЭлементовПоПорядкуРасчетов();
//	КонецЕсли;
//	Если Не Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным Тогда
//		ЭтапыОплатыКлиентСервер.РаспределитьСуммуПоЭтапамГрафикаОплаты(Объект.ЭтапыГрафикаОплаты, Объект.СуммаСНДС);
//	КонецЕсли;
//	
//	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Материалы, ЗависимыеРеквизитыМатериалы());
//	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.ВозвратныеОтходы, ЗависимыеРеквизитыВозвратныеОтходы());
//	
//	УстановитьВидимостьДоговора();
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	ОбновитьДоступностьЭлементовВозвратнойТары(ЭтаФорма);
//	ЗаполнитьУстановитьРеквизитыДоставкиСервер("Партнер");
//	НадписьЭтапыОплаты = ЭтапыОплатыКлиентСервер.НадписьЭтапыОплаты(ЭтаФорма, Истина, Объект.СуммаСНДС);
//	
//	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);
//	
//	Если ИспользоватьНаправленияДеятельности Тогда
//		НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(Объект.НаправлениеДеятельности, , Объект.Договор);
//	КонецЕсли;
//	НаправленияДеятельностиСервер.ПриИзмененииНаправленияДеятельностиСервер(ЭтаФорма);
//	Объект.ОбосабливатьПоНазначениюПродукции = Константы.ВариантОбособленияМатериаловВПереработке.Получить()
//		= Перечисления.ВариантыОбособленияМатериаловВПереработке.НазначениеПродукции;
//	
//	АктуализироватьЗакупкуПодДеятельность();
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриИзмененииКонтактногоЛицаСервер(ПартнерИзменился)
//	
//	ВладелецКонтактногоЛица = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.КонтактноеЛицо, "Владелец");
//	Если ВладелецКонтактногоЛица <> Объект.Партнер Тогда
//		Объект.Партнер = ВладелецКонтактногоЛица;
//		ПриИзмененииПартнераСервер();
//		ПартнерИзменился = Истина;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриИзмененииДоговораСервер()
//	
//	ЗакупкиВызовСервера.ЗаполнитьБанковскиеСчетаПоДоговору(Объект.Договор, Объект.БанковскийСчет);
//	
//	ОбновитьФорму = Ложь;
//	ВзаиморасчетыСервер.ЗаполнитьПорядокРасчетовВФорме(ЭтаФорма, Ложь, , ОбновитьФорму);
//	Если ОбновитьФорму Тогда
//		УстановитьСвойстваЭлементовПоПорядкуРасчетов();
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(Объект.Договор) Тогда
//		Объект.ПорядокОплаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Договор,"ПорядокОплаты");
//	КонецЕсли;
//	
//	Если ИспользоватьНаправленияДеятельности Тогда
//		НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(Объект.НаправлениеДеятельности, , Объект.Договор);
//	КонецЕсли;
//	
//	ЗаполнитьПодчиненныеСвойстваПоСтатистике("Договор");
//	НаправленияДеятельностиСервер.ПриИзмененииНаправленияДеятельностиСервер(ЭтаФорма);
//	Объект.ОбосабливатьПоНазначениюПродукции = Константы.ВариантОбособленияМатериаловВПереработке.Получить()
//		= Перечисления.ВариантыОбособленияМатериаловВПереработке.НазначениеПродукции;
//		
//	АктуализироватьЗакупкуПодДеятельность();
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриИзмененииВидаЦеныСервер(ЦеныРассчитаны)
//	
//	ЦеныРассчитаны = ЗаполнитьЦеныПоВидуЦенСервер(Объект.ВидЦены, "ВозвратныеОтходы", Ложь);
//	ЦеныРассчитаны = ЗаполнитьЦеныПоВидуЦенСервер(Объект.ВидЦены, "Материалы", Ложь) И ЦеныРассчитаны;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриИзмененииВалютыСервер(НоваяВалюта, ПересчитатьСуммы)
//	
//	ЗаполнитьДоговорПоУмолчанию();
//	
//	Если ПересчитатьСуммы Тогда
//		
//		СтараяВалюта                = ВалютаДокумента;
//		ДатаДокумента               = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
//		СтруктураКурсовСтаройВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтараяВалюта, ДатаДокумента);
//		СтруктураКурсовНовойВалюты  = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НоваяВалюта,  ДатаДокумента);
//		
//		// Пересчет общей суммы документа
//		Объект.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
//			Объект.Сумма,
//			СтруктураКурсовСтаройВалюты,
//			СтруктураКурсовНовойВалюты);
//		
//		// Пересчет сумм в продукции
//		ПересчитатьСуммыТабличнойЧастиВВалюту(
//			Объект.ВозвратныеОтходы,
//			СтараяВалюта,
//			НоваяВалюта,
//			СтруктураКурсовСтаройВалюты,
//			СтруктураКурсовНовойВалюты);
//		
//		// Пересчет сумм в материалах
//		ПересчитатьСуммыТабличнойЧастиВВалюту(
//			Объект.Материалы,
//			СтараяВалюта,
//			НоваяВалюта,
//			СтруктураКурсовСтаройВалюты,
//			СтруктураКурсовНовойВалюты);
//		
//		// Пересчет сумм в услугах
//		ПересчитатьСуммыТабличнойЧастиВВалюту(
//			Объект.Услуги,
//			СтараяВалюта,
//			НоваяВалюта,
//			СтруктураКурсовСтаройВалюты,
//			СтруктураКурсовНовойВалюты,
//			"СуммаСНДС");
//		
//		ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Материалы, ЗависимыеРеквизитыМатериалы());
//		ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.ВозвратныеОтходы, ЗависимыеРеквизитыВозвратныеОтходы());
//		
//		РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//		
//		Если Объект.ГруппировкаЗатрат <> Перечисления.ГруппировкиЗатратВЗаказеПереработчику.БезГруппировки Тогда
//			ПриИзмененииСуммыУслуг(ЭтаФорма);
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	ЗаполнитьПодчиненныеСвойстваПоСтатистике("Валюта");
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриИзмененииКонтрагентаСервер()
//	
//	УстановитьВидимостьДоговора();
//	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
//		ЗаполнитьДоговорПоУмолчанию();
//	КонецЕсли;
//	
//	Если ИспользоватьНаправленияДеятельности Тогда
//		НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(Объект.НаправлениеДеятельности, , Объект.Договор);
//	КонецЕсли;
//	НаправленияДеятельностиСервер.ПриИзмененииНаправленияДеятельностиСервер(ЭтаФорма);
//	Объект.ОбосабливатьПоНазначениюПродукции = Константы.ВариантОбособленияМатериаловВПереработке.Получить()
//		= Перечисления.ВариантыОбособленияМатериаловВПереработке.НазначениеПродукции;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриИзмененииОрганизацииСервер()
//	
//	УстановитьВидимостьДоговора();
//	
//	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
//		
//		ЗаполнитьДоговорПоУмолчанию();
//		
//		Если ИспользоватьНаправленияДеятельности Тогда
//			НаправленияДеятельностиСервер.ЗаполнитьНаправлениеПоУмолчанию(Объект.НаправлениеДеятельности, , Объект.Договор);
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	АктуализироватьЗакупкуПодДеятельность();
//	
//	ДенежныеСредстваСервер.ПроверитьЗаполнитьБанковскийСчетОрганизацииПоВладельцу(
//		Объект.Организация, 
//		Объект.БанковскийСчет, 
//		Объект.ФормаОплаты, 
//		Объект.НаправлениеДеятельности);
//	
//	ДенежныеСредстваСервер.ПроверитьЗаполнитьКассуОрганизацииПоВладельцу(
//		Объект.Организация, 
//		Объект.Касса, 
//		Объект.ФормаОплаты, 
//		Объект.НаправлениеДеятельности);
//	
//	ЗаполнитьПодчиненныеСвойстваПоСтатистике("Организация");
//	
//	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);
//	НаправленияДеятельностиСервер.ПриИзмененииНаправленияДеятельностиСервер(ЭтаФорма);
//	Объект.ОбосабливатьПоНазначениюПродукции = Константы.ВариантОбособленияМатериаловВПереработке.Получить()
//		= Перечисления.ВариантыОбособленияМатериаловВПереработке.НазначениеПродукции;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриИзмененииПоступлениеОднойДатойСервер()
//	
//	// Вычислим максимальную дату поступления и приведем к ней ТЧ
//	Если Объект.ПоступлениеОднойДатой Тогда
//		
//		Объект.ДатаПоступления = МаксимальнаяДатаПоступления();
//		
//		ЗаполнитьДатыПоступленияСервер(Объект.ДатаПоступления);
//		
//	КонецЕсли;
//	
//	УстановитьВидимостьЭлементовФормыДатПоступления();
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПриИзмененииДатыСервер()
//	
//	ПартионныйУчетВерсии22 = РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22(Объект.Дата);
//	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);
//	
//	ПодготовитьЗаполнитьУстановитьВидимостьСерий();
//	УстановитьВидимостьЭлементовПоВерсииПартионногоУчета();
//	
//	АктуализироватьЗакупкуПодДеятельность();
//	
//КонецПроцедуры

//&НаСервере
//Процедура НаправлениеДеятельностиПриИзмененииСервер()
//	
//	Если Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
//		
//		ЗаполнитьДоговорПоУмолчанию();
//		
//	КонецЕсли;
//	НаправленияДеятельностиСервер.ПриИзмененииНаправленияДеятельностиСервер(ЭтаФорма);
//	Объект.ОбосабливатьПоНазначениюПродукции = Константы.ВариантОбособленияМатериаловВПереработке.Получить()
//		= Перечисления.ВариантыОбособленияМатериаловВПереработке.НазначениеПродукции;
//	
//	АктуализироватьЗакупкуПодДеятельность();
//	
//КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//Функция КоличествоУслуг(Количество, ГруппировкаЗатрат)
//	
//	Если ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.БезГруппировки") Тогда
//		Возврат 0;
//	Иначе
//		Возврат Количество;
//	КонецЕсли;
//	
//КонецФункции

//&НаКлиенте
//Процедура ПриИзмененииСписатьНаРасходы(ИмяТаблицы)
//	
//	ТекущиеДанные = Элементы[ИмяТаблицы].ТекущиеДанные;
//	
//	Если ТекущиеДанные.СписатьНаРасходы
//	   И ТекущиеДанные.ТипНоменклатуры <> ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа") Тогда
//		ТекущиеДанные.СписатьНаРасходы = Ложь;   	
//	КонецЕсли;   
//	
//	Если ТекущиеДанные.СписатьНаРасходы Тогда
//		ТекущиеДанные.Назначение               = Неопределено;
//	Иначе
//		
//		ТекущиеДанные.СтатьяРасходов           = ПредопределенноеЗначение("ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка");
//		ТекущиеДанные.АналитикаРасходов        = Неопределено;
//		ТекущиеДанные.АналитикаАктивовПассивов = Неопределено;
//		
//		ДоходыИРасходыКлиентСервер.ЗаполнитьТипСтатьиВСтрокеТЧ(ТекущиеДанные, "СтатьяРасходов");
//											   
//	КонецЕсли;
//	
//	ОграничениеТипаПолучателя(ТекущиеДанные, ИмяТаблицы + "Получатель", Истина);
//	
//КонецПроцедуры	

//#КонецОбласти

//#Область Ценообразование

//&НаСервере
//Функция ЗаполнитьЦеныПоВидуЦенСервер(ВидЦен, ИмяТЧ, ПоВыделеннымСтрокам)
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
//	
//	ПараметрыЗаполнения = Новый Структура;
//	ПараметрыЗаполнения.Вставить("Дата",    Объект.Дата);
//	ПараметрыЗаполнения.Вставить("Валюта",  Объект.Валюта);
//	ПараметрыЗаполнения.Вставить("ВидЦены", ВидЦен);
//	ПараметрыЗаполнения.Вставить("ПоляЗаполнения", "Цена, ВидЦены");
//	
//	Если ПоВыделеннымСтрокам Тогда
//		
//		МассивСтрок = Новый Массив;
//		Для Каждого Строка Из Элементы[ИмяТЧ].ВыделенныеСтроки Цикл
//			МассивСтрок.Добавить(Объект[ИмяТЧ].НайтиПоИдентификатору(Строка));
//		КонецЦикла;
//		
//	Иначе
//		
//		МассивСтрок = Неопределено;
//		
//	КонецЕсли;
//	
//	ЦеныРассчитаны = ПродажиСервер.ЗаполнитьЦены(
//		Объект[ИмяТЧ],
//		МассивСтрок,
//		ПараметрыЗаполнения,
//		СтруктураДействий);
//	
//	Если ИмяТЧ = "Материалы" Тогда
//		СтруктураЗависимыхРеквизитов = ЗависимыеРеквизитыМатериалы();
//		ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект[ИмяТЧ], СтруктураЗависимыхРеквизитов);
//	ИначеЕсли ИмяТЧ = "ВозвратныеОтходы" Тогда
//		СтруктураЗависимыхРеквизитов = ЗависимыеРеквизитыВозвратныеОтходы();
//		ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект[ИмяТЧ], СтруктураЗависимыхРеквизитов);
//	КонецЕсли;
//	
//	Если ИмяТЧ = "Материалы" Тогда
//		РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	КонецЕсли;
//	
//	Возврат ЦеныРассчитаны;
//	
//КонецФункции

//#КонецОбласти

//#Область ПодборыИОбработкаПроверкиКоличества

//&НаКлиенте
//Процедура ПодобратьТовар(ИмяТЧ)
//	
//	Отказ = Ложь;
//	
//	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
//		ОчиститьСообщения();
//		СообщитьОбОшибкахОткрытияПодбора(Отказ);
//	КонецЕсли;
//	
//	Если Отказ Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ПараметрЗаголовок = НСтр("ru = 'Подбор товаров в %Документ%'");
//	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
//		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", Объект.Ссылка);
//	Иначе
//		ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Документ%", НСтр("ru = 'заказ переработчику'"));
//	КонецЕсли;
//	
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("Заголовок",               ПараметрЗаголовок);
//	ПараметрыФормы.Вставить("СкрыватьРучныеСкидки",    Истина);
//	ПараметрыФормы.Вставить("ЦенаВключаетНДС",         Ложь);
//	ПараметрыФормы.Вставить("Валюта",                  Объект.Валюта);
//	ПараметрыФормы.Вставить("Дата",                    Объект.Дата);
//	ПараметрыФормы.Вставить("Документ",                Объект.Ссылка);
//	ПараметрыФормы.Вставить("РежимПодбораИспользоватьСкладыВТабличнойЧасти", Истина);
//	
//	Если ИмяТЧ = "Материалы" 
//		ИЛИ ИмяТЧ = "РедактированиеЭтаповОбеспечениеМатериаламиИРаботами" Тогда
//		
//		ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре(Ложь));
//		ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров", Истина);
//		ПараметрыФормы.Вставить("ИспользоватьДатыОтгрузки", Истина);
//		ПараметрыФормы.Вставить("ПараметрыУказанияСерий", ПараметрыУказанияСерий);
//		ПараметрыФормы.Вставить("Назначение",         Объект.Назначение);
//		ПараметрыФормы.Вставить("Подразделение",      Объект.Подразделение);
//		ПараметрыФормы.Вставить("ПодборВариантовОбеспечения", Истина);
//		ПараметрыФормы.Вставить("ОстаткиПоВсемСкладам", Истина);
//		
//		ФормаПодбораТоваров = "Обработка.ПодборТоваровВДокументПродажи.Форма";
//		
//		ОткрытьФорму(ФормаПодбораТоваров, ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
//		
//	Иначе
//		
//		ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры", 
//			?(Не ИспользоватьУправлениеПроизводством2_2
//			  Или Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЗаказамНаПроизводство"), 
//			  НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре(Ложь), НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТареРаботе(Ложь)));
//		
//		Если ИмяТЧ = "Продукция" Тогда
//			ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров", Истина);
//		КонецЕсли;
//		
//		ФормаПодбораТоваров = "Обработка.ПодборТоваровВДокументЗакупки.Форма";
//		
//		ОткрытьФорму(ФормаПодбораТоваров, ПараметрыФормы, Элементы[ИмяТЧ], УникальныйИдентификатор);
//		
//	КонецЕсли;
//		
//КонецПроцедуры

//&НаКлиенте
//Процедура СообщитьОбОшибкахОткрытияПодбора(Отказ)
//	
//	Если Не ЗначениеЗаполнено(Объект.Валюта) Тогда
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Поле ""Валюта"" не заполнено'"), Объект.Ссылка, "Объект.Валюта",,Отказ);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение, ИмяТЧ)
//	
//	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
//	
//	ТаблицаДокумента = ТабличнаяЧастьПоИмени(ИмяТЧ, ЭтаФорма);
//	
//	Если ИмяТЧ = "Продукция" Тогда
//		СписокСвойств = "Номенклатура, Характеристика, Упаковка, КоличествоУпаковок";
//	ИначеЕсли ИмяТЧ = "ВозвратныеОтходы" Тогда
//		СписокСвойств = "Номенклатура, Характеристика, Упаковка, Цена, КоличествоУпаковок";
//	ИначеЕсли ИмяТЧ = "Материалы" Тогда
//		СписокСвойств = "Номенклатура, Характеристика, Упаковка, Склад, Цена, КоличествоУпаковок, ВидЦены, СрокПоставки, ВариантОбеспечения, Серия, ДатаОтгрузки";
//	ИначеЕсли ИмяТЧ = "РедактированиеЭтаповВыходныеИзделия" Тогда
//		СписокСвойств = "Номенклатура, Характеристика, Упаковка, КоличествоУпаковок";
//	ИначеЕсли ИмяТЧ = "РедактированиеЭтаповПобочныеИзделия" Тогда
//		СписокСвойств = "Номенклатура, Характеристика, Упаковка, Цена, КоличествоУпаковок";
//	ИначеЕсли ИмяТЧ = "РедактированиеЭтаповОбеспечениеМатериаламиИРаботами" Тогда
//		СписокСвойств = "Номенклатура, Характеристика, Упаковка, Склад, КоличествоУпаковок, ВариантОбеспечения, Серия, ДатаОтгрузки";
//	КонецЕсли;
//	
//	ВыделенныеСтроки = Новый Массив;
//	
//	Для каждого СтрокаТовара Из ТаблицаТоваров Цикл
//		
//		ТекущаяСтрока = ТаблицаДокумента.Добавить();
//		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара, СписокСвойств);
//		
//		СтруктураДействий = Новый Структура;
//		ДобавитьВСтруктуруДействияПоОбновлениюВспомРевизитовСтроки(СтруктураДействий);
//		
//		Если ИмяТЧ = "Продукция" 
//		 Или ИмяТЧ = "ВозвратныеОтходы"
//		 Или ИмяТЧ = "РедактированиеЭтаповВыходныеИзделия"
//		 Или ИмяТЧ = "РедактированиеЭтаповПобочныеИзделия" Тогда
//			
//			ДоходыИРасходыКлиентСервер.ИнициализироватьПустоеЗначениеСтатьиВСтрокеТЧ(ТекущаяСтрока, "СтатьяРасходов");
//			ДоходыИРасходыКлиентСервер.ЗаполнитьТипСтатьиВСтрокеТЧ(ТекущаяСтрока, "СтатьяРасходов");
//			
//		Иначе
//			ДобавитьДействиеПроверитьЗаполнитьСклад(ИмяТЧ, ЭтаФорма, СтруктураДействий);	
//		КонецЕсли;	
//		
//		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ИмяТЧ, СтруктураДействий);
//		
//		Если ИмяТЧ = "Материалы" Тогда
//			
//			Если Объект.НеОтгружатьЧастями Тогда
//				ТекущаяСтрока.ДатаОтгрузки = Объект.ДатаОтгрузки;
//			КонецЕсли;
//			
//			СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
//			Если Не ЗначениеЗаполнено(СтрокаТовара.ВариантОбеспечения) Тогда
//				СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечение", Новый Структура("ЗаполнитьОбособленно", Ложь));
//				СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
//					Новый Структура("ЕстьРаботы, ЕстьОтменено, ДоступноОбеспечение", Ложь, Истина, ДоступноОбеспечение(ЭтаФорма)));
//			КонецЕсли;
//			
//		ИначеЕсли ИмяТЧ = "ВозвратныеОтходы" Тогда
//			
//			СтруктураДействий.Вставить("ПересчитатьСумму", "КоличествоУпаковок");
//			
//		ИначеЕсли ИмяТЧ = "Продукция" Тогда
//			
//			Если Объект.ПоступлениеОднойДатой Тогда
//				ТекущаяСтрока.ДатаПоступления = Объект.ДатаПоступления;
//			КонецЕсли;
//			
//			СтруктураДействий.Вставить("ПроверитьЗаполнитьДолюСтоимости", ПараметрыРаспределенияЗатрат);
//			
//			ВыделенныеСтроки.Добавить(ТекущаяСтрока.ПолучитьИдентификатор());
//			ПродукцияСтрокаЗаполнитьСпецификацию(ТекущаяСтрока);
//			ЗаполнитьНомерГруппыЗатратВСтрокеПродукции(ТекущаяСтрока, Объект);
//			
//		ИначеЕсли ИмяТЧ = "РедактированиеЭтаповОбеспечениеМатериаламиИРаботами" Тогда
//			
//			Если РедактированиеЭтапов.НеОтгружатьЧастями Тогда
//				ТекущаяСтрока.ДатаОтгрузки = РедактированиеЭтапов.ДатаОтгрузки;
//			КонецЕсли;
//			
//		КонецЕсли;
//		
//		
//		КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
//		
//		Если ИмяТЧ = "ВозвратныеОтходы" Или ИмяТЧ = "Продукция" Тогда
//			НаправленияДеятельностиКлиентСервер.СтруктураДействийВставитьПриДобавленииСтроки(ЭтаФорма, СтруктураДействий);
//		КонецЕсли;
//		
//		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//		
//		Если ИмяТЧ = "Продукция" 
//		 Или ИмяТЧ = "ВозвратныеОтходы" 
//		 Или ИмяТЧ = "РедактированиеЭтаповВыходныеИзделия" 
//		 Или ИмяТЧ = "РедактированиеЭтаповПобочныеИзделия" Тогда
//		 
//			ТекущаяСтрока.Получатель = ?(ТекущаяСтрока.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Работа, 
//										 ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка"), 
//										 ?(ЗначениеЗаполнено(СтрокаТовара.Склад), СтрокаТовара.Склад, СкладПоУмолчанию));
//				
//		КонецЕсли;	
//		
//	КонецЦикла;
//	
//	Если ИмяТЧ = "Материалы" Тогда
//		Если Объект.НеОтгружатьЧастями И ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения Тогда
//			Объект.ДатаОтгрузки = Макс(ВыбранноеЗначение.МаксимальнаяДатаОтгрузки, Объект.ДатаОтгрузки, НачалоДня(ТекущаяДатаСеанса()));
//			ОбеспечениеСервер.ЗаполнитьРеквизитВКоллекции(Объект.Материалы, "ДатаОтгрузки", Объект.ДатаОтгрузки);
//		КонецЕсли;
//		
//		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
//	КонецЕсли;
//	
//	Если ИмяТЧ = "РедактированиеЭтаповОбеспечениеМатериаламиИРаботами" Тогда
//		Если РедактированиеЭтапов.НеОтгружатьЧастями И ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения Тогда
//			РедактированиеЭтапов.ДатаОтгрузки = Макс(ВыбранноеЗначение.МаксимальнаяДатаОтгрузки, РедактированиеЭтапов.ДатаОтгрузки, НачалоДня(ТекущаяДатаСеанса()));
//			ОбеспечениеСервер.ЗаполнитьРеквизитВКоллекции(РедактированиеЭтапов.ОбеспечениеМатериаламиИРаботами, "ДатаОтгрузки", РедактированиеЭтапов.ДатаОтгрузки);
//		КонецЕсли;
//	КонецЕсли;
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	Если ИмяТЧ = "Продукция" ИЛИ ИмяТЧ = "ВозвратныеОтходы" Тогда
//		МногооборотнаяТараСервер.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);
//	КонецЕсли;
//	
//	Если ИмяТЧ = "Продукция" Тогда
//		
//		ЗаполнитьУслугиПоПродукции(Объект);
//		ЗаполнитьВозвратныеОтходыИМатериалыНаСервере(ВыделенныеСтроки);
//		ПриИзмененииСуммыУслуг(ЭтаФорма);
//		
//	КонецЕсли;
//	
//	ПослеИзмененияСтрокТЧПрограммноНаСервере(ИмяТЧ,, СтруктураДействий);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение, ИмяТЧ)
//	
//	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения И ИмяТЧ = "Материалы" Тогда
//		
//		ЗначенияРеквизитов = ОбеспечениеКлиентСервер.ЗначенияРеквизитовДокументаДляВопросаОбОтгрузкеОднойДатой();
//		ЗначенияРеквизитов.ДатаОтгрузки         = Объект.ДатаОтгрузки;
//		ЗначенияРеквизитов.ЖелаемаяДатаОтгрузки = Объект.ЖелаемаяДатаОтгрузки;
//		ЗначенияРеквизитов.НеОтгружатьЧастями   = Объект.НеОтгружатьЧастями;
//		
//		ОбеспечениеКлиент.ПоказатьВопросОбОтгрузкеОднойДатой(
//			ЭтаФорма,
//			ЗначенияРеквизитов,
//			ВыбранноеЗначение,
//			"ОбработкаВыбораПодборНаКлиентеПослеВопросаМатериалы",
//			Объект.Материалы.Количество() > 0);
//			
//	ИначеЕсли ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения И ИмяТЧ = "РедактированиеЭтаповОбеспечениеМатериаламиИРаботами" Тогда
//		
//		ЗначенияРеквизитов = ОбеспечениеКлиентСервер.ЗначенияРеквизитовДокументаДляВопросаОбОтгрузкеОднойДатой();
//		ЗначенияРеквизитов.ДатаОтгрузки         = РедактированиеЭтапов.ДатаОтгрузки;
//		ЗначенияРеквизитов.ЖелаемаяДатаОтгрузки = РедактированиеЭтапов.ЖелаемаяДатаОтгрузки;
//		ЗначенияРеквизитов.НеОтгружатьЧастями   = РедактированиеЭтапов.НеОтгружатьЧастями;
//		
//		ОбеспечениеКлиент.ПоказатьВопросОбОтгрузкеОднойДатой(
//			ЭтаФорма,
//			ЗначенияРеквизитов,
//			ВыбранноеЗначение,
//			"ОбработкаВыбораПодборНаКлиентеПослеВопросаРедактированиеЭтаповОбеспечениеМатериаламиИРаботами",
//			РедактированиеЭтапов.ОбеспечениеМатериаламиИРаботами.Количество() > 0);
//			
//	Иначе
//		
//		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение, ИмяТЧ);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаВыбораПодборНаКлиентеПослеВопросаМатериалы(Ответ, ДополнительныеПараметры) Экспорт
//	
//	Если Ответ = КодВозвратаДиалога.Да Тогда
//		Объект.НеОтгружатьЧастями = Ложь;
//		УстановитьВидимостьЭлементовФормыДатОтгрузки();
//	КонецЕсли;
//	
//	ОбработкаВыбораПодборНаСервере(ДополнительныеПараметры, "Материалы");
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаВыбораПодборНаКлиентеПослеВопросаРедактированиеЭтаповОбеспечениеМатериаламиИРаботами(Ответ, ДополнительныеПараметры) Экспорт
//	
//	Если Ответ = КодВозвратаДиалога.Да Тогда
//		РедактированиеЭтапов.НеОтгружатьЧастями = Ложь;
//		УстановитьВидимостьЭлементовФормыДатОтгрузки();
//	КонецЕсли;
//	
//	ОбработкаВыбораПодборНаСервере(ДополнительныеПараметры, "РедактированиеЭтаповОбеспечениеМатериаламиИРаботами");
//	
//КонецПроцедуры

//#КонецОбласти

//#Область ШтрихкодыИТорговоеОборудование

//&НаКлиенте
//Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов, ИмяТабличнойЧасти)
//	
//	Если ИмяТабличнойЧасти = "Материалы" Тогда
//		
//		СтруктураДействийСДобавленнымиСтроками = Новый Структура;
//		СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьВидЦены", Новый Структура("ВидЦены", Объект.ВидЦены));
//		СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
//		СтруктураДействийСДобавленнымиСтроками.Вставить("ПроверитьЗаполнитьОбеспечение", Новый Структура("ЗаполнитьОбособленно", Ложь));
//		СтруктураДействийСДобавленнымиСтроками.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
//			Новый Структура("ЕстьРаботы, ЕстьОтменено, ДоступноОбеспечение", Ложь, Истина, ДоступноОбеспечение(ЭтаФорма)));
//		
//		ДобавитьДействиеПроверитьЗаполнитьСклад(ИмяТабличнойЧасти, ЭтаФорма, СтруктураДействийСДобавленнымиСтроками);
//		
//		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ИмяТабличнойЧасти, СтруктураДействийСДобавленнымиСтроками);
//		ДобавитьВСтруктуруДействияПоОбновлениюВспомРевизитовСтроки(СтруктураДействийСДобавленнымиСтроками);
//		
//		СтруктураДействийСИзмененнымиСтроками = Новый Структура;
//		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ИмяТабличнойЧасти, СтруктураДействийСИзмененнымиСтроками);
//		
//		СтруктураДействий = ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов();
//		СтруктураДействий.Штрихкоды                              = ДанныеШтрихкодов;
//		СтруктураДействий.СтруктураДействийСДобавленнымиСтроками = СтруктураДействийСДобавленнымиСтроками;
//		СтруктураДействий.СтруктураДействийСИзмененнымиСтроками  = СтруктураДействийСИзмененнымиСтроками;
//		СтруктураДействий.ПараметрыУказанияСерий                 = ПараметрыУказанияСерий;
//		СтруктураДействий.ИмяТЧ                                  = ИмяТабличнойЧасти;
//		СтруктураДействий.ИзменятьКоличество                     = Истина;
//		СтруктураДействий.ТолькоТовары                           = Истина;
//		
//		ОбработатьШтрихкодыСервер(СтруктураДействий, КэшированныеЗначения);
//		ОбеспечениеКлиент.ЗаполнитьСлужебныеРеквизиты(Объект.Материалы, ДатаОтгрузкиОбязательна);
//		ШтрихкодированиеНоменклатурыКлиент.ОбработатьНеизвестныеШтрихкоды(СтруктураДействий,КэшированныеЗначения, ЭтаФорма);
//		
//		Если ШтрихкодированиеНоменклатурыКлиент.НужноОткрытьФормуУказанияСерийПослеОбработкиШтрихкодов(СтруктураДействий) Тогда
//			
//			ТекущиеДанныеИдентификатор = СтруктураДействий.МассивСтрокССериями[0];
//			ПодключитьОбработчикОжидания("ОткрытьПодборСерийПриСканированииШтрихкодаНоменклатуры", 0.1, Истина);
//			
//		КонецЕсли;
//		
//		РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//		
//		Если СтруктураДействий.ТекущаяСтрока <> Неопределено Тогда
//			Элементы.Материалы.ТекущаяСтрока = СтруктураДействий.ТекущаяСтрока;
//		КонецЕсли;
//		
//	Иначе // Продукция и возвратные отходы
//		
//		СтруктураДействийСДобавленнымиСтроками = Новый Структура;
//		СтруктураДействийСИзмененнымиСтроками = Новый Структура;
//		
//		Если ИмяТабличнойЧасти = "ВозвратныеОтходы" Тогда
//			СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьВидЦены", Новый Структура("ВидЦены", Объект.ВидЦены));
//			СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьЦенуПродажи", ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруЗаполненияЦеныВСтрокеТЧ(Объект));
//		Иначе
//			СтруктураДействийСДобавленнымиСтроками.Вставить("ПроверитьЗаполнитьДолюСтоимости", ПараметрыРаспределенияЗатрат);
//			СтруктураДействийСИзмененнымиСтроками.Вставить("ПроверитьЗаполнитьДолюСтоимости", ПараметрыРаспределенияЗатрат);
//		КонецЕсли;
//		
//		НаправленияДеятельностиКлиентСервер.СтруктураДействийВставитьПриДобавленииСтроки(ЭтаФорма, СтруктураДействийСДобавленнымиСтроками);
//		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ИмяТабличнойЧасти, СтруктураДействийСДобавленнымиСтроками);
//		ПроизводствоКлиентСервер.ДобавитьВСтруктуруДействияПроверитьЗаполнитьСкладПроизводства(Объект.Подразделение, СтруктураДействийСДобавленнымиСтроками, "Получатель");
//		
//		ДобавитьВСтруктуруДействияПоОбновлениюВспомРевизитовСтроки(СтруктураДействийСДобавленнымиСтроками);
//		
//		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ИмяТабличнойЧасти, СтруктураДействийСИзмененнымиСтроками);
//		
//		СтруктураДействий = ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов();
//		СтруктураДействий.Штрихкоды                              = ДанныеШтрихкодов;
//		СтруктураДействий.СтруктураДействийСДобавленнымиСтроками = СтруктураДействийСДобавленнымиСтроками;
//		СтруктураДействий.СтруктураДействийСИзмененнымиСтроками  = СтруктураДействийСИзмененнымиСтроками;
//		СтруктураДействий.ПараметрыУказанияСерий                 = Неопределено;
//		СтруктураДействий.ИмяТЧ                                  = ИмяТабличнойЧасти;
//		СтруктураДействий.ИзменятьКоличество                     = Истина;
//		СтруктураДействий.ТолькоТоварыИРабота                    = Истина;
//		
//		ОбработатьШтрихкодыСервер(СтруктураДействий,КэшированныеЗначения);
//		ШтрихкодированиеНоменклатурыКлиент.ОбработатьНеизвестныеШтрихкоды(СтруктураДействий,КэшированныеЗначения,ЭтаФорма);
//		
//		РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//		
//		Если СтруктураДействий.ТекущаяСтрока <> Неопределено Тогда
//			
//			Элементы[ИмяТабличнойЧасти].ТекущаяСтрока = СтруктураДействий.ТекущаяСтрока;
//			
//			ТекущиеДанные = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
//			ЗаполнитьПолучателяПоУмолчанию(ТекущиеДанные);
//			
//			ДоходыИРасходыКлиентСервер.ИнициализироватьПустоеЗначениеСтатьиВСтрокеТЧ(ТекущиеДанные, "СтатьяРасходов");
//			ДоходыИРасходыКлиентСервер.ЗаполнитьТипСтатьиВСтрокеТЧ(ТекущиеДанные, "СтатьяРасходов");
//			
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ОбработатьШтрихкодыСервер(СтруктураПараметровДействия, КэшированныеЗначения)
//	
//	ШтрихкодированиеНоменклатурыСервер.ОбработатьШтрихкоды(ЭтаФорма, Объект, СтруктураПараметровДействия, КэшированныеЗначения);
//	
//КонецПроцедуры

//#КонецОбласти

//#Область Серии

//&НаКлиенте
//Процедура ОткрытьПодборСерийПриСканированииШтрихкодаНоменклатуры()

//	Если ТекущиеДанныеИдентификатор = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ТекущиеДанные = Объект.Материалы.НайтиПоИдентификатору(ТекущиеДанныеИдентификатор);
//	ОткрытьПодборСерий(,ТекущиеДанные);

//КонецПроцедуры

//&НаСервере
//Процедура ПодготовитьЗаполнитьУстановитьВидимостьСерий()
//	
//	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.ЗаказПереработчику));
//	
//	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОткрытьПодборСерий(Текст = "", ТекущиеДанные = Неопределено)
//	
//	Если ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения
//		И Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМатериалы Тогда
//		
//		ПараметрыФормы = ПараметрыФормыЗапросаКоличестваИСерийМатериалы();
//		
//		Если ПараметрыФормы = Неопределено Тогда
//			Возврат;
//		КонецЕсли;
//		ПараметрыФормы.Вставить("ВыборСерии", Истина);
//		
//		Если ТипЗнч(ПараметрыФормы) = Тип("Структура") Тогда
//			ОткрытьФорму(
//				"Обработка.ПодборТоваровВДокументПродажи.Форма.ЗапросКоличестваИСерий",
//				ПараметрыФормы,
//				ЭтаФорма,
//				,
//				,
//				,
//				Новый ОписаниеОповещения("ОбработатьВыборВариантаОбеспеченияМатериалы", ЭтотОбъект),
//				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//			КонецЕсли;
//			
//		Возврат;
//	КонецЕсли;
//	
//	
//	Если НоменклатураКлиент.ДляУказанияСерийНуженСерверныйВызов(ЭтаФорма,ПараметрыУказанияСерий,Текст, ТекущиеДанные)Тогда
//		ТекстИсключения = НСтр("ru = 'Ошибка при попытке указать серии - в этом документе для указания серий не нужен серверный вызов.'");
//		ВызватьИсключение ТекстИсключения;
//	КонецЕсли;
//КонецПроцедуры


//#КонецОбласти

//#Область Обеспечение


//&НаКлиенте
//Функция ПараметрыФормыЗапросаКоличестваИСерийМатериалы()
//	
//	ПараметрыПроверки = ОбеспечениеКлиентСервер.ИнициализироватьПараметрыПроверкиЗаполнения("Материалы",
//		НСтр("ru = 'Сырье и материалы для производства'"));
//	ПараметрыПроверки.Поля.Склад   = "Объект.Материалы[%1].Склад";
//	Текст = НСтр("ru = 'Не заполнена колонка ""Склад"" в строке %1 списка ""Сырье и материалы для производства""'");

//	Если Не ОбеспечениеКлиент.ПроверитьЗаполнение(
//				Объект, Объект.Материалы, Элементы.Материалы.ТекущаяСтрока, ПараметрыПроверки) Тогда
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	ПараметрыФормы = ПараметрыВыбораОбеспечения(); // получен, в том числе, параметр "АдресТаблицыПодобраноРанее".
//	
//	Если Не ТипЗнч(ПараметрыФормы) = Тип("Структура") Тогда
//		Ошибки = ОбеспечениеКлиентСервер.ОшибкиКонтроляОтгрузкиИОбеспечения(ПараметрыФормы, "Материалы",
//						НСтр("ru = 'Сырье и материалы для производства'"));
//		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
//		Возврат Неопределено;
//	КонецЕсли;
//	
//	ПараметрыФормы.Вставить("ПодборТоваров", Ложь);
//	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
//	
//	ПараметрыФормы.Вставить("Дата",                              Объект.Дата);
//	ПараметрыФормы.Вставить("Склад",                             Неопределено);
//	ПараметрыФормы.Вставить("ИспользоватьСкладыВТабличнойЧасти", Истина);
//	ПараметрыФормы.Вставить("Упаковка",                          ТекущаяСтрока.Упаковка);
//	
//	ПараметрыФормы.Вставить("ПараметрыУказанияСерий", ПараметрыУказанияСерий);
//	ПараметрыФормы.Вставить("Регистратор", Объект.Ссылка);
//	
//	// Остальные параметры получены при вызове ПараметрыВыбораОбеспечения()
//	ПараметрыФормы.Вставить("Назначение",                        ПараметрыФормы.Отбор.Назначение);
//	ПараметрыФормы.Вставить("Подразделение",                     ПараметрыФормы.Отбор.Подразделение);
//	
//	ПараметрыФормы.Вставить("Номенклатура",                      ПараметрыФормы.Отбор.Номенклатура);
//	ПараметрыФормы.Вставить("Характеристика",                    ПараметрыФормы.Отбор.Характеристика);
//	
//	ПараметрыФормы.Вставить("ТипНоменклатуры",                   ПараметрыФормы.Отбор.ТипНоменклатуры);
//	
//	ПараметрыФормы.Вставить("СкладВТЧ",                          ПараметрыФормы.Отбор.Склад);
//	ПараметрыФормы.Вставить("ВариантОбеспечения",                ПараметрыФормы.ТекущийВариант.ВариантОбеспечения);
//	ПараметрыФормы.Вставить("Количество",                        ПараметрыФормы.ТекущийВариант.Количество);
//	ПараметрыФормы.Вставить("Серия",                             ТекущаяСтрока.Серия);

//	Возврат ПараметрыФормы
//	
//КонецФункции

//&НаСервере
//Функция ПараметрыВыбораОбеспечения()

//	Материал = Объект.Материалы.НайтиПоИдентификатору(Элементы.Материалы.ТекущаяСтрока);
//	
//	ПутиКДанным = Новый Соответствие();
//	ПутиКДанным.Вставить("ДатаОтгрузкиРабот", "ДатаОтгрузки");
//	
//	Если Константы.ВариантОбособленияМатериаловВПереработке.Получить() =
//			Перечисления.ВариантыОбособленияМатериаловВПереработке.НазначениеПродукции
//		И Объект.ГруппировкаЗатрат =
//			Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции Тогда
//		
//		ОбновитьНазначениеОбеспеченияМатериалов();
//		ПутиКДанным.Вставить("Назначение", "НазначениеОбеспечения");
//		
//	КонецЕсли;
//	

//	Отбор = Новый Структура("Номенклатура, Характеристика", Материал.Номенклатура, Материал.Характеристика);
//	Таблица = Документы.ЗаказПереработчику.ТаблицаРаспоряжениеСпецификацияДляОбеспечения(Объект, Отбор);
//	ПараметрыЗаполнения = Новый Структура("СтатусКВыполнению, МенеджерРегистра, ТаблицаДляПроведения",
//		Объект.Статус <> Перечисления.СтатусыЗаказовПереработчикам.НеСогласован, РегистрыНакопления.ЗаказыКлиентов, Таблица);

//	Результат = ОбеспечениеСервер.ПараметрыВыбораОбеспечения(
//		Элементы.Материалы.ТекущаяСтрока,
//		Объект,
//		Объект.Материалы,
//		ПутиКДанным,
//		ПараметрыЗаполнения);

//	ОбеспечениеСервер.ДобавитьСвойствоАдресТаблицыПодобраноРанее(Результат, УникальныйИдентификатор);
//	
//	Возврат Результат;

//КонецФункции

//&НаСервере
//Функция ПодготовитьДанныеДляОбеспеченияЗаказа()

//	РеквизитыЗаказа = Новый Структура("ЖелаемаяДатаОтгрузки, Ссылка, НеОтгружатьЧастями, Статус, Дата, Партнер, Менеджер");
//	ЗаполнитьЗначенияСвойств(РеквизитыЗаказа, Объект);

//	Если Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства Тогда
//	Иначе
//		
//		ПутиКДанным = Новый Соответствие;
//		ПутиКДанным.Вставить("ДатаОтгрузкиРабот", "ДатаОтгрузки");
//		
//		ТаблицаТовары = ОбеспечениеСервер.СтрокиВТаблицу(
//							Объект.Материалы, Объект, ПутиКДанным);
//							
//	КонецЕсли;
//	АдресТаблицыТовары = ПоместитьВоВременноеХранилище(ТаблицаТовары);

//	ПараметрыЗаполнения = Новый Структура("СтатусКВыполнению, ИмяМенеджераРегистра",
//		Объект.Статус <> Перечисления.СтатусыЗаказовПереработчикам.НеСогласован, "ЗаказыКлиентов");

//	ПараметрыФормы = ОбеспечениеКлиентСервер.ПараметрыФормыСостояниеОбеспеченияЗаказов();
//	ПараметрыФормы.ВызовИзФормыЗаказа          = Истина;
//	ПараметрыФормы.РеквизитыЗаказа             = РеквизитыЗаказа;
//	ПараметрыФормы.АдресТаблицыТовары          = АдресТаблицыТовары;
//	ПараметрыФормы.ПараметрыВыполненияДействий = ПараметрыЗаполнения;

//	
//	Возврат ПараметрыФормы;

//КонецФункции

//&НаКлиенте
//Процедура ОбработатьВыборВариантаОбеспеченияМатериалы(СтруктураПодобранныеТовары, ДополнительныеПараметры) Экспорт
//	
//	Если Не ЗначениеЗаполнено(СтруктураПодобранныеТовары) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ЗначенияРеквизитов = ОбеспечениеКлиентСервер.ЗначенияРеквизитовДокументаДляВопросаОбОтгрузкеОднойДатой();
//	ЗначенияРеквизитов.ДатаОтгрузки         = Объект.ДатаОтгрузки;
//	ЗначенияРеквизитов.ЖелаемаяДатаОтгрузки = Объект.ЖелаемаяДатаОтгрузки;
//	ЗначенияРеквизитов.НеОтгружатьЧастями   = Объект.НеОтгружатьЧастями;
//	
//	ОбеспечениеКлиент.ПоказатьВопросОбОтгрузкеОднойДатой(
//		ЭтаФорма,
//		ЗначенияРеквизитов,
//		СтруктураПодобранныеТовары,
//		"ЗаполнитьВариантОбеспеченияПослеВопросаМатериалы",
//		Объект.Материалы.Количество() > 1);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьВариантОбеспеченияПослеВопросаМатериалы(Ответ, ДополнительныеПараметры) Экспорт
//	
//	Если Ответ = КодВозвратаДиалога.Да Тогда
//		Объект.НеОтгружатьЧастями = Ложь;
//		УстановитьВидимостьЭлементовФормыДатОтгрузки();
//	КонецЕсли;
//	
//	Оповещение = ЗаполнитьВариантОбеспечения(ДополнительныеПараметры.ПодобранныеТовары);
//	ПоказатьОповещениеПользователя(ОбеспечениеКлиентСервер.ТекстЗаполнениеОбеспечения(), , Оповещение);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработатьВыборВариантаОбеспеченияМатериалыЭтапов(СтруктураПодобранныеТовары, ДополнительныеПараметры) Экспорт
//	
//	Если Не ЗначениеЗаполнено(СтруктураПодобранныеТовары) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ЗначенияРеквизитов = ОбеспечениеКлиентСервер.ЗначенияРеквизитовДокументаДляВопросаОбОтгрузкеОднойДатой();
//	ЗначенияРеквизитов.ДатаОтгрузки         = РедактированиеЭтапов.ДатаОтгрузки;
//	ЗначенияРеквизитов.ЖелаемаяДатаОтгрузки = РедактированиеЭтапов.ЖелаемаяДатаОтгрузки;
//	ЗначенияРеквизитов.НеОтгружатьЧастями   = РедактированиеЭтапов.НеОтгружатьЧастями;
//	
//	ОбеспечениеКлиент.ПоказатьВопросОбОтгрузкеОднойДатой(
//		ЭтаФорма,
//		ЗначенияРеквизитов,
//		СтруктураПодобранныеТовары,
//		"ЗаполнитьВариантОбеспеченияПослеВопросаМатериалыЭтапов",
//		РедактированиеЭтапов.ОбеспечениеМатериаламиИРаботами.Количество() > 1);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьВариантОбеспеченияПослеВопросаМатериалыЭтапов(Ответ, ДополнительныеПараметры) Экспорт
//	
//	Если Ответ = КодВозвратаДиалога.Да Тогда
//		РедактированиеЭтапов.НеОтгружатьЧастями = Ложь;
//		УстановитьВидимостьЭлементовФормыДатОтгрузки();
//	КонецЕсли;
//	
//	Оповещение = ЗаполнитьВариантОбеспечения(ДополнительныеПараметры.ПодобранныеТовары);
//	ПоказатьОповещениеПользователя(ОбеспечениеКлиентСервер.ТекстЗаполнениеОбеспечения(), , Оповещение);
//	
//КонецПроцедуры

//&НаСервере
//Функция ЗаполнитьВариантОбеспечения(ВыбранноеЗначение)

//	ИмяТЧ = "Материалы";

//	Если Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства Тогда
//	Иначе
//		
//		Для Каждого Элемент Из ВыбранноеЗначение Цикл
//			Элемент.Вставить("Идентификатор", Элементы.Материалы.ТекущаяСтрока);
//		КонецЦикла;

//		ТекстОповещения = Документы.ЗаказПереработчику.ЗаполнитьВариантОбеспечения(
//								Объект, 
//								ЭтаФорма, 
//								"СтрокаТовары", 
//								ВыбранноеЗначение, 
//								ПараметрыУказанияСерий, 
//								ЗависимыеРеквизитыМатериалы());
//	КонецЕсли;

//	ЗаполнитьСлужебныеРеквизиты();
//	ЗаполнитьСлужебныеРеквизитыТабличныхЧастей(ИмяТЧ);
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);

//	Возврат ТекстОповещения;

//КонецФункции

//&НаСервере
//Функция ЗаполнитьОбеспечениеВУстановленномПорядке(ВыбранноеЗначение)
//	
//	ИмяТЧ = "Материалы";
//	
//	ПараметрыЗаполнения = Новый Структура("ПереченьВариантов, ИзменятьОбособление, ЗаполнятьЦелымиУпаковками", Неопределено, Истина, Ложь);
//	ЗаполнитьЗначенияСвойств(ПараметрыЗаполнения, ВыбранноеЗначение);
//	
//	Если Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства Тогда
//		
//		
//	Иначе
//		
//		Таблица = Документы.ЗаказПереработчику.ТаблицаРаспоряжениеСпецификацияДляОбеспечения(Объект);
//		ПутиКДанным = Новый Соответствие;
//		ПутиКДанным.Вставить("ДатаОтгрузкиРабот", "ДатаОтгрузки");
//		
//		Если Константы.ВариантОбособленияМатериаловВПереработке.Получить() =
//				Перечисления.ВариантыОбособленияМатериаловВПереработке.НазначениеПродукции
//			И Объект.ГруппировкаЗатрат =
//				Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции Тогда
//			
//			ОбновитьНазначениеОбеспеченияМатериалов();
//			ПутиКДанным.Вставить("Назначение", "НазначениеОбеспечения");
//			
//		КонецЕсли;
//		
//		ПараметрыДокумента = Новый Структура;
//		ПараметрыДокумента.Вставить("МенеджерРегистра", РегистрыНакопления.ЗаказыКлиентов);
//		ПараметрыДокумента.Вставить("СтатусКВыполнению", (Объект.Статус <> Перечисления.СтатусыЗаказовПереработчикам.НеСогласован));
//		ПараметрыДокумента.Вставить("ПутиКДанным", ПутиКДанным);
//		ПараметрыДокумента.Вставить("ТаблицаДляПроведения", Таблица);
//		
//		Таблица = ОбеспечениеСервер.ТаблицаЗаполнениеОбеспечения(
//			Элементы.Материалы.ВыделенныеСтроки,
//			Объект,
//			Объект.Материалы,
//			ПараметрыЗаполнения,
//			ПараметрыДокумента);


//		Если ТипЗнч(Таблица) <> Тип("ТаблицаЗначений") Тогда
//			Возврат Новый Структура("Ошибки", ОбеспечениеКлиентСервер.ОшибкиКонтроляОтгрузкиИОбеспечения(
//				Таблица, "Материалы", НСтр("ru = 'Сырье и материалы'")));
//		КонецЕсли;
//		ТекстОповещения = Документы.ЗаказПереработчику.ЗаполнитьВариантОбеспечения(
//			Объект, ЭтаФорма, "СтрокиТовары", Таблица, ПараметрыУказанияСерий, ЗависимыеРеквизитыМатериалы());
//	
//	КонецЕсли;
//	
//	ЗаполнитьСлужебныеРеквизиты();
//	ЗаполнитьСлужебныеРеквизитыТабличныхЧастей(ИмяТЧ);
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);

//	Возврат Новый Структура("Ошибки, Оповещение", Неопределено, ТекстОповещения);
//	
//КонецФункции

//&НаСервере
//Функция ЗаполнитьОбеспечениеЗаказа(ВыбранноеЗначение)

//	ИмяТЧ = "Материалы";

//	Если ВыбранноеЗначение.ОтгружатьЧастями Тогда
//		Объект.НеОтгружатьЧастями = Ложь;
//		УстановитьВидимостьЭлементовФормыДатОтгрузки();
//	КонецЕсли;

//	ТаблицаОбеспечения = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
//	
//	Если Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства Тогда
//	Иначе	
//		
//		ТекстОповещения = Документы.ЗаказПереработчику.ЗаполнитьВариантОбеспечения(
//							Объект, 
//							ЭтаФорма, 
//							"Заказ", 
//							ТаблицаОбеспечения, 
//							ПараметрыУказанияСерий, 
//							ЗависимыеРеквизитыМатериалы());
//			
//	КонецЕсли;

//	ЗаполнитьСлужебныеРеквизиты();
//	ЗаполнитьСлужебныеРеквизитыТабличныхЧастей(ИмяТЧ);
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);

//	Возврат ТекстОповещения;

//КонецФункции

//&НаКлиенте
//Процедура СоздатьКорректировкуНазначенияЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
//	
//	Ответ = РезультатВопроса;
//	Если Ответ = КодВозвратаДиалога.Нет Тогда
//		Возврат;
//	Иначе
//		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
//	КонецЕсли;
//	
//	НаличиеТоваровКОбособленномуОбеспечению = ЕстьТоварыКОбособленномуОбеспечению();
//	
//	Если НаличиеТоваровКОбособленномуОбеспечению = "ЕстьТоварыКОбособленномуОбеспечению"
//	   И Объект.Проведен И Не Модифицированность Тогда
//		
//		// Если документ записан впервые, в ОбъектыОснований находится пустая ссылка, нужно актуализировать.
//		ОбъектыОснований = Новый Массив();
//		ОбъектыОснований.Добавить(Объект.Ссылка);
//		
//		ДополнительныеПараметры.ОписаниеКоманды.Вставить("ОбъектыОснований", ОбъектыОснований);
//		
//		Если ДополнительныеПараметры.Резервирование Тогда
//			СозданиеНаОснованииУТКлиент.ОткрытьМастерРезервирования(ДополнительныеПараметры.ОписаниеКоманды);
//		Иначе
//			СозданиеНаОснованииУТКлиент.ОткрытьМастерСнятияРезерва(ДополнительныеПараметры.ОписаниеКоманды);
//		КонецЕсли;
//		
//	ИначеЕсли НаличиеТоваровКОбособленномуОбеспечению <> "ЕстьТоварыКОбособленномуОбеспечению" 
//		    И Объект.Проведен Тогда
//			
//		ОбеспечениеКлиент.СообщитьОбОтсутствииТовараКОбособленномуОбеспечению();
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//Функция ДоступноОбеспечение(Форма)

//	Возврат Форма.Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПереработчикам.НеСогласован");

//КонецФункции

//&НаСервере
//Процедура ОбновитьНазначениеОбеспеченияМатериалов()
//	
//	НазначенияГрупп = Новый Соответствие;
//	СтруктураОтбора = Новый Структура;
//	
//	Для Каждого ТекСтрока Из Объект.Материалы Цикл
//		
//		НазначениеГруппы = НазначенияГрупп[ТекСтрока.НомерГруппыЗатрат];
//		Если НазначениеГруппы = Неопределено Тогда
//			
//			СтруктураОтбора.Вставить("НомерГруппыЗатрат", ТекСтрока.НомерГруппыЗатрат);
//			
//			НайденныеСтроки = Объект.Продукция.НайтиСтроки(СтруктураОтбора);
//			Если НайденныеСтроки.Количество() = 1 Тогда
//				НазначениеГруппы = НайденныеСтроки[0].Назначение;
//				НазначенияГрупп.Вставить("ТекСтрока.НомерГруппыЗатрат", НазначениеГруппы);
//			КонецЕсли;
//			
//		КонецЕсли;
//		
//		Если Не ЗначениеЗаполнено(ТекСтрока.Назначение) Тогда
//			ТекСтрока.НазначениеОбеспечения = НазначениеГруппы;
//		Иначе
//			ТекСтрока.НазначениеОбеспечения = ТекСтрока.Назначение;
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//КонецПроцедуры

//#КонецОбласти

//#Область ДатыОтгрузки

//&НаКлиенте
//Процедура ЗаполнитьДатуОтгрузки(ИмяТЧ)

//	МассивВыделенныхСтрок = Элементы[ИмяТЧ].ВыделенныеСтроки;
//	Если МассивВыделенныхСтрок.Количество() > 0 Тогда
//		ДатаОтгрузки = Объект.ЖелаемаяДатаОтгрузки;
//		
//		ДопПараметры = Новый Структура("МассивВыделенныхСтрок,ИмяТЧ", МассивВыделенныхСтрок, ИмяТЧ);
//		Оповещение = Новый ОписаниеОповещения("ЗаполнитьДатуОтгрузкиЗавершение", ЭтотОбъект, ДопПараметры);
//		
//		ОбщегоНазначенияУТКлиент.ВвестиДатуСКонтролемПустогоЗначения(ДатаОтгрузки, НСтр("ru='Введите дату отгрузки'"), ЧастиДаты.Дата, Оповещение);
//		
//	Иначе
//		ТекстПредупреждения = НСтр("ru='В документе не выбраны строки для заполнения. Дата отгрузки не будет заполнена.'");
//		ПоказатьПредупреждение(, ТекстПредупреждения);
//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьДатуОтгрузкиЗавершение(ВыбраннаяДата, ДополнительныеПараметры) Экспорт
//	
//	Если ВыбраннаяДата <> Неопределено И ЗначениеЗаполнено(ВыбраннаяДата) Тогда
//		
//		ДатаОтгрузки = ВыбраннаяДата;
//		МассивВыделенныхСтрок = ДополнительныеПараметры.МассивВыделенныхСтрок;
//		
//		ЗаполнитьДатуОтгрузкиСервер(ДатаОтгрузки, ДополнительныеПараметры.ИмяТЧ, МассивВыделенныхСтрок);
//		ПродажиКлиент.ОповеститьОбОкончанииЗаполненияДатОтгрузки(ДатаОтгрузки, Истина);
//	
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьДатуОтгрузкиСервер(ДатаОтгрузки, ИмяТЧ, МассивВыделенныхСтрок = Неопределено)

//	ТабличнаяЧасть = ТабличнаяЧастьПоИмени(ИмяТЧ, ЭтаФорма);
//	
//	ОбеспечениеСервер.ЗаполнитьРеквизитВКоллекции(
//		ТабличнаяЧасть, 
//		"ДатаОтгрузки", 
//		ДатаОтгрузки, 
//		МассивВыделенныхСтрок);

//КонецПроцедуры

//&НаСервере
//Процедура НеОтгружатьЧастямиПриИзмененииСервер()

//	Если Объект.НеОтгружатьЧастями Тогда
//		Объект.ДатаОтгрузки = ОбеспечениеСервер.МаксимальноеЗначениеВКоллекции(Объект.Материалы, "ДатаОтгрузки", '00010101');
//		ОбеспечениеСервер.ЗаполнитьРеквизитВКоллекции(Объект.Материалы, "ДатаОтгрузки", Объект.ДатаОтгрузки);
//	КонецЕсли;

//	УстановитьВидимостьЭлементовФормыДатОтгрузки();

//КонецПроцедуры

//#КонецОбласти


//#Область ДоступностьИВидимостьЭлементовНаФорме

//&НаСервере
//Процедура УстановитьВидимостьЭлементовФормыДатПоступления()
//	
//	// Кнопка и реквизит ТЧ
//	Элементы.ПродукцияЗаполнитьДатуПоступления.Видимость = Не Объект.ПоступлениеОднойДатой;
//	Элементы.ПродукцияДатаПоступления.Видимость = Не Объект.ПоступлениеОднойДатой;
//	
//	Элементы.ВозвратныеОтходыЗаполнитьДатуПоступления.Видимость = Не Объект.ПоступлениеОднойДатой;
//	Элементы.ВозвратныеОтходыДатаПоступления.Видимость = Не Объект.ПоступлениеОднойДатой;
//	
//	// Общий реквизит формы
//	Элементы.ДатаПоступления1.Видимость = Объект.ПоступлениеОднойДатой;
//	
//КонецПроцедуры

//&НаСервере
//Процедура УстановитьВидимостьЭлементовФормыДатОтгрузки()
//		
//	// Кнопка и реквизит ТЧ
//	Элементы.МатериалыЗаполнитьДатуОтгрузки.Видимость = Не Объект.НеОтгружатьЧастями;
//	Элементы.МатериалыДатаОтгрузки.Видимость = Не Объект.НеОтгружатьЧастями;
//	
//	
//	// Общий реквизит формы и кнопка
//	Элементы.ДатаОтгрузки.Видимость = Объект.НеОтгружатьЧастями;
//	
//КонецПроцедуры

//&НаСервере
//Процедура УстановитьДоступностьЭлементовПоСтатусуСервер()
//	
//	УстановитьПодписку = Ложь;
//	
//	Если Объект.Статус = Перечисления.СтатусыЗаказовПереработчикам.НеСогласован
//		Или Объект.Статус = Перечисления.СтатусыЗаказовПереработчикам.Закрыт Тогда
//		
//		УстановитьПодписку = Ложь;
//		
//	ИначеЕсли Объект.Статус = Перечисления.СтатусыЗаказовПереработчикам.КОбеспечению
//		Или Объект.Статус = Перечисления.СтатусыЗаказовПереработчикам.КИсполнению Тогда
//		
//		УстановитьПодписку = Объект.Согласован;
//		
//	КонецЕсли;
//	
//	МассивЭлементов = Новый Массив;
//	
//	// Элементы управления шапки
//	МассивЭлементов.Добавить("Дата");
//	МассивЭлементов.Добавить("Договор");
//	МассивЭлементов.Добавить("Валюта");
//	МассивЭлементов.Добавить("Организация");
//	МассивЭлементов.Добавить("Партнер");
//	МассивЭлементов.Добавить("Контрагент");
//	
//	МассивЭлементов.Добавить("ЖелаемаяДатаПоступления");
//	МассивЭлементов.Добавить("ЖелаемаяДатаОтгрузки");
//	
//	МассивЭлементов.Добавить("НеОтгружатьЧастями");
//	МассивЭлементов.Добавить("ДатаОтгрузки");
//	МассивЭлементов.Добавить("ПоступлениеОднойДатой");
//	МассивЭлементов.Добавить("ДатаПоступления");
//	
//	МассивЭлементов.Добавить("ВернутьМногооборотнуюТару");
//	МассивЭлементов.Добавить("СрокВозвратаМногооборотнойТары");
//	
//	// Элементы управления, связанные с оплатой
//	МассивЭлементов.Добавить("БанковскийСчет");
//	
//	// Элементы управления, связанные с таблицей Возвращаемые товары
//	МассивЭлементов.Добавить("ПродукцияНоменклатура");
//	МассивЭлементов.Добавить("ПродукцияХарактеристика");
//	МассивЭлементов.Добавить("ПродукцияКоличествоУпаковок");
//	МассивЭлементов.Добавить("ПродукцияУпаковка");
//	МассивЭлементов.Добавить("ПродукцияЦена");
//	МассивЭлементов.Добавить("ПродукцияСтавкаНДС");
//	МассивЭлементов.Добавить("ПродукцияСумма");
//	
//	// Элементы управления, связанные с таблицей Заменяющие товары
//	МассивЭлементов.Добавить("МатериалыНоменклатура");
//	МассивЭлементов.Добавить("МатериалыХарактеристика");
//	МассивЭлементов.Добавить("МатериалыКоличествоУпаковок");
//	МассивЭлементов.Добавить("МатериалыУпаковка");
//	МассивЭлементов.Добавить("МатериалыВидЦены");
//	МассивЭлементов.Добавить("МатериалыЦена");
//	МассивЭлементов.Добавить("МатериалыСумма");
//	
//	МассивЭлементов.Добавить("Продукция;ПередНачаломДобавления,ПередУдалением");
//	МассивЭлементов.Добавить("Материалы;ПередНачаломДобавления,ПередУдалением");
//	
//	// Элементы управления, связанные с таблицей Возвращаемые товары
//	МассивЭлементов.Добавить("ПродукцияКонтекстноеМенюДобавить");
//	МассивЭлементов.Добавить("ПродукцияКонтекстноеМенюСкопировать");
//	МассивЭлементов.Добавить("ПродукцияКонтекстноеМенюУдалить");
//	
//	МассивЭлементов.Добавить("ПродукцияДобавить");
//	МассивЭлементов.Добавить("ПродукцияИзменить");
//	МассивЭлементов.Добавить("ПродукцияСкопировать");
//	МассивЭлементов.Добавить("ПродукцияУдалить");
//	
//	МассивЭлементов.Добавить("ПродукцияЗаполнитьПоСпецификации");
//	МассивЭлементов.Добавить("ПродукцияЗаполнитьДатуПоступления");
//	
//	МассивЭлементов.Добавить("ПродукцияОткрытьПодбор");
//	МассивЭлементов.Добавить("ПродукцияПоискПоШтрихкоду");
//	МассивЭлементов.Добавить("ПродукцияЗагрузитьДанныеИзТСД");
//	
//	// Элементы управления, связанные с таблицей Заменяющие товары
//	МассивЭлементов.Добавить("МатериалыКонтекстноеМенюДобавить");
//	МассивЭлементов.Добавить("МатериалыКонтекстноеМенюСкопировать");
//	МассивЭлементов.Добавить("МатериалыКонтекстноеМенюУдалить");
//	
//	МассивЭлементов.Добавить("МатериалыДобавить");
//	МассивЭлементов.Добавить("МатериалыИзменить");
//	МассивЭлементов.Добавить("МатериалыСкопировать");
//	МассивЭлементов.Добавить("МатериалыУдалить");
//	
//	МассивЭлементов.Добавить("МатериалыЗаполнитьПоСпецификации");
//	МассивЭлементов.Добавить("МатериалыЗаполнитьЦеныПоВидуЦен");
//	МассивЭлементов.Добавить("МатериалыЗаполнитьДатуОтгрузки");
//	МассивЭлементов.Добавить("МатериалыЗаполнитьСклад");
//	МассивЭлементов.Добавить("МатериалыДополнитьМногооборотнойТарой");
//	
//	МассивЭлементов.Добавить("МатериалыОткрытьПодбор");
//	МассивЭлементов.Добавить("МатериалыПоискПоШтрихкоду");
//	МассивЭлементов.Добавить("МатериалыЗагрузитьДанныеИзТСД");
//	
//	ОбщегоНазначенияУТ.УстановитьПодпискуНаСобытияИзмененияЭлементовФормы(ЭтаФорма, МассивЭлементов, УстановитьПодписку);
//	
//КонецПроцедуры

//&НаСервере
//Процедура УстановитьВидимостьВидаЦен()
//	
//	ДоступныеВидыЦен = ОпределитьДоступныеВидыЦен();
//	
//	Если ДоступныеВидыЦен = Неопределено Тогда // ФО Несколько видов цен включена.
//		
//		Элементы.ВидЦены.Видимость                     = Истина;
//		Элементы.ЗаполнятьВидыЦенПоУмолчанию.Видимость = Ложь;
//		
//	ИначеЕсли ДоступныеВидыЦен.Количество() > 1 Тогда // ФО Несколько видов цен выключена, видов цен - больше одного.
//		
//		Элементы.ВидЦены.Видимость                     = Ложь;
//		Элементы.ЗаполнятьВидыЦенПоУмолчанию.Видимость = Истина;
//		
//	ИначеЕсли ДоступныеВидыЦен.Количество() = 1 Тогда // ФО Несколько видов цен выключена, вид цены - один.
//		
//		Элементы.ВидЦены.Видимость                     = Ложь;
//		Элементы.ЗаполнятьВидыЦенПоУмолчанию.Видимость = Истина;
//		
//	Иначе // ФО Несколько видов цен выключена, видов цен в базе нет.
//		
//		Элементы.ВидЦены.Видимость                     = Ложь;
//		Элементы.ЗаполнятьВидыЦенПоУмолчанию.Видимость = Ложь;
//		
//	КонецЕсли;
//	
//	Если ДоступныеВидыЦен <> Неопределено И ДоступныеВидыЦен.Количество() = 0 Тогда
//		Объект.ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ОпределитьДоступныеВидыЦен()
//	
//	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВидовЦен") Тогда
//		СтруктураОтбора = Новый Структура("ПометкаУдаления, ЦенаВключаетНДС", Ложь, Ложь);
//		Возврат Справочники.ВидыЦен.ДоступныеВидыЦен(СтруктураОтбора);
//	Иначе
//		Возврат Неопределено;
//	КонецЕсли;
//	
//КонецФункции

//&НаСервере
//Процедура УстановитьВидимостьДоговора()
//	
//	ВидимостьДоговора = Ложь;
//	
//	ПараметрыОбъекта = Новый Структура("Партнер, Контрагент, Организация, Соглашение, Договор");
//	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
//	
//	ЗакупкиСервер.УстановитьДоступностьДоговора(
//		ПараметрыОбъекта,
//		Элементы.Договор.Доступность,
//		ВидимостьДоговора,
//		Объект.Договор);
//	
//	Элементы.Договор.Видимость = ВидимостьДоговора;
//	
//КонецПроцедуры

//&НаСервере
//Процедура УстановитьВидимостьОбеспечения()
//	
//	Элементы.МатериалыСостояниеОбеспечения.Видимость = ПравоДоступа("Просмотр", Метаданные.Обработки.СостояниеОбеспечения);
//	
//	Если Не ПравоДоступа("Добавление", Метаданные.Документы.КорректировкаНазначенияТоваров)
//		Или Не ПолучитьФункциональнуюОпцию("ИспользоватьОбособленноеОбеспечениеЗаказов") Тогда
//		Элементы.СоздатьКорректировкуНазначенияСнятиеРезерва.Видимость = Ложь;
//		Элементы.СоздатьКорректировкуНазначенияРезервирование.Видимость = Ложь;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура УстановитьВидимостьЭлементовПоВерсииПартионногоУчета()
//	
//	Элементы.ВозвратныеОтходыСтатьяКалькуляции.Видимость = ПартионныйУчетВерсии22;
//	
//КонецПроцедуры

//#КонецОбласти

//#Область Доставка

//&НаСервере
//Процедура ЗаполнитьУстановитьРеквизитыДоставкиСервер(ИмяЭлементаФормы)
//	
//	ДоставкаТоваров.ЗаполнитьРеквизитыДоставки(Элементы, ИмяЭлементаФормы, Объект);
//	
//КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//Функция ПолучитьИмяРеквизитаАдресаДоставки(Элемент)
//	
//	Если СтрНайти(Элемент.Имя, "АдресДоставкиПеревозчика") > 0 Тогда
//		ИмяРеквизитаАдреса = "АдресДоставкиПеревозчика";
//	Иначе
//		ИмяРеквизитаАдреса = "АдресДоставки";
//	КонецЕсли;
//	
//	Возврат ИмяРеквизитаАдреса;
//	
//КонецФункции

//#КонецОбласти

//#Область КонтрольНесогласованныхИзменений

//&НаКлиенте
//Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеПриИзменении(Элемент)
//	Если Элемент.Имя = "Дата" Тогда
//		ДатаПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "Договор" Тогда
//		ДоговорПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "Валюта" Тогда
//		ВалютаПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "Организация" Тогда
//		ОрганизацияПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "Партнер" Тогда
//		ПартнерПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "Контрагент" Тогда
//		КонтрагентПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "НеОтгружатьЧастями" Тогда
//		НеОтгружатьЧастямиПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "ДатаОтгрузки" Тогда
//		ДатаОтгрузкиПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "ПоступлениеОднойДатой" Тогда
//		ПоступлениеОднойДатойПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "ДатаПоступления" Тогда
//		ДатаПоступленияПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "ВернутьМногооборотнуюТару" Тогда
//		ВернутьМногооборотнуюТаруПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "ПродукцияНоменклатура" Тогда
//		ПродукцияНоменклатураПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "ПродукцияХарактеристика" Тогда
//		ПродукцияХарактеристикаПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "ПродукцияПолучатель" Тогда
//		ПродукцияПолучательПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "ПродукцияКоличествоУпаковок" Тогда
//		ПродукцияКоличествоУпаковокПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "ПродукцияУпаковка" Тогда
//		ПродукцияУпаковкаПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "ПродукцияСписатьНаРасходы" Тогда
//		ПродукцияСписатьНаРасходыПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "МатериалыНоменклатура" Тогда
//		МатериалыНоменклатураПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "МатериалыХарактеристика" Тогда
//		МатериалыХарактеристикаПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "МатериалыКоличествоУпаковок" Тогда
//		МатериалыКоличествоУпаковокПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "МатериалыУпаковка" Тогда
//		МатериалыУпаковкаПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "МатериалыВидЦены" Тогда
//		МатериалыВидЦеныПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "МатериалыЦена" Тогда
//		МатериалыЦенаПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "МатериалыСумма" Тогда
//		МатериалыСуммаПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "ПродукцияОтмененоПричиныОтменыНеИспользуются" Тогда
//		ПродукцияОтмененоПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "ПродукцияОтменено" Тогда
//		ПродукцияОтмененоПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "МатериалыСерия" Тогда
//		МатериалыСерияПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "МатериалыСклад" Тогда
//		МатериалыСкладПриИзменении(Элемент);
//	ИначеЕсли Элемент.Имя = "МатериалыОтменено" Тогда
//		МатериалыОтмененоПриИзменении(Элемент);
//	Иначе
//		ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтаФорма, Элемент);
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеКоманды(Команда)
//	Если Команда.Имя = "Продукция_Заполнить_ЗаполнитьДатуПоступления" Тогда
//		ПродукцияЗаполнитьДатуПоступления(Команда);
//	ИначеЕсли Команда.Имя = "Продукция_Заполнить_ЗаполнитьПолучателя" Тогда
//		ПродукцияЗаполнитьПолучателя(Команда);
//	ИначеЕсли Команда.Имя = "Продукция_Общее_ПодобратьТовары" Тогда
//		ПродукцияОбщееПодобратьТовары(Команда);
//	ИначеЕсли Команда.Имя = "Продукция_Общее_ПоискПоШтрихкоду" Тогда
//		ПродукцияОбщееПоискПоШтрихкоду(Команда);
//	ИначеЕсли Команда.Имя = "Продукция_Общее_ЗагрузитьДанныеИзТСД" Тогда
//		ПродукцияОбщееЗагрузитьДанныеИзТСД(Команда);
//	ИначеЕсли Команда.Имя = "Материалы_Заполнить_ЗаполнитьЦеныПоВидуЦен" Тогда
//		МатериалыЗаполнитьЦеныПоВидуЦен(Команда);
//	ИначеЕсли Команда.Имя = "Материалы_Заполнить_ЗаполнитьДатуОтгрузки" Тогда
//		МатериалыЗаполнитьДатуОтгрузки(Команда);
//	ИначеЕсли Команда.Имя = "Материалы_Заполнить_ЗаполнитьСклад" Тогда
//		МатериалыЗаполнитьСклад(Команда);
//	ИначеЕсли Команда.Имя = "Материалы_Заполнить_ДополнитьМногооборотнойТарой" Тогда
//		ДополнитьМногооборотнойТарой(Команда);
//	ИначеЕсли Команда.Имя = "Материалы_Общее_ПодобратьТовары" Тогда
//		МатериалыОбщееПодобратьТовары(Команда);
//	ИначеЕсли Команда.Имя = "Материалы_Общее_ПоискПоШтрихкоду" Тогда
//		МатериалыОбщееПоискПоШтрихкоду(Команда);
//	ИначеЕсли Команда.Имя = "Материалы_Общее_ЗагрузитьДанныеИзТСД" Тогда
//		МатериалыОбщееЗагрузитьДанныеИзТСД(Команда);
//	Иначе
//		ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтаФорма, Команда);
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеНажатие(Элемент)
//	ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтаФорма, Элемент);
//КонецПроцедуры

//&НаКлиенте
//Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередНачаломИзменения(Элемент, Отказ)
//	ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтаФорма, Элемент);
//КонецПроцедуры

//&НаКлиенте
//Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередУдалением(Элемент, Отказ)
//	Если Элемент.Имя = "Продукция" Тогда
//		ПродукцияПередУдалением(Элемент, Отказ);
//	ИначеЕсли Не Элемент.Имя = "Материалы" Тогда
//		ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтаФорма, Элемент);
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
//	Если Элемент.Имя = "Продукция" Тогда
//		ПродукцияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Неопределено);
//	Иначе
//		ОбщегоНазначенияУТКлиент.КонтрольНеСогласованныхИзмененийВызватьИсключение(ЭтаФорма, Элемент);
//	КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_ПриИзменении_УстановитьДоступностьЭлементовПоСтатусуСервер(Элемент)
//	
//	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтаФорма) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если СтруктураДействийКонтрольНеСогласованныхИзменений.ПриИзменении.Свойство(Элемент.Имя) Тогда
//		КонтрольНеСогласованныхИзмененийОбработатьСобытиеПриИзменении(Элемент);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_Нажатие_УстановитьДоступностьЭлементовПоСтатусуСервер(Элемент)
//	
//	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтаФорма) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если СтруктураДействийКонтрольНеСогласованныхИзменений.Нажатие.Свойство(Элемент.Имя) Тогда
//		КонтрольНеСогласованныхИзмененийОбработатьСобытиеНажатие(Элемент);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_Команда_УстановитьДоступностьЭлементовПоСтатусуСервер(Команда)
//	
//	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтаФорма) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если СтруктураДействийКонтрольНеСогласованныхИзменений.Команды.Свойство(Команда.Имя) Тогда
//		КонтрольНеСогласованныхИзмененийОбработатьСобытиеКоманды(Команда);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_ПередНачаломИзменения_УстановитьДоступностьЭлементовПоСтатусуСервер(Элемент, Отказ)
//	
//	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтаФорма) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если СтруктураДействийКонтрольНеСогласованныхИзменений.ПередНачаломИзменения.Свойство(Элемент.Имя) Тогда
//		КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередНачаломИзменения(Элемент, Отказ);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_ПередУдалением_УстановитьДоступностьЭлементовПоСтатусуСервер(Элемент, Отказ)
//	
//	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтаФорма) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Имя = Элемент.Имя;
//	Если СтруктураДействийКонтрольНеСогласованныхИзменений.ПередУдалением.Свойство(Имя) Тогда
//		КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередУдалением(Элемент, Отказ);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_ПередНачаломДобавления_УстановитьДоступностьЭлементовПоСтатусуСервер(Элемент, Отказ, Копирование, Родитель, Группа)
//	
//	Если ОбщегоНазначенияУТКлиент.ПриДействииСЭлементомЗависящимОтСтатуса(ЭтаФорма) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Имя = Элемент.Имя;
//	Если СтруктураДействийКонтрольНеСогласованныхИзменений.ПередНачаломДобавления.Свойство(Имя) Тогда
//		КонтрольНеСогласованныхИзмененийОбработатьСобытиеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа);
//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_ПриИзмененииРеквизитаЗависящегоОтСтатуса()
//	
//	ИзменитьДокументСервер();
//	ОбщегоНазначенияУТКлиент.ПослеИзмененияРеквизитаЗависящегоОтСтатуса(ЭтаФорма);
//	
//КонецПроцедуры

//#КонецОбласти

//#Область ГруппировкаЗатрат

//&НаСервере
//Процедура ГруппировкаЗатратПриИзмененииНаСервере()

//	Если Не ЗначениеЗаполнено(Объект.ГруппировкаЗатрат) Тогда
//		Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.БезГруппировки;
//	КонецЕсли;
//	
//	ПерепривязатьМатериалы = ГруппировкаЗатратДоИзменения = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции
//		И Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоСпецификациям;
//		
//	Если ПерепривязатьМатериалы Тогда
//		
//		// Проверка что одна и та же номенклатура не оформлена двумя строками с разными спецификациями.
//		ПродукцияКопия = Объект.Продукция.Выгрузить(, "НомерГруппыЗатрат,Спецификация");
//		ПродукцияКопия.Свернуть("НомерГруппыЗатрат,Спецификация");
//		ВсегоСтрок = ПродукцияКопия.Количество();
//		ПродукцияКопия.Свернуть("НомерГруппыЗатрат");
//		ПерепривязатьМатериалы = ВсегоСтрок = ПродукцияКопия.Количество();
//		
//	КонецЕсли;

//	Объект.ПереработкаПоЗаказу = (
//		Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЗаказамНаПроизводство
//		Или Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства);
//	
//	Если ПерепривязатьМатериалы Тогда
//		
//		ВыполнитьСменуГруппировкиЗатратСПродукцииНаСпецификации();
//		
//	ИначеЕсли Объект.ПереработкаПоЗаказу Тогда 
//		
//		// Нельзя текущие данные привязать к заказам, поэтому удалим все
//		// Пользователю нужно воспользоваться подбором из заказов.
//		Объект.Продукция.Очистить();
//		Объект.ВозвратныеОтходы.Очистить();
//		Объект.Материалы.Очистить();
//		Объект.Услуги.Очистить();
//		
//	Иначе
//		
//		// В остальных случаях пользователю нужно заново определять группировки
//		Для каждого ДанныеСтроки Из Объект.ВозвратныеОтходы Цикл
//			ДанныеСтроки.НомерГруппыЗатрат = 0;
//		КонецЦикла;
//		
//		Для каждого ДанныеСтроки Из Объект.Материалы Цикл
//			ДанныеСтроки.НомерГруппыЗатрат = 0;
//		КонецЦикла;
//		
//		Для каждого ДанныеСтроки Из Объект.Продукция Цикл
//			ДанныеСтроки.НомерГруппыЗатрат = 0;
//		КонецЦикла;
//		
//		Для каждого ДанныеСтроки Из Объект.Продукция Цикл
//			ЗаполнитьНомерГруппыЗатратВСтрокеПродукции(ДанныеСтроки, Объект);
//		КонецЦикла;
//		
//		Объект.Услуги.Очистить();
//		
//		
//		НадписьЗаголовокЗаказы = Новый ФорматированнаяСтрока("");
//		
//	КонецЕсли;
//	
//	Если Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства
//		Или Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции Тогда
//		Объект.СпособРаспределенияЗатратНаВыходныеИзделия = Перечисления.СпособыРаспределенияЗатратНаВыходныеИзделия.ПустаяСсылка();
//	ИначеЕсли Не ЗначениеЗаполнено(Объект.СпособРаспределенияЗатратНаВыходныеИзделия) Тогда
//		Объект.СпособРаспределенияЗатратНаВыходныеИзделия = Перечисления.СпособыРаспределенияЗатратНаВыходныеИзделия.ПоДолямСтоимости;
//	КонецЕсли;
//	
//	СпособРаспределенияЗатратНаВыходныеИзделияПриИзмененииНаСервере();
//	
//	ЗаполнитьУслугиПоПродукции(Объект);
//	
//	ПриИзмененииСуммыУслуг(ЭтаФорма);
//	Если Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.БезГруппировки Тогда
//		ПриИзмененииСуммыУслугиСервер();
//	Иначе
//		РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	КонецЕсли;
//	
//	ЗаполнитьПредставлениеГруппыЗатрат();
//	НастроитьФормуПоСпособуГруппировкиЗатрат();
//	
//	ГруппировкаЗатратДоИзменения = Объект.ГруппировкаЗатрат;
//	ОпределитьКоличествоВыходныхИзделий(ЭтаФорма);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ВыполнитьСменуГруппировкиЗатратСПродукцииНаСпецификации()

//	Для каждого СтрокаПродукция Из Объект.Продукция Цикл
//		СтруктураПоиска = Новый Структура("Спецификация", СтрокаПродукция.Спецификация);
//		СписокСтрок = Объект.Продукция.НайтиСтроки(СтруктураПоиска);
//		Для каждого СтрокаПродукцияСТакойжеСпецификацией Из СписокСтрок Цикл
//			Если СтрокаПродукцияСТакойжеСпецификацией.НомерГруппыЗатрат = СтрокаПродукция.НомерГруппыЗатрат Тогда
//				Продолжить;
//			КонецЕсли;
//			
//			СтруктураПоиска = Новый Структура("НомерГруппыЗатрат", СтрокаПродукцияСТакойжеСпецификацией.НомерГруппыЗатрат);
//			СписокСтрок = Объект.ВозвратныеОтходы.НайтиСтроки(СтруктураПоиска);
//			Для каждого Строкаотход Из СписокСтрок Цикл
//				Строкаотход.НомерГруппыЗатрат = СтрокаПродукция.НомерГруппыЗатрат;
//			КонецЦикла;
//			
//			СписокСтрок = Объект.Материалы.НайтиСтроки(СтруктураПоиска);
//			Для каждого СтрокаМатериал Из СписокСтрок Цикл
//				СтрокаМатериал.НомерГруппыЗатрат = СтрокаПродукция.НомерГруппыЗатрат;
//			КонецЦикла;
//			СтрокаПродукцияСТакойжеСпецификацией.НомерГруппыЗатрат = СтрокаПродукция.НомерГруппыЗатрат ;
//		КонецЦикла;
//	КонецЦикла;
//	
//КонецПроцедуры

//&НаСервере
//Процедура НастроитьФормуПоСпособуГруппировкиЗатрат()

//	// Заголовки элементов
//	#Область Заголовки
//	ЗаголовокГруппы = ПереработкаНаСторонеКлиентСервер.ЗаголовокПоляГруппыЗатрат(
//		Объект.ГруппировкаЗатрат, Объект.ОбосабливатьПоНазначениюПродукции);
//	
//	Если Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции Тогда
//		
//		ПодсказкаГруппыПродукция = НСтр("ru = 'Продукция к которой относится продукция'");
//		ПодсказкаГруппыОтходы    = НСтр("ru = 'Продукция к которой относится возвратный отход'");
//		ПодсказкаГруппыМатериалы = НСтр("ru = 'Продукция к которой относится материал'");
//		ПодсказкаГруппыУслуги    = НСтр("ru = 'Продукция к которой относится услуга'");
//		
//		ЗаголовокКомандыЗаполнитьГруппуЗатрат = НСтр("ru = 'Продукцию'");
//		
//	ИначеЕсли Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоСпецификациям Тогда
//		
//		ПодсказкаГруппыПродукция = НСтр("ru = 'Спецификация к которой относится продукция'");
//		ПодсказкаГруппыОтходы    = НСтр("ru = 'Спецификация к которой относится возвратный отход'");
//		ПодсказкаГруппыМатериалы = НСтр("ru = 'Спецификация к которой относится материал'");
//		ПодсказкаГруппыУслуги    = НСтр("ru = 'Спецификация к которой относится услуга'");
//		
//		ЗаголовокКомандыЗаполнитьГруппуЗатрат = НСтр("ru = 'Спецификацию'");
//		
//	ИначеЕсли Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЗаказамНаПроизводство Тогда
//		
//		ПодсказкаГруппыПродукция = НСтр("ru = 'Заказ (этап, спецификация) к которому относится продукция'");
//		ПодсказкаГруппыОтходы    = НСтр("ru = 'Заказ (этап, спецификация) к которому относится возвратный отход'");
//		ПодсказкаГруппыМатериалы = НСтр("ru = 'Заказ (этап, спецификация) к которому относится материал'");
//		ПодсказкаГруппыУслуги    = НСтр("ru = 'Заказ (этап, спецификация) к которому относится услуга'");
//		
//		ЗаголовокКомандыЗаполнитьГруппуЗатрат = НСтр("ru = 'Заказ (этап, спецификация)'");
//	
//	ИначеЕсли Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства Тогда
//		
//		ПодсказкаГруппыПродукция = НСтр("ru = 'Этап к которому относится продукция'");
//		ПодсказкаГруппыОтходы    = НСтр("ru = 'Этап к которому относится возвратный отход'");
//		ПодсказкаГруппыМатериалы = НСтр("ru = 'Этап к которому относится материал'");
//		ПодсказкаГруппыУслуги    = НСтр("ru = 'Этап к которому относится услуга'");
//		
//		ЗаголовокКомандыЗаполнитьГруппуЗатрат = НСтр("ru = 'Этап производства'");
//	КонецЕсли;

//	Если Объект.ГруппировкаЗатрат <> Перечисления.ГруппировкиЗатратВЗаказеПереработчику.БезГруппировки Тогда
//		Элементы.ПродукцияГруппаЗатрат.Заголовок        = ЗаголовокГруппы;
//		Элементы.ВозвратныеОтходыГруппаЗатрат.Заголовок = ЗаголовокГруппы;
//		Элементы.МатериалыГруппаЗатрат.Заголовок        = ЗаголовокГруппы;
//		Элементы.УслугиГруппаЗатрат.Заголовок           = ЗаголовокГруппы;
//		
//		Элементы.ПродукцияГруппаЗатрат.Подсказка        = ПодсказкаГруппыПродукция;
//		Элементы.ВозвратныеОтходыГруппаЗатрат.Подсказка = ПодсказкаГруппыОтходы;
//		Элементы.МатериалыГруппаЗатрат.Подсказка        = ПодсказкаГруппыМатериалы;
//		Элементы.УслугиГруппаЗатрат.Подсказка           = ПодсказкаГруппыУслуги;
//		
//		Элементы.ВозвратныеОтходыЗаполнитьГруппуЗатрат.Заголовок = ЗаголовокКомандыЗаполнитьГруппуЗатрат;
//		Элементы.МатериалыЗаполнитьГруппуЗатрат.Заголовок = ЗаголовокКомандыЗаполнитьГруппуЗатрат;
//	КонецЕсли;
//	
//	#КонецОбласти

//	// Видимость элементов
//	#Область Видимость
//	Элементы.ПродукцияГруппаЗатрат.Видимость = Объект.ПереработкаПоЗаказу;
//	
//	ПоЭтапам = (Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства);
//	Элементы.СтраницаПродукцияЭтапов.Видимость = ПоЭтапам;
//	Элементы.СтраницаМатериалыЭтапов.Видимость = ПоЭтапам;
//	Элементы.СтраницаПродукция.Видимость = НЕ ПоЭтапам;
//	Элементы.СтраницаМатериалы.Видимость = НЕ ПоЭтапам;
//	Элементы.СуммаВсегоБезНДСМатериалов.Видимость = НЕ ПоЭтапам;
//	
//	Элементы.ВозвратныеОтходыГруппаЗатрат.Видимость = (Объект.ГруппировкаЗатрат <> Перечисления.ГруппировкиЗатратВЗаказеПереработчику.БезГруппировки);
//	Элементы.МатериалыГруппаЗатрат.Видимость = (Объект.ГруппировкаЗатрат <> Перечисления.ГруппировкиЗатратВЗаказеПереработчику.БезГруппировки);
//	Элементы.ПродукцияПерезаполнить.Видимость = (Объект.ГруппировкаЗатрат <> Перечисления.ГруппировкиЗатратВЗаказеПереработчику.БезГруппировки);
//	
//	Элементы.ВозвратныеОтходыЗаполнитьГруппуЗатрат.Видимость = (Объект.ГруппировкаЗатрат <> Перечисления.ГруппировкиЗатратВЗаказеПереработчику.БезГруппировки);
//	Элементы.МатериалыЗаполнитьГруппуЗатрат.Видимость = (Объект.ГруппировкаЗатрат <> Перечисления.ГруппировкиЗатратВЗаказеПереработчику.БезГруппировки);
//	
//	Элементы.ПродукцияПодобратьПоЗаказамНаПроизводство.Видимость = Объект.ПереработкаПоЗаказу;
//	
//	Элементы.УслугиЗапланировано.Видимость = (Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЗаказамНаПроизводство);
//	
//	Элементы.ПродукцияСпецификация.Видимость = (
//		Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоСпецификациям
//		ИЛИ Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции);
//	
//	Элементы.ЗакрытьЗаказ.Видимость = Не Объект.ПереработкаПоЗаказу;
//	Элементы.НадписьЗаголовокЗаказы.Видимость = Объект.ПереработкаПоЗаказу;
//	
//	Элементы.ПродукцияОтменитьНепоставленныеСтроки.Видимость = Не Объект.ПереработкаПоЗаказу;
//	Элементы.ВозвратныеОтходыОтменитьНепоставленныеСтроки.Видимость = Не Объект.ПереработкаПоЗаказу;
//	Элементы.МатериалыОтменитьНеотработанныеСтроки.Видимость = Не Объект.ПереработкаПоЗаказу;
//	
//	ИспользоватьСтатусы = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыЗаказовПереработчикам") Или Объект.ПереработкаПоЗаказу;
//	
//	Элементы.Статус.Видимость = ИспользоватьСтатусы;
//	
//	Элементы.СпособРаспределенияЗатратНаВыходныеИзделия.Видимость =
//		Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.БезГруппировки
//		Или Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоСпецификациям
//		Или Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЗаказамНаПроизводство;
//		
//	#КонецОбласти
//	
//	// Прочее
//	#Область Прочее
//	ЕстьКнопкаОткрытия = Объект.ПереработкаПоЗаказу;
//	Элементы.ПродукцияГруппаЗатрат.КнопкаОткрытия = ЕстьКнопкаОткрытия;
//	Элементы.ВозвратныеОтходыГруппаЗатрат.КнопкаОткрытия = ЕстьКнопкаОткрытия;
//	Элементы.МатериалыГруппаЗатрат.КнопкаОткрытия = ЕстьКнопкаОткрытия;
//	Элементы.УслугиГруппаЗатрат.ГиперссылкаЯчейки = ЕстьКнопкаОткрытия;
//	
//	Если Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.БезГруппировки Тогда
//		Элементы.СтраницыУслуги.ТекущаяСтраница = Элементы.СтраницаОднаУслуга;
//	Иначе
//		Элементы.СтраницыУслуги.ТекущаяСтраница = Элементы.СтраницаНесколькоУслуг;
//	КонецЕсли;
//	
//	
//	МассивТиповВыбора = ?(Не ИспользоватьУправлениеПроизводством2_2
//						 Или Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЗаказамНаПроизводство"), 
//		НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре(Ложь), 
//		НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТареРаботе(Ложь));
//	
//	МассивПараметровВыбора = Новый Массив;
//	МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.ТипНоменклатуры", Новый ФиксированныйМассив(МассивТиповВыбора)));
//	
//	Элементы.ПродукцияНоменклатура.ПараметрыВыбора        = Новый ФиксированныйМассив(МассивПараметровВыбора);
//	Элементы.ВозвратныеОтходыНоменклатура.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
//	
//	#КонецОбласти
//	
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьПредставлениеГруппыЗатрат()

//	Если Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.БезГруппировки Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ИмяПоляГруппаЗатрат = ИмяПоляГруппаЗатрат(Объект);
//	
//	ПараметрыГруппыЗатрат = Новый Структура("Распоряжение, Спецификация,"+ИмяПоляГруппаЗатрат);
//	
//	СписокТЧ = Новый Массив;
//	СписокТЧ.Добавить(Объект.Продукция);
//	СписокТЧ.Добавить(Объект.ВозвратныеОтходы);
//	СписокТЧ.Добавить(Объект.Материалы);
//	
//	Для каждого СтрокаУслуга Из Объект.Услуги Цикл
//		
//		ЗаполнитьЗначенияСвойств(ПараметрыГруппыЗатрат, СтрокаУслуга);
//		ПредставлениеГруппы = ПереработкаНаСтороне.ПредставлениеГруппыЗатрат(
//			ПараметрыГруппыЗатрат,
//			Объект.ГруппировкаЗатрат,
//			Объект.Продукция,
//			ИмяПоляГруппаЗатрат);
//		
//		СтрокаУслуга.ГруппаЗатрат = ПредставлениеГруппы;
//		
//		Для каждого ТабличнаяЧасть Из СписокТЧ Цикл
//			Для каждого ДанныеСтроки Из ТабличнаяЧасть Цикл
//				Если ДанныеСтроки[ИмяПоляГруппаЗатрат] = СтрокаУслуга[ИмяПоляГруппаЗатрат] Тогда
//					ДанныеСтроки.ГруппаЗатрат = ПредставлениеГруппы;
//				КонецЕсли;
//			КонецЦикла;
//		КонецЦикла;
//		
//	КонецЦикла;
//	
//	// Очистка наименования группы затрат если она не указана
//	Для каждого ТабличнаяЧасть Из СписокТЧ Цикл
//		Для каждого ДанныеСтроки Из ТабличнаяЧасть Цикл
//			Если НЕ ЗначениеЗаполнено(ДанныеСтроки[ИмяПоляГруппаЗатрат]) Тогда
//				ДанныеСтроки.ГруппаЗатрат = "";
//			КонецЕсли;
//		КонецЦикла;
//	КонецЦикла;
//	
//КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//Процедура ЗаполнитьУслугиПоПродукции(Объект)
//	
//	Если Объект.ПереработкаПоЗаказу Тогда
//		// При переработке по заказам список услуг не зависит от продукции
//		Возврат;
//	КонецЕсли;
//	
//	ИмяПоляГруппаЗатрат = ИмяПоляГруппаЗатрат(Объект);
//	
//	СписокГруппЗатрат = Новый Массив;
//	
//	// Добавление услуг для групп которых нет в списке услуг
//	Для каждого СтрокаПродукция Из Объект.Продукция Цикл
//		
//		Если НЕ ЗначениеЗаполнено(СтрокаПродукция[ИмяПоляГруппаЗатрат]) Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		ПараметрыГруппыЗатрат = Новый Структура("Распоряжение,Спецификация,"+ИмяПоляГруппаЗатрат);
//		ЗаполнитьЗначенияСвойств(ПараметрыГруппыЗатрат, СтрокаПродукция);
//		СписокГруппЗатрат.Добавить(ПараметрыГруппыЗатрат);
//		
//		СтруктураПоиска = Новый Структура(ИмяПоляГруппаЗатрат, СтрокаПродукция[ИмяПоляГруппаЗатрат]);
//		СписокСтрок = Объект.Услуги.НайтиСтроки(СтруктураПоиска);
//		Если СписокСтрок.Количество() = 0 Тогда
//			СтрокаУслуга = Объект.Услуги.Добавить();
//			СтрокаУслуга[ИмяПоляГруппаЗатрат] = СтрокаПродукция[ИмяПоляГруппаЗатрат];
//			СтрокаУслуга.Спецификация = СтрокаПродукция.Спецификация;
//		КонецЕсли;
//	КонецЦикла;
//	
//	ПредставленияГруппЗатрат = ПредставленияГруппЗатрат(
//		СписокГруппЗатрат,
//		Объект.ГруппировкаЗатрат,
//		Объект.Продукция,
//		ИмяПоляГруппаЗатрат);
//	
//	Для каждого СтрокаУслуга Из Объект.Услуги Цикл
//		ГруппаЗатрат = ПредставленияГруппЗатрат.Получить(СтрокаУслуга[ИмяПоляГруппаЗатрат]);
//		Если ГруппаЗатрат <> Неопределено Тогда
//			СтрокаУслуга.ГруппаЗатрат = ГруппаЗатрат;
//		КонецЕсли;
//	КонецЦикла;
//	
//	// Удаление услуг для групп, которых нет в списке продукции
//	СтрокиУслугКУдалению = Новый Массив;
//	Для каждого СтрокаУслуга Из Объект.Услуги Цикл
//		СтруктураПоиска = Новый Структура(ИмяПоляГруппаЗатрат, СтрокаУслуга[ИмяПоляГруппаЗатрат]);
//		СписокСтрок = Объект.Продукция.НайтиСтроки(СтруктураПоиска);
//		Если СписокСтрок.Количество() = 0 Тогда
//			СтрокиУслугКУдалению.Добавить(СтрокаУслуга);
//		КонецЕсли;
//	КонецЦикла;
//	
//	Для каждого СтрокаУслуга Из СтрокиУслугКУдалению Цикл
//		СтруктураПоиска = Новый Структура(ИмяПоляГруппаЗатрат, СтрокаУслуга[ИмяПоляГруппаЗатрат]);
//		
//		СписокСтрок = Объект.ВозвратныеОтходы.НайтиСтроки(СтруктураПоиска);
//		Для каждого ДанныеСтроки Из СписокСтрок Цикл
//			Объект.ВозвратныеОтходы.Удалить(ДанныеСтроки);
//		КонецЦикла;
//		
//		СписокСтрок = Объект.Материалы.НайтиСтроки(СтруктураПоиска);
//		Для каждого ДанныеСтроки Из СписокСтрок Цикл
//			Объект.Материалы.Удалить(ДанныеСтроки);
//		КонецЦикла;
//		
//		Объект.Услуги.Удалить(СтрокаУслуга);
//	КонецЦикла;
//	
//КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ПредставленияГруппЗатрат(Знач СписокГруппЗатрат, Знач ГруппировкаЗатрат, Знач Продукция, Знач ИмяПоляГруппаЗатрат)
//	
//	Результат = Новый Соответствие;
//	
//	Для каждого ПараметрыГруппыЗатрат Из СписокГруппЗатрат Цикл
//		
//		ПредставлениеГруппыЗатрат = ПереработкаНаСтороне.ПредставлениеГруппыЗатрат(
//			ПараметрыГруппыЗатрат, 
//			ГруппировкаЗатрат, 
//			Продукция,
//			ИмяПоляГруппаЗатрат);
//		
//		Результат.Вставить(ПараметрыГруппыЗатрат[ИмяПоляГруппаЗатрат], ПредставлениеГруппыЗатрат);
//		
//	КонецЦикла;
//	
//	Возврат Результат;
//	
//КонецФункции

//&НаКлиентеНаСервереБезКонтекста
//Процедура ЗаполнитьНомерГруппыЗатратВСтрокеПродукцииПриОкончанииРедактирования(СтрокаПродукция, Объект, КешТекущейСтроки, НоваяСтрока)
//	
//	Если (Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоСпецификациям")
//			И (КешТекущейСтроки.Спецификация <> СтрокаПродукция.Спецификация))
//		Или (Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции")
//			И (КешТекущейСтроки.Номенклатура <> СтрокаПродукция.Номенклатура
//				Или КешТекущейСтроки.Характеристика <> СтрокаПродукция.Характеристика
//				Или КешТекущейСтроки.Назначение <> СтрокаПродукция.Назначение)) Тогда
//		
//		ЗаполнитьНомерГруппыЗатратВСтрокеПродукции(СтрокаПродукция, Объект);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//Процедура ЗаполнитьНомерГруппыЗатратВСтрокеПродукции(СтрокаПродукция, Объект)
//	
//	Если Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции") Тогда
//		СтруктураПоиска = Новый Структура("Номенклатура, Характеристика, Назначение");
//	ИначеЕсли Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоСпецификациям") Тогда
//		СтруктураПоиска = Новый Структура("Спецификация");
//	Иначе
//		Возврат;
//	КонецЕсли;
//	
//	СтрокаПродукция.НомерГруппыЗатрат = Объект.МаксимальныйНомерГруппыЗатрат + 1;
//	
//	ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаПродукция);
//	СписокСтрок = Объект.Продукция.НайтиСтроки(СтруктураПоиска);
//	
//	Если СписокСтрок.Количество() > 0 И СписокСтрок[0] = СтрокаПродукция Тогда
//		СписокСтрок.Удалить(0);
//	КонецЕсли;
//	
//	Если СписокСтрок.Количество() > 0 И СписокСтрок[0].НомерГруппыЗатрат <> 0 Тогда
//		СтрокаПродукция.НомерГруппыЗатрат = СписокСтрок[0].НомерГруппыЗатрат;
//	КонецЕсли;
//	
//	Если СтрокаПродукция.НомерГруппыЗатрат > Объект.МаксимальныйНомерГруппыЗатрат Тогда
//		Объект.МаксимальныйНомерГруппыЗатрат = СтрокаПродукция.НомерГруппыЗатрат;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВыбратьГруппуЗатрат(ИмяТЧ, МножественныйВыборСтрок = Ложь)

//	ТекущиеДанные = Элементы[ИмяТЧ].ТекущиеДанные;
//	
//	Если ТекущиеДанные = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ИмяПоляГруппаЗатрат = ИмяПоляГруппаЗатрат(Объект);
//	
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("ГруппировкаЗатрат", Объект.ГруппировкаЗатрат);
//	ПараметрыФормы.Вставить("Услуги", Объект.Услуги);
//	ПараметрыФормы.Вставить("НомерГруппыЗатрат", ТекущиеДанные[ИмяПоляГруппаЗатрат]);
//	ПараметрыФормы.Вставить("ИмяПоляГруппаЗатрат", ИмяПоляГруппаЗатрат);
//	ПараметрыФормы.Вставить(
//		"ЗаголовокГруппы",
//		ПереработкаНаСторонеКлиентСервер.ЗаголовокПоляГруппыЗатрат(
//			Объект.ГруппировкаЗатрат,
//			Объект.ОбосабливатьПоНазначениюПродукции));
//			
//			
//	СтруктураПараметров = Новый Структура("ИмяТЧ, МножественныйВыборСтрок", ИмяТЧ, МножественныйВыборСтрок);
//	
//	ОписаниеОповещения  = Новый ОписаниеОповещения("ВыбратьГруппуЗатратЗавершение", ЭтотОбъект, СтруктураПараметров);
//	ОткрытьФорму("Документ.ЗаказПереработчику.Форма.ВыборГруппыЗатрат", ПараметрыФормы,,,,, ОписаниеОповещения);

//КонецПроцедуры

//&НаКлиенте
//Процедура ВыбратьГруппуЗатратЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
//	
//	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(
//		Истина, "Документ.ЗаказПереработчику.Форма.ФормаДокумента.ВыбратьГруппуЗатратЗавершение");
//	
//	Если РезультатЗакрытия = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ИмяПоляГруппаЗатрат = ИмяПоляГруппаЗатрат(Объект);
//	
//	Модифицированность = Истина;
//	
//	ДанныеЭтапов = Новый Соответствие;
//	
//	ИмяТЧ                   = ДополнительныеПараметры.ИмяТЧ;
//	МножественныйВыборСтрок = ДополнительныеПараметры.МножественныйВыборСтрок;
//	
//	Если МножественныйВыборСтрок Тогда
//		ВыделенныеСтроки = Элементы[ИмяТЧ].ВыделенныеСтроки;	
//	Иначе
//		ВыделенныеСтроки = Новый Массив;
//		ВыделенныеСтроки.Добавить(Элементы[ИмяТЧ].ТекущаяСтрока);
//	КонецЕсли;	
//	
//	ТабличнаяЧасть = ТабличнаяЧастьПоИмени(ИмяТЧ, ЭтаФорма);
//	
//	Для каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
//		
//		СтруктураДействий = Новый Структура;
//		
//		ТекущиеДанные = ТабличнаяЧасть.НайтиПоИдентификатору(ИдентификаторСтроки);
//		ТекущиеДанные[ИмяПоляГруппаЗатрат] = РезультатЗакрытия[ИмяПоляГруппаЗатрат];
//		ТекущиеДанные.ГруппаЗатрат = РезультатЗакрытия.ГруппаЗатрат;
//		
//		Если ИмяТЧ = "Продукция" И Объект.ПереработкаПоЗаказу Тогда
//			
//			ТекущиеДанные.Спецификация = РезультатЗакрытия.Спецификация;
//			
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	ВыбратьГруппуЗатратЗавершениеНаСервере(ИмяТЧ);
//	
//	Если ИмяТЧ = "Продукция" Тогда
//		ТребуетсяЗаполнитьДанныеРаспоряжения = Истина;
//	Иначе
//		ТребуетсяУточнитьДанныеРаспоряжения = Истина;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ВыбратьГруппуЗатратЗавершениеНаСервере(ИмяТЧ)
//	
//	ТабличнаяЧасть = ТабличнаяЧастьПоИмени(ИмяТЧ, ЭтаФорма);
//	ТекущаяСтрока = ТабличнаяЧасть.НайтиПоИдентификатору(Элементы[ИмяТЧ].ТекущаяСтрока);
//	
//	ЗаполнитьУслугиПоПродукции(Объект);
//	ПриИзмененииСуммыУслуг(ЭтаФорма);
//	ЗаполнитьПредставлениеГруппыЗатрат();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ГруппировкаЗатратПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
//	
//	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(
//		Истина, "Документ.ЗаказПереработчику.Форма.ФормаДокумента.ГруппировкаЗатратПриИзмененииЗавершение");
//	
//	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
//		ГруппировкаЗатратПриИзмененииНаСервере();
//	Иначе
//		Объект.ГруппировкаЗатрат = ГруппировкаЗатратДоИзменения;
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПроверитьЗаполнениеГруппыЗатрат(Отказ)
//	
//	Если Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.БезГруппировки Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ШаблонСообщения = НСтр("ru = 'Не заполнена колонка ""%1"" в строке %2 списка ""%3""'");
//	ЗаголовокПоля = ПереработкаНаСторонеКлиентСервер.ЗаголовокПоляГруппыЗатрат(
//		Объект.ГруппировкаЗатрат, Объект.ОбосабливатьПоНазначениюПродукции);
//	
//	СписокТЧ = Новый СписокЗначений;
//	СписокТЧ.Добавить("Продукция", НСтр("ru = 'Продукция'"));
//	СписокТЧ.Добавить("ВозвратныеОтходы", НСтр("ru = 'Возвратные отходы'"));
//	СписокТЧ.Добавить("Материалы", НСтр("ru = 'Сырье и материалы'"));
//	
//	ИмяПоляГруппаЗатрат	= ИмяПоляГруппаЗатрат(Объект);
//	
//	Для каждого ПараметрыТЧ Из СписокТЧ Цикл
//		ТабличнаяЧасть = ТабличнаяЧастьПоИмени(ПараметрыТЧ.Значение, ЭтаФорма);
//		Если ПараметрыТЧ.Значение = "РедактированиеЭтаповВыходныеИзделия" Тогда
//			ИмяТЧ = "РедактированиеЭтапов.ВыходныеИзделия";
//		ИначеЕсли ПараметрыТЧ.Значение = "РедактированиеЭтаповПобочныеИзделия" Тогда
//			ИмяТЧ = "РедактированиеЭтапов.ПобочныеИзделия";
//		ИначеЕсли ПараметрыТЧ.Значение = "РедактированиеЭтаповОбеспечениеМатериаламиИРаботами" Тогда
//			ИмяТЧ = "РедактированиеЭтапов.ОбеспечениеМатериаламиИРаботами";
//		Иначе
//			ИмяТЧ = "Объект." + ПараметрыТЧ.Значение;
//		КонецЕсли;
//		Для каждого ДанныеСтроки Из ТабличнаяЧасть Цикл
//			
//			Если НЕ ЗначениеЗаполнено(ДанныеСтроки[ИмяПоляГруппаЗатрат]) Тогда
//				ТекстСообщения = СтрШаблон(ШаблонСообщения, ЗаголовокПоля, ДанныеСтроки.НомерСтроки, ПараметрыТЧ.Представление);
//				ПутьКТЧ = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(ИмяТЧ, ДанныеСтроки.НомерСтроки, "ГруппаЗатрат");
//				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка, ПутьКТЧ,, Отказ);
//			КонецЕсли;
//			
//		КонецЦикла;
//	КонецЦикла;

//КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//Функция ИмяПоляГруппаЗатрат(Объект)

//	Возврат ПереработкаНаСторонеКлиентСервер.ИмяПоляГруппаЗатратВЗаказеПереработчику(Объект);

//КонецФункции

//&НаСервере
//Функция НомераГруппыЗатратВыделенныхСтрок(Коллекция, ВыделенныеСтроки)
//	
//	НомераГруппыЗатрат = Новый Массив();
//	Для Каждого Идентификатор Из ВыделенныеСтроки Цикл
//		
//		Строка = Коллекция.НайтиПоИдентификатору(Идентификатор);
//		Если ЗначениеЗаполнено(Строка.НомерГруппыЗатрат) Тогда
//			НомераГруппыЗатрат.Добавить(Строка.НомерГруппыЗатрат);
//		КонецЕсли;
//		
//	КонецЦикла;
//	НомераГруппыЗатрат = ОбщегоНазначенияКлиентСервер.СвернутьМассив(НомераГруппыЗатрат);
//	Возврат НомераГруппыЗатрат;
//	
//КонецФункции

//&НаСервере
//Функция СтрокиПоНомеруГруппыЗатрат(Коллекция, НомераГруппыЗатрат)
//	
//	Строки = Новый Массив();
//	
//	Поле = "НомерГруппыЗатрат";
//	Таблица = Новый ТаблицаЗначений();
//	Таблица.Колонки.Добавить(Поле);
//	Таблица.Колонки.Добавить("Строка");
//	
//	Для Каждого Строка Из Коллекция Цикл
//		
//		Если Строка.Отменено Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		НоваяСтрока = Таблица.Добавить();
//		НоваяСтрока.Строка = Строка;
//		НоваяСтрока[Поле] = Строка[Поле];
//		
//	КонецЦикла;
//	
//	Таблица.Индексы.Добавить(Поле);
//	
//	Отбор = Новый Структура(Поле);
//	Для Каждого Значение Из НомераГруппыЗатрат Цикл
//		Отбор[Поле] = Значение;
//		НайденныеСтроки = Таблица.НайтиСтроки(Отбор);
//		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Строки, НайденныеСтроки);
//	КонецЦикла;
//	
//	Для Индекс = 0 По Строки.ВГраница() Цикл
//		Строки[Индекс] = Строки[Индекс].Строка;
//	КонецЦикла;
//	
//	Возврат Строки;
//	
//КонецФункции

//#КонецОбласти

//#Область РаботаСБуферомОбмена

//&НаСервере
//Процедура СкопироватьСтрокиНаСервере(ИмяТЧ) 
//	
//	ТабличнаяЧасть = ТабличнаяЧастьПоИмени(ИмяТЧ, ЭтаФорма);
//	КопированиеСтрокСервер.ПоместитьВыделенныеСтрокиВБуферОбмена(Элементы[ИмяТЧ].ВыделенныеСтроки, ТабличнаяЧасть);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПолучитьСтрокиИзБуфераОбмена(ИмяТЧ) 
//	
//	ПараметрыОтбора = Новый Структура();
//	ПараметрыОтбора.Вставить("ОтборПоТипуНоменклатуры", НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре());
//	
//	МассивИдентификаторовСтрок = Новый Массив;
//	
//	ТаблицаТоваров = КопированиеСтрокСервер.ПолучитьСтрокиИзБуфераОбмена(ПараметрыОтбора);
//	
//	ТабличнаяЧасть = ТабличнаяЧастьПоИмени(ИмяТЧ, ЭтаФорма);
//	
//	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
//		
//		ТекущаяСтрока = ТабличнаяЧасть.Добавить();
//		
//		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара);
//		
//		Если ИмяТЧ = "Продукция" Тогда
//			ЗаполнитьНомерГруппыЗатратВСтрокеПродукции(ТекущаяСтрока, Объект);
//			МассивИдентификаторовСтрок.Добавить(ТекущаяСтрока.ПолучитьИдентификатор());
//		КонецЕсли;
//		
//		СтруктураДействий = Новый Структура;
//		
//		Если ИмяТЧ = "Продукция" Тогда
//			Если Объект.ПоступлениеОднойДатой Тогда
//				ТекущаяСтрока.ДатаПоступления = Объект.ДатаПоступления;
//			КонецЕсли;
//		ИначеЕсли ИмяТЧ = "ВозвратныеОтходы" Тогда
//			СтруктураДействий.Вставить("ПересчитатьСумму");
//		ИначеЕсли (ИмяТЧ = "Материалы" ИЛИ ИмяТЧ = "РедактированиеЭтаповОбеспечениеМатериаламиИРаботами")
//			И Объект.НеОтгружатьЧастями Тогда
//			ТекущаяСтрока.ДатаОтгрузки = Объект.ДатаОтгрузки;
//		КонецЕсли;
//		
//		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
//		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
//		СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
//		
//		Если ИмяТЧ = "Продукция" Или ИмяТЧ = "ВозвратныеОтходы" Тогда
//			ПроизводствоКлиентСервер.ДобавитьВСтруктуруДействияПроверитьЗаполнитьСкладПроизводства(Объект.Подразделение, СтруктураДействий, "Получатель");
//		Иначе
//			ДобавитьДействиеПроверитьЗаполнитьСклад(ИмяТЧ, ЭтаФорма, СтруктураДействий);
//		КонецЕсли;	
//		
//		Если ИмяТЧ = "Материалы" Тогда
//			
//			СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечение", Новый Структура("ЗаполнитьОбособленно", Ложь));
//			СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
//				Новый Структура("ЕстьРаботы, ЕстьОтменено, ДоступноОбеспечение", Ложь, Истина, ДоступноОбеспечение(ЭтаФорма)));
//				
//		ИначеЕсли ИмяТЧ = "РедактированиеЭтаповОбеспечениеМатериаламиИРаботами" Тогда
//			
//			СтруктураДействий.Вставить("ПроверитьЗаполнитьОбеспечение", Новый Структура("ЗаполнитьОбособленно", Ложь));
//			СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
//				Новый Структура("ЕстьРаботы, ЕстьОтменено, ДоступноОбеспечение", Ложь, Ложь, ДоступноОбеспечение(ЭтаФорма)));
//				
//		ИначеЕсли ИмяТЧ = "Продукция" Тогда
//			НаправленияДеятельностиКлиентСервер.СтруктураДействийВставитьПриДобавленииСтроки(ЭтаФорма, СтруктураДействий);
//			СтруктураДействий.Вставить("ПроверитьЗаполнитьДолюСтоимости", ПараметрыРаспределенияЗатрат);
//		ИначеЕсли ИмяТЧ = "ВозвратныеОтходы" Тогда
//			НаправленияДеятельностиКлиентСервер.СтруктураДействийВставитьПриДобавленииСтроки(ЭтаФорма, СтруктураДействий);
//		КонецЕсли;
//		
//		ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ИмяТЧ, СтруктураДействий);
//		
//	
//		КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
//		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
//		
//	КонецЦикла;
//	
//	Если ИмяТЧ = "Материалы" Тогда
//		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
//	ИначеЕсли ИмяТЧ = "РедактированиеЭтаповОбеспечениеМатериаламиИРаботами" Тогда
//		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(
//			РедактированиеЭтапов, 
//			ПараметрыУказанияСерийРедактированиеЭтапов.ОбеспечениеМатериаламиИРаботами);
//	Иначе
//		МногооборотнаяТараСервер.ОбновитьСостояниеЗаполненияМногооборотнойТары(Объект.СостояниеЗаполненияМногооборотнойТары);
//	КонецЕсли;
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	ПослеИзмененияСтрокТЧПрограммноНаСервере(ИмяТЧ, МассивИдентификаторовСтрок);
//	
//КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//Процедура УстановитьДоступностьКомандБуфераОбмена(Форма, ДоступностьЭлементов)
//	
//	Форма.Элементы.МатериалыВставитьСтроки.Доступность = ДоступностьЭлементов;
//	Форма.Элементы.МатериалыКонтекстноеМенюВставитьСтроки.Доступность = ДоступностьЭлементов;
//	Форма.Элементы.ПродукцияВставитьСтроки.Доступность = ДоступностьЭлементов;
//	Форма.Элементы.ПродукцияКонтекстноеМенюВставитьСтроки.Доступность = ДоступностьЭлементов;
//	Форма.Элементы.ВозвратныеОтходыВставитьСтроки.Доступность = ДоступностьЭлементов;
//	Форма.Элементы.ВозвратныеОтходыКонтекстноеМенюВставитьСтроки.Доступность = ДоступностьЭлементов;
//	
//КонецПроцедуры

//#КонецОбласти

//#Область Прочее

//&НаСервере
//Функция ПровестиИЗакрытьНаСервере(ПараметрыЗаписи)
//	
//	РезультатЗаписи = Ложь;
//	
//	НачатьТранзакцию();
//	Попытка
//		РезультатЗаписи = Записать(ПараметрыЗаписи);
//		ЗафиксироватьТранзакцию();
//	Исключение
//		ОтменитьТранзакцию();
//		ЗаписьЖурналаРегистрации(
//			НСтр("ru = 'Проведение документа'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
//			УровеньЖурналаРегистрации.Ошибка,,,
//			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
//		Возврат Ложь;
//	КонецПопытки;
//	
//	Возврат РезультатЗаписи;
//	
//КонецФункции

//&НаКлиенте
//Процедура Подключаемый_ОбработатьЗаписьОбъекта()
//	
//	ОбщегоНазначенияУТКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыДляЗаписи);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_ЗакрытьФорму()
//	
//	Закрыть();
//	
//КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//Функция ПараметрыПересчетаСуммыНДСВТЧ(Форма)
//	
//	СтруктураПересчетаСуммы = Новый Структура("ЦенаВключаетНДС", Ложь);
//	
//	Возврат СтруктураПересчетаСуммы;
//	
//КонецФункции

//&НаСервере
//Процедура ЗаполнитьМногооборотнуюТаруИзХранилищаСервер(АдресТарыВХранилище)
//	
//	СтруктураДействийИзмененныеСтроки = Новый Структура;
//	СтруктураДействийИзмененныеСтроки.Вставить("ПересчитатьКоличествоУпаковок");
//	СтруктураДействийИзмененныеСтроки.Вставить("ПересчитатьСумму");
//	СтруктураДействийИзмененныеСтроки.Вставить("ПроверитьЗаполнитьОбеспечение", Новый Структура("ЗаполнитьОбособленно", Ложь));
//	СтруктураДействийИзмененныеСтроки.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения",
//		Новый Структура("ЕстьРаботы, ЕстьОтменено, ДоступноОбеспечение", Ложь, Истина, ДоступноОбеспечение(ЭтаФорма)));
//	
//	ДобавитьВСтруктуруДействияПоОбновлениюВспомРевизитовСтроки(СтруктураДействийИзмененныеСтроки);
//	ДобавитьДействиеПроверитьЗаполнитьСклад("Материалы", ЭтаФорма, СтруктураДействийИзмененныеСтроки);
//	
//	СтруктураДействийДобавленныеСтроки =  ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураДействийИзмененныеСтроки);
//	
//	МногооборотнаяТараСервер.ЗаполнитьМногооборотнуюТаруИзХранилища(
//		Объект,
//		АдресТарыВХранилище,
//		"Материалы",
//		"Номенклатура,Характеристика,Склад,ДатаОтгрузки",
//		СтруктураДействийИзмененныеСтроки,
//		СтруктураДействийДобавленныеСтроки);
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПродукцияНоменклатураПриИзмененииНаСервере(ИдентификаторСтроки, СтруктураДействий, КэшированныеЗначения)

//	ТекущаяСтрока = Объект.Продукция.НайтиПоИдентификатору(ИдентификаторСтроки);
//	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

//	ПродукцияСтрокаЗаполнитьСпецификацию(ТекущаяСтрока);
//	
//КонецПроцедуры

//&НаСервере
//Функция ПродукцияСтрокаЗаполнитьСпецификацию(ДанныеСтроки)
//	
//	Если Объект.ГруппировкаЗатрат <> Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции
//		И Объект.ГруппировкаЗатрат <> Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоСпецификациям Тогда
//		
//		Возврат Истина;
//	КонецЕсли;
//	
//	Если ДанныеСтроки.Номенклатура.Пустая() Тогда
//		ДанныеСтроки.Спецификация = Неопределено;
//		Возврат Истина;
//	КонецЕсли;
//	
//	ДанныеСпецификации = УправлениеДаннымиОбИзделияхВызовСервера.СпецификацияИзделия(
//		ДанныеСтроки.Номенклатура,
//		ДанныеСтроки.Характеристика,
//		Объект.Дата,
//		Объект.Подразделение,
//		ПараметрыВыбораСпецификаций,
//		ДанныеСтроки.Спецификация);
//	
//	СпецификацияИзменилась = Ложь;
//	Если ДанныеСпецификации = Неопределено Тогда
//		
//		ДанныеСтроки.Спецификация = Неопределено;
//		
//		СпецификацияИзменилась = Истина;
//		
//	Иначе
//		
//		Если ДанныеСпецификации.Спецификация <> ДанныеСтроки.Спецификация Тогда
//			ЗаполнитьЗначенияСвойств(ДанныеСтроки, ДанныеСпецификации);
//			СпецификацияИзменилась = Истина;
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Возврат СпецификацияИзменилась;
//	
//КонецФункции

//&НаСервере
//Процедура ВозвратныеОтходыНоменклатураПриИзмененииНаСервере(ИдентификаторСтроки, СтруктураДействий, КэшированныеЗначения)

//	ТекущаяСтрока = Объект.ВозвратныеОтходы.НайтиПоИдентификатору(ИдентификаторСтроки);
//	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

//КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//Процедура ОбновитьДоступностьЭлементовВозвратнойТары(Форма)
//	
//	Форма.Элементы.СрокВозвратаМногооборотнойТары.Доступность = Форма.Объект.ВернутьМногооборотнуюТару;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПересчитатьСуммыТабличнойЧастиВВалюту(Таблица, 
//	Знач СтараяВалюта,
//	Знач НоваяВалюта,
//	Знач СтруктураКурсовСтаройВалюты,
//	Знач СтруктураКурсовНовойВалюты,
//	ИмяПоляСумма = "Сумма")
//	
//	СуммаКРаспределению = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
//		Таблица.Итог(ИмяПоляСумма),
//		СтруктураКурсовСтаройВалюты,
//		СтруктураКурсовНовойВалюты);
//	
//	МассивСумм = Новый Массив;
//	
//	Для Х = 0 По Таблица.Количество() - 1 Цикл
//		
//		ТекСтрока = Таблица[Х];
//		
//		Если Таблица <> Объект.Услуги Тогда
//			ТекСтрока.Цена = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
//				ТекСтрока.Цена,
//				СтруктураКурсовСтаройВалюты,
//				СтруктураКурсовНовойВалюты);
//		КонецЕсли;
//		
//		СуммаВНовойВалюте = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(
//			ТекСтрока[ИмяПоляСумма],
//			СтруктураКурсовСтаройВалюты,
//			СтруктураКурсовНовойВалюты);
//		
//		МассивСумм.Добавить(СуммаВНовойВалюте);
//		
//	КонецЦикла;
//	
//	МассивСумм = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаКРаспределению, МассивСумм);
//	
//	Если МассивСумм <> Неопределено Тогда
//		
//		Для Х = 0 По Таблица.Количество() - 1 Цикл
//			
//			ТекСтрока = Таблица[Х];
//			ТекСтрока[ИмяПоляСумма] = МассивСумм[Х];
//			Если ИмяПоляСумма = "СуммаСНДС" Тогда
//				Ценообразование.ПересчитатьСуммыВСтрокеПоСуммеСНДС(ТекСтрока, Ложь, Ложь, Ложь, Ложь, "Сумма");
//			КонецЕсли;
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьСлужебныеРеквизиты()
//	
//	
//	ЗаполнитьПредставлениеГруппыЗатрат();
//	
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьСлужебныеРеквизитыТабличныхЧастей(СписокТЧ = "")
//	
//	СтруктураТЧ = Новый Структура(СписокТЧ);
//	ВсеТЧ = Не ЗначениеЗаполнено(СтруктураТЧ);
//	
//	
//		СтруктураДействий = Новый Структура;
//		ДобавитьВСтруктуруДействияПоОбновлениюВспомРевизитовСтроки(СтруктураДействий);
//		
//		Если ВсеТЧ Или СтруктураТЧ.Свойство("Продукция") Тогда
//			  
//			НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(
//				Объект.Продукция, СтруктураДействий);
//				
//			ПроизводствоСервер.ЗаполнитьПризнакЦеховаяКладоваяВТаблице(Объект.Продукция, "Получатель");
//			
//			ПроизводствоСервер.РассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия(
//				Объект, ПараметрыРаспределенияЗатрат);
//			
//		КонецЕсли;
//	
//		Если ВсеТЧ Или СтруктураТЧ.Свойство("ВозвратныеОтходы") Тогда
//			  
//			НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(
//				Объект.ВозвратныеОтходы, СтруктураДействий);
//				
//			ПроизводствоСервер.ЗаполнитьПризнакЦеховаяКладоваяВТаблице(Объект.ВозвратныеОтходы, "Получатель");
//			
//		КонецЕсли;
//	
//		Если ВсеТЧ Или СтруктураТЧ.Свойство("Материалы") Тогда
//			  
//			НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(
//				Объект.Материалы, СтруктураДействий);
//				
//			ПроизводствоСервер.ЗаполнитьПризнакЦеховаяКладоваяВТаблице(Объект.Материалы, "Склад");
//			
//			ПараметрыЗаполнения = Новый Структура;
//			ПараметрыЗаполнения.Вставить("ЕстьРаботы", Ложь);
//			ПараметрыЗаполнения.Вставить("ЕстьОтменено", Истина);
//			ПараметрыЗаполнения.Вставить("ДоступноОбеспечение", ДоступноОбеспечение(ЭтотОбъект));
//			
//			ЗаполнитьСлужебныеРеквизиты1(
//				Объект.Материалы, ПараметрыЗаполнения, ДатаОтгрузкиОбязательна);
//			
//		КонецЕсли;
//	
//	
//	Если ВсеТЧ Или СтруктураТЧ.Свойство("Услуги") Тогда
//		
//		СтруктураДействий = Новый Структура;
//		ДобавитьВСтруктуруДействияПоОбновлениюВспомРевизитовСтроки(СтруктураДействий, Истина);
//		
//		НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Услуги, СтруктураДействий);
//		
//	КонецЕсли;	
//	
//КонецПроцедуры	  

//&НаСервере
//// Заполняет служебные реквизиты "ДатаОтгрузкиОбязательна" и "СкладОбязателен" в табличной части документа и в шапке.
////
////  Параметры:
////   Товары - ДанныеФормыКоллекция - таблица формы.
////   Параметры - Структура - структура с полями "ЕстьРаботы" и "ЕстьОтменено" описывающая специфику обрабатываемой таблицы.
////   ДатаОтгрузкиОбязательна - РеквизитФормы - служебный реквизит формы, заполняемый по итогам обработки таблицы формы.
////   СкладОбязателен - РеквизитФормы - служебный реквизит формы, заполняемый по итогам обработки таблицы формы.
////
//Процедура ЗаполнитьСлужебныеРеквизиты1(Товары, Параметры, ДатаОтгрузкиОбязательна = Неопределено, СкладОбязателен = Неопределено) Экспорт
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения", Параметры);
//	ОбработатьТЧ(Товары, СтруктураДействий, Неопределено);
//	
//	ДатаОтгрузкиОбязательна  = ?(Товары.Итог("ДатаОтгрузкиОбязательна") = 0, 0, 1);
//	СкладОбязателен          = ?(Товары.Итог("СкладОбязателен") = 0, 0, 1);
//	
//КонецПроцедуры

//&НаСервере
//// Выполняет обработку строк табличной части документа в соответствии с операциями, перечисленными в структуре действий.
////
//// Параметры:
////	ТЧ - ДанныеФормыКоллекция - таблица товаров документа.
////	СтруктураДействий - Структура - структура с действиями, которые нужно произвести.
////	КэшированныеЗначения - Структура - кэшированные значения.
////
//Процедура ОбработатьТЧ(ТЧ,СтруктураДействий,КэшированныеЗначения) Экспорт
//	
//	Если КэшированныеЗначения = Неопределено Тогда
//		КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
//	КонецЕсли;
//	
//	ДействияЗаполнения = Новый Структура;
//	ДействияОбработки = Новый Структура;
//	Для Каждого Действие Из СтруктураДействий Цикл
//		Если ПоддерживаемыеДействияЗаполненияТЧ().Найти(Действие.Ключ) = Неопределено Тогда
//			ДействияОбработки.Вставить(Действие.Ключ,Действие.Значение);
//		Иначе
//			ДействияЗаполнения.Вставить(Действие.Ключ,Действие.Значение);
//		КонецЕсли;
//	КонецЦикла;
//	Если ДействияЗаполнения.Количество() > 0 Тогда
//		НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(ТЧ,ДействияЗаполнения);
//	КонецЕсли;
//	Если ДействияОбработки.Количество() > 0 Тогда
//		Для Каждого СтрТабл Из ТЧ Цикл
//			ОбработатьСтрокуТЧ(СтрТабл, ДействияОбработки, КэшированныеЗначения);
//		КонецЦикла;
//	КонецЕсли;
//	
//КонецПроцедуры
//&НаСервере
//Функция ПоддерживаемыеДействияЗаполненияТЧ() Экспорт
//	
//	Действия = Новый Массив;
//	Действия.Добавить("ЗаполнитьПризнакТипНоменклатуры");
//	Действия.Добавить("ЗаполнитьПризнакМаркируемаяПродукция");
//	Действия.Добавить("ЗаполнитьПризнакЕдиницаИзмерения");
//	Действия.Добавить("ЗаполнитьПризнакТипИзмеряемойВеличины");
//	Действия.Добавить("ЗаполнитьВесУпаковки");
//	Действия.Добавить("ЗаполнитьОбъемУпаковки");
//	Действия.Добавить("ЗаполнитьЕдиницуИзмеренияВеса");
//	Действия.Добавить("ЗаполнитьЕдиницуИзмеренияОбъема");
//	Действия.Добавить("ЗаполнитьПризнакАртикул");
//	Действия.Добавить("ЗаполнитьПризнакКод");
//	Действия.Добавить("ЗаполнитьПризнакОписание");
//	Действия.Добавить("ЗаполнитьПризнакВариантОформленияПродажи");
//	Действия.Добавить("ЗаполнитьПризнакХарактеристикиИспользуются");
//	Действия.Добавить("ЗаполнитьПризнакВедетсяУчетПоГТД");
//	Действия.Добавить("ЗаполнитьПризнакВедетсяУчетПоРНПТ");
//	Действия.Добавить("ЗаполнитьПризнакЭтоУслуга");
//	Действия.Добавить("ЗаполнитьПризнакПодакцизныйТовар");
//	Действия.Добавить("ЗаполнитьПризнакСерииИспользуются");
//	Действия.Добавить("ПересчитатьВесОбъем");
//	Действия.Добавить("ПересчитатьКоличествоУпаковок");
//	Действия.Добавить("ЗаполнитьПризнакМаркируемаяПродукцияАлкогольная");
//	Действия.Добавить("ЗаполнитьВидПродукцииИС");
//	
//	Возврат Действия;
//	
//КонецФункции
//&НаСервере
//Процедура ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)
//	ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения(ТекущаяСтрока, СтруктураДействий);	
//КонецПроцедуры

//&НаСервере
//Процедура ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения(ТекущаяСтрока, СтруктураДействий) Экспорт
//	
//	Если СтруктураДействий.Свойство("ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения") Тогда
//		
//		ПараметрыДействия = СтруктураДействий.ПриИзмененииТипаНоменклатурыИлиВариантаОбеспечения;
//		Отменено = ПараметрыДействия.ЕстьОтменено И ТекущаяСтрока.Отменено;
//		ЭтоРабота = ПараметрыДействия.ЕстьРаботы
//			И(ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа")
//				Или ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
//				
//		ДоступноОбеспечение = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыДействия, "ДоступноОбеспечение", Истина);
//		
//		ДатаОтгрузкиВСтрокеОбязательна = ОбеспечениеКлиентСервер.ДатаОтгрузкиОбязательна(
//											ТекущаяСтрока, ДоступноОбеспечение, ПараметрыДействия.ЕстьОтменено);
//		
//		ТекущаяСтрока.ДатаОтгрузкиОбязательна = ?(ДатаОтгрузкиВСтрокеОбязательна, 1, 0);
//		
//		ЭтоПроизводство = ПараметрыДействия.Свойство("ЭтоПроизводство"); // Устанавливается в заказе материалов в производство, нарушает логику проверки склада.
//		ТекущаяСтрока.СкладОбязателен = ?(Не ЭтоРабота И Не Отменено 
//											И (ТекущаяСтрока.ВариантОбеспечения <> ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.НеТребуется")
//		                                		Или ЭтоПроизводство), 1, 0);
//												
//	ИначеЕсли СтруктураДействий.Свойство("ПриИзмененииТипаНоменклатуры") Тогда
//		
//		ПараметрыДействия = СтруктураДействий.ПриИзмененииТипаНоменклатуры;
//		Если ПараметрыДействия.Свойство("ЕстьОтменено")
//			И ПараметрыДействия.ЕстьОтменено Тогда
//			Отменено = ПараметрыДействия.ЕстьОтменено И ТекущаяСтрока.Отменено;
//		Иначе
//			Отменено = Ложь;
//		КонецЕсли;
//		ЭтоРабота = ПараметрыДействия.ЕстьРаботы
//			И(ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа")
//				Или ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
//				
//		ТекущаяСтрока.СкладОбязателен = ?(Не ЭтоРабота И Не Отменено, 1, 0);
//		
//	КонецЕсли;
//	
//КонецПроцедуры


//&НаКлиенте
//Функция МаксимальнаяДатаАванса()
//	
//	МаксДатаАванса = '00010101';
//	
//	Для Каждого ТекЭтап Из Объект.ЭтапыГрафикаОплаты Цикл
//		
//		Если ТекЭтап.ВариантОплаты = ПредопределенноеЗначение("Перечисление.ВариантыОплатыПоставщику.ПредоплатаДоПоступления")
//			Или ТекЭтап.ВариантОплаты = ПредопределенноеЗначение("Перечисление.ВариантыОплатыПоставщику.АвансДоПодтверждения") Тогда
//			
//			МаксДатаАванса = Макс(МаксДатаАванса, ТекЭтап.ДатаПлатежа);
//			
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Возврат МаксДатаАванса;
//	
//КонецФункции

//&НаКлиентеНаСервереБезКонтекста
//Функция ЗависимыеРеквизитыВозвратныеОтходы()
//	
//	Возврат Новый Структура("Отменено", "Сумма");
//	
//КонецФункции

//&НаКлиентеНаСервереБезКонтекста
//Функция ЗависимыеРеквизитыМатериалы()
//	
//	Возврат Новый Структура("Отменено", "Сумма");
//	
//КонецФункции

//&НаСервере
//Процедура ПриЧтенииСозданииНаСервере()
//	
//	ПартионныйУчетВерсии22 = РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22(?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()));
//	ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения = ПолучитьФункциональнуюОпцию("ИспользоватьРасширеннуюФормуПодбораКоличестваИВариантовОбеспечения");
//	
//	ИспользоватьНесколькоСкладов = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоСкладов");
//	
//	Если Объект.Статус = Перечисления.СтатусыЗаказовПереработчикам.КОбеспечению
//		И Элементы.Статус.СписокВыбора.НайтиПоЗначению(Перечисления.СтатусыЗаказовПереработчикам.КОбеспечению) = Неопределено Тогда
//		Элементы.Статус.СписокВыбора.Вставить(1, Перечисления.СтатусыЗаказовПереработчикам.КОбеспечению);
//	КонецЕсли;
//	
//	Элементы.ДокументОснование.Видимость = ЗначениеЗаполнено(Объект.ДокументОснование);
//	
//	ПараметрыРаспределенияЗатрат = Новый ФиксированнаяСтруктура(Документы.ЗаказПереработчику.ПараметрыРаспределенияЗатрат(Объект));
//	
//	
//	ВалютаДокумента = Объект.Валюта;
//	
//	ИспользоватьУпрощеннуюСхемуОплаты = ПолучитьФункциональнуюОпцию("ИспользоватьУпрощеннуюСхемуОплатыВЗакупках");
//	ИспользоватьНаправленияДеятельности = ПолучитьФункциональнуюОпцию("ИспользоватьУчетЗатратПоНаправлениямДеятельности");
//	
//	ХарактеристикиИспользуются = Справочники.Номенклатура.ХарактеристикиИспользуются(Объект.Номенклатура);
//	Элементы.Характеристика.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВидовНоменклатуры");
//	Элементы.Характеристика.Доступность = ХарактеристикиИспользуются;
//	
//	УстановитьДоступностьЭлементовПоСтатусуСервер();
//	
//	ЗаполнитьСлужебныеРеквизиты();
//	ЗаполнитьСлужебныеРеквизитыТабличныхЧастей();
//	
//	ВзаиморасчетыСервер.ЗаполнитьПорядокРасчетовВФорме(ЭтаФорма, Ложь ,Ложь);
//	
//	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(
//		НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.ЗаказПереработчику));
//	
//	
//	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Материалы, ЗависимыеРеквизитыМатериалы());
//	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.ВозвратныеОтходы, ЗависимыеРеквизитыВозвратныеОтходы());
//	
//	УстановитьВидимостьДоговора();
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	ОбновитьСостояниеСервер();
//	УстановитьСвойстваЭлементовПоПорядкуРасчетов();
//	
//	УстановитьВидимостьЭлементовФормыДатОтгрузки();
//	УстановитьВидимостьЭлементовФормыДатПоступления();
//	УстановитьВидимостьЭлементовПоВерсииПартионногоУчета();
//	
//	ДоставкаТоваров.ПриЧтенииСозданииРаспоряженийНаСервере(Элементы, Объект);
//	
//	ОбновитьДоступностьЭлементовВозвратнойТары(ЭтаФорма);
//	УстановитьВидимостьОбеспечения();
//	Элементы.МатериалыЗаполнитьОбеспечение.Доступность = Не ТолькоПросмотр;
//	
//	ОбщегоНазначенияУТ.ИнициализироватьКешТекущейСтроки(ЭтотОбъект, "Продукция");
//	ОбщегоНазначенияУТ.ИнициализироватьКешТекущейСтроки(ЭтотОбъект, "ВозвратныеОтходы");
//	ОбщегоНазначенияУТ.ИнициализироватьКешТекущейСтроки(ЭтотОбъект, "Материалы");
//	
//	ОбщегоНазначенияУТ.ИнициализироватьКешТекущейСтроки(ЭтотОбъект, "ВыходныеИзделия", "РедактированиеЭтапов");
//	
//	ИспользоватьУправлениеПроизводством2_2 = ПолучитьФункциональнуюОпцию("ИспользоватьУправлениеПроизводством2_2");
//	
//	НастроитьФормуПоСпособуГруппировкиЗатрат();
//	
//	ОпределитьКоличествоВыходныхИзделий(ЭтаФорма);
//	КоличествоУслуг = КоличествоУслуг(Объект.Услуги.Количество(), Объект.ГруппировкаЗатрат);
//	ГруппировкаЗатратДоИзменения = Объект.ГруппировкаЗатрат;
//	
//	МетаданныеФормы = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка).ОписаниеФормыДокументаДляЗаполненияРеквизитовСвязанныхСНаправлениемДеятельности();
//	НаправленияДеятельностиСервер.ПриЧтенииСозданииНаСервере(ЭтаФорма);
//	
//	АктуализироватьЗакупкуПодДеятельность(Ложь);
//	
//	ПараметрыВыбораСпецификаций = УправлениеДаннымиОбИзделиях.ПараметрыВыбораСпецификаций(Объект, Документы.ЗаказПереработчику);
//	УправлениеДаннымиОбИзделияхКлиентСервер.УстановитьПараметрыВыбораСпецификаций(Элементы.ПродукцияСпецификация, ПараметрыВыбораСпецификаций);
//	

//	ПланыВидовХарактеристик.СтатьиРасходов.ЗаполнитьПризнакАналитикаРасходовОбязательна(Объект.Продукция);
//	ПланыВидовХарактеристик.СтатьиРасходов.ЗаполнитьПризнакАналитикаРасходовЗаказРеализация(Объект.Продукция);
//	ДоходыИРасходыСервер.ЗаполнитьТипСтатьи(Объект.Продукция);
//	
//	ПланыВидовХарактеристик.СтатьиРасходов.ЗаполнитьПризнакАналитикаРасходовОбязательна(Объект.ВозвратныеОтходы);
//	ПланыВидовХарактеристик.СтатьиРасходов.ЗаполнитьПризнакАналитикаРасходовЗаказРеализация(Объект.ВозвратныеОтходы);
//	ДоходыИРасходыСервер.ЗаполнитьТипСтатьи(Объект.ВозвратныеОтходы);
//	
//	
//КонецПроцедуры


//&НаКлиентеНаСервереБезКонтекста
//Процедура РассчитатьИтоговыеПоказателиДокумента(Форма)
//	
//	КоллекцияМатериалы = Форма.Объект.Материалы;
//	
//	Форма.СуммаМатериалов         = КоллекцияМатериалы.Итог("Сумма") - КоллекцияМатериалы.Итог("СуммаОтменено");
//	Форма.СуммаОтмененоМатериалов = КоллекцияМатериалы.Итог("СуммаОтменено");
//	
//	КоллекцияПродукция = Форма.Объект.Продукция;
//	КоллекцияВозвратныеОтходы = Форма.Объект.ВозвратныеОтходы;
//	
//	Форма.СуммаАвансаДоПодтверждения     = 0;
//	Форма.СуммаПредоплатыДоПоступления   = 0;
//	Форма.СуммаКредитаПослеПоступления   = 0;
//	Форма.ПроцентАвансаДоПодтверждения   = 0;
//	Форма.ПроцентПредоплатыДоПоступления = 0;
//	Форма.ПроцентКредитаПослеПоступления = 0;
//	ПроцентПлатежейОбщий                 = 0;
//	
//	АвансДоПодтверждения    = ПредопределенноеЗначение("Перечисление.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения");
//	ПредоплатаДоПоступления = ПредопределенноеЗначение("Перечисление.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления");
//	КредитПослеПоступления  = ПредопределенноеЗначение("Перечисление.ВариантыКонтроляОплатыПоставщику.КредитПослеПоступления");
//	
//	СтруктураАванс      = Новый Структура("Сумма, Проценты", "СуммаАвансаДоПодтверждения",   "ПроцентАвансаДоПодтверждения");
//	СтруктураПредоплата = Новый Структура("Сумма, Проценты", "СуммаПредоплатыДоПоступления", "ПроцентПредоплатыДоПоступления");
//	СтруктураКредит     = Новый Структура("Сумма, Проценты", "СуммаКредитаПослеПоступления", "ПроцентКредитаПослеПоступления");
//	
//	СоответствиеВариантовОплаты = Новый Соответствие;
//	СоответствиеВариантовОплаты.Вставить(АвансДоПодтверждения,    СтруктураАванс);
//	СоответствиеВариантовОплаты.Вставить(ПредоплатаДоПоступления, СтруктураПредоплата);
//	СоответствиеВариантовОплаты.Вставить(КредитПослеПоступления,  СтруктураКредит);
//	
//	ПредыдущееЗначениеДаты = Дата(1, 1, 1);
//	Форма.НомерСтрокиПолнойОплаты = 0;
//	
//	Для Каждого ТекСтрока Из Форма.Объект.ЭтапыГрафикаОплаты Цикл
//		
//		ПроцентПлатежейОбщий = ПроцентПлатежейОбщий + ТекСтрока.ПроцентПлатежа;
//		ТекСтрока.ПроцентЗаполненНеВерно = (ПроцентПлатежейОбщий > 100);
//		ТекСтрока.ДатаЗаполненаНеВерно = (ПредыдущееЗначениеДаты > ТекСтрока.ДатаПлатежа);
//		
//		ПредыдущееЗначениеДаты = ТекСтрока.ДатаПлатежа;
//		Если ПроцентПлатежейОбщий = 100 Тогда
//			Форма.НомерСтрокиПолнойОплаты = ТекСтрока.НомерСтроки;
//		КонецЕсли;
//		
//		ИменаЭлементов = СоответствиеВариантовОплаты[ТекСтрока.ВариантОплаты];
//		Если ИменаЭлементов <> Неопределено Тогда
//			Форма[ИменаЭлементов.Сумма]    = Форма[ИменаЭлементов.Сумма]    + ТекСтрока.СуммаПлатежа;
//			Форма[ИменаЭлементов.Проценты] = Форма[ИменаЭлементов.Проценты] + ТекСтрока.ПроцентПлатежа;
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	БезНДС	= ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
//	НДС0	= ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
//	
//	ЕстьНДС = Ложь;
//	Для каждого СтрокаУслуга Из Форма.Объект.Услуги Цикл
//		Если СтрокаУслуга.СтавкаНДС <> БезНДС Тогда
//			ЕстьНДС = Истина;
//		КонецЕсли;
//	КонецЦикла;
//	
//	Если ЕстьНДС Тогда
//		Форма.Элементы.ГруппаСтраницыВсегоПродукция.ТекущаяСтраница	= Форма.Элементы.СтраницаВсегоСНДСПродукция;
//	Иначе
//		Форма.Элементы.ГруппаСтраницыВсегоПродукция.ТекущаяСтраница	= Форма.Элементы.СтраницаВсегоБезНДСПродукция;
//	КонецЕсли;
//	
//	ТолькоПросмотрНДС		= (Форма.Объект.СтавкаНДС = БезНДС) ИЛИ (Форма.Объект.СтавкаНДС = НДС0);
//	ОтметкаНезаполненного	= (Форма.Объект.СуммаНДС = 0 И Не ТолькоПросмотрНДС);
//	
//	Форма.Элементы.СуммаНДС.ТолькоПросмотр				= ТолькоПросмотрНДС;
//	Форма.Элементы.СуммаНДС.ОтметкаНезаполненного		= ОтметкаНезаполненного;
//	Форма.Элементы.СуммаНДС.АвтоОтметкаНезаполненного	= ОтметкаНезаполненного;
//	
//КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//Процедура ПриИзмененииСуммыУслуг(Форма)

//	Форма.Объект.СуммаСНДС = Форма.Объект.Услуги.Итог("СуммаСНДС");
//	Форма.Объект.СуммаДокумента = Форма.Объект.СуммаСНДС;
//	Форма.КоличествоУслуг = КоличествоУслуг(Форма.Объект.Услуги.Количество(), Форма.Объект.ГруппировкаЗатрат);

//КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//Процедура ДобавитьВСтруктуруДействияПоОбновлениюВспомРевизитовСтроки(СтруктураДействий, ЭтоУслуги = Ложь)
//	
//	СтруктураХарактеристики  = Новый Структура("Номенклатура", "ХарактеристикиИспользуются");
//	
//	СтруктураДействий.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", СтруктураХарактеристики);
//	
//	Если НЕ ЭтоУслуги Тогда
//		СтруктураТипНоменклатуры = Новый Структура("Номенклатура", "ТипНоменклатуры");
//		СтруктураАртикул         = Новый Структура("Номенклатура", "Артикул");
//		СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", СтруктураТипНоменклатуры);
//		СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", СтруктураАртикул);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ИмяТабличнойЧасти, СтруктураДействий)
//	
//	СтруктураДействий.Вставить(
//		"ПересчитатьКоличествоЕдиниц", ПроизводствоКлиентСервер.ПараметрыПересчетаКоличестваЕдиниц());
//	
//	Если ИмяТабличнойЧасти = "ВозвратныеОтходы" 
//			Или ИмяТабличнойЧасти = "Материалы" Тогда
//		СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизитыВозвратныеОтходы());
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьДоговорПоУмолчанию()
//	
//	ПараметрыОбъекта = Новый Структура("Партнер, Договор, Контрагент, Организация");
//	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
//	ПараметрыОбъекта.Вставить("Соглашение", Справочники.СоглашенияСПоставщиками.ПустаяСсылка());
//			
//	Если Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов 
//			И ИспользоватьНаправленияДеятельности Тогда
//			
//		ДопПараметры = ЗакупкиСервер.ДополнительныеПараметрыОтбораДоговоров();
//		ДопПараметры.ВалютаВзаиморасчетов = Объект.Валюта;
//		ДопПараметры.НаправлениеДеятельности = Объект.НаправлениеДеятельности;
//		Договор = ЗакупкиСервер.ПолучитьДоговорПоУмолчанию(ПараметрыОбъекта, 
//															Объект.ХозяйственнаяОперация, 
//															ДопПараметры);
//	Иначе
//		
//		ДопПараметры = ЗакупкиСервер.ДополнительныеПараметрыОтбораДоговоров();
//		ДопПараметры.ВалютаВзаиморасчетов = Объект.Валюта;
//		Договор = ЗакупкиСервер.ПолучитьДоговорПоУмолчанию(ПараметрыОбъекта, 
//															Объект.ХозяйственнаяОперация, 
//															ДопПараметры);
//	КонецЕсли;	
//		
//	Если Договор <> Объект.Договор Тогда
//		Объект.Договор = Договор;
//		ОбновитьФорму = Ложь;
//		АктуализироватьЗакупкуПодДеятельность();
//		ВзаиморасчетыСервер.ЗаполнитьПорядокРасчетовВФорме(ЭтаФорма, Ложь, , ОбновитьФорму);
//		Если ОбновитьФорму Тогда
//			УстановитьСвойстваЭлементовПоПорядкуРасчетов();
//		КонецЕсли;
//		ЗакупкиВызовСервера.ЗаполнитьБанковскиеСчетаПоДоговору(Объект.Договор, Объект.БанковскийСчет);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Функция ЗаполнитьСкладВВыделенныхСтрокахНаСервере(ИмяТЧ, Знач МассивВыделенныхСтрок, Склад)
//	
//	ЗаполненоСтрок = СкладыСервер.ЗаполнитьСкладыВВыделенныхСтроках(
//						ТабличнаяЧастьПоИмени(ИмяТЧ, ЭтаФорма), 
//						МассивВыделенныхСтрок, 
//						Склад);
//	
//	Если ИмяТЧ = "Материалы" И ЗаполненоСтрок > 0 Тогда
//		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект, ПараметрыУказанияСерий);
//	КонецЕсли;
//	
//	Если ЗаполненоСтрок > 0 Тогда
//        
//        ТабличнаяЧасть = ТабличнаяЧастьПоИмени(ИмяТЧ, ЭтаФорма);
//        
//        КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
//        	
//		СтруктураДействий = Новый Структура;
//		СтруктураДействий.Вставить("ЗаполнитьПризнакЦеховаяКладовая");
//		СтруктураДействий.Вставить(
//			"ПересчитатьКоличествоЕдиниц", ПроизводствоКлиентСервер.ПараметрыПересчетаКоличестваЕдиниц());
//		
//		Для каждого ИдентификаторСтроки Из МассивВыделенныхСтрок Цикл
//			СтрокаТаблицы = ТабличнаяЧасть.НайтиПоИдентификатору(ИдентификаторСтроки);
//			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, КэшированныеЗначения);
//		КонецЦикла;				
//			
//	КонецЕсли;	
//	
//	ТребуетсяЗаполнитьДанныеРаспоряжения = Истина;
//	
//	Возврат ЗаполненоСтрок;
//	
//КонецФункции

//&НаСервере
//Процедура ОбновитьЭлементыДополнительныхРеквизитов()
//	
//	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ИзменитьДокументСервер()
//	
//	УстановитьДоступностьЭлементовПоСтатусуСервер();
//	УстановитьВидимостьЭлементовФормыДатОтгрузки();
//	ОбновитьСостояниеЭлементовУправленияИтоговПоРасчетам();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьПустыеДатыПоступления()
//	
//	Если Объект.Продукция.Количество() = 0 
//		И Объект.ВозвратныеОтходы.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если ПроверитьПустуюДатуПоступленияСервер() Тогда
//		
//		ДатаПоступления = Неопределено;
//		Если ЗначениеЗаполнено(Объект.ЖелаемаяДатаПоступления) И Объект.ЖелаемаяДатаПоступления >= Объект.Дата Тогда
//			ДатаПоступления = Объект.ЖелаемаяДатаПоступления;
//		КонецЕсли;
//		
//		ЗаполнитьПустыеДатыПоступленияСервер(ДатаПоступления);
//	
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьПустуюДатуПоступления()
//	
//	Если Объект.Продукция.Количество() = 0 
//		И Объект.ВозвратныеОтходы.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ПроверитьЗаполнитьДатуПоступленияСервер();
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПроверитьЗаполнитьДатуПоступленияСервер()
//	
//	Если ПроверитьПустуюДатуПоступленияСервер() Тогда
//		
//		Если ЗначениеЗаполнено(Объект.ЖелаемаяДатаПоступления) И Объект.ЖелаемаяДатаПоступления >= Объект.Дата Тогда
//			Объект.ДатаПоступления = Объект.ЖелаемаяДатаПоступления;
//		Иначе
//			Объект.ДатаПоступления = ТекущаяДатаСеанса();
//		КонецЕсли;
//		
//		ЗаполнитьДатыПоступленияСервер(Объект.ДатаПоступления);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьПустыеДатыПоступленияСервер(ДатаПоступления)
//	
//	Если ДатаПоступления = Неопределено Тогда
//		ДатаПоступления = ТекущаяДатаСеанса();
//	КонецЕсли;
//	
//	Для Каждого СтрокаТЧ Из Объект.Продукция Цикл
//		Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаПоступления) Тогда
//			СтрокаТЧ.ДатаПоступления = ДатаПоступления;
//		КонецЕсли;
//	КонецЦикла;
//	
//	Для Каждого СтрокаТЧ Из Объект.ВозвратныеОтходы Цикл
//		Если Не ЗначениеЗаполнено(СтрокаТЧ.ДатаПоступления) Тогда
//			СтрокаТЧ.ДатаПоступления = ДатаПоступления;
//		КонецЕсли;
//	КонецЦикла;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ОбновитьСостояниеСервер()
//	
//	Документы.ЗаказПереработчику.РассчитатьСостояние(
//		Объект.Ссылка,
//		Объект.Договор,
//		ЭтаФорма);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ОбновитьСостояниеЭлементовУправленияИтоговПоРасчетам()
//	
//	Если Объект.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов Тогда
//		Расчеты = НСтр("ru='Расчеты по договору'");
//	Иначе
//		Расчеты = НСтр("ru='Оплачено по заказу'") + ": " + Формат(СуммаОплаты, "ЧДЦ=2; ЧН=") + " " + ВалютаДокумента + "  " + ПроцентОплаты + "%";
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьДатуПоступления(ИмяТЧ, МассивВыделенныхСтрок = Неопределено)
//	
//	ДатаПоступления = Объект.ЖелаемаяДатаПоступления;
//	
//	Оповещение = Новый ОписаниеОповещения("ЗаполнитьДатуПоступленияЗавершение", ЭтотОбъект, Новый Структура("ИмяТЧ, МассивВыделенныхСтрок", ИмяТЧ, МассивВыделенныхСтрок));
//	
//	ОбщегоНазначенияУТКлиент.ВвестиДатуСКонтролемПустогоЗначения(ДатаПоступления, НСтр("ru='Введите дату поступления'"), ЧастиДаты.Дата, Оповещение);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьДатуПоступленияЗавершение(ВыбраннаяДата, ДополнительныеПараметры) Экспорт
//	
//	Если ВыбраннаяДата <> Неопределено И ЗначениеЗаполнено(ВыбраннаяДата) Тогда
//		
//		ДатаПоступления = ВыбраннаяДата;
//		МассивВыделенныхСтрок = ДополнительныеПараметры.МассивВыделенныхСтрок;
//		ИмяТЧ = ДополнительныеПараметры.ИмяТЧ;
//		
//		ТабличнаяЧасть = ТабличнаяЧастьПоИмени(ИмяТЧ, ЭтаФорма);
//		
//		Если МассивВыделенныхСтрок = Неопределено Тогда
//			
//			Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
//				СтрокаТЧ.ДатаПоступления = ДатаПоступления;
//			КонецЦикла;
//			
//		Иначе
//			
//			Для Каждого ИдентификаторСтроки Из МассивВыделенныхСтрок Цикл
//				
//				СтрокаТЧ = ТабличнаяЧасть.НайтиПоИдентификатору(ИдентификаторСтроки);
//				СтрокаТЧ.ДатаПоступления = ДатаПоступления;
//				
//			КонецЦикла;
//			
//		КонецЕсли;
//		
//		ЗакупкиКлиент.ОповеститьОбОкончанииЗаполненияДатПоступления(ДатаПоступления, (МассивВыделенныхСтрок <> Неопределено));
//	
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Функция ПоместитьГрафикВоВременноеХранилище()
//	
//	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Объект.ЭтапыГрафикаОплаты.Выгрузить());
//	
//	Возврат АдресВоВременномХранилище;
//	
//КонецФункции

//&НаКлиенте
//Процедура НадписьЭтапыОплатыНажатие(Элемент, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	Попытка
//		ЗаблокироватьДанныеФормыДляРедактирования();
//	Исключение
//		ПоказатьПредупреждение(Неопределено, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
//		Возврат;
//	КонецПопытки;
//	
//	ПараметрыФормы = Новый Структура();
//	ПараметрыФормы.Вставить("ТолькоПросмотр",                         ТолькоПросмотр);
//	ПараметрыФормы.Вставить("СуммаОплатыПоДокументу",                 Объект.СуммаСНДС);
//	
//	ПараметрыФормы.Вставить("Партнер",                                Объект.Партнер);
//	ПараметрыФормы.Вставить("Дата",                                   Объект.Дата);
//	ПараметрыФормы.Вставить("ЖелаемаяДатаПоступления",                Объект.ЖелаемаяДатаПоступления);
//	ПараметрыФормы.Вставить("Валюта",                                 Объект.Валюта);
//	ПараметрыФормы.Вставить("УникальныйИдентификатор",                УникальныйИдентификатор);
//	ПараметрыФормы.Вставить("ФормаОплаты",                            Объект.ФормаОплаты);
//	ПараметрыФормы.Вставить("Касса",                                  Объект.Касса);
//	ПараметрыФормы.Вставить("БанковскийСчет",                         Объект.БанковскийСчет);
//	ПараметрыФормы.Вставить("Организация",                            Объект.Организация);
//	ПараметрыФормы.Вставить("ПорядокРасчетов",                        Объект.ПорядокРасчетов);
//	ПараметрыФормы.Вставить("ГрафикИсполненияВДоговоре",              ГрафикИсполненияВДоговоре);
//	ПараметрыФормы.Вставить("ПорядокОплаты",                          Объект.ПорядокОплаты);
//	ПараметрыФормы.Вставить("ВалютаВзаиморасчетов",                   Объект.Валюта);
//	
//	ПараметрыФормы.Вставить("ПараметрыВыбораРеквизитов",              ПараметрыВыбораРеквизитов);
//	ПараметрыФормы.Вставить("ДоступныеПорядкиРасчетов",               ДоступныеПорядкиРасчетов);
//	ПараметрыФормы.Вставить("ОтключитьЗаполнениеПоПредыдущимЗаказам", Истина);
//	ПараметрыФормы.Вставить("ЭтоЗаказ",                               Истина);
//	ПараметрыФормы.Вставить("УпрощенныйРежим",                        ИспользоватьУпрощеннуюСхемуОплаты);
//	
//	ПараметрыФормы.Вставить("АдресВоВременномХранилище",              ПоместитьГрафикВоВременноеХранилище());
//	
//	Оповещение = Новый ОписаниеОповещения("НадписьЭтапыОплатыНажатиеЗавершение", ЭтотОбъект);
//	
//	ОткрытьФорму("ОбщаяФорма.ЭтапыОплатыПоставщику",
//		ПараметрыФормы, 
//		ЭтаФорма,,,, 
//		Оповещение, 
//		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура НадписьЭтапыОплатыНажатиеЗавершение(ПараметрыОплаты, ДополнительныеПараметры) Экспорт
//	
//	Если ПараметрыОплаты <> Неопределено Тогда
//		
//		Модифицированность = Истина;
//		Объект.ЭтапыГрафикаОплаты.Очистить();
//		Объект.Согласован = Ложь;
//		Объект.ФормаОплаты             = ПараметрыОплаты.ФормаОплаты;
//		Объект.Касса                   = ПараметрыОплаты.Касса;
//		Объект.БанковскийСчет          = ПараметрыОплаты.БанковскийСчет;
//		Объект.ЖелаемаяДатаПоступления = ПараметрыОплаты.ЖелаемаяДатаПоступления;
//		Объект.ПорядокОплаты           = ПараметрыОплаты.ПорядокОплаты;
//		
//		Если Объект.ПорядокРасчетов <> ПараметрыОплаты.ПорядокРасчетов Тогда
//			Объект.ПорядокРасчетов = ПараметрыОплаты.ПорядокРасчетов;
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(ПараметрыОплаты.АдресВоВременномХранилище) Тогда
//			ЗаполнитьЭтапыОплатыИзВременногоХранилищаСервер(ПараметрыОплаты.АдресВоВременномХранилище);
//		КонецЕсли;
//		
//		УстановитьСвойстваЭлементовПоПорядкуРасчетов();
//		
//		УстановитьДоступностьЭлементовПоСтатусуСервер();
//		
//	КонецЕсли;
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьЭтапыОплатыИзВременногоХранилищаСервер(АдресВоВременномХранилище) 
//	
//	ЭтапыОплаты = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
//	
//	Для Каждого ТекСтрока Из ЭтапыОплаты Цикл
//		НоваяСтрока = Объект.ЭтапыГрафикаОплаты.Добавить();
//		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
//	КонецЦикла;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьДатуВТЧ(Знач ИмяТЧ, Знач ПолеДата, Знач НоваяДата)

//	Если НоваяДата = '000101010000' Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ТабличнаяЧасть = ТабличнаяЧастьПоИмени(ИмяТЧ, ЭтаФорма);
//	Для каждого ДанныеСтроки Из ТабличнаяЧасть Цикл
//		ДанныеСтроки[ПолеДата] = НоваяДата;
//	КонецЦикла;

//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьДатыПоступленияСервер(ДатаПоступления)
//	
//	ЗаполнитьДатуВТЧ("Продукция", "ДатаПоступления", ДатаПоступления);
//	ЗаполнитьДатуВТЧ("ВозвратныеОтходы", "ДатаПоступления", ДатаПоступления);
//	
//КонецПроцедуры

//&НаСервере
//Функция МаксимальнаяДатаПоступления()
//	
//	МаксимальнаяДатаПоступления = Дата(1,1,1);
//	Для Каждого Товар Из Объект.Продукция Цикл 
//		МаксимальнаяДатаПоступления = Макс(МаксимальнаяДатаПоступления, Товар.ДатаПоступления);
//	КонецЦикла;
//	
//	Для Каждого Товар Из Объект.ВозвратныеОтходы Цикл 
//		МаксимальнаяДатаПоступления = Макс(МаксимальнаяДатаПоступления, Товар.ДатаПоступления);
//	КонецЦикла;
//	
//	Возврат МаксимальнаяДатаПоступления
//	
//КонецФункции

//&НаСервере
//Функция ПроверитьПустуюДатуПоступленияСервер()
//	
//	Для Каждого ТекСтрока Из Объект.Продукция Цикл
//		
//		Если Не ЗначениеЗаполнено(ТекСтрока.ДатаПоступления) Тогда
//			Возврат Истина;
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	Возврат Ложь;
//	
//КонецФункции

//&НаСервере
//Процедура УстановитьСвойстваЭлементовПоПорядкуРасчетов()
//	
//	НадписьЭтапыОплаты = ЭтапыОплатыКлиентСервер.НадписьЭтапыОплаты(ЭтаФорма, Истина, Объект.СуммаСНДС);
//	
//	ВзаиморасчетыСервер.УстановитьВидимостьГруппыФинансовогоУчета(ЭтаФорма, Истина);
//	ВзаиморасчетыСервер.УстановитьВидимостьЗачетаОплаты(ЭтаФорма, Истина);
//	

//	ОбновитьСостояниеЭлементовУправленияИтоговПоРасчетам();
//	
//КонецПроцедуры

//&НаСервере
//Процедура ИзмененаОплатаСервер()
//	
//	ОбновитьСостояниеСервер();
//	ОбновитьСостояниеЭлементовУправленияИтоговПоРасчетам();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПроверитьНаличиеЗаказовПоДаннымПереработчика(НомерПоДаннымПартнера)
//	
//	СписокЗаказовПоНомеру = ЗаказыПоДаннымПереработчика(Объект.Ссылка, Объект.Контрагент, НомерПоДаннымПартнера);
//	
//	Если СписокЗаказовПоНомеру.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;
//		
//	СписокКнопок = Новый СписокЗначений;
//	Если СписокЗаказовПоНомеру.Количество() = 1 Тогда
//		ТекстВопроса = НСтр("ru='В информационной базе уже существует заказ с таким же номером по данным переработчика. Продолжить?'");
//		СписокКнопок.Добавить("ОткрытьСписокЗаказов", НСтр("ru = 'Открыть заказ'"));
//	Иначе
//		ТекстВопроса = НСтр("ru='В информационной базе уже существуют заказы с таким же номером по данным переработчика. Продолжить?'");
//		СписокКнопок.Добавить("ОткрытьСписокЗаказов", НСтр("ru = 'Открыть список заказов'"));
//	КонецЕсли;
//	
//	СписокКнопок.Добавить("Продолжить", НСтр("ru = 'Продолжить'"));
//	
//	ОписаниеОповещения = Новый ОписаниеОповещения("ПроверитьНаличиеЗаказовПоДаннымПереработчикаЗавершение", ЭтотОбъект, Новый Структура("СписокЗаказов", СписокЗаказовПоНомеру));
//	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокКнопок);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПроверитьНаличиеЗаказовПоДаннымПереработчикаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
//    
//    СписокЗаказовПоНомеру = ДополнительныеПараметры.СписокЗаказов;
//    
//    Если РезультатВопроса = "ОткрытьСписокЗаказов" Тогда
//        
//		Если СписокЗаказовПоНомеру.Количество() > 1 Тогда
//			
//			ПараметрыФормы = Новый Структура;
//			ПараметрыФормы.Вставить("СписокДокументов", СписокЗаказовПоНомеру);
//			ПараметрыФормы.Вставить("Заголовок", НСтр("ru='Заказы переработчикам (%КоличествоДокументов%)'"));
//            ОткрытьФорму("ОбщаяФорма.ПросмотрСпискаДокументов", ПараметрыФормы);
//			
//        Иначе
//            
//            ПараметрыФормы = Новый Структура("Ключ", СписокЗаказовПоНомеру.Получить(0).Значение);
//            ОткрытьФорму("Документ.ЗаказПереработчику.ФормаОбъекта", ПараметрыФормы);
//            
//        КонецЕсли;
//        
//    КонецЕсли;

//КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ЗаказыПоДаннымПереработчика(ТекущийЗаказ, Контрагент, НомерВходящегоДокумента)
//	
//	ДатаВходящегоДокумента = ?(ЗначениеЗаполнено(ТекущийЗаказ.Дата), ТекущийЗаказ.Дата, ТекущаяДатаСеанса());
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ЗаказПереработчику.Ссылка КАК Ссылка
//	|ИЗ
//	|	Документ.ЗаказПереработчику КАК ЗаказПереработчику
//	|ГДЕ
//	|	ЗаказПереработчику.Ссылка <> &ТекущийЗаказ
//	|	И ЗаказПереработчику.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
//	|	И ЗаказПереработчику.НомерПоДаннымПартнера = &НомерПоДаннымПартнера
//	|	И ЗаказПереработчику.Контрагент = &Контрагент
//	|	И НЕ ЗаказПереработчику.ПометкаУдаления";
//	
//	Запрос.УстановитьПараметр("ДатаНачала",    ДобавитьМесяц(ДатаВходящегоДокумента, -3));
//	Запрос.УстановитьПараметр("ДатаОкончания", ДобавитьМесяц(ДатаВходящегоДокумента, 3));
//	Запрос.УстановитьПараметр("Контрагент",    Контрагент);
//	Запрос.УстановитьПараметр("ТекущийЗаказ",  ТекущийЗаказ);
//	Запрос.УстановитьПараметр("НомерПоДаннымПартнера", НомерВходящегоДокумента);
//	
//	СписокЗаказовПоНомеру = Новый СписокЗначений;
//	СписокЗаказовПоНомеру.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
//	
//	Возврат СписокЗаказовПоНомеру;
//	
//КонецФункции

//&НаКлиенте
//Процедура РасчетыНажатие(Элемент, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	
//	ОтчетыУТКлиентПереопределяемый.ОткрытьОтчетКарточкаРасчетовСПоставщиками("КарточкаРасчетовСПоставщикамиПоДокументамКонтекст", Объект.Ссылка);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьПодчиненныеСвойстваПоСтатистике(ИмяРеквизитаРодителя)
//	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьПодчиненныеСвойства(Объект, ИмяРеквизитаРодителя);
//КонецПроцедуры

//&НаКлиенте
//Процедура ПересчитатьСуммыПриИзмененииВалюты(РезультатВопроса, ДополнительныеПараметры) Экспорт
//	
//	ПересчитатьСуммы = (РезультатВопроса = КодВозвратаДиалога.Да);
//	ВалютаПриИзмененииЗавершение(ПересчитатьСуммы);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ВалютаПриИзмененииЗавершение(ПересчитатьСуммы)

//	ПриИзмененииВалютыСервер(Объект.Валюта, ПересчитатьСуммы);
//	
//	Если ПересчитатьСуммы Тогда
//		ЦенообразованиеКлиент.ОповеститьОбОкончанииПересчетаСуммВВалюту(ВалютаДокумента, Объект.Валюта);
//	КонецЕсли;
//	
//	ВалютаДокумента = Объект.Валюта;

//КонецПроцедуры

//&НаКлиенте
//Процедура ЖелаемаяДатаПоступленияНачалоВыбораИзСпискаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
//    
//    ВыбранноеЗначение = ВыбранныйЭлемент;
//    
//    Если ВыбранноеЗначение <> Неопределено Тогда
//        Объект.ЖелаемаяДатаПоступления = ВыбранноеЗначение.Значение;
//    КонецЕсли;

//КонецПроцедуры

//&НаСервере
//Процедура ПродукцияХарактеристикаПриИзмененииНаСервере(ИдентификаторСтроки)

//	ТекущаяСтрока = Объект.Продукция.НайтиПоИдентификатору(ИдентификаторСтроки);

//	ПродукцияСтрокаЗаполнитьСпецификацию(ТекущаяСтрока);

//КонецПроцедуры

//&НаКлиенте
//Процедура Услуги_ВыбратьИЗаполнитьУслугуЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

//	Если РезультатЗакрытия = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	СтруктураПересчетаСуммы = ПараметрыПересчетаСуммыНДСВТЧ(ЭтаФорма);
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС",
//		Новый Структура("НалогообложениеНДС, Дата", ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС"), Объект.Дата));
//	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
//	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);

//	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
//		ЭтаФорма.ИмяФормы, "Услуги"));

//	Для каждого ИдентификаторСтроки Из Элементы.Услуги.ВыделенныеСтроки Цикл
//		ДанныеСтроки = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
//		ДанныеСтроки.Номенклатура = РезультатЗакрытия;
//		
//		СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ДанныеСтроки.Характеристика);
//		ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ДанныеСтроки, СтруктураДействий, КэшированныеЗначения);
//	КонецЦикла;
//	
//	ПриИзмененииСуммыУслуг(ЭтаФорма);
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОткрытьРаспоряжениеГруппы(ТекущиеДанные)
//	
//	ИмяПоляГруппаЗатрат	= ИмяПоляГруппаЗатрат(Объект);

//	Если НЕ ЗначениеЗаполнено(ТекущиеДанные[ИмяПоляГруппаЗатрат]) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если Объект.ПереработкаПоЗаказу Тогда
//		СтруктураПоиска = Новый Структура(ИмяПоляГруппаЗатрат, ТекущиеДанные[ИмяПоляГруппаЗатрат]);
//	 	СписокСтрок = Объект.Услуги.НайтиСтроки(СтруктураПоиска);
//		Если СписокСтрок.Количество() <> 0 Тогда
//			ПоказатьЗначение(, СписокСтрок[0].Распоряжение);
//		КонецЕсли;
//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьВозвратныеОтходыИМатериалы()

//	ТекущиеДанные = Элементы.Продукция.ТекущиеДанные;
//	Если ТекущиеДанные = Неопределено Тогда
//		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать выбрать продукцию.'"));
//		Возврат;
//	КонецЕсли;
//	
//	ИмяПоляГруппаЗатрат = ИмяПоляГруппаЗатрат(Объект);
//	
//	// Нужно проверить что в выбранных строках заполнена спецификация или заказ
//	Отказ = Ложь;
//	ДанныеВыбранныхСтрок = Новый Массив;
//	Для каждого ИдентификаторСтроки Из Элементы.Продукция.ВыделенныеСтроки Цикл
//		
//		ТекущиеДанные = Объект.Продукция.НайтиПоИдентификатору(ИдентификаторСтроки);
//		
//		Если ТекущиеДанные.Отменено Тогда
//			Продолжить;
//		ИначеЕсли (Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции")
//				ИЛИ Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоСпецификациям"))
//			И НЕ ЗначениеЗаполнено(ТекущиеДанные.Спецификация) Тогда
//			
//			ТекстСообщения = СтрШаблон(
//				НСтр("ru = 'Необходимо указать спецификацию в строке %1 списка ""Продукция""'"), 
//				Формат(ТекущиеДанные.НомерСтроки, "ЧГ="));
//			
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//				ТекстСообщения,
//				Объект.Ссылка,
//				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Продукция", ТекущиеДанные.НомерСтроки, "Спецификация"),
//				, 
//				Отказ);
//			
//			Продолжить;
//			
//		ИначеЕсли Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЗаказамНаПроизводство")
//			И НЕ ЗначениеЗаполнено(ТекущиеДанные[ИмяПоляГруппаЗатрат]) Тогда
//			
//			ТекстСообщения = СтрШаблон(
//				НСтр("ru = 'Необходимо указать заказ в строке %1 списка ""Продукция""'"), 
//				Формат(ТекущиеДанные.НомерСтроки, "ЧГ="));
//			
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//				ТекстСообщения,
//				Объект.Ссылка,
//				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Продукция", ТекущиеДанные.НомерСтроки, "ГруппаЗатрат"),
//				, 
//				Отказ);
//			
//			Продолжить;
//			
//		КонецЕсли;
//		
//		ДанныеВыбранныхСтрок.Добавить(ИдентификаторСтроки);
//		
//	КонецЦикла;
//	
//	Если Отказ Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если ДанныеВыбранныхСтрок.Количество() = 0 Тогда
//		ТекстПредупреждения = НСтр("ru='Необходимо выбрать строки, для которых возможно перезаполнение по спецификации.'");
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
//		Возврат;
//	КонецЕсли;
//	
//	ТекстВопроса = Неопределено;
//	Если Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции")
//		ИЛИ Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоСпецификациям") Тогда
//		
//		ТекстВопроса = НСтр("ru = 'Заполнить возвратные отходы, сырье и материалы по спецификации?'");
//		
//	ИначеЕсли Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЗаказамНаПроизводство") Тогда
//		
//		ТекстВопроса = НСтр("ru = 'Заполнить возвратные отходы, сырье и материалы по заказу на производство?'");
//		
//	КонецЕсли;
//	
//	Если ТекстВопроса <> Неопределено Тогда
//		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьВозвратныеОтходыИМатериалыПриИзмененииПродукцииЗавершение", ЭтотОбъект, ДанныеВыбранныхСтрок);
//		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
//	КонецЕсли;

//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьВозвратныеОтходыИМатериалыПриИзмененииПродукцииЗавершение(РезультатВопроса, ВыделенныеСтроки) Экспорт
//	
//	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
//		ЗаполнитьВозвратныеОтходыИМатериалыНаСервере(ВыделенныеСтроки);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьВозвратныеОтходыИМатериалыНаСервере(ВыделенныеСтроки)

//	Если (Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции")
//		Или Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоСпецификациям")) Тогда
//		
//		ЗаполнитьПоСпецификации(ВыделенныеСтроки);
//		
//	Иначе
//		Возврат;
//	КонецЕсли;

//	ЗаполнитьЦеныПоВидуЦенСервер(Объект.ВидЦены, "ВозвратныеОтходы", Ложь);
//	ЗаполнитьЦеныПоВидуЦенСервер(Объект.ВидЦены, "Материалы", Ложь);
//	ЗаполнитьСлужебныеРеквизиты();
//	ЗаполнитьСлужебныеРеквизитыТабличныхЧастей("ВозвратныеОтходы, Материалы");
//	ОпределитьКоличествоВыходныхИзделий(ЭтаФорма);
//	
//	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить(
//		"ПересчитатьКоличествоЕдиниц", ПроизводствоКлиентСервер.ПараметрыПересчетаКоличестваЕдиниц());
//	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.ВозвратныеОтходы, СтруктураДействий, КэшированныеЗначения);
//	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.Материалы, СтруктураДействий, КэшированныеЗначения);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьПоСпецификации(ВыделенныеСтроки)

//	НомераГруппыЗатрат = НомераГруппыЗатратВыделенныхСтрок(Объект.Продукция, ВыделенныеСтроки);
//	СписокПродукции = СтрокиПоНомеруГруппыЗатрат(Объект.Продукция, НомераГруппыЗатрат);
//	
//	УдалитьСтрокиТЧПоНомерамГруппыЗатрат("ВозвратныеОтходы", НомераГруппыЗатрат);
//	УдалитьСтрокиТЧПоНомерамГруппыЗатрат("Материалы", НомераГруппыЗатрат);
//	
//	Документы.ЗаказПереработчику.ЗаполнитьВозвратныеОтходыИМатериалыПоСпецификации(СписокПродукции, Объект);
//	НаправленияДеятельностиСервер.ПриЗаполненииПоСпецификацииСервер(ЭтаФорма);

//КонецПроцедуры

//&НаСервере
//Процедура УдалитьСтрокиТЧПоНомерамГруппыЗатрат(ИмяТЧ, НомераГруппыЗатрат)
//	
//	ИмяПоляГруппаЗатрат = ИмяПоляГруппаЗатрат(Объект);
//	
//	ОтборСтрок = Новый Структура(ИмяПоляГруппаЗатрат);
//	Если НомераГруппыЗатрат.Количество() = 0 Тогда
//		ОтборСтрок[ИмяПоляГруппаЗатрат] = 0;
//		НайденныеСтроки = Объект[ИмяТЧ].НайтиСтроки(ОтборСтрок);
//		Для Каждого ТекСтрока Из НайденныеСтроки Цикл
//			Объект[ИмяТЧ].Удалить(ТекСтрока);
//		КонецЦикла;
//	Иначе
//		Для Каждого ТекНомер Из НомераГруппыЗатрат Цикл
//			ОтборСтрок[ИмяПоляГруппаЗатрат] = ТекНомер;
//			НайденныеСтроки = Объект[ИмяТЧ].НайтиСтроки(ОтборСтрок);
//			Для Каждого ТекСтрока Из НайденныеСтроки Цикл
//				Объект[ИмяТЧ].Удалить(ТекСтрока);
//			КонецЦикла;
//		КонецЦикла;
//	КонецЕсли;
//	
//КонецПроцедуры

//// Процедуру следует использовать, если строки были добавлены программно (не интерактивно), например, при вставке из
//// буфера, при заполнении по спецификации. Процедура выполняет действия которые зависят от данных в строках.
////
//&НаСервере
//Процедура ПослеИзмененияСтрокТЧПрограммноНаСервере(ИмяТЧ, МассивИдентификаторовСтрок = Неопределено, СтруктураРанееВыполненныхДействий = Неопределено)
//	
//	СписокТЧ = СтрРазделить(ИмяТЧ, ",");
//	
//	Если СтруктураРанееВыполненныхДействий = Неопределено Тогда
//		СтруктураРанееВыполненныхДействий = Новый Структура;
//	КонецЕсли;	
//	
//	Если СписокТЧ.Найти("Продукция") <> Неопределено
//			ИЛИ СписокТЧ.Найти("ВозвратныеОтходы") <> Неопределено
//			ИЛИ СписокТЧ.Найти("РедактированиеЭтаповВыходныеИзделия") <> Неопределено
//			ИЛИ СписокТЧ.Найти("РедактированиеЭтаповПобочныеИзделия") <> Неопределено Тогда
//		ОпределитьКоличествоВыходныхИзделий(ЭтаФорма);
//	КонецЕсли;
//	
//	Если СписокТЧ.Найти("Услуги") <> Неопределено Тогда
//		ПриИзмененииСуммыУслуг(ЭтаФорма);
//	КонецЕсли;
//	
//	Если СписокТЧ.Найти("Продукция") <> Неопределено ИЛИ СписокТЧ.Найти("РедактированиеЭтаповВыходныеИзделия") <> Неопределено Тогда
//		
//		МассивГруппировок = Новый Массив;
//		
//		Если МассивИдентификаторовСтрок <> Неопределено Тогда
//			Для каждого ИдентификаторСтроки Из МассивИдентификаторовСтрок Цикл
//				Если Объект.ГруппировкаЗатрат = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства Тогда
//					ДанныеСтроки = РедактированиеЭтапов.ВыходныеИзделия.НайтиПоИдентификатору(ИдентификаторСтроки);
//					МассивГруппировок.Добавить(ДанныеСтроки.Распоряжение);
//				Иначе
//					ДанныеСтроки = Объект.Продукция.НайтиПоИдентификатору(ИдентификаторСтроки);
//					МассивГруппировок.Добавить(ДанныеСтроки.НомерГруппыЗатрат);
//				КонецЕсли;
//				
//			КонецЦикла;
//		КонецЕсли;
//		
//		РассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия(МассивГруппировок);
//		
//	КонецЕсли;
//	
//	Если СписокТЧ.Найти("Услуги") = Неопределено 
//	   И (Не СтруктураРанееВыполненныхДействий.Свойство("ЗаполнитьПризнакЦеховаяКладовая")
//			Или Не СтруктураРанееВыполненныхДействий.Свойство("ПересчитатьКоличествоЕдиниц")) Тогда
//	   		   		   		   			
//		Для каждого ИмяТекущейТаблицы Из СписокТЧ Цикл
//			
//			ИмяПоляСклад = "";
//				
//			Если ИмяТекущейТаблицы = "Продукция"
//		 	 Или ИмяТекущейТаблицы = "ВозвратныеОтходы"
//		 	 Или ИмяТекущейТаблицы = "РедактированиеЭтаповВыходныеИзделия"
//		 	 Или ИмяТекущейТаблицы = "РедактированиеЭтаповПобочныеИзделия" Тогда
//		 	 	ИмяПоляСклад = "Получатель";
//			ИначеЕсли ИмяТекущейТаблицы = "Материалы"
//				  Или ИмяТекущейТаблицы = "РедактированиеЭтаповОбеспечениеМатериаламиИРаботами" Тогда
//				ИмяПоляСклад = "Склад";  	
//			Иначе
//				Продолжить;		  	
//			КонецЕсли;	  		
//			
//			ТекущаяТаблица = ТабличнаяЧастьПоИмени(ИмяТекущейТаблицы, ЭтаФорма);
//			
//			ИсточникДанных = ?(СтрНайти(ИмяТекущейТаблицы, "РедактированиеЭтапов") > 0, РедактированиеЭтапов, Объект);
//			ИмяТекущейТабличнойЧасти = СтрЗаменить(ИмяТекущейТаблицы, "РедактированиеЭтапов", "");
//				
//			МассивСтрок = Неопределено;
//			КоллекцияСтрок = ТекущаяТаблица;
//			Если МассивИдентификаторовСтрок <> Неопределено Тогда
//				МассивСтрок = Новый Массив;
//				Для каждого ИдентификаторСтроки Из МассивИдентификаторовСтрок Цикл
//					МассивСтрок.Добавить(ИсточникДанных[ИмяТекущейТабличнойЧасти].НайтиПоИдентификатору(ИдентификаторСтроки));
//				КонецЦикла; 
//				КоллекцияСтрок = МассивСтрок;
//			КонецЕсли;
//			
//			КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
//			
//			СтруктураДействий = Новый Структура;
//			СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", ПроизводствоКлиентСервер.ПараметрыПересчетаКоличестваЕдиниц()); 
//			Если Не СтруктураРанееВыполненныхДействий.Свойство("ЗаполнитьПризнакЦеховаяКладовая") Тогда
//				СтруктураДействий.Вставить("ЗаполнитьПризнакЦеховаяКладовая", Новый Структура("ИмяПоляСклад", ИмяПоляСклад));
//			КонецЕсли;
//				
//			Для каждого СтрокаТаблицы Из КоллекцияСтрок Цикл
//				ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, КэшированныеЗначения);
//			КонецЦикла;		
//			
//		КонецЦикла;	
//		
//	КонецЕсли;	
//	
//КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//Функция ТабличнаяЧастьПоИмени(ИмяТЧ, Форма)

//	Если ИмяТЧ = "РедактированиеЭтаповОбеспечениеМатериаламиИРаботами" Тогда
//		ТабличнаяЧасть = Форма.РедактированиеЭтапов.ОбеспечениеМатериаламиИРаботами;
//	ИначеЕсли ИмяТЧ = "РедактированиеЭтаповВыходныеИзделия" Тогда
//		ТабличнаяЧасть = Форма.РедактированиеЭтапов.ВыходныеИзделия;
//	ИначеЕсли ИмяТЧ = "РедактированиеЭтаповПобочныеИзделия" Тогда
//		ТабличнаяЧасть = Форма.РедактированиеЭтапов.ПобочныеИзделия;
//	ИначеЕсли ИмяТЧ = "РедактированиеЭтаповЭтапы" Тогда
//		ТабличнаяЧасть = Форма.РедактированиеЭтапов.Этапы;
//	Иначе
//		ТабличнаяЧасть = Форма.Объект[ИмяТЧ];
//	КонецЕсли;

//	Возврат ТабличнаяЧасть;
//	
//КонецФункции
// 

//&НаКлиенте
//Процедура ОсобыеУсловияПеревозкиПриИзменении(Элемент)
//	
//	ОсобыеУсловияПеревозкиПриИзмененииСервер();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ДополнитьИнформациюПоДоставкеКонтактами(Команда)
//	
//	ДополнитьИнформациюПоДоставкеКонтактамиСервер();
//	
//КонецПроцедуры

//&НаСервере
//Процедура ОсобыеУсловияПеревозкиПриИзмененииСервер()
//	
//	ДоставкаТоваров.ОсобыеУсловияПеревозкиПриИзменении(Элементы, Объект);
//	
//КонецПроцедуры

//&НаСервере
//Процедура ДополнитьИнформациюПоДоставкеКонтактамиСервер()
//	
//	ДоставкаТоваров.ДополнитьИнформациюПоДоставкеКонтактами(Объект);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПередЗаписьюПредложитьПодобратьМногооборотнуюТаруЗавершение(Результат, ДополнительныеПараметры) Экспорт
//	
//	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПереработчикам.КОбеспечению")
//		Или Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПереработчикам.КИсполнению")
//		Или Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПереработчикам.Закрыт") Тогда
//		
//		Если НЕ Объект.ПоступлениеОднойДатой Тогда
//			ЗаполнитьПустыеДатыПоступления();
//		Иначе
//			ЗаполнитьПустуюДатуПоступления();
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Если Объект.ПорядокРасчетов <> ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоНакладным")
//		И Не (ГрафикИсполненияВДоговоре И Объект.ПорядокРасчетов = ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоДоговорамКонтрагентов")) Тогда
//		
//		СуммаЭтаповОплаты = Объект.ЭтапыГрафикаОплаты.Итог("СуммаПлатежа");
//		РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//		
//		Если Объект.СуммаСНДС = 0 И Объект.ЭтапыГрафикаОплаты.Количество() > 0 Тогда
//			
//			Объект.ЭтапыГрафикаОплаты.Очистить();
//			
//		ИначеЕсли Объект.СуммаСНДС <> СуммаЭтаповОплаты Тогда
//			
//			Если Объект.ЭтапыГрафикаОплаты.Количество() = 0 Тогда
//				
//				ПараметрыДляДобавления = ЭтапыОплатыКлиентСервер.ПараметрыДляДобавленияЭтапаПоУмолчанию();
//				ПараметрыДляДобавления.Объект = Объект;
//				ПараметрыДляДобавления.ВариантОплаты = ПредопределенноеЗначение("Перечисление.ВариантыОплатыПоставщику.ПредоплатаДоПоступления");
//				ПараметрыДляДобавления.ЖелаемаяДата = Объект.ЖелаемаяДатаПоступления;
//				ПараметрыДляДобавления.ДатаСеанса = ОбщегоНазначенияКлиент.ДатаСеанса();
//				ПараметрыДляДобавления.СуммаОплатыПоДокументу = Объект.СуммаСНДС;
//				
//				ЭтапыОплатыКлиентСервер.ДобавитьЭтапОплатыПоУмолчанию(ПараметрыДляДобавления);
//				
//			Иначе
//				
//				ЭтапыОплатыКлиентСервер.РаспределитьСуммуПоЭтапамГрафикаОплаты(Объект.ЭтапыГрафикаОплаты, Объект.СуммаСНДС);
//				
//			КонецЕсли;
//			
//			ЭтапыОплатыКлиент.ОповеститьОбОкончанииЗаполненияЭтаповГрафикаОплаты();
//			
//		КонецЕсли;
//		
//		НадписьЭтапыОплаты = ЭтапыОплатыКлиентСервер.НадписьЭтапыОплаты(ЭтаФорма, Истина, Объект.СуммаСНДС);
//		
//	КонецЕсли;
//	
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	// Предложим пользователю скорректировать желаемую дату поступления
//	
//	Если ЗначениеЗаполнено(Объект.ЖелаемаяДатаПоступления) Тогда
//		
//		МаксДатаАванса = МаксимальнаяДатаАванса();
//		
//		Если НЕ ОтветПередЗаписью И ЗначениеЗаполнено(МаксДатаАванса) И МаксДатаАванса > Объект.ЖелаемаяДатаПоступления Тогда
//			
//			ТекстВопроса = НСтр("ru='Желаемая дата поступления меньше даты этапов предоплаты. Дата будет скорректирована до %МаксДатаАванса%'");
//			ТекстВопроса = СтрЗаменить(ТекстВопроса, "%МаксДатаАванса%", Формат(МаксДатаАванса,"ДЛФ=DD"));
//			
//			ДополнительныеПараметры.Вставить("МаксДатаАванса", МаксДатаАванса);
//			ПоказатьВопрос(
//				Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект, ДополнительныеПараметры),
//				ТекстВопроса,
//				РежимДиалогаВопрос.ОКОтмена);
//			Возврат;
//			
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	ОбщегоНазначенияУТКлиент.ЗаписатьОбъектПриНеобходимости(ЭтотОбъект, ДополнительныеПараметры.ПараметрыЗаписи,,Истина);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПередЗаписьюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
//	
//	МаксДатаАванса = ДополнительныеПараметры.МаксДатаАванса;
//	
//	ОтветНаВопрос = РезультатВопроса;
//	Если ОтветНаВопрос = КодВозвратаДиалога.ОК Тогда
//		ОтветПередЗаписью = Истина;
//		Объект.ЖелаемаяДатаПоступления = МаксДатаАванса;
//		ОбщегоНазначенияУТКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтаФорма, ДополнительныеПараметры.ПараметрыЗаписи);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//Процедура ОпределитьКоличествоВыходныхИзделий(Форма)

//	Форма.КоличествоВыходныхИзделий = 
//		Форма.Объект.Продукция.Количество() 
//		+ Форма.Объект.ВозвратныеОтходы.Количество()
//		;

//КонецПроцедуры
// 
//// СтандартныеПодсистемы.Свойства

//&НаСервере
//Процедура СвойстваВыполнитьОтложеннуюИнициализацию()
//	УправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
//	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
//	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
//КонецПроцедуры

//// Конец СтандартныеПодсистемы.Свойства

//&НаСервере
//Процедура ЗаполнитьПорядокОплатыПоУмолчанию()
//	
//	ВалютаОплаты = ДенежныеСредстваСервер.ПолучитьВалютуОплаты(Объект.ФормаОплаты, Объект.БанковскийСчет, Объект.Касса);
//	
//	Объект.ПорядокОплаты = Перечисления.ПорядокОплатыПоСоглашениям.ПолучитьПорядокОплатыПоУмолчанию(ВалютаДокумента,,ВалютаОплаты);
//	
//КонецПроцедуры

//&НаСервере
//Процедура АктуализироватьЗакупкуПодДеятельность(Заполнить = Истина)
//	
//	ПараметрыЗаполнения = Документы.ЗаказПереработчику.ПараметрыЗаполненияВидаДеятельностиНДС(Объект);
//	Если Заполнить Тогда
//		УчетНДСУП.ЗаполнитьВидДеятельностиНДС(
//			Объект.ЗакупкаПодДеятельность,
//			ПараметрыЗаполнения,
//			УчетНДСКэшированныеЗначенияПараметров);
//	КонецЕсли;
//	
//	УчетНДСУП.ЗаполнитьСписокВыбораВидаДеятельностиНДС(
//		Элементы.ЗакупкаПодДеятельность,
//		Объект.ЗакупкаПодДеятельность,
//		ПараметрыЗаполнения,
//		УчетНДСКэшированныеЗначенияПараметров);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура УслугиПоПереработкеПриИзменении(Элемент)
//	
//	НастроитьВидимостьИЗаполнениеУслуг(ЭтаФорма);
//	
//КонецПроцедуры

//&НаКлиентеНаСервереБезКонтекста
//Процедура НастроитьВидимостьИЗаполнениеУслуг(Форма)
//	
//	ИспользоватьУслуги = (Форма.Объект.УслугиПоПереработке = ПредопределенноеЗначение("Перечисление.ВариантыОформленияУслугДокументовПереработки.УказываютсяВЗаказеОтчете"));
//	ПоЭтапам = (Форма.Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства"));
//	
//	Форма.Элементы.ГруппаОплата.Видимость                 = ИспользоватьУслуги;
//	Форма.Элементы.ГруппаСтраницыВсегоПродукция.Видимость = ИспользоватьУслуги;
//	Форма.Элементы.ВалютаДокумента.Видимость              = ИспользоватьУслуги Или Не ПоЭтапам;
//	
//	Форма.Элементы.СтраницаУслуги.Видимость               = ИспользоватьУслуги;
//	
//	Форма.Элементы.БанковскийСчет.Видимость               = ИспользоватьУслуги;
//	Форма.Элементы.ГруппаФинансовогоУчета.Видимость       = ИспользоватьУслуги;
//	
//	Если Не ИспользоватьУслуги Тогда
//		
//		Форма.Объект.БанковскийСчет = ПредопределенноеЗначение("Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка");
//		Форма.Объект.ГруппаФинансовогоУчета = ПредопределенноеЗначение("Справочник.ГруппыФинансовогоУчетаРасчетов.ПустаяСсылка");
//		
//		Форма.Объект.Сумма = 0;
//		Форма.Объект.СуммаНДС = 0;
//		
//		Для Каждого Строка Из Форма.Объект.Услуги Цикл
//			Строка.Сумма = 0;
//			Строка.СуммаНДС = 0;
//			Строка.СуммаСНДС = 0;
//		КонецЦикла;
//		
//		ПриИзмененииСуммыУслуг(Форма);
//		
//		Форма.Объект.ЭтапыГрафикаОплаты.Очистить();
//		
//		Форма.НадписьЭтапыОплаты = ЭтапыОплатыКлиентСервер.НадписьЭтапыОплаты(Форма, Истина, Форма.Объект.СуммаСНДС);
//		
//	КонецЕсли;
//	
//	РассчитатьИтоговыеПоказателиДокумента(Форма);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗакрытьЗаказ(Команда)
//	
//	Если Модифицированность Или Не Объект.Проведен Тогда
//		Ответ = Неопределено;
//		ПоказатьВопрос(
//			Новый ОписаниеОповещения("ЗакрытьЗаказЗавершение", ЭтотОбъект),
//			НСтр("ru = 'Необходимо провести документ для выполнения операции. Провести документ?'"),
//			РежимДиалогаВопрос.ДаНет);
//		Возврат;
//	КонецЕсли;
//	
//	Модифицированность = Истина;
//	
//	ЗакрытьЗаказФрагмент();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗакрытьЗаказФрагмент(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
//	
//	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(,
//		"Документ.ЗаказПереработчику.ФормаДокумента.Команда.ЗакрытьЗаказФрагмент");
//	
//	СписокЗаказовКЗакрытию = Новый СписокЗначений;
//	СписокЗаказовКЗакрытию.Добавить(Объект.Ссылка);
//	
//	СтруктураЗакрытия = Новый Структура;
//	СтруктураЗакрытия.Вставить("Заказы",                       СписокЗаказовКЗакрытию);
//	СтруктураЗакрытия.Вставить("ДокументИнициатор",            Объект.Ссылка);
//	СтруктураЗакрытия.Вставить("ОтменитьНеотработанныеСтроки", Истина);
//	СтруктураЗакрытия.Вставить("ЗакрыватьЗаказы",              Истина);
//	
//	ОткрытьФорму("Обработка.ПомощникЗакрытияЗаказов.Форма.ФормаЗакрытия", СтруктураЗакрытия,
//					ЭтаФорма,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗакрытьЗаказЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
//	
//	ОписаниеОповещения = Новый ОписаниеОповещения("ЗакрытьЗаказФрагмент", ЭтотОбъект);
//	ПараметрыЗаписи = Новый Структура;
//	ПараметрыЗаписи.Вставить("ДействиеПослеЗаписи",ОписаниеОповещения);
//	ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
//	
//	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
//		Возврат;
//	Иначе
//		Записать(ПараметрыЗаписи);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьСтатьюКалькуляции(ИмяТабличнойЧасти, ТипЗатрат)

//	Если Элементы[ИмяТабличнойЧасти].ВыделенныеСтроки.Количество() = 0 Тогда
//		ТекстПредупреждения = НСтр("ru='Необходимо выбрать строки, для которых необходимо заполнить статью калькуляции.'");
//		ПоказатьПредупреждение(, ТекстПредупреждения);
//		Возврат;
//	КонецЕсли;
//	
//	ПараметрыОтбора = Новый Структура;
//	ПараметрыОтбора.Вставить("ТипЗатрат", ТипЗатрат);
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
//	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("ИмяТабличнойЧасти", ИмяТабличнойЧасти);
//	
//	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьСтатьюКалькуляцииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
//	ОткрытьФорму("Справочник.СтатьиКалькуляции.ФормаВыбора", ПараметрыФормы,,,,, ОписаниеОповещения);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьСтатьюКалькуляцииЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт

//	Если РезультатЗакрытия = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ИмяТабличнойЧасти = ДополнительныеПараметры.ИмяТабличнойЧасти;
//	
//	Для каждого ИдентификаторСтроки Из Элементы[ИмяТабличнойЧасти].ВыделенныеСтроки Цикл
//		ДанныеСтроки = Объект[ИмяТабличнойЧасти].НайтиПоИдентификатору(ИдентификаторСтроки);
//		ДанныеСтроки.СтатьяКалькуляции = РезультатЗакрытия;
//	КонецЦикла;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОграничениеТипаПолучателя(ТекущаяСтрока, ИмяЭлемента, ПриветсиКТипу = Ложь)
//	
//	ОграничитьТипПодразделением = ТекущаяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа")
//	                              Или ТекущаяСтрока.СписатьНаРасходы;
//	
//	Элементы[ИмяЭлемента].ОграничениеТипа = ?(ОграничитьТипПодразделением,
//											  Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"),
//											  Новый ОписаниеТипов("СправочникСсылка.Склады"));
//											  
//	Если ПриветсиКТипу Тогда
//		ТекущаяСтрока.Получатель = Элементы[ИмяЭлемента].ОграничениеТипа.ПривестиЗначение(ТекущаяСтрока.Получатель);
//	КонецЕсли;	
//	
//КонецПроцедуры	

//&НаКлиенте
//Процедура ПриИзмененииПолучателя(СтрокаТабличнойЧасти)
//	
//	СтруктураДействий = Новый Структура;
//	СтруктураДействий.Вставить("ЗаполнитьПризнакЦеховаяКладовая", Новый Структура("ИмяПоляСклад", "Получатель"));
//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", ПроизводствоКлиентСервер.ПараметрыПересчетаКоличестваЕдиниц());
//	
//	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТабличнойЧасти, СтруктураДействий, КэшированныеЗначения);
//	
//КонецПроцедуры

//#КонецОбласти

//&НаСервере
//Функция СкорректироватьСтрокиЗаказа(СтруктураДополнительныхПараметров)
//	
//	ИмяТЧ = ?(СтруктураДополнительныхПараметров.ИмяТабличнойЧасти = "Товары",
//				"Продукция, ВозвратныеОтходы, Материалы", 
//				СтруктураДополнительныхПараметров.ИмяТабличнойЧасти);
//	
//	ДокументОбъект = РеквизитФормыВЗначение("Объект");
//	
//	СтруктураДополнительныхПараметров.ПроверятьОстатки = Не (ДокументОбъект.Статус = Перечисления.СтатусыЗаказовПереработчикам.НеСогласован);
//	
//	СтруктураРезультата = ДокументОбъект.СкорректироватьСтрокиЗаказа(СтруктураДополнительныхПараметров);
//	
//	Если СтруктураРезультата.КоличествоСтрок <> 0 Тогда
//		
//		ДокументОбъект.ЗаполнитьЭтапыГрафикаОплаты();
//		
//	КонецЕсли;
//	
//	Если СтруктураДополнительныхПараметров.ЗакрыватьЗаказы Тогда
//		ДокументОбъект.Статус = Перечисления.СтатусыЗаказовПереработчикам.Закрыт;
//		
//		Если НЕ Объект.ПоступлениеОднойДатой Тогда
//			Если ПроверитьПустуюДатуПоступленияСервер() Тогда
//				
//				Если ЗначениеЗаполнено(Объект.ЖелаемаяДатаПоступления) И Объект.ЖелаемаяДатаПоступления >= Объект.Дата Тогда
//					ДатаПоступления = Объект.ЖелаемаяДатаПоступления;
//				Иначе
//					ДатаПоступления = ТекущаяДатаСеанса();
//				КонецЕсли;
//				
//				ЗаполнитьПустыеДатыПоступленияСервер(ДатаПоступления);
//				
//			КонецЕсли;
//		Иначе
//			Если ПроверитьПустуюДатуПоступленияСервер() Тогда
//				
//				Если ЗначениеЗаполнено(Объект.ЖелаемаяДатаПоступления) И Объект.ЖелаемаяДатаПоступления >= Объект.Дата Тогда
//					Объект.ДатаПоступления = Объект.ЖелаемаяДатаПоступления;
//				Иначе
//					Объект.ДатаПоступления = ТекущаяДатаСеанса();
//				КонецЕсли;
//				
//				ЗаполнитьДатыПоступленияСервер(Объект.ДатаПоступления);
//				
//			КонецЕсли;
//		КонецЕсли;
//		
//		ПриИзмененииСтатусаСервер();
//		
//	КонецЕсли;
//	
//	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
//	
//	ЗаполнитьСлужебныеРеквизиты();
//	ЗаполнитьСлужебныеРеквизитыТабличныхЧастей(ИмяТЧ);
//	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.ВозвратныеОтходы, ЗависимыеРеквизитыВозвратныеОтходы());
//	ОбщегоНазначенияУТ.ЗаполнитьДубликатыЗависимыхРеквизитовВКоллекции(Объект.Материалы, ЗависимыеРеквизитыМатериалы());
//	
//	РассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия();
//	РассчитатьИтоговыеПоказателиДокумента(ЭтаФорма);
//	
//	Модифицированность = Истина;
//	
//	Возврат СтруктураРезультата;
//	
//КонецФункции

//&НаКлиентеНаСервереБезКонтекста
//Процедура ДобавитьДействиеПроверитьЗаполнитьСклад(ИмяТЧ, Форма, СтруктураДействий)
//	
//	Если НЕ Форма.ИспользоватьНесколькоСкладов Тогда
//		СтруктураПараметровДействия = Новый Структура("Склад, СкладГруппа", Форма.СкладПоУмолчанию, Ложь);
//		СтруктураДействий.Вставить("ПроверитьЗаполнитьСклад", СтруктураПараметровДействия);
//	КонецЕсли;	
//	
//	ИмяПоляСклад = 
//		?(ИмяТЧ = "Материалы" Или ИмяТЧ = "РедактированиеЭтаповОбеспечениеМатериаламиИРаботами", "Склад", "Получатель");	
//		
//	СтруктураДействий.Вставить("ЗаполнитьПризнакЦеховаяКладовая", Новый Структура("ИмяПоляСклад", ИмяПоляСклад));		
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОткрытьФормуВводаДолиСтоимости(ТекущаяСтрока)
//	
//	Если Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства") Тогда
//		ИмяОбъекта = "РедактированиеЭтапов";
//	Иначе
//		ИмяОбъекта = "Объект";
//	КонецЕсли;
//	
//	НетОшибок = ПроизводствоКлиент.ПроверитьЗаполнениеПередВводомДолиСтоимости(ТекущаяСтрока, ПараметрыРаспределенияЗатрат, ИмяОбъекта);
//	
//	Если НетОшибок Тогда
//		ПараметрыФормы = ПараметрыФормыВводаДолиСтоимости(
//			ИмяОбъекта,
//			ПараметрыРаспределенияЗатрат,
//			ТекущаяСтрока.ПолучитьИдентификатор());
//		ОткрытьФорму("ОбщаяФорма.ВводДолиСтоимости",
//			ПараметрыФормы,
//			ЭтаФорма);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаВводаДолиСтоимости(Элемент, ТекущиеДанные, ВыбранноеЗначение)
//	
//	Если ТекущиеДанные.ДоляСтоимости <> ВыбранноеЗначение.ДоляСтоимости Тогда
//		
//		ПроизводствоКлиентСервер.ЗаполнитьДолюСтоимостиВСтроке(
//			ТекущиеДанные,
//			ВыбранноеЗначение);
//		
//		Группировки = Новый Массив;
//		
//		Если Объект.ГруппировкаЗатрат = ПредопределенноеЗначение("Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства") Тогда
//			Группировки.Добавить(ТекущиеДанные.Распоряжение);
//		Иначе
//			Группировки.Добавить(ТекущиеДанные.НомерГруппыЗатрат);
//		КонецЕсли;
//		
//		РассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия(Группировки);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаСервере
//Процедура СпособРаспределенияЗатратНаВыходныеИзделияПриИзмененииНаСервере()
//	
//	ПараметрыРаспределенияЗатратСтруктура = Документы.ЗаказПереработчику.ПараметрыРаспределенияЗатрат(Объект);
//	ПараметрыРаспределенияЗатрат = Новый ФиксированнаяСтруктура(ПараметрыРаспределенияЗатратСтруктура);
//	
//	Если Объект.ГруппировкаЗатрат <> Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства Тогда
//		ПроизводствоСервер.РассчитатьДолюСтоимости(Объект, ПараметрыРаспределенияЗатрат);
//	КонецЕсли;
//	
//	РассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия();
//	
//КонецПроцедуры

//&НаСервере
//Процедура РассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия(Группировки = Неопределено)
//	
//		ПроизводствоСервер.РассчитатьПроцентРаспределенияЗатратНаВыходныеИзделия(Объект, ПараметрыРаспределенияЗатрат, Группировки);
//	
//КонецПроцедуры
//	
//&НаСервере
//Функция ПараметрыФормыВводаДолиСтоимости(ИмяОбъекта, ПараметрыРаспределенияЗатратЭтапа, ТекущиеДанныеИдентификатор)
//	
//	ПараметрыФормы = ПроизводствоСервер.ПараметрыФормыВводаДолейСтоимости(ЭтаФорма[ИмяОбъекта], ПараметрыРаспределенияЗатратЭтапа, ТекущиеДанныеИдентификатор);
//	Возврат ПараметрыФормы;
//	
//КонецФункции

//&НаКлиенте
//Процедура ЗаполнитьПолучателяПоУмолчанию(ТекущиеДанные, ПризнакВыполнения = Ложь)
//	
//	НастройкиЗаполнения = Новый Соответствие;
//	НастройкиЗаполнения.Вставить("ТипНоменклатуры", Новый Соответствие);
//	
//	НастройкиТипНоменклатура = НастройкиЗаполнения.Получить("ТипНоменклатуры");
//	
//	НастройкиТипНоменклатура.Вставить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа") ,
//		ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка"));
//	
//	Если Не ИспользоватьНесколькоСкладов Тогда
//		НастройкиТипНоменклатура.Вставить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар")              , СкладПоУмолчанию);
//		НастройкиТипНоменклатура.Вставить(ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара") , СкладПоУмолчанию);
//	КонецЕсли;	
//	
//	ПроизводствоКлиентСервер.ЗаполнитьЗначениеРеквизита(ТекущиеДанные, "Получатель", НастройкиЗаполнения, Истина, ПризнакВыполнения); 
//	
//КонецПроцедуры

//&НаСервереБезКонтекста
//Процедура АналитикаРасходовПолучениеДанныхВыбора(ДанныеВыбора, Текст)
//	
//	ДанныеВыбора = Новый СписокЗначений;
//	ПродажиСервер.ЗаполнитьДанныеВыбораАналитикиРасходов(ДанныеВыбора, Текст);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СтатьяРасходовВыбор(ИмяОбъекта, ИмяТаблицы)
//	
//	ДополнительныеПараметры = Новый Структура;
//	ДополнительныеПараметры.Вставить("ИдентификаторСтроки" , Элементы[ИмяТаблицы].ТекущаяСтрока);
//	ДополнительныеПараметры.Вставить("ИмяОбъекта"          , ИмяОбъекта);
//	ДополнительныеПараметры.Вставить("ИмяТаблицы"          , ИмяТаблицы);
//	
//	ОписаниеОповещения = Новый ОписаниеОповещения("СтатьяРасходовВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
//	
//	ПараметрыВыбораСтатьи = Новый Массив;
//	ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("ДополнитьСтатьямиРасходов", Истина));
//	ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("ДополнитьСтатьямиАктивовПассивов", Истина));
//	
//	ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("Отбор.ХозяйственнаяОперация",
//								   ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию")));
//	
//	МассивВариантов = Новый Массив;
//	МассивВариантов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НаНаправленияДеятельности"));
//	МассивВариантов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НаРасходыБудущихПериодов"));
//	МассивВариантов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты"));
//	МассивВариантов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НаВнеоборотныеАктивы"));
//	МассивВариантов.Добавить(ПредопределенноеЗначение("Перечисление.ВариантыРаспределенияРасходов.НеРаспределять"));
//	
//	ПараметрыВыбораСтатьи.Добавить(Новый ПараметрВыбора("Отбор.ВариантРаспределенияРасходов", Новый ФиксированныйМассив(МассивВариантов)));
//	
//	ПараметрыФормы = Новый Структура;
//	ПараметрыФормы.Вставить("Статья"          , Элементы[ИмяТаблицы].ТекущиеДанные.СтатьяРасходов);
//	ПараметрыФормы.Вставить("ПараметрыВыбора" , Новый ФиксированныйМассив(ПараметрыВыбораСтатьи));
//	
//	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтатьи", ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура СтатьяРасходовВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт
//	
//	Если Результат = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	ИмяОбъекта = ДополнительныеПараметры.ИмяОбъекта;
//	ИмяТаблицы = ДополнительныеПараметры.ИмяТаблицы;
//	ИмяТЧ      = ?(СтрНачинаетсяС(ИмяТаблицы, ИмяОбъекта), 
//					Сред(ИмяТаблицы, СтрДлина(ИмяОбъекта) + 1),
//					ИмяТаблицы);
//	
//	Строка = ЭтаФорма[ИмяОбъекта][ИмяТЧ].НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);       
//	Строка.СтатьяРасходов = Результат;
//	
//	СтатьяРасходовПриИзмененииСервер(ИмяОбъекта, ИмяТаблицы, КэшированныеЗначения);
//	
//КонецПроцедуры

//&НаСервере
//Процедура СтатьяРасходовПриИзмененииСервер(ИмяОбъекта, ИмяТаблицы, КэшированныеЗначения)
//	
//	СтруктураДействий = Новый Структура;
//	
//	ИмяТЧ = ?(СтрНачинаетсяС(ИмяТаблицы, ИмяОбъекта), 
//				Сред(ИмяТаблицы, СтрДлина(ИмяОбъекта) + 1), 
//				ИмяТаблицы);
//				
//	СтрокаТаблицы = ЭтаФорма[ИмяОбъекта][ИмяТЧ].НайтиПоИдентификатору(Элементы[ИмяТаблицы].ТекущаяСтрока);
//	
//	Если ТипЗнч(СтрокаТаблицы.СтатьяРасходов) = Тип("ПланВидовХарактеристикСсылка.СтатьиАктивовПассивов") Тогда
//		
//		ДоходыИРасходыСервер.СтатьяАктивовПассивовПриИзменении(Объект, СтрокаТаблицы.СтатьяРасходов, СтрокаТаблицы.АналитикаАктивовПассивов);
//		
//		Если ЗначениеЗаполнено(СтрокаТаблицы.АналитикаРасходов) Тогда
//			СтрокаТаблицы.АналитикаРасходов                = Неопределено;
//			СтрокаТаблицы.АналитикаРасходовОбязательна     = Ложь;
//			СтрокаТаблицы.АналитикаРасходовЗаказРеализация = Ложь;
//		КонецЕсли;
//		
//	Иначе
//		
//		ДоходыИРасходыСервер.СтатьяРасходовПриИзменении(Объект, СтрокаТаблицы.СтатьяРасходов, СтрокаТаблицы.АналитикаРасходов);
//		
//		Если ЗначениеЗаполнено(СтрокаТаблицы.АналитикаАктивовПассивов) Тогда
//			СтрокаТаблицы.АналитикаАктивовПассивов = Неопределено;
//		КонецЕсли;
//		
//		СтруктураДействий.Вставить("ЗаполнитьПризнакАналитикаРасходовОбязательна");
//		СтруктураДействий.Вставить("ЗаполнитьПризнакАналитикаРасходовЗаказРеализация");	
//		
//	КонецЕсли;
//	
//	СтруктураДействий.Вставить("ЗаполнитьТипСтатьи");

//	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, КэшированныеЗначения);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОповеститьОбОкончанииЗаполненияПолучателей()
//		
//	ПоказатьОповещениеПользователя(
//		НСтр("ru = 'Получатель заполнен'"),
//		,
//		НСтр("ru='Для выделенных строк получатель установлен'"),
//		БиблиотекаКартинок.Информация32);
//		
//КонецПроцедуры

//#КонецОбласти

//&НаСервере
//Процедура УстановитьУсловноеОформление()
//	
//	УсловноеОформление.Элементы.Очистить();
//	
//	Элемент = УсловноеОформление.Элементы.Добавить();
//	
//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериалыСтатьяКалькуляции.Имя);
//	
//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.СтатьяКалькуляции.Имя);
//	
//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.УслугиСтатьяКалькуляции.Имя);
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПартионныйУчетВерсии22");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Ложь;
//	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
//	
//	#Область СтандартноеОформление

//	НоменклатураСервер.УстановитьУсловноеОформлениеСерийНоменклатуры(
//		ЭтаФорма, 
//		"СерииВсегдаВТЧТовары", 
//		"МатериалыСерия", 
//		"Объект.Материалы.СтатусУказанияСерий",
//		"Объект.Материалы.ТипНоменклатуры");
//	
//	НоменклатураСервер.УстановитьУсловноеОформлениеНазначенияНоменклатуры(
//		ЭтаФорма,
//		"ПродукцияНазначение",
//		"Объект.Продукция.ТипНоменклатуры");
//	
//	НоменклатураСервер.УстановитьУсловноеОформлениеНазначенияНоменклатуры(
//		ЭтаФорма,
//		"ВозвратныеОтходыНазначение",
//		"Объект.ВозвратныеОтходы.ТипНоменклатуры");
//	
//	ЗаказыСервер.УстановитьОформлениеОтмененнойСтроки(УсловноеОформление,
//		Элементы.Продукция,
//		Элементы.ПродукцияОтменено.Имя,
//		Элементы.ПродукцияПричинаОтмены.Имя);
//	
//	ЗаказыСервер.УстановитьОформлениеОтмененнойСтроки(УсловноеОформление,
//		Элементы.ВозвратныеОтходы,
//		Элементы.ВозвратныеОтходыОтменено.Имя,
//		Элементы.ВозвратныеОтходыПричинаОтмены.Имя);
//	
//	ЗаказыСервер.УстановитьОформлениеОтмененнойСтроки(УсловноеОформление,
//		Элементы.Материалы,
//		Элементы.Материалы.Имя);
//	
//	

//	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма, 
//																   "ПродукцияНоменклатураЕдиницаИзмерения", 
//                                                                   "Объект.Продукция.Упаковка");

//	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма, 
//																   "ВозвратныеОтходыНоменклатураЕдиницаИзмерения", 
//                                                                   "Объект.ВозвратныеОтходы.Упаковка");

//	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма, 
//																   "МатериалыНоменклатураЕдиницаИзмерения", 
//                                                                   "Объект.Материалы.Упаковка");

//	ОбщегоНазначенияУТ.УстановитьУсловноеОформлениеПриоритета(ЭтаФорма);

//	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
//		ЭтаФорма, 
//		"РедактированиеЭтаповОбеспечениеМатериаламиИРаботамиХарактеристика",
//		"РедактированиеЭтапов.ОбеспечениеМатериаламиИРаботами.ХарактеристикиИспользуются");

//	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
//		ЭтаФорма, 
//		"МатериалыХарактеристика",
//		"Объект.Материалы.ХарактеристикиИспользуются");

//	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
//		ЭтаФорма, 
//		"ПродукцияХарактеристика",
//		"Объект.Продукция.ХарактеристикиИспользуются");

//	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
//		ЭтаФорма, 
//		"ВозвратныеОтходыХарактеристика",
//		"Объект.ВозвратныеОтходы.ХарактеристикиИспользуются");

//	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
//		ЭтаФорма, 
//		"УслугиХарактеристика",
//		"Объект.Услуги.ХарактеристикиИспользуются");

//	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(
//		ЭтаФорма,
//		"Характеристика",
//		"ХарактеристикиИспользуются");
//		
//	Ценообразование.УстановитьУсловноеОформлениеВидовЦен(
//		ЭтаФорма, 
//		"МатериалыВидЦены", 
//        "Объект.Материалы.ВидЦены");

//	Ценообразование.УстановитьУсловноеОформлениеВидовЦен(
//		ЭтаФорма, 
//		"ВозвратныеОтходыВидЦены", 
//        "Объект.ВозвратныеОтходы.ВидЦены");
//														 
//	ОбщегоНазначенияУТ.УстановитьСнятьОтметкуНезаполненного(УсловноеОформление,
//		"ДатаОтгрузки", "ДатаОтгрузки", "ДатаОтгрузкиОбязательна");
//	
//	ОбщегоНазначенияУТ.УстановитьСнятьОтметкуНезаполненного(УсловноеОформление,
//		"МатериалыДатаОтгрузки", "Материалы.ДатаОтгрузки", "Материалы.ДатаОтгрузкиОбязательна");
//	
//	ОбщегоНазначенияУТ.УстановитьСнятьОтметкуНезаполненного(УсловноеОформление,
//		"МатериалыСклад", "Материалы.Склад", "Материалы.СкладОбязателен");
//	
//	СтатусыЧерновик = Новый СписокЗначений;
//	СтатусыЧерновик.Добавить(Перечисления.СтатусыЗаказовПереработчикам.НеСогласован);
//	
//	ОбеспечениеСервер.УстановитьСнятьОтметкуНезаполненногоПоСтатусу(УсловноеОформление,
//		"Подразделение", "Подразделение", "", СтатусыЧерновик);
//	
//	ОбеспечениеСервер.УстановитьСнятьОтметкуНезаполненногоПоСтатусу(УсловноеОформление,
//		"ДатаПоступления", "ДатаПоступления", "", СтатусыЧерновик);
//	
//	ОбеспечениеСервер.УстановитьСнятьОтметкуНезаполненногоПоСтатусу(УсловноеОформление,
//		"ПродукцияДатаПоступления", "ДатаПоступления", "Продукция", СтатусыЧерновик);
//	
//	ОбеспечениеСервер.УстановитьСнятьОтметкуНезаполненногоПоСтатусу(УсловноеОформление,
//		"ВозвратныеОтходыДатаПоступления", "ДатаПоступления", "ВозвратныеОтходы", СтатусыЧерновик);
//	
//	#КонецОбласти
//	
//	// ЦветГиперссылки для поля ГруппаЗатрат
//#Область ЦветГиперссылки
//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.УслугиГруппаЗатрат.Имя);
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПереработкаПоЗаказу");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Истина;
//	
//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветГиперссылки);																 
//#КонецОбласти

//	// Текст <продукция не выбрана> в поле ГруппаЗатрат
//#Область ТекстПродукцияНеВыбрана
//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВозвратныеОтходыГруппаЗатрат.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВозвратныеОтходы.НомерГруппыЗатрат");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = 0;
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ГруппировкаЗатрат");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции;

//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
//	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<продукция не выбрана>'"));
//	
//	//
//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериалыГруппаЗатрат.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Материалы.НомерГруппыЗатрат");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = 0;
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ГруппировкаЗатрат");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции;

//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
//	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<продукция не выбрана>'"));
//	
//	//
//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.УслугиГруппаЗатрат.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Услуги.НомерГруппыЗатрат");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = 0;
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ГруппировкаЗатрат");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции;

//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
//	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<продукция не выбрана>'"));
//#КонецОбласти

//	// Только просмотр СуммыНДС, если СтавкаНДС = БезНДС или НДС0%
//#Область УслугиСуммаНДС_ТолькоПросмотр
//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.УслугиСуммаНДС.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Услуги.СтавкаНДС");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
//	СписокЗначений = Новый СписокЗначений;
//	СписокЗначений.Добавить(Перечисления.СтавкиНДС.БезНДС);
//	СписокЗначений.Добавить(Перечисления.СтавкиНДС.НДС0);
//	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

//	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
//#КонецОбласти

//	#Область ПродукцияСпецификация_ОтметкаНеЗаполненного
//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродукцияСпецификация.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ГруппировкаЗатрат");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции;

//	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНеЗаполненного", Ложь);
//	#КонецОбласти
//	
//	
//	#Область Продукция
//	
//	#Область Продукция_ДоляСтоимости
//	
//	// Установка оформления процента
//	ПроизводствоСервер.УстановитьУсловноеОформлениеПоляДоляСтоимостиПроцент(ЭтаФорма, "Объект", "Продукция");
//	ПроизводствоСервер.УстановитьУсловноеОформлениеПоляДоляСтоимостиОтмененныхСтрок(ЭтаФорма, "Объект", "Продукция");
//	
//	// Установка видимости колонки Доля стоимости по группировке затрат
//	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
//	
//	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродукцияДоляСтоимости.Имя);
//	
//	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродукцияДоляСтоимостиПроцент.Имя);
//	
//	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродукцияЕстьОшибкиЗаполненияДолиСтоимости.Имя);
//	
//	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ГруппировкаЗатрат");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
//	
//	СписокЗначений = Новый СписокЗначений;
//	СписокЗначений.Добавить(Перечисления.ГруппировкиЗатратВЗаказеПереработчику.ПоПродукции);
//	
//	ОтборЭлемента.ПравоеЗначение = СписокЗначений;
//	
//	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
//	
//	#КонецОбласти
//	
//	#Область Продукция_СписаниеНаРасходы
//	
//	// оформление статей и аналитики расходов
//	
//	ТипСтатьиПоУмолчанию = 1;// Оформление статьи по умолчанию
//	
//	ТипыСтатей = Новый Массив;
//	ТипыСтатей.Добавить(1); // Статьи расходов
//	ТипыСтатей.Добавить(3); // Статьи активов/пассивов
//	ДоходыИРасходыСервер.УстановитьУсловноеОформлениеАналитикПриСовместномИспользованииСтатей(
//		ЭтаФорма, "Продукция", ТипыСтатей, ТипСтатьиПоУмолчанию);
//	
//	ПланыВидовХарактеристик.СтатьиРасходов.УстановитьУсловноеОформлениеАналитик(
//		УсловноеОформление, Новый Структура("Продукция"));
//	
//	УстановитьУсловноеОформлениеСписатьНаРасходы("Объект",, "Продукция");
//	
//	#КонецОбласти
//	
//	#Область Продукция_Получатель
//	
//	УстановитьУсловноеОформлениеПолучатель("Объект",, "Продукция");
//	
//	#КонецОбласти
//	
//	#КонецОбласти
//	
//	#Область ВозвратныеОтходы
//	
//	#Область ВозвратныеОтходы_СписаниеНаРасходы
//	
//	// оформление статей и аналитики расходов
//	
//	ТипСтатьиПоУмолчанию = 1;// Оформление статьи по умолчанию
//	
//	ТипыСтатей = Новый Массив;
//	ТипыСтатей.Добавить(1); // Статьи расходов
//	ТипыСтатей.Добавить(3); // Статьи активов/пассивов
//	ДоходыИРасходыСервер.УстановитьУсловноеОформлениеАналитикПриСовместномИспользованииСтатей(
//		ЭтаФорма, "ВозвратныеОтходы", ТипыСтатей, ТипСтатьиПоУмолчанию);
//	
//	ПланыВидовХарактеристик.СтатьиРасходов.УстановитьУсловноеОформлениеАналитик(
//		УсловноеОформление, Новый Структура("ВозвратныеОтходы"));
//	
//	УстановитьУсловноеОформлениеСписатьНаРасходы("Объект",, "ВозвратныеОтходы");
//	
//	#КонецОбласти
//	
//	#Область ВозвратныеОтходы_Получатель
//	
//	УстановитьУсловноеОформлениеПолучатель("Объект",, "ВозвратныеОтходы");
//	
//	#КонецОбласти
//	
//	#КонецОбласти
//	
//	#Область Прочее

//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Состояние.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СостояниеПросрочено");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Истина;

//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныйДокумент);

//	//
//	
//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Состояние.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Состояние");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Перечисления.СостоянияЗаказовПереработчикам.Закрыт;

//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЗакрытыйДокумент);

//	//
//	
//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродукцияДатаПоступления.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Продукция.Отменено");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Истина;
//	
//	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
//	
//	//
//	
//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВозвратныеОтходыДатаПоступления.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВозвратныеОтходы.Отменено");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Истина;
//	
//	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
//	
//	//

//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериалыЦена.Имя);

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериалыСумма.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Материалы.ВидЦены");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
//	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

//	//

//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВозвратныеОтходыЦена.Имя);

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВозвратныеОтходыСумма.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВозвратныеОтходы.ВидЦены");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
//	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

//	//

//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДатаПоступления1.Имя);

//	ГруппаОтбора1 = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
//	ГруппаОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

//	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Статус");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
//	СписокЗначений = Новый СписокЗначений;
//	СписокЗначений.Добавить(Перечисления.СтатусыЗаказовПереработчикам.КОбеспечению);
//	СписокЗначений.Добавить(Перечисления.СтатусыЗаказовПереработчикам.КИсполнению);
//	СписокЗначений.Добавить(Перечисления.СтатусыЗаказовПереработчикам.Закрыт);
//	ОтборЭлемента.ПравоеЗначение = СписокЗначений;

//	ОтборЭлемента = ГруппаОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ДатаПоступления");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
//	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

//	//

//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериалыСклад.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СкладОтгрузкиГруппа");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Ложь;

//	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

//	//

//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.МатериалыСклад.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Материалы.Склад");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Материалы.Отменено");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Ложь;

//	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);

//	//

//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродукцияОтменено.Имя);

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродукцияПричинаОтмены.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИспользоватьПричиныОтменыЗаказовПоставщикам");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Ложь;

//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.SpecialTextColor);
//	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

//	//

//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВозвратныеОтходыОтменено.Имя);

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВозвратныеОтходыПричинаОтмены.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИспользоватьПричиныОтменыЗаказовПоставщикам");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Ложь;

//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.SpecialTextColor);
//	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

//	//

//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПродукцияОтмененоПричиныОтменыНеИспользуются.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИспользоватьПричиныОтменыЗаказовПоставщикам");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Истина;

//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.FieldSelectionBackColor);
//	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
//	
//	//

//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВозвратныеОтходыОтмененоПричиныОтменыНеИспользуются.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИспользоватьПричиныОтменыЗаказовПоставщикам");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Истина;

//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.FieldSelectionBackColor);
//	Элемент.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

//	//
//	
//	Элемент = УсловноеОформление.Элементы.Добавить();
//	
//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Номенклатура.Имя);
//	
//	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
//	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
//	
//	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПроверятьУказаниеРаботы");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Ложь;
//	
//	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Номенклатура");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
//	
//	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
//	
//	//
//	
//	Элемент = УсловноеОформление.Элементы.Добавить();
//	
//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.УслугиНоменклатура.Имя);
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПроверятьУказаниеРаботы");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Ложь;
//	
//	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
//	
//	//
//	
//	НаправленияДеятельностиСервер.УстановитьУсловноеОформлениеНаправленияДеятельности(ЭтаФорма);

//	//

//	Элемент = УсловноеОформление.Элементы.Добавить();
//	
//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Подразделение.Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Статус");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Перечисления.СтатусыЗаказовПереработчикам.НеСогласован;
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ПереработкаПоЗаказу");
//	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Ложь;
//	
//	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
//#КонецОбласти
//	
//КонецПроцедуры

//&НаСервере
//Процедура УстановитьУсловноеОформлениеСписатьНаРасходы(ИмяОбъекта, ПрефиксТЧ = "", ИмяТЧ)
//	
//	// только просмотр, поясняющая надпись, если товар

//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ПрефиксТЧ + ИмяТЧ + "СписатьНаРасходы"].Имя);

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ПрефиксТЧ + ИмяТЧ + "СтатьяРасходов"].Имя);

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ПрефиксТЧ + ИмяТЧ + "АналитикаРасходов"].Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".ТипНоменклатуры");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
//	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыНоменклатуры.Работа;

//	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр" , Истина);
//	Элемент.Оформление.УстановитьЗначениеПараметра("Текст"          , НСтр("ru = '<для работ>'"));
//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста"     , ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
//	
//	
//	// отметка незаполненного статьи расходов, если списываем на расходы

//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ПрефиксТЧ + ИмяТЧ + "СтатьяРасходов"].Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".СписатьНаРасходы");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Истина;

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".СтатьяРасходов");
//	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеЗаполнено;

//	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного" , Истина);
//	
//	
//	// только просмотр статьи расходов, если не списываем на расходы
//	
//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ПрефиксТЧ + ИмяТЧ + "СтатьяРасходов"].Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".СписатьНаРасходы");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Ложь;

//	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр" , Истина);
//	

//	// поясняющая надпись, если работа и на расходы не списываем

//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ПрефиксТЧ + ИмяТЧ + "АналитикаРасходов"].Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".ТипНоменклатуры");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыНоменклатуры.Работа;

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".СписатьНаРасходы");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Ложь;
//	
//	Элемент.Оформление.УстановитьЗначениеПараметра("Текст"      , НСтр("ru = '<при списании на расходы>'"));
//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста" , ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
//	

//	// текст аналитики расходов, если статья не выбрана
//	
//	Элемент = УсловноеОформление.Элементы.Добавить();
//	
//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ПрефиксТЧ + ИмяТЧ + "АналитикаРасходов"].Имя);
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".СписатьНаРасходы");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Истина;
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".СтатьяРасходов");
//	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеЗаполнено;
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".АналитикаРасходов");
//	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеЗаполнено;
//	
//	Элемент.Оформление.УстановитьЗначениеПараметра("Текст"      , НСтр("ru = '<выберите статью расходов>'"));
//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста" , ЦветаСтиля.НезаполненноеПолеТаблицы);
//	
//	
//	// аналитика расходов "Только просмотр", если не заполнена статья расходов
//	
//	Элемент = УсловноеОформление.Элементы.Добавить();

//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ПрефиксТЧ + ИмяТЧ + "АналитикаРасходов"].Имя);
//	
//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ПрефиксТЧ + ИмяТЧ + "АналитикаАктивовПассивов"].Имя);

//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".СтатьяРасходов");
//	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеЗаполнено;
//	
//	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр" , Истина);

//	
//	// назначение не указывается при списании на расходы
//	
//	Элемент = УсловноеОформление.Элементы.Добавить();
//	
//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ПрефиксТЧ + ИмяТЧ + "Назначение"].Имя);
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".СписатьНаРасходы");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Истина;
//	
//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста"     , ЦветаСтиля.НезаполненноеПолеТаблицы);
//	Элемент.Оформление.УстановитьЗначениеПараметра("Текст"          , НСтр("ru = '<не используется при списании на расходы>'"));
//	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр" , Истина);
//	
//КонецПроцедуры

//&НаСервере
//Процедура УстановитьУсловноеОформлениеПолучатель(ИмяОбъекта, ПрефиксТЧ = "", ИмяТЧ)
//	
//	// Получатель при установленном флаге списать на расходы с типом работа
//	Элемент = УсловноеОформление.Элементы.Добавить();
//	
//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ПрефиксТЧ + ИмяТЧ + "Получатель"].Имя);
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".СписатьНаРасходы");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Истина;
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".ТипНоменклатуры");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыНоменклатуры.Работа;
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".Получатель");
//	ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.НеЗаполнено;
//	
//	Элемент.Оформление.УстановитьЗначениеПараметра("Текст"      , Новый ПолеКомпоновкиДанных("Объект.Подразделение"));
//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста" , ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
//	
//	
//	// Получатель при снятом флаге списать на расходы с типом работа
//	Элемент = УсловноеОформление.Элементы.Добавить();
//	
//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ПрефиксТЧ + ИмяТЧ + "Получатель"].Имя);
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".СписатьНаРасходы");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Ложь;
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".ТипНоменклатуры");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыНоменклатуры.Работа;
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".Получатель");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".Отменено");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Ложь;
//	
//	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
//	
//	
//	// Получатель с типом товары / многооборотная тара
//	Элемент = УсловноеОформление.Элементы.Добавить();
//	
//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ПрефиксТЧ + ИмяТЧ + "Получатель"].Имя);
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".ТипНоменклатуры");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
//	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыНоменклатуры.Работа;
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".Получатель");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИспользоватьНесколькоСкладов");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Истина;
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".Отменено");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Ложь;
//	                             	
//	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
//	
//	
//	// Несколько складов не используются для типов товары / многооборотная тара
//	Элемент = УсловноеОформление.Элементы.Добавить();
//	
//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ПрефиксТЧ + ИмяТЧ + "Получатель"].Имя);
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".СписатьНаРасходы");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Ложь;
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".ТипНоменклатуры");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
//	ОтборЭлемента.ПравоеЗначение = Перечисления.ТипыНоменклатуры.Работа;
//	
//	Отбор = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	Отбор.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИспользоватьНесколькоСкладов");
//	Отбор.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//	Отбор.ПравоеЗначение = Ложь;
//	
//	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста"            , ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
//	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного" , Ложь);
//	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр"        , Истина);
//	
//	Элемент = УсловноеОформление.Элементы.Добавить();
//	
//	
//	// Отмененные строки
//	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
//	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы[ПрефиксТЧ + ИмяТЧ + "Получатель"].Имя);
//	
//	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ИмяОбъекта + "." + ИмяТЧ + ".Отменено");
//	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
//	ОтборЭлемента.ПравоеЗначение = Истина;
//	
//	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
//	
//КонецПроцедуры


//// Процедура устанавливает свойства реквизитов в зависимости от значений функциональных опции, например, видимость.
////
//&НаКлиентеНаСервереБезКонтекста
//Процедура НастроитьЭлементыФормыПоФункциональнымОпциям(Форма)
//	
//	Элементы = Форма.Элементы;
//	
//	// ИспользоватьНесколькоСкладов
//	Если Не форма.ИспользоватьНесколькоСкладов Тогда
//		Элементы.ПродукцияПолучатель.Заголовок        = НСтр("ru = 'Подразделение'");
//		Элементы.ВозвратныеОтходыПолучатель.Заголовок = НСтр("ru = 'Подразделение'");
//	КонецЕсли;	
//	
//КонецПроцедуры	

//#Область Инициализация

//ОтветПередЗаписью = Ложь;

//#КонецОбласти
