
// Обработчик события ТекстВопросаПередЗаписьюПервогоАдминистратора вызывается
// из формы пользователя в обработчике перед записью,
// чтобы изменить текст вопроса пользователю,
// например, для подсистемы УправлениеДоступом.
//  Вызов происходит, если установлен ЗапретРедактированияРолей
// и количество пользователей информационной базы равно нулю.
// 
Процедура ТекстВопросаПередЗаписьюПервогоАдминистратора(ТекстВопроса) Экспорт
	
	ТекстВопроса = НСтр("ru = 'Первый пользователь информационной базы должен иметь полные права.
	                          |Пользователь будет добавлен в группу доступа Администраторы. Продолжить?'");
	
КонецПроцедуры


Процедура ПередЗавершениемРаботыСистемыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	////ASP+
	//Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
	//	ASP_ЗавершитьРаботуСистемы = Истина;
	//	ЗавершитьРаботуСистемы();
	//КонецЕсли;
	////ASP-

КонецПроцедуры