// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// См. ИнтеграцияСМаркетплейсамиСИ.ПараметрыСервисаМаркетплейсы
Процедура ПараметрыСервисаМаркетплейсы(ПараметрыФормы) Экспорт
	ИнтеграцияСМаркетплейсамиСИ.ПараметрыСервисаМаркетплейсы(ПараметрыФормы);
КонецПроцедуры

// Расшифровать токен JWT.
// 
// Параметры:
//  Токен - Строка - Токен
// 
// Возвращаемое значение:
//  См. ИнтеграцияСМаркетплейсамиСИ.РасшифроватьТокенJWT
Функция РасшифроватьТокенJWT(Токен) Экспорт
	Возврат ИнтеграцияСМаркетплейсамиСИ.РасшифроватьТокенJWT(Токен);
КонецФункции

// Прочитать данные из безопасного хранилища.
// 
// Параметры:
//  ВидМаркетплейса - Строка, ПеречислениеСсылка.ВидыМаркетплейсов - Вид маркетплейса
//  Ключ - Строка - Ключ
// 
// Возвращаемое значение:
//  См. ИнтеграцияСМаркетплейсамиСИ.ПрочитатьДанныеИзБезопасногоХранилища
Функция ПрочитатьДанныеИзБезопасногоХранилища(ВидМаркетплейса = "", Ключ = "") Экспорт
	Возврат ИнтеграцияСМаркетплейсамиСИ.ПрочитатьДанныеИзБезопасногоХранилища(ВидМаркетплейса, Ключ);
КонецФункции

// Данные аутентификации ИТС.
// 
// Возвращаемое значение:
//  См. ИнтеграцияСМаркетплейсамиСИ.ДанныеАутентификацииИТС.
Функция ДанныеАутентификацииИТС() Экспорт
	Возврат ИнтеграцияСМаркетплейсамиСИ.ДанныеАутентификацииИТС();
КонецФункции

#КонецОбласти
