#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ФОРМЫ

// Функция формирует печатную форму документа.
//
// Параметры:
// Тип - Строка - тип печатной формы: Заказ или Счет
// МассивОбъектов - Массив - массив документов для печати
// ОбъектыПечати - СписокЗначений
//
// Возвращаемое значение:
// ТабличныйДокумент
//
Функция СформироватьПечатнуюФорму(Тип, МассивОбъектов, ОбъектыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаУслуги.Ссылка КАК Ссылка,
	|	ЗаявкаНаУслуги.Номер,
	|	ЗаявкаНаУслуги.Дата,
	|	ЗаявкаНаУслуги.ПроцентЗаСрочность,
	|	ЗаявкаНаУслуги.СуммаЗаСрочность,
	|	ЗаявкаНаУслуги.ПроцентЗаСложность,
	|	ЗаявкаНаУслуги.СуммаЗаСложность,
	|	ЗаявкаНаУслуги.ПланируемаяДатаВыполнения,
	|	ЗаявкаНаУслуги.СуммаУслуги,
	|	ЗаявкаНаУслуги.Услуга.НаименованиеПолное КАК ПредставлениеУслуги,
	|	ЗаявкаНаУслуги.Адрес,
	|	ЗаявкаНаУслуги.Ответственный.Наименование КАК ОтвЛицо,
	|	ЗаявкаНаУслуги.Организация,
	|	ЗаявкаНаУслуги.Контрагент,
	|	ЗаявкаНаУслуги.Организация.Префикс КАК Префикс,
	|	ЗаявкаНаУслуги.Товары.(
	|		НомерСтроки,
	|		Номенклатура.НаименованиеПолное КАК Номенклатура,
	|		КоличествоУпаковок КАК Количество,
	|		ВЫБОР
	|			КОГДА ЗаявкаНаУслуги.Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				ТОГДА ПРЕДСТАВЛЕНИЕ(ЗаявкаНаУслуги.Товары.Номенклатура.ЕдиницаИзмерения)
	|			ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ЗаявкаНаУслуги.Товары.Упаковка.ЕдиницаИзмерения)
	|		КОНЕЦ КАК ЕдиницаИзмерения,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ЗаявкаНаУслуги КАК ЗаявкаНаУслуги
	|ГДЕ
	|	ЗаявкаНаУслуги.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	ДанныеПечати = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	КолонкаКодов   = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	
	Макет = Документы.ЗаявкаНаУслуги.ПолучитьМакет("Заявка");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Пока ДанныеПечати.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Заявка";
		
		ПараметрыШапки = Новый Структура;
		
		ПараметрыШапки.Вставить("ТекстЗаголовка", "Заявка на получение услуг № " + ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер) + " от " + Формат(ДанныеПечати.Дата, "ДЛФ=DD"));
		ПараметрыШапки.Вставить("ПредставлениеЗаказчика", ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата), 
																			"ПолноеНаименование,ИНН,КПП,") + ",");
		ПараметрыШапки.Вставить("ПолноеПредставлениеЗаказчика", ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата), 
																			"ПолноеНаименование,ИНН,КПП, ЮридическийАдрес, Банк, БИК, КоррСчет, НомерСчета,"));																		
		ПараметрыШапки.Вставить("ПредставлениеПоставщика", ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Контрагент, ДанныеПечати.Дата), 
																			"ПолноеНаименование,ИНН,КПП, ЮридическийАдрес, Банк, БИК, КоррСчет, НомерСчета,"));																		
		ПараметрыШапки.Вставить("ПредставлениеУслуги", ДанныеПечати.ПредставлениеУслуги);
		ПараметрыШапки.Вставить("Адрес", СокрЛП(ДанныеПечати.Адрес));
		ПараметрыШапки.Вставить("ПланируемаяДатаВыполнения", Формат(ДанныеПечати.ПланируемаяДатаВыполнения, "ДЛФ=DD"));
		СуммаВсего = ДанныеПечати.СуммаУслуги + ДанныеПечати.СуммаЗаСрочность + ДанныеПечати.СуммаЗаСложность;
		ПараметрыШапки.Вставить("СуммаУслугВсего", Формат(СуммаВсего, "ЧЦ=15; ЧДЦ=2"));
		ПараметрыШапки.Вставить("СуммаУслугВсегоПрописью", РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаВсего, Константы.ВалютаУправленческогоУчета.Получить()));
		
		ТаблицаТовары = ДанныеПечати.Товары.Выгрузить();
		ТаблицаТовары.Сортировать("НомерСтроки");
		
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыШапки);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		НомерСтроки = 0;
		
		Для Каждого СтрокаТовары Из ТаблицаТовары Цикл
			
			НомерСтроки = НомерСтроки + 1;
			
			ОбластьСтрока.Параметры.Заполнить(СтрокаТовары);
			ТабличныйДокумент.Вывести(ОбластьСтрока);

		КонецЦикла;
		ОбластьПодвал.Параметры.Ответственный = ДанныеПечати.ОтвЛицо;
		ОбластьПодвал.Параметры.ПредставлениеУслуги = ДанныеПечати.ПредставлениеУслуги;
		ОбластьПодвал.Параметры.СуммаИзделия = Формат(ТаблицаТовары.Итог("Сумма"), "ЧЦ=15; ЧДЦ=2");
		ОбластьПодвал.Параметры.СуммаУслуги = Формат(ДанныеПечати.СуммаУслуги, "ЧЦ=15; ЧДЦ=2");
		ОбластьПодвал.Параметры.СуммаЗаСложность = Формат(ДанныеПечати.СуммаЗаСложность, "ЧЦ=15; ЧДЦ=2");
		ОбластьПодвал.Параметры.СуммаЗаСрочность = Формат(ДанныеПечати.СуммаЗаСрочность, "ЧЦ=15; ЧДЦ=2");
		ОбластьПодвал.Параметры.ПроцентЗаСрочность = ДанныеПечати.ПроцентЗаСрочность;
		ОбластьПодвал.Параметры.СуммаУслугВсего = Формат(СуммаВсего, "ЧЦ=15; ЧДЦ=2");
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;

	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // СформироватьПечатнуюФорму()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Заявка") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Заявка", ПараметрыПечати["Тип"], СформироватьПечатнуюФорму(ПараметрыПечати["Тип"], МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
КонецПроцедуры // Печать()
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

#КонецЕсли
