#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ЕстьУчетнаяЗапись =
		ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыВыполненияКоманды.Источник, "УчетнаяЗапись");
	Если Не ЕстьУчетнаяЗапись Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Не предусмотрено заполнение сведений по товарам из этого источника.'"));
		Возврат;
	КонецЕсли;
	
	Форма = ПараметрыВыполненияКоманды.Источник;
	УчетнаяЗапись = ПараметрыВыполненияКоманды.Источник.УчетнаяЗапись;
	
	ИнтеграцияСМаркетплейсамиКлиент.ОткрытьФормуЗаполненияДанныхЭкземпляров(Форма, УчетнаяЗапись);

КонецПроцедуры

#КонецОбласти
