
&ИзменениеИКонтроль("СпособыДоставкиДоКлиентаСНашимУчастием")
Функция асп_СпособыДоставкиДоКлиентаСНашимУчастием(ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками)

	СпособыДоставки = Новый Массив; // Массив из ПеречислениеСсылка.СпособыДоставки

#Удаление
	СпособыДоставки.Добавить(ПредопределенноеЗначение("Перечисление.СпособыДоставки.ДоКлиента"));
#КонецУдаления
#Вставка
	//ГТС Удаляем до клиента для оформления ТТН клиенту //ASP_Crow 11.03.2026 000029567 В расширени
#КонецВставки
	СпособыДоставки.Добавить(ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу"));
	СпособыДоставки.Добавить(ПредопределенноеЗначение("Перечисление.СпособыДоставки.КПолучателюОпределяетСлужбаДоставки"));

	Если ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками Тогда
		СпособыДоставки.Добавить(ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПеревозчика"));
	КонецЕсли;

	Возврат СпособыДоставки;

КонецФункции
