
&ИзменениеИКонтроль("ВариантОбеспеченияИФлагОбособленноПоУмолчанию")
Функция асп_ВариантОбеспеченияИФлагОбособленноПоУмолчанию(ЗаполнятьОбособленно)

	КОбеспечению   = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.КОбеспечению");
	НеОбеспечивать = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.НеТребуется");
    #Удаление
	Результат = Новый Структура();
	Результат.Вставить("Товар",  Новый Структура("ВариантОбеспечения,Обособленно", КОбеспечению,   Ложь));
	Результат.Вставить("Тара",   Новый Структура("ВариантОбеспечения,Обособленно", КОбеспечению,   Ложь));
	Результат.Вставить("Работа", Новый Структура("ВариантОбеспечения,Обособленно", НеОбеспечивать, Ложь));
	Результат.Вставить("Услуга", Новый Структура("ВариантОбеспечения,Обособленно", НеОбеспечивать, Ложь));
    #КонецУдаления
	#Вставка
	Результат = Новый Структура();
	Результат.Вставить("Товар",  Новый Структура("ВариантОбеспечения,Обособленно", НеОбеспечивать,   Ложь));//ASP_Dante 09/10/19КОбеспечению
	Результат.Вставить("Тара",   Новый Структура("ВариантОбеспечения,Обособленно", НеОбеспечивать,   Ложь));//ASP_Dante 09/10/19КОбеспечению
	Результат.Вставить("Работа", Новый Структура("ВариантОбеспечения,Обособленно", НеОбеспечивать, Ложь));
	Результат.Вставить("Услуга", Новый Структура("ВариантОбеспечения,Обособленно", НеОбеспечивать, Ложь));
	Результат.Вставить("Набор",   Новый Структура("ВариантОбеспечения,Обособленно", КОбеспечению,   Ложь));
	#КонецВставки
	Если ЗаполнятьОбособленно Тогда

		Результат.Товар.Обособленно         = Истина;
		Результат.Работа.Обособленно        = Истина;
		Результат.Работа.ВариантОбеспечения = КОбеспечению;

	КонецЕсли;

	Возврат Результат;

КонецФункции
