
&ИзменениеИКонтроль("ПерезаполнитьВидыЗапасов")
Процедура асп_ПерезаполнитьВидыЗапасов()

	Если Константы.КонтролироватьОстаткиТоваровОрганизаций.Получить() Тогда
		ПараметрыСеанса.ПроводитьБезКонтроляОстатковТоваровОрганизаций = Истина;
	КонецЕсли;

	Завершение = Ложь;
	Итерация = 1;
	Пока Не Завершение Цикл
		#Удаление
		Если Итерация > 50 Тогда
			#КонецУдаления
		#Вставка
		//ASP_Dante 20/09/21	
		Если Итерация > 300 Тогда
			//ASP_Dante 20/09/21
			#КонецВставки
			ТекстИсключения = НСтр("ru = 'Превышен лимит итераций перезаполнения видов запасов'", Метаданные.ОсновнойЯзык.КодЯзыка);
			ЗаписьЖурналаРегистрации(
			ИмяСобытия(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Обработки.ПомощникИсправленияОстатковТоваровОрганизаций,
			,
			ТекстИсключения);
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;

		ЗаполнитьСписокДокументовКПерезаполнению();
		Если ДокументыКПерезаполнению.Количество() = 0 Тогда
			Если СледующаяАналитикаРазвернутогоСальдо() Тогда
				ОчиститьРезервы("ПоАналитике");
				Итерация = 1;
				Продолжить;
			Иначе
				Завершение = Истина;
			КонецЕсли;
		Иначе
			СнятьФлагВидыЗапасовУказаныВручную();
			ПерезаполнитьВидыЗапасовИтерация();
			Итерация = Итерация + 1;
		КонецЕсли;
		ДокументыКПерезаполнению.Очистить();
	КонецЦикла;

КонецПроцедуры
