// Процедура - обработчик события "ОбработкаКоманды".
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ПараметрКоманды) Тогда
	
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Документ.РеализацияТоваровУслуг",
			"Накладная",
			ПараметрКоманды,
			Неопределено,
			Новый Структура("ВывестиКомплектовочныйЛист,ВыводитьКомплектующие", Истина, Истина)
		);
	
	КонецЕсли;

КонецПроцедуры // ОбработкаКоманды()
