#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		ПараметрыНабора = МодульУправлениеСвойствами.СтруктураПараметровНабораСвойств();
		ПараметрыНабора.Используется = Константы.ИспользоватьОповещенияПользователейОСобытиях.Получить();
		
		МодульУправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_ВидыОповещенийПользователей", ПараметрыНабора);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли