#Область СлужебныйПрограммныйИнтерфейс

// Установить режим отображения сообщений.
// 
// Параметры:
//  Обсуждение - см. ОповещенияПользователейОСобытиях.УстановитьРежимОтображенияСообщений.Обсуждение
//  НеБеспокоить - см. ОповещенияПользователейОСобытиях.УстановитьРежимОтображенияСообщений.НеБеспокоить
//  РежимНаблюдения - см. ОповещенияПользователейОСобытиях.УстановитьРежимОтображенияСообщений.РежимНаблюдения
//  Пользователь - см. ОповещенияПользователейОСобытиях.УстановитьРежимОтображенияСообщений.Пользователь
Процедура УстановитьРежимОтображенияСообщений(Обсуждение, НеБеспокоить, РежимНаблюдения = Неопределено, Пользователь = Неопределено) Экспорт
	ОповещенияПользователейОСобытиях.УстановитьРежимОтображенияСообщений(Обсуждение,
		НеБеспокоить,
		РежимНаблюдения,
		Пользователь);
КонецПроцедуры

// Подписаться на оповещение по виду оповещения.
// 
// Параметры:
//  ВидОповещения - СправочникСсылка.ВидыОповещенийПользователей - Вид оповещения
//  Пользователь - Неопределено, СправочникСсылка.Пользователи - Пользователь
Процедура ПодписатьсяНаОповещениеПоВидуОповещения(ВидОповещения, Пользователь = Неопределено) Экспорт
	Если НЕ ОбщегоНазначения.СсылкаСуществует(ВидОповещения) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ОтключенныеНастройкиОповещенийПользователей.СоздатьНаборЗаписей();
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.ВидОповещения = ВидОповещения;
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать(РежимЗамещения.Удаление);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

// Отключить оповещение по виду оповещения.
// 
// Параметры:
//  ВидОповещения - СправочникСсылка.ВидыОповещенийПользователей - Вид оповещения
//  Пользователь - Неопределено, СправочникСсылка.Пользователи - Пользователь
Процедура ОтключитьОповещениеПоВидуОповещения(ВидОповещения, Пользователь = Неопределено) Экспорт
	Если НЕ ОбщегоНазначения.СсылкаСуществует(ВидОповещения) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ОтключенныеНастройкиОповещенийПользователей.СоздатьНаборЗаписей();
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.ВидОповещения = ВидОповещения;
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей.Записать(РежимЗамещения.Замещение);
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

#КонецОбласти

