
// Описание дополнитльеных настроек отчета
// В данной процедуре можно задать описания варинатов отчетов, опредлить дополнительные варианты,
// определить дополнительные разделы варианта отчета
//
Процедура НастройкиОтчета(Настройки) Экспорт

	//Описание вариантов отчетов
	ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "ВоронкаПродаж", "");
	ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "СоставВыполненияЭтапов", "");
	ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "ПотериПоЭтапам", "");
	ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "ВероятностныйПрогноз", "");
	ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "АнализПартнера", "");
	ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "АнализОтветственного", "");
	ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "АнализВидаСделки", "");
	ВариантыОтчетов.УстановитьОписаниеВариантаВДопНастройках(Настройки, "СредниеСрокиИсполнения", "");

	//Дополнительные подсистемы
	//ВариантыОтчетов.ДобавитьПодсистемуВариантаВДопНастройках(Настройки, "Ключварианта", "Подсистема\ПодчиненнаяПодсистема");
	//ВариантыОтчетов.УдалитьПодсистемуВариантаВДопНастройках(Настройки, "Ключварианта", "Подсистема\ПодчиненнаяПодсистема");

КонецПроцедуры
