

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ЗначениеПараметра = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Сегмент");
	СписокПартнеров = Новый СписокЗначений;
	СписокПартнеров.ЗагрузитьЗначения(СегментыСервер.МассивЭлементов(ЗначениеПараметра.Значение));
	Если СписокПартнеров.Количество() > 0 тогда
		КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек, "Партнер", СписокПартнеров, ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВидСделки",     КомпоновкаДанныхКлиентСервер.ПолеИспользуется(КомпоновщикНастроек.ПолучитьНастройки(), "ВидСделки"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Ответственный", КомпоновкаДанныхКлиентСервер.ПолеИспользуется(КомпоновщикНастроек.ПолучитьНастройки(), "Ответственный"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Партнер",       КомпоновкаДанныхКлиентСервер.ПолеИспользуется(КомпоновщикНастроек.ПолучитьНастройки(), "Партнер") ИЛИ СписокПартнеров.Количество() > 0);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Этап",          КомпоновкаДанныхКлиентСервер.ПолеИспользуется(КомпоновщикНастроек.ПолучитьНастройки(), "Этап"));
	                                     
	ВнешнийНаборДанных = ПолучитьВнешнийНаборДанных();
	СделкиСервер.СформироватьОтчет(ДокументРезультат, ДанныеРасшифровки, ЭтотОбъект, СтандартнаяОбработка, ВнешнийНаборДанных);

КонецПроцедуры

Функция ПолучитьВнешнийНаборДанных()
	
	ВнешнияНаборДанных = Новый Структура("ДанныеОВероятности, ДанныеРасшифровки");
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Этап");
	ТаблицаДанных.Колонки.Добавить("Вероятность");
	ТаблицаДанных.Колонки.Добавить("ВероятностьВыигрыша");
	
	ТаблицаДанныхРасшифровки = Новый ТаблицаЗначений;
	ТаблицаДанныхРасшифровки.Колонки.Добавить("Этап");
	ТаблицаДанныхРасшифровки.Колонки.Добавить("ВидСделки");
	ТаблицаДанныхРасшифровки.Колонки.Добавить("Ответственный");
	ТаблицаДанныхРасшифровки.Колонки.Добавить("Партнер");
	ТаблицаДанныхРасшифровки.Колонки.Добавить("Сделка");
	ТаблицаДанныхРасшифровки.Колонки.Добавить("СтатусСделки");
	ТаблицаДанныхРасшифровки.Колонки.Добавить("СтатусСделкиНаЭтапе");
	ТаблицаДанныхРасшифровки.Колонки.Добавить("КолВоСделок");
	ТаблицаДанныхРасшифровки.Колонки.Добавить("Потенциал");
	
	
	ПодключитьНаборДанныхРасшифровки = КомпоновкаДанныхКлиентСервер.ПолеИспользуется(КомпоновщикНастроек.ПолучитьНастройки(), "Сделка");
	ПодключитьНаборДанныхРасшифровки = ПодключитьНаборДанныхРасшифровки или КомпоновкаДанныхКлиентСервер.ПолеИспользуется(КомпоновщикНастроек.ПолучитьНастройки(), "СтатусСделкиНаЭтапе");
	ПодключитьНаборДанныхРасшифровки = ПодключитьНаборДанныхРасшифровки или КомпоновкаДанныхКлиентСервер.ПолеИспользуется(КомпоновщикНастроек.ПолучитьНастройки(), "СтатусСделки");
	ПодключитьНаборДанныхРасшифровки = ПодключитьНаборДанныхРасшифровки или КомпоновкаДанныхКлиентСервер.ПолеИспользуется(КомпоновщикНастроек.ПолучитьНастройки(), "КолВоСделок");
	
	Если НЕ ПодключитьНаборДанныхРасшифровки тогда
		
		Если КомпоновкаДанныхКлиентСервер.ПолеИспользуется(КомпоновщикНастроек.ПолучитьНастройки(), "Вероятность") 
		 или КомпоновкаДанныхКлиентСервер.ПолеИспользуется(КомпоновщикНастроек.ПолучитьНастройки(), "ВероятностьВыигрыша") тогда
			
			СКД = ПолучитьМакет("СхемаПолученияДанных");
			
			КомпоновщикНастроекДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
			КомпоновщикНастроекДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
			КомпоновщикНастроекДанных.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
			
			КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(КомпоновщикНастроекДанных.Настройки.Отбор, КомпоновщикНастроек.ПолучитьНастройки().Отбор);
			КомпоновкаДанныхКлиентСервер.ЗаполнитьЭлементы(КомпоновщикНастроекДанных.Настройки.ПараметрыДанных, КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных);
			
			КомпоновщикНастроекДанных.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
			
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, КомпоновщикНастроекДанных.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"), , );
			
			ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
			
			ТаблицаЗначений = Новый ТаблицаЗначений;
			
			//Создадим и инициализируем процессор вывода результата
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
			ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
			
			//Обозначим начало вывода
			ПроцессорВывода.Вывести(ПроцессорКомпоновки, истина);
			Вероятность = 1;
			
			Для каждого СтрокаДанных из ТаблицаЗначений Цикл
			    СтрокаВероятности = ТаблицаДанных.Добавить();
				СтрокаВероятности.Этап = СтрокаДанных.Этап;
				Вероятность = Вероятность * СтрокаДанных.КолВоВыиграных / (СтрокаДанных.КолВоВыиграных + СтрокаДанных.КолВоПроигранных);
				СтрокаВероятности.Вероятность = Вероятность*100;
				Индекс = ТаблицаЗначений.Индекс(СтрокаДанных);
				ВероятностьВыигрыша = 1;
				Для сч = индекс по ТаблицаЗначений.Количество()-1 Цикл
					СтрокаДанныхПослед = ТаблицаЗначений[сч];
					Если СтрокаДанныхПослед.КолВоВыиграных + СтрокаДанныхПослед.КолВоПроигранных <> 0 тогда
						ВероятностьВыигрыша = ВероятностьВыигрыша * СтрокаДанныхПослед.КолВоВыиграных / (СтрокаДанныхПослед.КолВоВыиграных + СтрокаДанныхПослед.КолВоПроигранных);
					Иначе
						ВероятностьВыигрыша = 0;
					КонецЕсли;
					СтрокаВероятности.ВероятностьВыигрыша = ВероятностьВыигрыша;
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВидСделки",     Истина);
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Ответственный", Истина);
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Партнер",       Истина);
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Этап",          Истина);

		СКД = ПолучитьМакет("СхемаРасшифровки");
		КомпоновщикНастроекДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроекДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
		КомпоновщикНастроекДанных.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
		
		КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(КомпоновщикНастроекДанных.Настройки.Отбор, КомпоновщикНастроек.Настройки.Отбор);
		КомпоновкаДанныхКлиентСервер.ЗаполнитьЭлементы(КомпоновщикНастроекДанных.Настройки.ПараметрыДанных, КомпоновщикНастроек.Настройки.ПараметрыДанных);
		
		КомпоновщикНастроекДанных.Настройки.Структура.Очистить();
		Группировка = КомпоновкаДанныхКлиентСервер.ДобавитьГруппировку(КомпоновщикНастроекДанных,);
		
		КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроекДанных, "Этап");
		КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроекДанных, "ВидСделки");
		КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроекДанных, "Ответственный");
		КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроекДанных, "Партнер");
		КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроекДанных, "Сделка");
		КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроекДанных, "СтатусСделки");
		КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроекДанных, "СтатусСделкиНаЭтапе");
		КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроекДанных, "КолВоСделок");
		КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроекДанных, "Потенциал");
		
		КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(КомпоновщикНастроекДанных.Настройки.Отбор, КомпоновщикНастроек.ПолучитьНастройки().Отбор);
		КомпоновкаДанныхКлиентСервер.ЗаполнитьЭлементы(КомпоновщикНастроекДанных.Настройки.ПараметрыДанных, КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных);
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, КомпоновщикНастроекДанных.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"), , );
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , , Истина);
		Таблица = Новый ТаблицаЗначений;
		
		//Создадим и инициализируем процессор вывода результата
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(Таблица);
		
		//Обозначим начало вывода
		ПроцессорВывода.Вывести(ПроцессорКомпоновки, истина);
		
		Для каждого СтрокаСДанными из Таблица Цикл
			СтрокаДанных = ТаблицаДанныхРасшифровки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДанных, СтрокаСДанными);
			СтрокаДанных.КолВоСделок = 1;
		КонецЦикла;
		
	КонецЕсли;
	ВнешнияНаборДанных.ДанныеОВероятности = ТаблицаДанных;
	ВнешнияНаборДанных.ДанныеРасшифровки = ТаблицаДанныхРасшифровки;	
	
	Возврат ВнешнияНаборДанных;
	
КонецФункции
 
Процедура СкопироватьДанныеПоСтроке(ТаблицаДанных, СтрокаДанных, Уровень, УровеньПоляЭтап, СтруктураПолей, МассивГруппировок)
	
	Если Уровень <> УровеньПоляЭтап тогда
		РасчитатьСтроку(СтруктураПолей, СтрокаДанных, УровеньПоляЭтап, Строка(МассивГруппировок[Уровень].Поле));
		ЕстьВложенныеСтроки = ложь;
		Для каждого ВложеннаяСтрока из СтрокаДанных.Строки Цикл
			Если ВложеннаяСтрока.ЭтоПолеДобавленоАвтоматически <> "ЭтоПолеДобавленоАвтоматически" тогда
				ЕстьВложенныеСтроки = истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЕстьВложенныеСтроки тогда
			Для каждого ВложеннаяСтрока из СтрокаДанных.Строки Цикл
				Если ВложеннаяСтрока.ЭтоПолеДобавленоАвтоматически <> "ЭтоПолеДобавленоАвтоматически" тогда
					СкопироватьДанныеПоСтроке(ТаблицаДанных, ВложеннаяСтрока, Уровень+1, УровеньПоляЭтап, СтруктураПолей, МассивГруппировок);
				КонецЕсли;
			КонецЦикла;
		Иначе
			СтрокаДанных = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДанных, СтруктураПолей); 
		КонецЕсли;
	Иначе
		Вероятность         = 1;
		СделокВсего         = 0;
		СделокВыиграных     = 0;
		СделокПроиграно     = 0;
		СделокВРаботе       = 0;
		Потенциал           = 0;
		ПотенциалВыиграный  = 0;
		ПотенциалПроиграный = 0;
		ПотенциалВработе    = 0;
		Продолжительность   = 0;
		
		ПерваяСтрока = истина;
		
		Для каждого СтрокаЭтапа из СтрокаДанных.Строки Цикл
			Если СтрокаЭтапа.ЭтоПолеДобавленоАвтоматически = "ЭтоПолеДобавленоАвтоматически" тогда
				Продолжить;
			КонецЕсли;
			СтруктураПолей.Этап = СтрокаЭтапа.Этап;
			
			Потенциал = Макс(СтрокаЭтапа.ПотенциалВсего, Потенциал);
			ПотенциалВыиграный = СтрокаЭтапа.ПотенциалВыигран;
			ПотенциалВработе   = ПотенциалВработе + СтрокаЭтапа.ПотенциалВРаботе;
			
			Если СтрокаЭтапа.КолВоВсего - СтрокаЭтапа.КолВоВРаботе - СтрокаЭтапа.КолВоПроиграныхНаПредЭтапах <> 0 тогда
				Вероятность = Вероятность * (СтрокаЭтапа.КолВоВсего - СтрокаЭтапа.КолВоНеВыигравших)/(СтрокаЭтапа.КолВоВсего - СтрокаЭтапа.КолВоВРаботе - СтрокаЭтапа.КолВоПроиграныхНаПредЭтапах);
			КонецЕсли;
			СделокВсего     = СтрокаЭтапа.КолВоВсего;
			СделокВыиграных = СтрокаЭтапа.КолВоВсего - СтрокаЭтапа.КолВоНеВыигравших;
			СделокПроиграно = СтрокаЭтапа.КолВоНеВыигравших - СтрокаЭтапа.КолВоВРаботе - СтрокаЭтапа.КолВоПроиграныхНаПредЭтапах;
			СделокВРаботе   = СтрокаЭтапа.КолВоВРаботе;
			
			ВероятностьВыиграша = 1;
			Для каждого СтрокаЭтапаПоследующая из СтрокаДанных.Строки Цикл
 				Если СтрокаЭтапаПоследующая.ЭтоПолеДобавленоАвтоматически = "ЭтоПолеДобавленоАвтоматически" тогда
					Продолжить;
				КонецЕсли;
				Если СтрокаДанных.Строки.Индекс(СтрокаЭтапаПоследующая) < СтрокаДанных.Строки.Индекс(СтрокаЭтапа) тогда
					Продолжить;
				КонецЕсли;
				Если СтрокаЭтапаПоследующая.КолВоВсего - СтрокаЭтапаПоследующая.КолВоВРаботе - СтрокаЭтапаПоследующая.КолВоПроиграныхНаПредЭтапах <> 0 тогда
					ВероятностьВыиграша = ВероятностьВыиграша * (СтрокаЭтапаПоследующая.КолВоВсего - СтрокаЭтапаПоследующая.КолВоНеВыигравших)/(СтрокаЭтапаПоследующая.КолВоВсего - СтрокаЭтапаПоследующая.КолВоВРаботе - СтрокаЭтапаПоследующая.КолВоПроиграныхНаПредЭтапах);
				КонецЕсли;
			КонецЦикла;
			СтруктураПолей["Порядок"]                 = СтрокаЭтапа.Этап.РеквизитДопУпорядочивания;
			СтруктураПолей["ВероятностьЭтап"]         = Вероятность*100;
			СтруктураПолей["ВероятностьВыиграшаЭтап"] = ВероятностьВыиграша*100;
	 		СтруктураПолей["СделокВсегоЭтап"]         = СделокВсего;
	 		СтруктураПолей["СделокВыиграныхЭтап"]     = СделокВыиграных;
	 		СтруктураПолей["СделокПроиграноЭтап"]     = СделокПроиграно;
	 		СтруктураПолей["СделокВРаботеЭтап"]       = СделокВРаботе;
			
			СтруктураПолей["ПотенциалЭтап"]           = Потенциал;
			СтруктураПолей["ПотенциалВыиграныйЭтап"]  = ПотенциалВыиграный;
			СтруктураПолей["ПотенциалПроиграныйЭтап"] = Потенциал - ПотенциалВыиграный - ПотенциалВработе;
			СтруктураПолей["ПотенциалВработеЭтап"]    = СтрокаЭтапа.ПотенциалВРаботе;
			СтруктураПолей["Продолжительность"]       = СтрокаЭтапа.Продолжительность;
		
			Если СтрокаЭтапа.Строки.Количество() = 0 тогда
				СтрокаДанныхТаблицы = ТаблицаДанных.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДанныхТаблицы, СтруктураПолей); 
			Иначе
				СкопироватьДанныеПоСтроке(ТаблицаДанных, СтрокаДанных, Уровень, УровеньПоляЭтап, СтруктураПолей, МассивГруппировок)
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


Процедура РасчитатьСтроку(СтруктураПолей, СтрокаДляРасчета, УровеньПоляЭтап, Группировка = "")
	
	Вероятность           = 1;
	СделокВсего           = 0;
	СделокВыиграных       = 0;
	СделокПроиграно       = 0;
	СделокВРаботе         = 0;
	Потенциал             = 0;
	ПотенциалВыиграный    = 0;
	ПотенциалПроиграный   = 0;
	ПотенциалВработе      = 0;
	ПотенциалВработеСумма = 0;
	Продолжительность     = 0;
	
	ПерваяСтрока = Истина;
	
	Для каждого СтрокаДанных из СтрокаДляРасчета.Строки Цикл
		Если СтрокаДанных.ЭтоПолеДобавленоАвтоматически <> "ЭтоПолеДобавленоАвтоматически" тогда
			Продолжить;
		КонецЕсли;
		Потенциал          = Макс(СтрокаДанных.ПотенциалВсего, Потенциал);
		ПотенциалВыиграный = СтрокаДанных.ПотенциалВыигран;
		ПотенциалВработе   = ПотенциалВработе + СтрокаДанных.ПотенциалВРаботе;
		Продолжительность  = Продолжительность + СтрокаДанных.Продолжительность;
		
		Если СтрокаДанных.КолВоВсего - СтрокаДанных.КолВоВРаботе - СтрокаДанных.КолВоПроиграныхНаПредЭтапах <> 0 и (СтрокаДанных.КолВоВсего - СтрокаДанных.КолВоНеВыигравших)/(СтрокаДанных.КолВоВсего - СтрокаДанных.КолВоВРаботе - СтрокаДанных.КолВоПроиграныхНаПредЭтапах) <> 0  тогда
			Вероятность = Вероятность * (СтрокаДанных.КолВоВсего - СтрокаДанных.КолВоНеВыигравших)/(СтрокаДанных.КолВоВсего - СтрокаДанных.КолВоВРаботе - СтрокаДанных.КолВоПроиграныхНаПредЭтапах);
		КонецЕсли;
		СделокВсего     = СтрокаДанных.КолВоВсего;
		СделокВыиграных = СтрокаДанных.КолВоВсего - СтрокаДанных.КолВоНеВыигравших;
		СделокПроиграно = СтрокаДанных.КолВоНеВыигравших - СтрокаДанных.КолВоВРаботе - СтрокаДанных.КолВоПроиграныхНаПредЭтапах;
		СделокВРаботе   = СтрокаДанных.КолВоВРаботе;
	КонецЦикла;
	
	Если Группировка <> "" тогда
		СтруктураПолей[Группировка] = СтрокаДляРасчета[Группировка];
	КонецЕсли;
	
	СтруктураПолей["Вероятность" + Группировка]         = Вероятность*100;
	СтруктураПолей["ВероятностьВыиграша" + Группировка] = Вероятность*100;
	СтруктураПолей["СделокВсего"+ Группировка]     = СделокВсего;
	СтруктураПолей["СделокВыиграных"+ Группировка] = СделокВыиграных;
	СтруктураПолей["СделокПроиграно"+ Группировка] = СделокПроиграно;
	СтруктураПолей["СделокВРаботе"+ Группировка]   = СделокВРаботе;
	
	СтруктураПолей["Потенциал"+ Группировка]           = Потенциал;
	СтруктураПолей["ПотенциалВыиграный"+ Группировка]  = ПотенциалВыиграный;
	СтруктураПолей["ПотенциалПроиграный"+ Группировка] = Потенциал - ПотенциалВыиграный - ПотенциалВработе;
	СтруктураПолей["ПотенциалВработе"+ Группировка]    = ПотенциалВработе;
	СтруктураПолей["ПотенциалВработе"+ Группировка]    = ПотенциалВработе;
	СтруктураПолей["Продолжительность"]                = Продолжительность;
	
КонецПроцедуры

Процедура ДобавитьРасчетДанныхПоЭтапам(ЭлементСтруктуры, Уровень, УровеньПоляЭтап)
		ГруппуровкаЭтап = ЭлементСтруктуры.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ПолеГруппировки = ГруппуровкаЭтап.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Поле          = Новый ПолеКомпоновкиДанных("ЭтапФиктивный");
		ПолеГруппировки.Использование = истина;
		ГруппуровкаЭтап.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
        ВыбранноеПоле = ГруппуровкаЭтап.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных("ЭтоПолеДобавленоАвтоматически");
		Если ЭлементСтруктуры.Структура.Количество() > 1 и Уровень <> УровеньПоляЭтап тогда
			ДобавитьРасчетДанныхПоЭтапам(ЭлементСтруктуры.Структура[0], Уровень+1, УровеньПоляЭтап);
		КонецЕсли;                                        
КонецПроцедуры

Процедура ПересчитатьПолеЭтап(ТаблицаДанных, Уровень)
	СуммаЗначений = 0;
	Для каждого СтрокаТаблицыДанных из ТаблицаДанных.Строки Цикл
		Если Уровень = СтрокаТаблицыДанных.Уровень() тогда
			СуммаЗначений = СуммаЗначений + ?(СтрокаТаблицыДанных.Вероятность = NULL, 0, СтрокаТаблицыДанных.Вероятность);
			СтрокаТаблицыДанных.Вероятность = СуммаЗначений;
			СуммаПослед = 0;
			Для каждого СтрокаПослед из ТаблицаДанных.Строки Цикл
				Если ТаблицаДанных.Строки.Индекс(СтрокаТаблицыДанных) >= ТаблицаДанных.Строки.Индекс(СтрокаПослед) тогда 
					СуммаПослед = СуммаПослед + СтрокаПослед.Вероятность;
				КонецЕсли;
			КонецЦикла;
			СтрокаТаблицыДанных.ВероятностьОбратная = СуммаПослед;
		ИначеЕсли Уровень > СтрокаТаблицыДанных.Уровень() тогда
			ПересчитатьПолеЭтап(СтрокаТаблицыДанных, Уровень);
		Иначе 
			 Прервать;
		КонецЕсли;
	КонецЦикла
КонецПроцедуры

Процедура СкомпоноватьТаблицу(Результат, СтандартнаяОбработка) Экспорт
	
	ОбщегоНазначенияУТ.СкомпоноватьТаблицу(Результат, ЭтотОбъект);
	
КонецПроцедуры

Процедура СкомпоноватьСтрокуXML(Результат, СтандартнаяОбработка) Экспорт
	
	ОбщегоНазначенияУТ.СкомпоноватьТаблицу(Результат, ЭтотОбъект);
	
КонецПроцедуры

