
&ИзменениеИКонтроль("ПолучитьУсловияПродажПоУмолчанию")
Функция асп_ПолучитьУсловияПродажПоУмолчанию(Знач Партнер, ПараметрыОтбора, СоглашенияСКлиентамиПрименимы)

	СтруктураРеквизитов = ШаблонУсловийПродаж();

	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами")
	И СоглашенияСКлиентамиПрименимы;
	ИспользоватьДоговорыСКлиентами	 = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");

	Если ИспользоватьСоглашенияСКлиентами Тогда

		// Учтем вариант использования соглашений
		ИспользоватьТиповыеСоглашенияСКлиентами        = ПолучитьФункциональнуюОпцию("ИспользоватьТиповыеСоглашенияСКлиентами");
		ИспользоватьИндивидуальныеСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеСоглашенияСКлиентами");

		ТолькоТиповые = ИспользоватьТиповыеСоглашенияСКлиентами И НЕ ИспользоватьИндивидуальныеСоглашенияСКлиентами;
		ТолькоИндивидуальные = НЕ ИспользоватьТиповыеСоглашенияСКлиентами И ИспользоватьИндивидуальныеСоглашенияСКлиентами;

		ВсеПараметрыОтбора = Новый Структура();
		ВсеПараметрыОтбора.Вставить("ТолькоТиповые",                           ТолькоТиповые);
		ВсеПараметрыОтбора.Вставить("ТолькоИндивидуальные",                    ТолькоИндивидуальные);
		ВсеПараметрыОтбора.Вставить("ТолькоИспользуемыеВРаботеТП",             Ложь);
		ВсеПараметрыОтбора.Вставить("УчитыватьГруппыСкладов",                  Ложь);
		ВсеПараметрыОтбора.Вставить("ИсключитьГруппыСкладовДоступныеВЗаказах", Ложь);
		ВсеПараметрыОтбора.Вставить("ХозяйственныеОперации",                   Неопределено);
		ВсеПараметрыОтбора.Вставить("ВыбранноеСоглашение",                     Справочники.СоглашенияСКлиентами.ПустаяСсылка());
		ВсеПараметрыОтбора.Вставить("КомиссионныеПродажи25",                   Неопределено);
		ВсеПараметрыОтбора.Вставить("ОтгрузкаБезПереходаПраваСобственности25", Ложь);
		ВсеПараметрыОтбора.Вставить("Валюта",                                  Неопределено);

		Если ПараметрыОтбора <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ВсеПараметрыОтбора, ПараметрыОтбора);
		КонецЕсли;

		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
		|	СоглашениеСКлиентом.Ссылка                                      КАК Соглашение,
		|	СоглашениеСКлиентом.Типовое                                     КАК Типовое,
		|	СоглашениеСКлиентом.Партнер                                     КАК Партнер,
		|	СоглашениеСКлиентом.Контрагент                                  КАК Контрагент,
		|	СоглашениеСКлиентом.КонтактноеЛицо                              КАК КонтактноеЛицо,
		|	СоглашениеСКлиентом.Организация                                 КАК Организация,
		|	СоглашениеСКлиентом.Валюта                                      КАК Валюта,
		|	ВЫБОР 
		|		КОГДА СоглашениеСКлиентом.ИспользуютсяДоговорыКонтрагентов
		|			ТОГДА СоглашениеСКлиентом.Валюта
		|		ИНАЧЕ СоглашениеСКлиентом.ВалютаВзаиморасчетов
		|	КОНЕЦ                                                           КАК ВалютаВзаиморасчетов,
		|	ВЫБОР
		|		КОГДА &ИспользоватьГрафикиОплаты
		|			ТОГДА СоглашениеСКлиентом.ГрафикОплаты
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ГрафикиОплаты.ПустаяСсылка)
		|	КОНЕЦ                                                             КАК ГрафикОплаты,
		|	ВЫБОР
		|		КОГДА &ИспользоватьГрафикиОплаты
		|			ТОГДА СоглашениеСКлиентом.ГрафикОплаты.ФормаОплаты
		|		ИНАЧЕ СоглашениеСКлиентом.ФормаОплаты
		|	КОНЕЦ                                                           КАК ФормаОплаты,
		|	СоглашениеСКлиентом.ОплатаВВалюте                               КАК ОплатаВВалюте,
		|	СоглашениеСКлиентом.СуммаДокумента                              КАК СуммаДокумента,
		|	СоглашениеСКлиентом.Регулярное                                  КАК Регулярное,
		|	СоглашениеСКлиентом.Период                                      КАК Период,
		|	СоглашениеСКлиентом.КоличествоПериодов                          КАК КоличествоПериодов,
		|	СоглашениеСКлиентом.СрокПоставки                                КАК СрокПоставки,
		|	СоглашениеСКлиентом.ВидЦен                                      КАК ВидЦен,
		|	СоглашениеСКлиентом.ЦенаВключаетНДС                             КАК ЦенаВключаетНДС,
		|	СоглашениеСКлиентом.ИспользуетсяВРаботеТорговыхПредставителей   КАК ИспользуетсяВРаботеТорговыхПредставителей,
		|	ВЫБОР
		|		КОГДА
		|			НЕ СоглашениеСКлиентом.Склад.ЭтоГруппа
		|		ТОГДА
		|			СоглашениеСКлиентом.Склад
		|		КОГДА
		|			СоглашениеСКлиентом.Склад.ЭтоГруппа
		|			И &УчитыватьГруппыСкладов
		|			И СоглашениеСКлиентом.Склад.ВыборГруппы В (&ВыборГруппыСкладов)
		|		ТОГДА
		|			СоглашениеСКлиентом.Склад
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|	КОНЕЦ КАК Склад,
		|	СоглашениеСКлиентом.СегментНоменклатуры                         КАК СегментНоменклатуры,
		|	СоглашениеСКлиентом.ДатаНачалаДействия                          КАК ДатаНачалаДействия,
		|	СоглашениеСКлиентом.ДатаОкончанияДействия                       КАК ДатаОкончанияДействия,
		|	СоглашениеСКлиентом.ХозяйственнаяОперация                       КАК ХозяйственнаяОперация,
		|	СоглашениеСКлиентом.ОграничиватьРучныеСкидки                    КАК ОграничиватьРучныеСкидки,
		|	СоглашениеСКлиентом.ПроцентРучнойСкидки                         КАК ПроцентРучнойСкидки,
		|	СоглашениеСКлиентом.ПроцентРучнойНаценки                        КАК ПроцентРучнойНаценки,
		|	СоглашениеСКлиентом.СпособРасчетаВознаграждения                 КАК СпособРасчетаВознаграждения,
		|	СоглашениеСКлиентом.ПроцентВознаграждения                       КАК ПроцентВознаграждения,
		|	СоглашениеСКлиентом.УдержатьВознаграждение                      КАК УдержатьВознаграждение,
		|	СоглашениеСКлиентом.ИспользуютсяДоговорыКонтрагентов            КАК ИспользуютсяДоговорыКонтрагентов,
		|	СоглашениеСКлиентом.ПорядокРасчетов                             КАК ПорядокРасчетов,
		|	СоглашениеСКлиентом.ГруппаФинансовогоУчета                      КАК ГруппаФинансовогоУчета,
		|	СоглашениеСКлиентом.СтатьяДвиженияДенежныхСредств               КАК СтатьяДвиженияДенежныхСредств,
		|	СоглашениеСКлиентом.ДоступноВнешнимПользователям                КАК ДоступноВнешнимПользователям,
		|	СоглашениеСКлиентом.Статус                                      КАК СтатусСоглашения,
		|	СоглашениеСКлиентом.ВозвращатьМногооборотнуюТару                КАК ВозвращатьМногооборотнуюТару,
		|	СоглашениеСКлиентом.СрокВозвратаМногооборотнойТары              КАК СрокВозвратаМногооборотнойТары,
		|	СоглашениеСКлиентом.РассчитыватьДатуВозвратаТарыПоКалендарю     КАК РассчитыватьДатуВозвратаТарыПоКалендарю,
		|	СоглашениеСКлиентом.КалендарьВозвратаТары                       КАК КалендарьВозвратаТары,
		|	СоглашениеСКлиентом.ТребуетсяЗалогЗаТару                        КАК ТребуетсяЗалогЗаТару,
		|	СоглашениеСКлиентом.ОбеспечиватьЗаказыОбособленно               КАК ОбеспечиватьЗаказыОбособленно,
		|	СоглашениеСКлиентом.ВозможнаРеализацияБезПереходаПраваСобственности КАК ВозможнаРеализацияБезПереходаПраваСобственности,
		|	СоглашениеСКлиентом.Календарь                                   КАК Календарь,
		|	СоглашениеСКлиентом.ЧастотаЗаказа                               КАК ЧастотаЗаказа,
		|	СоглашениеСКлиентом.МинимальнаяСуммаЗаказа                      КАК МинимальнаяСуммаЗаказа,
		|	СоглашениеСКлиентом.НаправлениеДеятельности                     КАК НаправлениеДеятельности,
		|	СоглашениеСКлиентом.КомиссионерВедетУчетПоРНПТ                  КАК КомиссионерВедетУчетПоРНПТ,
		|	СоглашениеСКлиентом.КомиссионныеПродажи25                       КАК НоваяСхемаКомиссии
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СоглашениеСКлиентом
		|ГДЕ
		|	НЕ СоглашениеСКлиентом.ПометкаУдаления И
		|	СоглашениеСКлиентом.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
		|	И СоглашениеСКлиентом.Типовое
		|	И НЕ &ТолькоИндивидуальные
		|	И (НЕ &ОтборПоОперации
		|		ИЛИ СоглашениеСКлиентом.ХозяйственнаяОперация В(&ХозяйственныеОперации))
		|	И &ТолькоИспользуемыеВРаботеТП
		|	И ВЫБОР
		|		КОГДА &ОтборКомиссионныеПродажи25
		|			И &ОтборОтгрузкаБезПереходаПраваСобственности25
		|			ТОГДА &УсловиеКомиссия25
		|				ИЛИ &УсловиеОтгрузкаБезППС25
		|				ИЛИ СоглашениеСКлиентом.ХозяйственнаяОперация В
		|				(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоставкаПодПринципала),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи))
		|		КОГДА &ОтборКомиссионныеПродажи25
		|			ТОГДА &УсловиеКомиссия25
		|		КОГДА &ОтборОтгрузкаБезПереходаПраваСобственности25
		|			ТОГДА &УсловиеОтгрузкаБезППС25
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ((НЕ &ОтборВалюта)
		|			ИЛИ СоглашениеСКлиентом.Валюта = &Валюта)
		|	И &ТекстЗамены1
		|И &ТекстЗамены2
		|;
		|
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СоглашениеСКлиентом.Ссылка                                      КАК Соглашение,
		|	СоглашениеСКлиентом.Типовое                                     КАК Типовое,
		|	СоглашениеСКлиентом.Партнер                                     КАК Партнер,
		|	СоглашениеСКлиентом.Контрагент                                  КАК Контрагент,
		|	СоглашениеСКлиентом.КонтактноеЛицо                              КАК КонтактноеЛицо,
		|	СоглашениеСКлиентом.Организация                                 КАК Организация,
		|	СоглашениеСКлиентом.Валюта                                      КАК Валюта,
		|	ВЫБОР 
		|		КОГДА СоглашениеСКлиентом.ИспользуютсяДоговорыКонтрагентов
		|			ТОГДА СоглашениеСКлиентом.Валюта
		|		ИНАЧЕ СоглашениеСКлиентом.ВалютаВзаиморасчетов
		|	КОНЕЦ                                                           КАК ВалютаВзаиморасчетов,
		|	ВЫБОР
		|		КОГДА &ИспользоватьГрафикиОплаты
		|			ТОГДА СоглашениеСКлиентом.ГрафикОплаты
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ГрафикиОплаты.ПустаяСсылка)
		|	КОНЕЦ                                                           КАК ГрафикОплаты,
		|	ВЫБОР
		|		КОГДА &ИспользоватьГрафикиОплаты
		|			ТОГДА СоглашениеСКлиентом.ГрафикОплаты.ФормаОплаты
		|		ИНАЧЕ СоглашениеСКлиентом.ФормаОплаты
		|	КОНЕЦ                                                           КАК ФормаОплаты,
		|	СоглашениеСКлиентом.ОплатаВВалюте                               КАК ОплатаВВалюте,
		|	СоглашениеСКлиентом.СуммаДокумента                              КАК СуммаДокумента,
		|	СоглашениеСКлиентом.Регулярное                                  КАК Регулярное,
		|	СоглашениеСКлиентом.Период                                      КАК Период,
		|	СоглашениеСКлиентом.КоличествоПериодов                          КАК КоличествоПериодов,
		|	СоглашениеСКлиентом.СрокПоставки                                КАК СрокПоставки,
		|	СоглашениеСКлиентом.ВидЦен                                      КАК ВидЦен,
		|	СоглашениеСКлиентом.ЦенаВключаетНДС                             КАК ЦенаВключаетНДС,
		|	СоглашениеСКлиентом.ИспользуетсяВРаботеТорговыхПредставителей   КАК ИспользуетсяВРаботеТорговыхПредставителей,
		|	ВЫБОР
		|		КОГДА
		|			НЕ СоглашениеСКлиентом.Склад.ЭтоГруппа
		|		ТОГДА
		|			СоглашениеСКлиентом.Склад
		|		КОГДА
		|			СоглашениеСКлиентом.Склад.ЭтоГруппа
		|			И &УчитыватьГруппыСкладов
		|			И СоглашениеСКлиентом.Склад.ВыборГруппы В (&ВыборГруппыСкладов)
		|		ТОГДА
		|			СоглашениеСКлиентом.Склад
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|	КОНЕЦ КАК Склад,
		|	СоглашениеСКлиентом.СегментНоменклатуры                         КАК СегментНоменклатуры,
		|	СоглашениеСКлиентом.ДатаНачалаДействия                          КАК ДатаНачалаДействия,
		|	СоглашениеСКлиентом.ДатаОкончанияДействия                       КАК ДатаОкончанияДействия,
		|	СоглашениеСКлиентом.ХозяйственнаяОперация                       КАК ХозяйственнаяОперация,
		|	СоглашениеСКлиентом.ОграничиватьРучныеСкидки                    КАК ОграничиватьРучныеСкидки,
		|	СоглашениеСКлиентом.ПроцентРучнойСкидки                         КАК ПроцентРучнойСкидки,
		|	СоглашениеСКлиентом.ПроцентРучнойНаценки                        КАК ПроцентРучнойНаценки,
		|	СоглашениеСКлиентом.СпособРасчетаВознаграждения                 КАК СпособРасчетаВознаграждения,
		|	СоглашениеСКлиентом.ПроцентВознаграждения                       КАК ПроцентВознаграждения,
		|	СоглашениеСКлиентом.УдержатьВознаграждение                      КАК УдержатьВознаграждение,
		|	СоглашениеСКлиентом.ИспользуютсяДоговорыКонтрагентов            КАК ИспользуютсяДоговорыКонтрагентов,
		|	СоглашениеСКлиентом.ПорядокРасчетов                             КАК ПорядокРасчетов,
		|	СоглашениеСКлиентом.ГруппаФинансовогоУчета                      КАК ГруппаФинансовогоУчета,
		|	СоглашениеСКлиентом.СтатьяДвиженияДенежныхСредств               КАК СтатьяДвиженияДенежныхСредств,
		|	СоглашениеСКлиентом.ДоступноВнешнимПользователям                КАК ДоступноВнешнимПользователям,
		|	СоглашениеСКлиентом.Статус                                      КАК СтатусСоглашения,
		|	СоглашениеСКлиентом.ВозвращатьМногооборотнуюТару                КАК ВозвращатьМногооборотнуюТару,
		|	СоглашениеСКлиентом.СрокВозвратаМногооборотнойТары              КАК СрокВозвратаМногооборотнойТары,
		|	СоглашениеСКлиентом.РассчитыватьДатуВозвратаТарыПоКалендарю     КАК РассчитыватьДатуВозвратаТарыПоКалендарю,
		|	СоглашениеСКлиентом.КалендарьВозвратаТары                       КАК КалендарьВозвратаТары,
		|	СоглашениеСКлиентом.ТребуетсяЗалогЗаТару                        КАК ТребуетсяЗалогЗаТару,
		|	СоглашениеСКлиентом.ОбеспечиватьЗаказыОбособленно               КАК ОбеспечиватьЗаказыОбособленно,
		|	СоглашениеСКлиентом.ВозможнаРеализацияБезПереходаПраваСобственности КАК ВозможнаРеализацияБезПереходаПраваСобственности,
		|	СоглашениеСКлиентом.Календарь                                   КАК Календарь,
		|	СоглашениеСКлиентом.ЧастотаЗаказа                               КАК ЧастотаЗаказа,
		|	СоглашениеСКлиентом.МинимальнаяСуммаЗаказа                      КАК МинимальнаяСуммаЗаказа,
		|	СоглашениеСКлиентом.НаправлениеДеятельности                     КАК НаправлениеДеятельности,
		|	СоглашениеСКлиентом.КомиссионерВедетУчетПоРНПТ                  КАК КомиссионерВедетУчетПоРНПТ,
		|	СоглашениеСКлиентом.КомиссионныеПродажи25                       КАК НоваяСхемаКомиссии
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СоглашениеСКлиентом
		|ГДЕ
		|	НЕ СоглашениеСКлиентом.ПометкаУдаления
		|	И СоглашениеСКлиентом.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует) 
		|	И СоглашениеСКлиентом.Ссылка = &ВыбранноеСоглашение
		|	И (НЕ &ОтборПоОперации
		|		ИЛИ СоглашениеСКлиентом.ХозяйственнаяОперация В(&ХозяйственныеОперации))
		|	И ((НЕ &ОтборКомиссионныеПродажи25)
		|			ИЛИ СоглашениеСКлиентом.КомиссионныеПродажи25 = &КомиссионныеПродажи25)
		|	И (НЕ &ОтборОтгрузкаБезПереходаПраваСобственности25
		|		ИЛИ СоглашениеСКлиентом.ВозможнаРеализацияБезПереходаПраваСобственности
		|			И НЕ &ИспользоватьДоговорыСКлиентами
		|				ИЛИ СоглашениеСКлиентом.ИспользуютсяДоговорыКонтрагентов)
		|	И ((НЕ &ОтборВалюта)
		|			ИЛИ СоглашениеСКлиентом.Валюта = &Валюта)
		|	И (СоглашениеСКлиентом.Партнер = &Партнер ИЛИ 
		|	&ТекстЗамены3)
		|	И &ТолькоИспользуемыеВРаботеТП
		|";

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ТекстЗамены1", ?(Не ЗначениеЗаполнено(Партнер),
		"И СоглашениеСКлиентом.СегментПартнеров = ЗНАЧЕНИЕ(Справочник.СегментыПартнеров.ПустаяСсылка) ", 
		"И (СоглашениеСКлиентом.СегментПартнеров = ЗНАЧЕНИЕ(Справочник.СегментыПартнеров.ПустаяСсылка)
		|		ИЛИ СоглашениеСКлиентом.СегментПартнеров В
		|			(ВЫБРАТЬ
		|				ПартнерыСегмента.Сегмент
		|			ИЗ
		|				РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
		|			ГДЕ
		|				ПартнерыСегмента.Партнер = &Партнер))
		|"));

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ТекстЗамены2", ?(ВсеПараметрыОтбора.ТолькоТиповые Или Не ЗначениеЗаполнено(Партнер),"","
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 2
		|	СоглашениеСКлиентом.Ссылка                                      КАК Соглашение,
		|	СоглашениеСКлиентом.Типовое                                     КАК Типовое,
		|	СоглашениеСКлиентом.Партнер                                     КАК Партнер,
		|	СоглашениеСКлиентом.Контрагент                                  КАК Контрагент,
		|	СоглашениеСКлиентом.КонтактноеЛицо                              КАК КонтактноеЛицо,
		|	СоглашениеСКлиентом.Организация                                 КАК Организация,
		|	СоглашениеСКлиентом.Валюта                                      КАК Валюта,
		|	ВЫБОР 
		|		КОГДА СоглашениеСКлиентом.ИспользуютсяДоговорыКонтрагентов
		|			ТОГДА СоглашениеСКлиентом.Валюта
		|		ИНАЧЕ СоглашениеСКлиентом.ВалютаВзаиморасчетов
		|	КОНЕЦ                                                           КАК ВалютаВзаиморасчетов,
		|	ВЫБОР
		|		КОГДА &ИспользоватьГрафикиОплаты
		|			ТОГДА СоглашениеСКлиентом.ГрафикОплаты
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ГрафикиОплаты.ПустаяСсылка)
		|	КОНЕЦ                                                             КАК ГрафикОплаты,
		|	ВЫБОР
		|		КОГДА &ИспользоватьГрафикиОплаты
		|			ТОГДА СоглашениеСКлиентом.ГрафикОплаты.ФормаОплаты
		|		ИНАЧЕ СоглашениеСКлиентом.ФормаОплаты
		|	КОНЕЦ                                                           КАК ФормаОплаты,
		|	СоглашениеСКлиентом.ОплатаВВалюте                               КАК ОплатаВВалюте,
		|	СоглашениеСКлиентом.СуммаДокумента                              КАК СуммаДокумента,
		|	СоглашениеСКлиентом.Регулярное                                  КАК Регулярное,
		|	СоглашениеСКлиентом.Период                                      КАК Период,
		|	СоглашениеСКлиентом.КоличествоПериодов                          КАК КоличествоПериодов,
		|	СоглашениеСКлиентом.СрокПоставки                                КАК СрокПоставки,
		|	СоглашениеСКлиентом.ВидЦен                                      КАК ВидЦен,
		|	СоглашениеСКлиентом.ЦенаВключаетНДС                             КАК ЦенаВключаетНДС,
		|	СоглашениеСКлиентом.ИспользуетсяВРаботеТорговыхПредставителей   КАК ИспользуетсяВРаботеТорговыхПредставителей,
		|	ВЫБОР
		|		КОГДА
		|			НЕ СоглашениеСКлиентом.Склад.ЭтоГруппа
		|		ТОГДА
		|			СоглашениеСКлиентом.Склад
		|		КОГДА
		|			СоглашениеСКлиентом.Склад.ЭтоГруппа
		|			И &УчитыватьГруппыСкладов
		|			И СоглашениеСКлиентом.Склад.ВыборГруппы В (&ВыборГруппыСкладов)
		|		ТОГДА
		|			СоглашениеСКлиентом.Склад
		|		ИНАЧЕ
		|			ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|	КОНЕЦ КАК Склад,
		|	СоглашениеСКлиентом.СегментНоменклатуры                         КАК СегментНоменклатуры,
		|	СоглашениеСКлиентом.ДатаНачалаДействия                          КАК ДатаНачалаДействия,
		|	СоглашениеСКлиентом.ДатаОкончанияДействия                       КАК ДатаОкончанияДействия,
		|	СоглашениеСКлиентом.ХозяйственнаяОперация                       КАК ХозяйственнаяОперация,
		|	СоглашениеСКлиентом.ОграничиватьРучныеСкидки                    КАК ОграничиватьРучныеСкидки,
		|	СоглашениеСКлиентом.ПроцентРучнойСкидки                         КАК ПроцентРучнойСкидки,
		|	СоглашениеСКлиентом.ПроцентРучнойНаценки                        КАК ПроцентРучнойНаценки,
		|	СоглашениеСКлиентом.СпособРасчетаВознаграждения                 КАК СпособРасчетаВознаграждения,
		|	СоглашениеСКлиентом.ПроцентВознаграждения                       КАК ПроцентВознаграждения,
		|	СоглашениеСКлиентом.УдержатьВознаграждение                      КАК УдержатьВознаграждение,
		|	СоглашениеСКлиентом.ИспользуютсяДоговорыКонтрагентов            КАК ИспользуютсяДоговорыКонтрагентов,
		|	СоглашениеСКлиентом.ПорядокРасчетов                             КАК ПорядокРасчетов,
		|	СоглашениеСКлиентом.ГруппаФинансовогоУчета                      КАК ГруппаФинансовогоУчета,
		|	СоглашениеСКлиентом.СтатьяДвиженияДенежныхСредств               КАК СтатьяДвиженияДенежныхСредств,
		|	СоглашениеСКлиентом.ДоступноВнешнимПользователям                КАК ДоступноВнешнимПользователям,
		|	СоглашениеСКлиентом.Статус                                      КАК СтатусСоглашения,
		|	СоглашениеСКлиентом.ВозвращатьМногооборотнуюТару                КАК ВозвращатьМногооборотнуюТару,
		|	СоглашениеСКлиентом.СрокВозвратаМногооборотнойТары              КАК СрокВозвратаМногооборотнойТары,
		|	СоглашениеСКлиентом.РассчитыватьДатуВозвратаТарыПоКалендарю     КАК РассчитыватьДатуВозвратаТарыПоКалендарю,
		|	СоглашениеСКлиентом.КалендарьВозвратаТары                       КАК КалендарьВозвратаТары,
		|	СоглашениеСКлиентом.ТребуетсяЗалогЗаТару                        КАК ТребуетсяЗалогЗаТару,
		|	СоглашениеСКлиентом.ОбеспечиватьЗаказыОбособленно               КАК ОбеспечиватьЗаказыОбособленно,
		|	СоглашениеСКлиентом.ВозможнаРеализацияБезПереходаПраваСобственности КАК ВозможнаРеализацияБезПереходаПраваСобственности,
		|	СоглашениеСКлиентом.Календарь                                   КАК Календарь,
		|	СоглашениеСКлиентом.ЧастотаЗаказа                               КАК ЧастотаЗаказа,
		|	СоглашениеСКлиентом.МинимальнаяСуммаЗаказа                      КАК МинимальнаяСуммаЗаказа,
		|	СоглашениеСКлиентом.НаправлениеДеятельности                     КАК НаправлениеДеятельности,
		|	СоглашениеСКлиентом.КомиссионерВедетУчетПоРНПТ                  КАК КомиссионерВедетУчетПоРНПТ,
		|	СоглашениеСКлиентом.КомиссионныеПродажи25                       КАК НоваяСхемаКомиссии
		|ИЗ
		|	Справочник.СоглашенияСКлиентами КАК СоглашениеСКлиентом
		|ГДЕ
		|	НЕ СоглашениеСКлиентом.ПометкаУдаления
		|	И СоглашениеСКлиентом.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСоглашенийСКлиентами.Действует)
		|	И НЕ СоглашениеСКлиентом.Типовое
		|	И НЕ &ТолькоТиповые
		|	И (НЕ &ОтборПоОперации
		|		ИЛИ СоглашениеСКлиентом.ХозяйственнаяОперация В(&ХозяйственныеОперации))
		|	И ВЫБОР
		|		КОГДА &ОтборКомиссионныеПродажи25
		|			И &ОтборОтгрузкаБезПереходаПраваСобственности25
		|			ТОГДА &УсловиеКомиссия25
		|				ИЛИ &УсловиеОтгрузкаБезППС25
		|				ИЛИ СоглашениеСКлиентом.ХозяйственнаяОперация В
		|				(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоставкаПодПринципала),
		|				ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаНаХранениеСПравомПродажи))
		|		КОГДА &ОтборКомиссионныеПродажи25
		|			ТОГДА &УсловиеКомиссия25
		|		КОГДА &ОтборОтгрузкаБезПереходаПраваСобственности25
		|			ТОГДА &УсловиеОтгрузкаБезППС25
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ((НЕ &ОтборВалюта)
		|			ИЛИ СоглашениеСКлиентом.Валюта = &Валюта)
		|	И &ТолькоИспользуемыеВРаботеТП
		|	И СоглашениеСКлиентом.Партнер = &Партнер
		|УПОРЯДОЧИТЬ ПО
		|	Типовое ВОЗР
		|"));

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗамены3", ?(Не ЗначениеЗаполнено(Партнер),"СоглашениеСКлиентом.Типовое И СоглашениеСКлиентом.СегментПартнеров = ЗНАЧЕНИЕ(Справочник.СегментыПартнеров.ПустаяСсылка)", "
		|
		|	СоглашениеСКлиентом.Типовое И (СоглашениеСКлиентом.СегментПартнеров = ЗНАЧЕНИЕ(Справочник.СегментыПартнеров.ПустаяСсылка)
		|		ИЛИ СоглашениеСКлиентом.СегментПартнеров В
		|			(ВЫБРАТЬ
		|				ПартнерыСегмента.Сегмент
		|			ИЗ
		|				РегистрСведений.ПартнерыСегмента КАК ПартнерыСегмента
		|			ГДЕ
		|				ПартнерыСегмента.Партнер = &Партнер))"));

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И &ТолькоИспользуемыеВРаботеТП", ?(ВсеПараметрыОтбора.ТолькоИспользуемыеВРаботеТП,"И СоглашениеСКлиентом.ИспользуетсяВРаботеТорговыхПредставителей ",""));

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&УсловиеКомиссия25",
		"(НЕ &КомиссионныеПродажи25
		|	ИЛИ СоглашениеСКлиентом.КомиссионныеПродажи25)");

		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"&УсловиеОтгрузкаБезППС25",
		"(СоглашениеСКлиентом.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
		|	И СоглашениеСКлиентом.ВозможнаРеализацияБезПереходаПраваСобственности
		|	И СоглашениеСКлиентом.ИспользуютсяДоговорыКонтрагентов)");

		Запрос = Новый Запрос(ТекстЗапроса);

		Запрос.УстановитьПараметр("Партнер",                Партнер);
		Запрос.УстановитьПараметр("ВыборГруппыСкладов",     Справочники.Склады.ВариантыВыбораГруппыСкладов(ВсеПараметрыОтбора.ИсключитьГруппыСкладовДоступныеВЗаказах));
		Запрос.УстановитьПараметр("ОтборПоОперации",        ВсеПараметрыОтбора.ХозяйственныеОперации <> Неопределено);
		Запрос.УстановитьПараметр("ХозяйственныеОперации",  ВсеПараметрыОтбора.ХозяйственныеОперации);
		Запрос.УстановитьПараметр("УчитыватьГруппыСкладов", ВсеПараметрыОтбора.УчитыватьГруппыСкладов);
		Запрос.УстановитьПараметр("ТолькоТиповые",          ВсеПараметрыОтбора.ТолькоТиповые);
		Запрос.УстановитьПараметр("ТолькоИндивидуальные",   ВсеПараметрыОтбора.ТолькоИндивидуальные);
		Запрос.УстановитьПараметр("ВыбранноеСоглашение",    ВсеПараметрыОтбора.ВыбранноеСоглашение);
		Запрос.УстановитьПараметр("ОтборКомиссионныеПродажи25", ЗначениеЗаполнено(ВсеПараметрыОтбора.КомиссионныеПродажи25));
		Запрос.УстановитьПараметр("КомиссионныеПродажи25",  ВсеПараметрыОтбора.КомиссионныеПродажи25);
		Если НЕ ЗначениеЗаполнено(ВсеПараметрыОтбора.КомиссионныеПродажи25) Тогда
			Запрос.УстановитьПараметр("КомиссионныеПродажи25", Ложь);
		КонецЕсли;
		Запрос.УстановитьПараметр("ОтборВалюта",            ВсеПараметрыОтбора.Валюта <> Неопределено);
		Запрос.УстановитьПараметр("Валюта",                 ВсеПараметрыОтбора.Валюта);

		Запрос.УстановитьПараметр("ИспользоватьГрафикиОплаты", ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиОплаты"));
		Запрос.УстановитьПараметр("ИспользоватьДоговорыСКлиентами", ИспользоватьДоговорыСКлиентами);

		Запрос.УстановитьПараметр("ОтборОтгрузкаБезПереходаПраваСобственности25",
		ВсеПараметрыОтбора.ОтгрузкаБезПереходаПраваСобственности25 = Истина);

		РезультатЗапроса = Запрос.ВыполнитьПакет();

		// Если не найдено ни одного соглашения - возвращаем Неопределено 
		Если РезультатЗапроса[0].Пустой() Тогда
			Возврат Неопределено;
		КонецЕсли;

		Выборка = РезультатЗапроса[0].Выбрать();

		НайденноеСоглашение = Неопределено;

		// Если в выборке одно соглашение - используем его
		Если Выборка.Количество() = 1 Тогда

			Выборка.Следующий();
			НайденноеСоглашение = Выборка.Соглашение;

		КонецЕсли;

		// Если необходимы только типовые соглашения - дальнейшие проверки не имеют смысла
		Если НайденноеСоглашение = Неопределено И Не ВсеПараметрыОтбора.ТолькоТиповые Тогда

			// В выборке два или более соглашений
			Выборка.Следующий();

			ПервоеСоглашение        = Выборка.Соглашение;
			ПервоеСоглашениеТиповое = Выборка.Типовое;

			Выборка.Следующий();

			ВтороеСоглашениеТиповое = Выборка.Типовое;

			Выборка.Сбросить();
			Выборка.Следующий();

			// Если в выборке два соглашения разного типа - используем индивидуальное
			Если ПервоеСоглашениеТиповое <> ВтороеСоглашениеТиповое Тогда
				НайденноеСоглашение = ПервоеСоглашение;
			КонецЕсли;
		КонецЕсли;

		Если НайденноеСоглашение = Неопределено Тогда
			Если НЕ РезультатЗапроса[1].Пустой() Тогда
				Выборка = РезультатЗапроса[1].Выбрать();
				Выборка.Следующий();
				НайденноеСоглашение = Выборка.Соглашение;
			КонецЕсли;
		КонецЕсли;

		Если НайденноеСоглашение <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);
		Иначе
			ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Справочники.СоглашенияСКлиентами.ПустаяСсылка())
		КонецЕсли;
		Если Не ИспользоватьДоговорыСКлиентами Тогда
			СтруктураРеквизитов.Вставить("ИспользуютсяДоговорыКонтрагентов", ИспользоватьДоговорыСКлиентами);
		КонецЕсли;

	Иначе //соглашения не используются

		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Справочники.СоглашенияСКлиентами.ПустаяСсылка());
		ОтборВидаЦен          = Новый Структура("ИспользоватьПриПродаже", Истина);

		ВсеПараметрыОтбора = Новый Структура;
		ВсеПараметрыОтбора.Вставить("ПустаяСсылкаДокумента", Неопределено);
		Если ПараметрыОтбора <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ВсеПараметрыОтбора, ПараметрыОтбора);
		КонецЕсли;

		СсылкаДокументаДляСтатистики = ?(ВДокументеНеобходимоЗаполнятьПризнакЦенаВключаетНДС(ВсеПараметрыОтбора.ПустаяСсылкаДокумента) = Истина,
		ВсеПараметрыОтбора.ПустаяСсылкаДокумента, Неопределено);

		РеквизитыЦеныПоУмолчанию = Справочники.ВидыЦен.ВидЦеныИПризнакЦенаВключаетНДСПоУмолчанию(
		ОтборВидаЦен, СсылкаДокументаДляСтатистики);
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, РеквизитыЦеныПоУмолчанию);

		СтруктураРеквизитов.Вставить("ПорядокРасчетов",                               Перечисления.ПорядокРасчетов.ПоЗаказам);
		СтруктураРеквизитов.Вставить("ИспользуютсяДоговорыКонтрагентов",              ИспользоватьДоговорыСКлиентами);
		СтруктураРеквизитов.Вставить("ВозможнаРеализацияБезПереходаПраваСобственности",
		ПолучитьФункциональнуюОпцию("ИспользоватьОтгрузкуБезПереходаПраваСобственности2_0"));
		СтруктураРеквизитов.Вставить("НоваяСхемаКомиссии", 
		ПолучитьФункциональнуюОпцию("ИспользоватьКомиссиюПриПродажах"));

	КонецЕсли;
	
	#Вставка
	//Непп 21.01
	Если НайденноеСоглашение=Неопределено Тогда
		НайденноеСоглашение=Справочники.СоглашенияСКлиентами.НайтиПоНаименованию("Предоплата 100% отсрочка 2 дня");
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов,НайденноеСоглашение);
		СтруктураРеквизитов.Соглашение=НайденноеСоглашение;
		СтруктураРеквизитов.НоваяСхемаКомиссии = ложь;
	КонецЕсли;
	#КонецВставки

	Возврат СтруктураРеквизитов;


КонецФункции
