
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресТаблицыКонтрагентов = Параметры.АдресТаблицыКонтрагентов;
	
	ТаблицаКонтрагентов = ПолучитьИзВременногоХранилища(АдресТаблицыКонтрагентов);
	Контрагенты.Загрузить(ТаблицаКонтрагентов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ПеренестиВНастройку Тогда
		
		Результат = ПриЗакрытииНаСервере();
		
		Оповестить("КонтрагентыНастройки1ССверка", Результат, ЭтотОбъект.ВладелецФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриЗакрытииНаСервере()
	
	ТаблицаКонтрагентов = Новый ТаблицаЗначений();
	ТаблицаКонтрагентов.Колонки.Добавить("Контрагент");
	Для Каждого КонтрагентНастройки Из Контрагенты Цикл
		Если ЗначениеЗаполнено(КонтрагентНастройки.Контрагент) Тогда
			СтрокаТаблицы = ТаблицаКонтрагентов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, КонтрагентНастройки);
		КонецЕсли;
	КонецЦикла;
	
	АдресТаблицыКонтрагентов = ПоместитьВоВременноеХранилище(ТаблицаКонтрагентов, УникальныйИдентификатор);
	
	Возврат АдресТаблицыКонтрагентов;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ПеренестиВНастройку = Истина;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
