
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	КоличествоПодключений = Справочники.УчетныеЗаписиМаркетплейсов.ПолучитьКоличествоПодключений(
		ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсOzon"));

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если КоличествоПодключений = 0 Тогда
		ОткрытьФормуПодключенияКСервису(, ВладелецФормы);
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ЗакрытьФормуСпискаПодключений" Тогда
		Закрыть();
	ИначеЕсли ИмяСобытия = "УчетнаяЗаписьДеактивирована"
			Или ИмяСобытия = "ОбновитьСписокПодключений" Тогда
		Элементы.СписокПодключений.Обновить();
	ИначеЕсли ИмяСобытия = "ВывестиСообщение" И ЗначениеЗаполнено(Параметр) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Параметр);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокПодключений

&НаКлиенте
Процедура СписокПодключенийВыборЗначения(Элемент, Значение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("УчетнаяЗапись", Значение);
	ОткрытьФормуПодключенияКСервису(ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура СписокПодключенийПередНачаломИзменения(Элемент, Отказ)
	
	Отказ                = Истина;
	СтандартнаяОбработка = Истина;
	
	СписокПодключенийВыборЗначения(Элемент, Элементы.СписокПодключений.ТекущиеДанные.Ссылка, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПодключенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ОткрытьФормуПодключенияКСервису();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключить(Команда)

	ОткрытьФормуПодключенияКСервису();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуПодключенияКСервису(ПараметрыФормы = Неопределено, ВладелецОткрываемойФормы = Неопределено)

	ОткрытьФорму("Обработка.УправлениеПродажамиНаOzon.Форма.ПодключениеКСервису", ПараметрыФормы, ВладелецОткрываемойФормы);

КонецПроцедуры

#КонецОбласти

