#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		Или РасчетСебестоимостиПрикладныеАлгоритмы.ДвиженияЗаписываютсяРасчетомПартийИСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// В некоторых документах договор в онлайн движениях с количеством заполняется пустой ссылкой и такой и остается,
	// а при кэшировании расчетных суммовых движений пустые ссылки приводятся к пустому значению (неопределено),
	// из-за чего появляются разрывы по измерению "Договор".
	// Типизация расчетных движеяних происходит в см. РасчетСебестоимостиПрикладныеАлгоритмы.КэшироватьСформированныеДвиженияИзВременныхТаблиц()
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если Не ЗначениеЗаполнено(Запись.Договор)
		 И Запись.Договор <> Неопределено Тогда
			Запись.Договор = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
	Если РасчетСебестоимостиПрикладныеАлгоритмы.ФормироватьДвиженияРегистровУчетаСебестоимости(ЭтотОбъект) Тогда
		
		// Сохраним неизмененные первичные движения.
		СохранитьНеИзмененныеПервичныеДвижения();
		
		// Сохраним расчетные движения за периоды, в которых есть первичные движения.
		РасчетСебестоимостиПрикладныеАлгоритмы.СохранитьДвиженияСформированныеРасчетомПартийИСебестоимости(ЭтотОбъект, Замещение);
		
	КонецЕсли;
	
	Если Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства)
		Или ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Текущее состояние набора помещается во временную таблицу,
	// чтобы при записи получить изменение нового набора относительно текущего.
	
	ТекстыЗапросовДляПолученияТаблицыИзменений = 
		ЗакрытиеМесяцаСервер.ТекстыЗапросовДляПолученияТаблицыИзмененийРегистра(Метаданные(), Отбор);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстыЗапросовДляПолученияТаблицыИзменений.ТекстВыборкиНачальныхДанных;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Запрос.Выполнить();
	
	ДополнительныеСвойства.Вставить("ТекстВыборкиТаблицыИзменений", ТекстыЗапросовДляПолученияТаблицыИзменений.ТекстВыборкиТаблицыИзменений);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Или Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства)
		Или ПланыОбмена.ГлавныйУзел() <> Неопределено
		Или РасчетСебестоимостиПрикладныеАлгоритмы.ДвиженияЗаписываютсяРасчетомПартийИСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
	// и помещается во временную таблицу для последующей записи в регистрах заданий.
	Запрос = Новый Запрос;
	Запрос.Текст = ДополнительныеСвойства.ТекстВыборкиТаблицыИзменений;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СохранитьНеИзмененныеПервичныеДвижения()
	
	Если РасчетСебестоимостиПовтИсп.ЗначенияТехнологическихПараметров().НеСохранятьРасчетныеДвижения
	 ИЛИ ДополнительныеСвойства.Свойство("НеСохранятьРасчетныеДвижения") Тогда
		Возврат;
	КонецЕсли;
	
	ТипыВводаОстатков = ВводОстатковСервер.ДоступныеТипыВводаОстатков();
	Если ТипыВводаОстатков.Найти(ТипЗнч(Отбор.Регистратор.Значение)) <> Неопределено Тогда
		Возврат; // его движения не корректируются партионным учетом
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ДатаРегистратора") Тогда
		ДатаРегистратора = ДополнительныеСвойства.ДатаРегистратора;
	Иначе
		ДатаРегистратора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отбор.Регистратор.Значение, "Дата");
	КонецЕсли;
	
	Если НЕ РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22(НачалоМесяца(ДатаРегистратора)) Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаЗаписей = ЭтотОбъект.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", 				Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("НаборЗаписей", 				ТаблицаЗаписей);
	
	#Область ШаблоныТекстаЗапроса
	
	// Подготовим шаблоны для формирования текстов запросов.
	ПоляИсключения = Новый Структура("НомерСтроки, Активность, Регистратор, МоментВремени");
	ПоляПартий     = Новый Структура("Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, ВидДеятельностиНДС, РасчетНеЗавершен");
	
	ТекстПоляРегистра = "";
	ТекстПоляРегистраСМинусом = "";
	ТекстПоляРегистраБезПартий = "";
	ТекстПоляГруппировкиБезПартий = "";
	ТекстПоляСуммирования = "";
	ТекстПоляУсловия = "";
	
	Для Каждого ТекущаяКолонка Из ТаблицаЗаписей.Колонки Цикл
		
		Если ПоляИсключения.Свойство(ТекущаяКолонка.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоСуммируемоеПоле = Метаданные().Ресурсы.Найти(ТекущаяКолонка.Имя) <> Неопределено
			ИЛИ (Метаданные().Реквизиты.Найти(ТекущаяКолонка.Имя) <> Неопределено
				И ТекущаяКолонка.ТипЗначения.СодержитТип(Тип("Число")));
		 
		ТекстПоляРегистра = ТекстПоляРегистра + ?(ТекстПоляРегистра = "", "", ",
			|	") + "Т." + ТекущаяКолонка.Имя;
		ТекстПоляРегистраСМинусом = ТекстПоляРегистраСМинусом + ?(ТекстПоляРегистраСМинусом = "", "", ",
			|	") + ?(ЭтоСуммируемоеПоле, "-", "") + "Т." + ТекущаяКолонка.Имя;
			
		Если ЭтоСуммируемоеПоле Тогда
			
			ТекстПоляСуммирования = ТекстПоляСуммирования + ?(ТекстПоляСуммирования = "", "", ",
				|	") + "СУММА(Т." + ТекущаяКолонка.Имя + ") КАК " + ТекущаяКолонка.Имя;
			ТекстПоляУсловия = ТекстПоляУсловия + ?(ТекстПоляУсловия = "", "", "
				|	ИЛИ ") + "СУММА(Т." + ТекущаяКолонка.Имя + ") <> 0";
			
		Иначе
			
			Если НЕ ПоляПартий.Свойство(ТекущаяКолонка.Имя) Тогда
				
				ТекстПоляРегистраБезПартий = ТекстПоляРегистраБезПартий + ?(ТекстПоляРегистраБезПартий = "", "", ",
					|	") + "Т." + ТекущаяКолонка.Имя;
				ТекстПоляГруппировкиБезПартий = ТекстПоляГруппировкиБезПартий + ?(ТекстПоляГруппировкиБезПартий = "", "", ",
					|	") + "Т." + ТекущаяКолонка.Имя;
					
			Иначе
				
				ТекстПоляРегистраБезПартий = ТекстПоляРегистраБезПартий + ?(ТекстПоляРегистраБезПартий = "", "", ",
					|	") + "ВЫБОР КОГДА Т.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
					|		ТОГДА Т." + ТекущаяКолонка.Имя
					+ " ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ КАК " + ТекущаяКолонка.Имя;
				ТекстПоляГруппировкиБезПартий = ТекстПоляГруппировкиБезПартий + ?(ТекстПоляГруппировкиБезПартий = "", "", ",
					|	") + "ВЫБОР КОГДА Т.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
					|		ТОГДА Т." + ТекущаяКолонка.Имя
					+ " ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ";
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	#КонецОбласти
	
	#Область СозданиеВременныхТаблиц
	
	// Проанализируем наличие измененных первичных движений в разрезе периодов (месяцев).
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ
	|	&ТекстВыборПоляРегистра
	|ПОМЕСТИТЬ ВТНаборЗаписей
	|ИЗ
	|	&НаборЗаписей КАК Т
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	&ТекстПоляРегистраБезПартий,
	|	&ТекстПоляСуммирования
	|ПОМЕСТИТЬ ВТИзмененныеДвижения
	|ИЗ
	|
	|(ВЫБРАТЬ
	|	СпрНоменклатура.ТипНоменклатуры,
	|	ИСТИНА КАК ДвиженияИБ,
	|	&ТекстВыборПоляРегистра
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикиНоменклатуры
	|		ПО Т.АналитикаУчетаНоменклатуры = АналитикиНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО АналитикиНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	Т.Регистратор = &Регистратор
	|	И НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СпрНоменклатура.ТипНоменклатуры,
	|	ЛОЖЬ КАК ДвиженияИБ,
	|	&ТекстПоляРегистраСМинусом
	|ИЗ
	|	ВТНаборЗаписей КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикиНоменклатуры
	|		ПО Т.АналитикаУчетаНоменклатуры = АналитикиНоменклатуры.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО АналитикиНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	&ТекстПоляГруппировкиБезПартий
	|ИМЕЮЩИЕ
	|	&ТекстПоляУсловия
	|	ИЛИ МАКСИМУМ(Т.ДвиженияИБ) = ЛОЖЬ
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Т.Период КАК Период,
	|	МАКСИМУМ(Т.ЕстьИзмененныеДвижения) КАК ЕстьИзмененныеДвижения
	|ПОМЕСТИТЬ ВТПериодыДвижений
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НАЧАЛОПЕРИОДА(Т.Период, МЕСЯЦ) КАК Период,
	|		ЛОЖЬ КАК ЕстьИзмененныеДвижения
	|	ИЗ
	|		ВТНаборЗаписей КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НАЧАЛОПЕРИОДА(Т.Период, МЕСЯЦ) КАК Период,
	|		ИСТИНА КАК ЕстьИзмененныеДвижения
	|	ИЗ
	|		ВТИзмененныеДвижения КАК Т
	|	) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Период
	|;
	|";
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонТекстаЗапроса,
		ТекстПоляРегистра,
		ТекстПоляРегистраСМинусом,
		ТекстПоляРегистраБезПартий,
		ТекстПоляСуммирования,
		ТекстПоляГруппировкиБезПартий,
		ТекстПоляУсловия);
		
	Запрос.Текст = СтрЗаменить(ШаблонТекстаЗапроса, "&ТекстВыборПоляРегистра", ТекстПоляРегистра);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстПоляРегистраСМинусом", ТекстПоляРегистраСМинусом);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстПоляРегистраБезПартий", ТекстПоляРегистраБезПартий);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстПоляСуммирования", ТекстПоляСуммирования);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстПоляГруппировкиБезПартий", ТекстПоляГруппировкиБезПартий);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстПоляУсловия", ТекстПоляУсловия);
		
	Запрос.Выполнить(); // сформируем временные таблицы с описанием движений
	
	#КонецОбласти
	
	#Область ЗаполнениеНабораЗаписей
	
	// Движения не измененных периодов возьмем из ИБ,
	// а движения измененных периодов и расчетные движения - из набора записей.
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ
	|	&Регистратор КАК Регистратор,
	|	&ТекстПоляРегистра
	|ИЗ
	|	РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Т
	|ГДЕ
	|	Т.Регистратор = &Регистратор
	|	И НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|	И НАЧАЛОПЕРИОДА(Т.Период, МЕСЯЦ) В
	|		(ВЫБРАТЬ Т.Период
	|		 ИЗ ВТПериодыДвижений КАК Т
	|		 ГДЕ НЕ Т.ЕстьИзмененныеДвижения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Регистратор КАК Регистратор,
	|	&ТекстПоляРегистра
	|ИЗ
	|	ВТНаборЗаписей КАК Т
	|ГДЕ
	|	НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|	И НАЧАЛОПЕРИОДА(Т.Период, МЕСЯЦ) В
	|		(ВЫБРАТЬ Т.Период
	|		 ИЗ ВТПериодыДвижений КАК Т
	|		 ГДЕ Т.ЕстьИзмененныеДвижения)
	|";
	
	Запрос.Текст = СтрЗаменить(ШаблонТекстаЗапроса, "&ТекстПоляРегистра", ТекстПоляРегистра);
	
	ТаблицаЗаписей = Запрос.Выполнить().Выгрузить();
	
	ЭтотОбъект.Загрузить(ТаблицаЗаписей);
	
	#КонецОбласти 
	//++//ASP_Crow 23.03.2026 000029567 В расширение
	//АСист-Про
///////////////////////////////
	
	//Если ОбменДанными.Загрузка Тогда
	//	Возврат;
	//КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Партнеры.Ссылка КАК Партнер,
	                      |	Контрагенты.ЮрФизЛицо
	                      |ИЗ
	                      |	Справочник.Контрагенты КАК Контрагенты
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	                      |		ПО Контрагенты.Партнер = Партнеры.Ссылка
	                      |ГДЕ
	                      |	НЕ Партнеры.ПометкаУдаления
	                      |	И НЕ Контрагенты.ПометкаУдаления
	                      |	И Партнеры.Ссылка = &Партнер
	                      |	И Контрагенты.Ссылка = &Контрагент"); //Асист KS
	тзКонтры = Неопределено;
	
	нзВыручка = ЭтотОбъект;
	
	нз = РегистрыНакопления.сег_ДвиженияПоСегментам.СоздатьНаборЗаписей();
	нз.Отбор.Регистратор.Установить(нзВыручка.Отбор.Регистратор.Значение);
	нз.Прочитать();
	
	сч = нз.Количество();
	Пока сч > 0 Цикл
		сч = сч-1;
		Если нз[сч].СуммаВыручки <> 0 Тогда нз.Удалить(сч) КонецЕсли;
	КонецЦикла;
	
	тз = нз.ВыгрузитьКолонки();
	
	тзРаспределенных = Новый ТаблицаЗначений;
	тзРаспределенных.Колонки.Добавить("Подразделение");
	тзРаспределенных.Колонки.Добавить("Партнер");
	отборРаспределенных = Новый Структура("Подразделение, Партнер");
	
	
	тзСрезов = Новый ТаблицаЗначений;
	тзСрезов.Колонки.Добавить("Период");
	тзСрезов.Колонки.Добавить("Партнер");
	тзСрезов.Колонки.Добавить("Срез");
	отборСрезов = Новый Структура("Период, Партнер");
	
	Для Каждого стр из нзВыручка Цикл
		
		Если тзКонтры = Неопределено Тогда
			Запрос.УстановитьПараметр("Партнер", стр.АналитикаУчетаПоПартнерам.Партнер);
			Запрос.УстановитьПараметр("Контрагент", стр.АналитикаУчетаПоПартнерам.Контрагент); //Асист KS
			тзКонтры = Запрос.Выполнить().Выгрузить();
			стрК = тзКонтры.Найти(стр.АналитикаУчетаПоПартнерам.Партнер);
		Иначе
			стрК = тзКонтры.Найти(стр.АналитикаУчетаПоПартнерам.Партнер);
			Если стрК = Неопределено Тогда
				Запрос.УстановитьПараметр("Партнер", стр.АналитикаУчетаПоПартнерам.Партнер);
				Запрос.УстановитьПараметр("Контрагент", стр.АналитикаУчетаПоПартнерам.Контрагент);  //Асист KS
				Рез = Запрос.Выполнить().Выгрузить();
				Для Каждого текК Из Рез Цикл
					ЗаполнитьЗначенияСвойств(тзКонтры.Добавить(), текК);
				КонецЦикла;
				стрК = тзКонтры.Найти(стр.АналитикаУчетаПоПартнерам.Партнер);
			КонецЕсли;
			
		КонецЕсли;
		
		Если стрК = Неопределено Тогда //или стрК.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Продолжить;
		КонецЕсли;
		
		Если стр.СуммаВыручки = 0 Тогда Продолжить КонецЕсли;
		
		
		//ASP.Частичный расчет сегментации перед записью данных в регистр накопления
		отборРаспределенных.Подразделение = стр.Подразделение;
		отборРаспределенных.Партнер = стрК.Партнер;
		масРаспределенных = тзРаспределенных.НайтиСтроки(отборРаспределенных);
		
		Если масРаспределенных.Количество() = 0 Тогда
			сег_Сегментация.РаспределитьПоСегментам(,стр.Подразделение, стрК.Партнер);
			
			стрРаспределенных = тзРаспределенных.Добавить();
			стрРаспределенных.Подразделение = стр.Подразделение;
			стрРаспределенных.Партнер = стрК.Партнер;
		КонецЕсли;
		
		
		/////////////////////////
		отборСрезов.Период = стр.Период;
		отборСрезов.Партнер = стрК.Партнер;
		масСрезов = тзСрезов.НайтиСтроки(отборСрезов);
		
		Если масСрезов.Количество() = 0 Тогда
			срез = РегистрыСведений.сег_СегментацияКонтрагентов.СрезПоследних(стр.Период, Новый Структура("Партнер", стрК.Партнер));
			
			ДополнитьСрез(стрК.Партнер, срез, Справочники.СтруктураПредприятия.ПустаяСсылка());
			
			стрСрезов = тзСрезов.Добавить();
			стрСрезов.Период = стр.Период;
			стрСрезов.Партнер = стрК.Партнер;
			стрСрезов.Срез = срез;
		Иначе
			
			срез = масСрезов[0].Срез
		КонецЕсли;
		
		отборПодр = Новый Структура("Подразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
		масСег = срез.НайтиСтроки(отборПодр);
		
		Для Каждого сег Из масСег Цикл
			зап = тз.Добавить();
			
			зап.Период = стр.Период;
			зап.ПодразделениеФирмы = стр.Подразделение;
			зап.Партнер = стрК.Партнер;
			зап.ВидСегмента = сег.ВидСегмента;
			зап.Сегмент = сег.Сегмент;
			зап.СуммаВыручки = стр.СуммаВыручки;
			Попытка зап.Менеджер = стр.ЗаказКлиента.Менеджер Исключение КонецПопытки;
			зап.БизнесРегион = стрК.Партнер.БизнесРегион;
			зап.Номенклатура = стр.АналитикаУчетаНоменклатуры.Номенклатура;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(стр.Подразделение) Тогда
			
			ДополнитьСрез(стрК.Партнер, срез, стр.Подразделение);
			
			отборПодр.Подразделение = стр.Подразделение;
			масСег = срез.НайтиСтроки(отборПодр);
			
			Для Каждого сег Из масСег Цикл
				зап = тз.Добавить();
				
				зап.Период = стр.Период;
				зап.Подразделение = стр.Подразделение;
				зап.ПодразделениеФирмы = стр.Подразделение;
				зап.Партнер = стрК.Партнер;
				зап.ВидСегмента = сег.ВидСегмента;
				зап.Сегмент = сег.Сегмент;
				зап.СуммаВыручки = стр.СуммаВыручки;
				Попытка зап.Менеджер = стр.ЗаказКлиента.Менеджер Исключение КонецПопытки;
				зап.БизнесРегион = стрК.Партнер.БизнесРегион;
				зап.Номенклатура = стр.АналитикаУчетаНоменклатуры.Номенклатура;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	тз.Свернуть("Период, Партнер, Подразделение, ПодразделениеФирмы, Сегмент, Менеджер, БизнесРегион, Номенклатура, ВидСегмента", "СуммаВыручки, СуммаОплаты");
	//++ставим управляемую блокировку
	Если НЕ ТЗ.Количество()=0 Тогда
		Тзблок=ТЗ.СкопироватьКолонки("Партнер,Подразделение,Номенклатура");
		Тзблок.Свернуть("Партнер,Подразделение,Номенклатура");
		Блокировка = Новый БлокировкаДанных;
		Для Каждого Стр из ТЗблок Цикл
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.сег_ДвиженияПоСегментам");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Партнер", Тзблок.Партнер);
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.сег_ДвиженияПоСегментам");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Подразделение", Тзблок.Подразделение);
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.сег_ДвиженияПоСегментам");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("Номенклатура", Тзблок.Номенклатура);
		КонецЦикла;
		Блокировка.Заблокировать();
	КонецЕсли;
	//--
	
	Для Каждого сег Из тз Цикл
		зап = нз.Добавить();
		ЗаполнитьЗначенияСвойств(зап, сег);
		зап.Регистратор = нз.Отбор.Регистратор.Значение;
	КонецЦикла;
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(нзВыручка.Отбор.Регистратор.Значение))
		И ОбщегоНазначения.ЭтоДокумент(нзВыручка.Отбор.Регистратор.Значение.Метаданные())
		И нзВыручка.Отбор.Регистратор.Значение.Метаданные().Движения.Содержит(Метаданные.РегистрыНакопления.сег_ДвиженияПоСегментам) Тогда
		нз.Записать();
	КонецЕсли;
	
/////////////
//--//ASP_Crow 23.03.2026 000029567 В расширение
КонецПроцедуры

#КонецОбласти

#КонецЕсли

#Область ASP_Доработки

//Асист
&НаСервере
Процедура ДополнитьСрез(партнер, срез, подр)
	
	отборПодр = Новый Структура("Подразделение", подр);
	масСег = срез.НайтиСтроки(отборПодр);
	
	естьДилер = Ложь;
	естьМаркетинг = Ложь;
	естьОборот = Ложь;
	естьПоЧастоте = Ложь;
	
	Для Каждого Тек Из масСег Цикл
		Если Тек.ВидСегмента = Справочники.сег_Сегменты.ДилерскийСегмент Тогда
			естьДилер = Истина
		ИначеЕсли Тек.ВидСегмента = Справочники.сег_Сегменты.МаркетинговыйСегмент Тогда
			естьМаркетинг = Истина
		ИначеЕсли Тек.ВидСегмента = Справочники.сег_Сегменты.ОборотныйСегмент Тогда
			естьОборот = Истина
		ИначеЕсли Тек.ВидСегмента = Справочники.сег_Сегменты.СегментПоЧастотеЗаказов Тогда
			естьПоЧастоте = Истина
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(партнер.сег_Дилер) Тогда
		дилер = партнер.сег_Дилер
	Иначе
		дилер = Справочники.сег_Сегменты.НеДилер
	КонецЕсли;
	
	Если НЕ естьДилер Тогда
		зап = срез.Добавить();
		зап.Подразделение = подр;
		зап.Партнер = партнер;
		зап.ВидСегмента = Справочники.сег_Сегменты.ДилерскийСегмент;
		зап.Сегмент = дилер;
	КонецЕсли;
	Если НЕ естьМаркетинг Тогда
		зап = срез.Добавить();
		зап.Подразделение = подр;
		зап.Партнер = партнер;
		зап.ВидСегмента = Справочники.сег_Сегменты.МаркетинговыйСегмент;
		зап.Сегмент = Справочники.сег_Сегменты.ПервичныйКлиент;
	КонецЕсли;
	Если НЕ естьОборот Тогда
		зап = срез.Добавить();
		зап.Подразделение = подр;
		зап.Партнер = партнер;
		зап.ВидСегмента = Справочники.сег_Сегменты.ОборотныйСегмент;
		зап.Сегмент = Справочники.сег_Сегменты.Маленький;
	КонецЕсли;
	Если НЕ естьДилер Тогда
		зап = срез.Добавить();
		зап.Подразделение = подр;
		зап.Партнер = партнер;
		зап.ВидСегмента = Справочники.сег_Сегменты.СегментПоЧастотеЗаказов;
		зап.Сегмент = Справочники.сег_Сегменты.Редко;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
