
&ИзменениеИКонтроль("НачатьСледующуюКорректировкуОстатковРегистра")
Процедура асп_НачатьСледующуюКорректировкуОстатковРегистра(ПараметрыРасчета, ПараметрыКорректировки, ТипЗаписиКорректировки, ОчищатьКорректировкиСледующихПериодов)

	Если ПараметрыРасчета.ФормироватьНачальныеОстаткиПартий22 Тогда
		// При переходе на ПУ 2.2 все корректировки сделаем с одним типом записи, чтобы можно было "свернуть" все корректировочные движения.
		ТипЗаписи = Перечисления.ТипыЗаписейПартий.СлужебноеПереходНаПартионныйУчет22;
	Иначе
		ТипЗаписи = ТипЗаписиКорректировки;
	КонецЕсли;

	Если ТипыЗаписейКонвертацииДанных().Найти(ТипЗаписи) = Неопределено Тогда

		ТекстДляПротокола = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Тип записи корректировки ""%1"" должен быть указан в %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
		ТипЗаписи,
		"РасчетСебестоимостиПрикладныеАлгоритмы.ТипыЗаписейКонвертацииДанных");

		РасчетСебестоимостиПротоколРасчета.ЗафиксироватьОшибкуРасчета(
		ПараметрыРасчета,
		Перечисления.ТипыОшибокПартионногоУчетаИСебестоимости.ОшибкаВремениВыполнения,
		ТекстДляПротокола);

	КонецЕсли;

	ПараметрыКорректировки.ТипЗаписиКорректировки = ТипЗаписиКорректировки;

	// Обслуживание регистра РасчетСебестоимостиДатыКорректировокОстатков
	ИнициализироватьОписаниеОрганизацийДляВыполненияКорректировки(ПараметрыРасчета, ПараметрыКорректировки);

	ПараметрыКорректировки.ТипЗаписиКорректировки = ТипЗаписи;

	Если ОчищатьКорректировкиСледующихПериодов Тогда
		// Очистим движения корректировок в следующих периодах.
		ОчиститьКорректировкиРегистровВСледующихПериодах(ПараметрыРасчета, ПараметрыКорректировки);
	КонецЕсли;

	// Очистим временные таблицы предыдущих корректировок.
	ИменаУдаляемыхТаблиц = ПолучитьПереченьСуществующихВременныхТаблиц(
	ПараметрыРасчета,
	РасчетСебестоимостиУниверсальныеАлгоритмы.СоединитьСтроки(ПараметрыКорректировки.СуществующиеТаблицы, ПараметрыКорректировки.ИменаСформированныхТаблиц));

	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаУдаляемыхТаблиц, ",", Истина, Истина);
	ИменаУдаляемыхТаблиц = "";

#Удаление
	СлужебныеТаблицы = Новый Структура;
	Для Каждого ОписаниеРегистра Из ПараметрыРасчета.Движения Цикл
		СлужебныеТаблицы.Вставить(ОписаниеРегистра.Значение.ИмяТаблицыНачальныхОстатковРегистра);
	КонецЦикла;

	// Не удаляем таблицы расчетных остатков и таблицы сформированных корректировок
	// (в случае, если несколько корректировок разных регистров выполняются одновременно).
	Для Каждого ИмяТаблицы Из МассивСтрок Цикл

		Если СлужебныеТаблицы.Свойство(ИмяТаблицы) Тогда
			Продолжить;
		ИначеЕсли СтрНачинаетсяС(ИмяТаблицы, "ВТКорректировка") Тогда
			Продолжить;
		КонецЕсли;

		РасчетСебестоимостиУниверсальныеАлгоритмы.ДополнитьСтроку(ИменаУдаляемыхТаблиц, ИмяТаблицы);

	КонецЦикла;
#КонецУдаления
#Вставка
	Для Каждого ИмяТаблицы Из МассивСтрок Цикл
		
		Если СтрНачинаетсяС(ИмяТаблицы, "ВТРасчетныеНачальныеОстатки") Тогда
			Продолжить;
		ИначеЕсли СтрНачинаетсяС(ИмяТаблицы, "ВТКорректировка") Тогда
			Продолжить;
		КонецЕсли;
		
		РасчетСебестоимостиУниверсальныеАлгоритмы.ДополнитьСтроку(ИменаУдаляемыхТаблиц, ИмяТаблицы);
		
	КонецЦикла;

#КонецВставки

	УничтожитьВременныеТаблицы(ПараметрыРасчета, ИменаУдаляемыхТаблиц);

	// Инициализируем таблицу расчетных начальных остатков регистра.
	СформироватьТаблицуРасчетныхНачальныхОстатковРегистра(ПараметрыРасчета, ПараметрыКорректировки);

КонецПроцедуры

&ИзменениеИКонтроль("ПолучитьДанныеЭтапаРасчета")
Функция асп_ПолучитьДанныеЭтапаРасчета(ПараметрыРасчета, ТекстЗапроса, ПараметрыНумерации, ОчищатьВременныеТаблицы, Пояснение)

	ПараметрыРасчета.РаспределениеПартий.Вставить("ПараметрыНумерации", ПараметрыНумерации);

	ОписаниеДвижений = ПараметрыРасчета.РаспределениеПартий.ОписаниеДвижений;

	// Подготовим запрос.
	Запрос = Новый Запрос;
	#Вставка
    //++ НЕ УТ ASP_Crow 11.03.2026 000029567 В расширени
	Запрос.УстановитьПараметр("АналитическийУчетПоГруппамПродукции", ПолучитьФункциональнуюОпцию("АналитическийУчетПоГруппамПродукции"));
	//-- НЕ УТ
	#КонецВставки
	Если ПараметрыРасчета.Свойство("ИдетРасчетСебестоимости") Тогда
		ИдетРасчетСебестоимости = ПараметрыРасчета.ИдетРасчетСебестоимости;
	Иначе
		ИдетРасчетСебестоимости = Ложь;
	КонецЕсли;
	ИнициализироватьСвойстваЗапроса(Запрос, ПараметрыРасчета);

	Для Каждого КлючИЗначение Из ПараметрыРасчета.ДополнительныеПараметрыЗапросаЭтапа Цикл
		Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;

	Если ПараметрыРасчета.ПараметрыОтладки.Свойство("ТекстЗапросаДляОтладки")
		И ПроверитьНеобходимостьПрерватьРасчетДляТестирования(ПараметрыРасчета, "", Ложь) Тогда
		Запрос.Текст = ПараметрыРасчета.ПараметрыОтладки.ТекстЗапросаДляОтладки;
	Иначе
		Запрос.Текст = ТекстЗапроса;
	КонецЕсли;

	ВыбиратьДанныеДляРасчетаВоВременнуюТаблицу(Запрос);

	// Запомним существующие временные таблицы.
	Если ОчищатьВременныеТаблицы Тогда
		СуществующиеВТ = ПолучитьПереченьСуществующихВременныхТаблиц(Запрос);
	КонецЕсли;

	Если ЗначениеЗаполнено(ОписаниеДвижений.ВременныеТаблицыДляСледующихЭтапов) Тогда
		УничтожитьВременныеТаблицы(
		ПараметрыРасчета,
		ОписаниеДвижений.ВременныеТаблицыДляСледующихЭтапов);
	КонецЕсли;

	// Выполним запрос.
	ВыполнитьЗапросСЗамеромДляПротокола(ПараметрыРасчета, Запрос,,,, Пояснение);

	// Пронумеруем строки таблицы Данные.
	Если ЗначениеЗаполнено(ПараметрыНумерации) Тогда

		РасчетСебестоимостиПротоколРасчета.НачалоФормированиеВременнойТаблицы(ПараметрыРасчета, "Данные", НСтр("ru='Нумерация строк'", ОбщегоНазначения.КодОсновногоЯзыка()));

		ЗаполнитьНомераСтрокВременнойТаблицы(
		ПараметрыРасчета,
		ПараметрыНумерации,
		"Данные");

		РасчетСебестоимостиПротоколРасчета.ОкончаниеФормированиеВременнойТаблицы(ПараметрыРасчета);

	КонецЕсли;

	// Уничтожим вспомогательные временные таблицы, созданные в данном этапе расчета.
	Если ОчищатьВременныеТаблицы Тогда

		СуществующиеВТ = СуществующиеВТ + ?(СуществующиеВТ = "", "", ",") + "Данные";

		Если ЗначениеЗаполнено(ОписаниеДвижений.ИмяВременнойТаблицы) Тогда
			СуществующиеВТ = СуществующиеВТ + "," + ОписаниеДвижений.ИмяВременнойТаблицы;
		КонецЕсли;

		Если ЗначениеЗаполнено(ОписаниеДвижений.ВременныеТаблицыДляСледующихЭтапов) Тогда
			СуществующиеВТ = СуществующиеВТ + "," + ОписаниеДвижений.ВременныеТаблицыДляСледующихЭтапов;
		КонецЕсли;

		ОписаниеДвижений.ВременныеТаблицыТекущегоЭтапа =
		ПолучитьПереченьСуществующихВременныхТаблиц(Запрос, СуществующиеВТ);

	КонецЕсли;

	ПроверитьНеобходимостьПрерватьРасчетДляТестирования(ПараметрыРасчета, "ПолучитьДанныеЭтапаРасчета");

	ПараметрыРасчета.ДополнительныеПараметрыЗапросаЭтапа.Очистить();

	Возврат Истина;

КонецФункции

