
#Область ПрограммныйИнтерфейс

// Добавляет поля ресурсов в список запрещенных для выбора полей отчета.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма отчета.
//	СписокПолей - Массив - Массив имен полей, которые необходимо добавить к запрещенным.
//
Процедура ДобавитьПоляРесурсовВЗапрещенныеПоля(Форма, СписокПолей) Экспорт
	
	
	
КонецПроцедуры

// Открыть форму выбора периода.
// 
// Параметры:
//  ПараметрыВыбора - Структура Из КлючИЗначение
//   *НачалоПериода - Дата
//   *КонецПреиода - Дата
//  ЭлементФормы - КнопкаФормы - Кнопка выбора периода
//  ОписаниеОповещения - ОписаниеОповещения - Действия после выбора периода
Процедура ОткрытьФормуВыбораПериода(ПараметрыВыбора, ЭлементФормы, ОписаниеОповещения) Экспорт
	
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, ЭлементФормы, , , , ОписаниеОповещения);
	
КонецПроцедуры

// Поле организация при изменении.
// 
// Параметры:
//  Элемент - ПолеВвода - 
//  ПолеОрганизация - Строка - Имя поля ввода организации
//  Организация - СправочникСсылка.Организации - 
//  ВключатьОбособленныеПодразделения - Булево - Включать обособленные подразделения
Процедура ПолеОрганизацияПриИзменении(Элемент, ПолеОрганизация, Организация, ВключатьОбособленныеПодразделения) Экспорт
	
	Если ЗначениеЗаполнено(ПолеОрганизация) Тогда 
		Возврат;
	КонецЕсли;
	
	Организация = Неопределено;
	
КонецПроцедуры

// Организация при изменении.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Элемент - ПолеВвода
Процедура ОрганизацияПриИзменении(Форма, Элемент) Экспорт


КонецПроцедуры

// Дополнительные поля перед началом добавления.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Элемент - ТаблицаФормы
//  Отказ - Булево
//  Копирование - Булево
//  Родитель - ГруппаФормы
//  Группа - Булево
Процедура ДополнительныеПоляПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа) Экспорт
	
	
КонецПроцедуры

// Дополнительные поля перед началом изменения.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Элемент - ТаблицаФормы
//  Отказ - Булево
Процедура ДополнительныеПоляПередНачаломИзменения(Форма, Элемент, Отказ) Экспорт
	
	
КонецПроцедуры

// Группировка перед началом добавления.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Элемент - ТаблицаФормы
//  Отказ - Булево
//  Копирование - Булево
//  Родитель - ГруппаФормы
//  Группа - Булево
Процедура ГруппировкаПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа) Экспорт
	
	
КонецПроцедуры 

// Группировка перед началом изменения.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Элемент - ТаблицаФормы
//  Отказ - Булево
Процедура ГруппировкаПередНачаломИзменения(Форма, Элемент, Отказ) Экспорт
	
	
	
КонецПроцедуры

// Вызывается из обработчика события ПриИзменении табличного поля Отбор формы отчета.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма отчета.
//	Элемент - ТаблицаФормы - Таблица отбора.
//	ЕстьРеквизитПодразделение - Булево - Признак наличия реквизита подразделение.
//
Процедура ОтборыПриИзменении(Форма, Элемент, ЕстьРеквизитПодразделение = Истина) Экспорт
	
	
КонецПроцедуры

// Вызывается из обработчика события ПередНачаломДобавления табличного поля Отбор.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма отчета.
//	Элемент - ТаблицаФормы - Таблица отбора.
//	Отказ - Булево - Признак отказа.
//	Копирование - Булево - Признак копирования.
//	Родитель - Произвольный - Ссылка на родителя.
//	Группа - Булево - Признак добавления группы.
//
Процедура ОтборыПередНачаломДобавления(Форма, Элемент, Отказ, Копирование, Родитель, Группа) Экспорт
	
	
	
КонецПроцедуры

// Вызывается из обработчика события ПередНачаломИзменения табличного поля Отбор.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма отчета.
//	Элемент - ТаблицаФормы - Таблица отбора.
//	Отказ - Булево - Признак отказа.
//
Процедура ОтборыПередНачаломИзменения(Форма, Элемент, Отказ) Экспорт
	
	
	
КонецПроцедуры

// Предлагает сохранить табличное поле отчета в наиболее часто используемом формате.
//
// Параметры:
//  Форма        - ФормаКлиентскогоПриложения - форма отчета.
//  ИмяТабличногоДокумента - Строка - имя реквизита с данными табличного документа.
//  ТипПоУмолчанию - ТипФайлаТабличногоДокумента - позволяет переопределить формат по умолчанию для текущего сохранения
//
Процедура ОтчетСохранитьКак(Форма, ИмяТабличногоДокумента = "Результат", ТипПоУмолчанию = Неопределено) Экспорт
	
	БухгалтерскиеОтчетыКлиент.ОтчетСохранитьКак(Форма);
	
КонецПроцедуры

// Поле организация открытие.
// 
// Параметры:
//  Элемент - ПолеВвода
//  СтандартнаяОбработка - Булево
//  ПолеОрганизация - Строка - Имя поля организации
//  СоответствиеОрганизаций - Соответствие Из КлючИЗначение
Процедура ПолеОрганизацияОткрытие(Элемент, СтандартнаяОбработка, ПолеОрганизация, СоответствиеОрганизаций) Экспорт
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ПолеОрганизация) Тогда
		Если СоответствиеОрганизаций.Свойство(ПолеОрганизация) Тогда
			Значение = СоответствиеОрганизаций[ПолеОрганизация];
			Если ТипЗнч(Значение) = Тип("Структура") Тогда
				ПоказатьЗначение( , Значение.Организация);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Поле организация обработка выбора.
// 
// Параметры:
//  Элемент - ПолеВвода
//  ВыбранноеЗначение - СправочникСсылка.Организации
//  СтандартнаяОбработка - Булево
//  СоответствиеОрганизаций - Соответствие из КлючИЗначение
//  Организация  - СправочникСсылка.Организации
//  ВключатьОбособленныеПодразделения - Булево
Процедура ПолеОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, СоответствиеОрганизаций,
	Организация, ВключатьОбособленныеПодразделения) Экспорт 
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Значение = СоответствиеОрганизаций[ВыбранноеЗначение];
		Если ТипЗнч(Значение) = Тип("Структура") Тогда 
			Организация = Значение.Организация;
			ВключатьОбособленныеПодразделения = Значение.ВключатьОбособленныеПодразделения;
		Иначе
			Организация = Неопределено;
			ВключатьОбособленныеПодразделения = Неопределено;
		КонецЕсли;
	Иначе
		Организация = Неопределено;
		ВключатьОбособленныеПодразделения = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// Обработка расшифровки стандартного отчета.
// 
// Параметры:
//  ФормаОтчета - ФормаКлиентскогоПриложения
//  Элемент - ТабличныйДокумент
//  Расшифровка - ДанныеРасшифровкиКомпоновкиДанных
//  СтандартнаяОбработка - Булево
Процедура ОбработкаРасшифровкиСтандартногоОтчета(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ПараметрыРасшифровки = ОтчетыУТВызовСервераПереопределяемый.ПолучитьПараметрыРасшифровкиОтчета(ФормаОтчета.ДанныеРасшифровки, Расшифровка);
	Если НЕ ЗначениеЗаполнено(ПараметрыРасшифровки) Тогда
		Возврат;
	КонецЕсли;
	Если ПараметрыРасшифровки.ОткрытьОбъект Тогда
		ПоказатьЗначение( , ПараметрыРасшифровки.Значение);
	КонецЕсли;
	
КонецПроцедуры

// Вызывается из обработчика события ПриОткрытии формы отчета.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма отчета.
//	Отказ - Булево - Признак отказа.
//
Процедура ПриОткрытии(Форма, Отказ) Экспорт
	
КонецПроцедуры

#КонецОбласти