
&ИзменениеИКонтроль("ДобавитьТоварыПредприятия")
Функция асп_ДобавитьТоварыПредприятия(Форма, Знач ТаблицаТовары, КэшДанных)
	
	ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ТаблицаТовары, "Индекс");
	
	ВариантГруппировки = Форма.ВариантГруппировки;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таблица.Индекс КАК Индекс,
	|	ВЫРАЗИТЬ(Таблица.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(Таблица.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика
	|ПОМЕСТИТЬ ТаблицаНоменклатура
	|ИЗ
	|	&Таблица КАК Таблица
	|ГДЕ
	|	Таблица.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатура.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ТаблицаНоменклатура.Номенклатура.Наименование КАК Наименование,
	|	&ПолеСвязиИерархии,
	|	ТаблицаНоменклатура.Номенклатура КАК Номенклатура,
	#Вставка
	|	ISNULL(НоменклатураКлиента.НоменклатураКлиентаСсылка,ЗНАЧЕНИЕ(Справочник.НоменклатураКонтрагентов.ПустаяСсылка))           КАК НоменклатураКлиента,
	#КонецВставки
	|	ТаблицаНоменклатура.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ТаблицаНоменклатура.Номенклатура.ЦеноваяГруппа КАК ЦеноваяГруппа,
	|	ТаблицаНоменклатура.Характеристика КАК Характеристика,
	|	ТаблицаНоменклатура.Номенклатура.Артикул КАК Артикул,
	|	ВЫБОР
	|		КОГДА ТаблицаНоменклатура.Номенклатура.ИспользованиеХарактеристик В (ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры), ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры), ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ХарактеристикиИспользуются
	|ИЗ
	|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
	#Вставка
	|ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|НоменклатураКонтрагентов.Номенклатура КАК Номенклатура,
	|МАКСИМУМ(НоменклатураКонтрагентов.Ссылка) КАК НоменклатураКлиентаСсылка
	|ИЗ
	|Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	|ГДЕ
	|НоменклатураКонтрагентов.Номенклатура В(Выбрать ТаблицаНоменклатура.Номенклатура из ТаблицаНоменклатура)
	|И НоменклатураКонтрагентов.Владелец = &Клиент
	|
	|СГРУППИРОВАТЬ ПО
	|НоменклатураКонтрагентов.Номенклатура) КАК НоменклатураКлиента
	|ПО ТаблицаНоменклатура.Номенклатура = НоменклатураКлиента.Номенклатура 
	#КонецВставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТаблицаНоменклатура.Индекс
	#Удаление
	|ИТОГИ ПО
	|	Номенклатура";
	#КонецУдаления
	#Вставка
	|ИТОГИ
	|МАКСИМУМ(НоменклатураКлиента)
	|ПО
	|	Номенклатура";
	#КонецВставки
	
	Если Форма.ИспользоватьУпаковкиНоменклатуры Тогда
		Запрос.Текст = Запрос.Текст + "
		|;
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныНоменклатуры.Номенклатура   КАК Номенклатура,
		|	ЦеныНоменклатуры.Характеристика КАК Характеристика,
		|	ЦеныНоменклатуры.Упаковка       КАК Упаковка,
		|	ЦеныНоменклатуры.ВидЦены        КАК ВидЦены
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаДокумента, (Номенклатура, Характеристика) В (ВЫБРАТЬ Т.Номенклатура, Т.Характеристика ИЗ ТаблицаНоменклатура КАК Т) И ВидЦены В (&ВидыЦен)) КАК ЦеныНоменклатуры
		|";
	КонецЕсли;

	ИерархическоеДерево = Истина;
	Если ВариантГруппировки = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоИерархии Тогда
		
		ПолеСвязиИерархии = "ТаблицаНоменклатура.Номенклатура.Родитель КАК Родитель,";
		ЗапросИерархии = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаНоменклатура.Номенклатура.Родитель КАК Номенклатура,
		|	ТаблицаНоменклатура.Номенклатура.Родитель.Наименование КАК Наименование,
		|	ТаблицаНоменклатура.Номенклатура.Родитель.ЭтоГруппа КАК ИерархияЭтоГруппа,
		|	ТаблицаНоменклатура.Номенклатура.Родитель.ЭтоГруппа КАК ЭтоИерархия
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|ГДЕ
		|	ТаблицаНоменклатура.Номенклатура.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|АВТОУПОРЯДОЧИВАНИЕ
		|ИТОГИ ПО
		|	Номенклатура ТОЛЬКО ИЕРАРХИЯ";
		
	ИначеЕсли ВариантГруппировки = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам Тогда
		
		ПолеСвязиИерархии = "";
		ЗапросИерархии = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаНоменклатура.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ТаблицаНоменклатура.Номенклатура.ВидНоменклатуры.Наименование КАК Наименование,
		|	ТаблицаНоменклатура.Номенклатура.ВидНоменклатуры.ЭтоГруппа КАК ИерархияЭтоГруппа,
		|	ИСТИНА КАК ЭтоИерархия
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|АВТОУПОРЯДОЧИВАНИЕ
		|ИТОГИ
		|	МАКСИМУМ(ЭтоИерархия)
		|ПО
		|	ВидНоменклатуры ТОЛЬКО ИЕРАРХИЯ";
		
	Иначе
		
		ИерархическоеДерево = Ложь;
		ПолеСвязиИерархии = "";
		ЗапросИерархии = 
		"ВЫБРАТЬ
		|	1 КАК Поле1
		|ГДЕ
		|	ЛОЖЬ";
		
	КонецЕсли; 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ПолеСвязиИерархии,",ПолеСвязиИерархии);
	
	ВыбранныеВидыЦен = УстановкаЦенКлиентСервер.ВыбранныеВидыЦен(Форма);
	ВыбранныеСтрокиВидовЦен = УстановкаЦенКлиентСервер.ВыбранныеСтрокиТаблицыВидовЦен(Форма);
	
	Запрос.УстановитьПараметр("Таблица",       ТаблицаТовары);
	Запрос.УстановитьПараметр("ВидыЦен",       ВыбранныеВидыЦен);
	Запрос.УстановитьПараметр("ДатаДокумента", КонецДня(ДатаДокумента(Форма)));
	#Вставка 
	//Если Форма.ИмяФормы = "Обработка.ПрайсЛист.Форма.Форма" Тогда
	//	Запрос.УстановитьПараметр("Клиент", Форма.Клиент);
	//Иначе
	//	Запрос.УстановитьПараметр("Клиент", Справочники.Партнеры.ПустаяСсылка());
	//КонецЕсли;
	//++ASP_Crow 25.06.2024 0000023561 Изменился алгоритм в новой версии, адаптировали
	Если ТипЗнч(Форма) = Тип("Структура") Тогда
		Если Форма.Свойство("Клиент") Тогда
			Запрос.УстановитьПараметр("Клиент", Форма.Клиент);
		Иначе
			Запрос.УстановитьПараметр("Клиент", Справочники.Партнеры.ПустаяСсылка());
		КонецЕсли;
	Иначе
		Запрос.УстановитьПараметр("Клиент", Справочники.Партнеры.ПустаяСсылка());
	КонецЕсли;
	//--ASP_Crow 25.06.2024 0000023561
	#КонецВставки
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаНоменклатура = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если Форма.ИспользоватьУпаковкиНоменклатуры Тогда
		Упаковки = РезультатЗапроса[2].Выгрузить(); // ТаблицаЗначений
		Упаковки.Индексы.Добавить("Номенклатура, Характеристика");
	КонецЕсли;
	
	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	ПустаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
	
	ТаблицаНоменклатуры = СоздатьТаблицуНоменклатуры(Форма);
	ТаблицаНоменклатуры.Колонки.Добавить("СтрокаДереваЦен");
	
	// проверяем откуда вызов 
	// если из управляемой формы значит ТипЗнч(Форма.ДеревоЦен) = Тип("ДанныеФормыДерево"), получения набора строк через *.ПолучитьЭлементы()
	// если из структуры значит ТипЗнч(Форма.ДеревоЦен) = Тип("Структура"), получения набора строк через *.Строки
	ДеревоЦенЭтоДанныеФормыДерево = (ТипЗнч(Форма.ДеревоЦен) = Тип("ДанныеФормыДерево"));

	Параметры = Новый Структура();
	Параметры.Вставить("ДеревоЦенЭтоДанныеФормыДерево", (ТипЗнч(Форма.ДеревоЦен) = Тип("ДанныеФормыДерево")));
	
	Если ИерархическоеДерево Тогда
		Запрос.Текст = ЗапросИерархии;
		ДеревоИерархия = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		СкопироватьСтрокиДереваИерархии(Форма, Форма.ДеревоЦен, ДеревоИерархия, КэшДанных);
	КонецЕсли; 
	
	Если ДеревоЦенЭтоДанныеФормыДерево Тогда
		ЭлементыНоменклатура = Форма.ДеревоЦен.ПолучитьЭлементы(); // ДанныеФормыКоллекцияЭлементовДерева
	Иначе
		ЭлементыНоменклатура = Форма.ДеревоЦен.Строки;
	КонецЕсли;	
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика", ВыборкаНоменклатура.Номенклатура, ПустаяХарактеристика);
		НайденнаяСтрока = НайтиСтрокуДереваЦен(Форма, ПараметрыОтбора, КэшДанных, Ложь);
		
		Если НайденнаяСтрока <> Неопределено Тогда
			ЭлементНоменклатура = НайденнаяСтрока;
			ЗаполнитьЗначенияСвойств(ЭлементНоменклатура, ВыборкаНоменклатура);
		Иначе
			
			Если ИерархическоеДерево Тогда
				Если ВариантГруппировки = Перечисления.ВариантыНавигацииВФормахНоменклатуры.ПоВидам Тогда
					ПараметрыОтбора = Новый Структура("Номенклатура,Характеристика,ВидНоменклатуры", 
						ПустаяНоменклатура,ПустаяХарактеристика, ВыборкаНоменклатура.ВидНоменклатуры);
				Иначе
					ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика", 
						ВыборкаНоменклатура.Родитель, ПустаяХарактеристика);
				КонецЕсли; 
				
				НайденнаяИерархия = НайтиСтрокуДереваЦен(Форма, ПараметрыОтбора, КэшДанных, Ложь);
				
				Если НайденнаяИерархия = Неопределено Тогда
					ЭлементНоменклатура = ЭлементыНоменклатура.Добавить();
				Иначе
					Если ТипЗнч(НайденнаяИерархия) = Тип("ДанныеФормыЭлементДерева") Тогда
						ЭлементНоменклатура = НайденнаяИерархия.ПолучитьЭлементы().Добавить();
					Иначе
						ЭлементНоменклатура = НайденнаяИерархия.Строки.Добавить();
					КонецЕсли; 
				КонецЕсли; 
			Иначе
				ЭлементНоменклатура = ЭлементыНоменклатура.Добавить();
			КонецЕсли; 
			
			ЗаполнитьЗначенияСвойств(ЭлементНоменклатура, ВыборкаНоменклатура);
			УстановкаЦенКлиентСервер.ЗаполнитьИндексКартинкиСтрокиДереваЦен(ЭлементНоменклатура);
			
			НоваяСтрокаТЗ = НоваяСтрокаТаблицыСоответствия(КэшДанных, ЭлементНоменклатура, ДеревоЦенЭтоДанныеФормыДерево);
			
			ЗаполнитьЗначенияСвойств(ТаблицаНоменклатуры.Добавить(), НоваяСтрокаТЗ);
			
			Если Форма.ИспользоватьУпаковкиНоменклатуры Тогда
				
				ПараметрыПоиска = Новый Структура("Номенклатура, Характеристика", ЭлементНоменклатура.Номенклатура, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
				
				НайденныеСтроки = Упаковки.НайтиСтроки(ПараметрыПоиска);
				Для Каждого ВыборкаУпаковки Из НайденныеСтроки Цикл
					ЭлементНоменклатура["Упаковка" + ИмяКолонкиПоВидуЦены(ВыборкаУпаковки.ВидЦены, КэшДанных)] = ВыборкаУпаковки.Упаковка;
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Форма.ИспользоватьХарактеристикиНоменклатуры Тогда
			
			ВыборкаХарактеристики = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Если ДеревоЦенЭтоДанныеФормыДерево Тогда
				ЭлементыХарактеристики = ЭлементНоменклатура.ПолучитьЭлементы();
			Иначе
				ЭлементыХарактеристики = ЭлементНоменклатура.Строки;
			КонецЕсли;
			
			Пока ВыборкаХарактеристики.Следующий() Цикл
				
				Если ЗначениеЗаполнено(ВыборкаХарактеристики.Характеристика) Тогда
					
					ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика", ВыборкаХарактеристики.Номенклатура, ВыборкаХарактеристики.Характеристика);
					НайденнаяСтрока = НайтиСтрокуДереваЦен(Форма, ПараметрыОтбора, КэшДанных, Ложь);
					
					Если НайденнаяСтрока <> Неопределено Тогда
						ЭлементХарактеристика = НайденнаяСтрока;
					Иначе
						
						ЭлементХарактеристика = ЭлементыХарактеристики.Добавить();
						ЗаполнитьЗначенияСвойств(ЭлементХарактеристика, ВыборкаХарактеристики);
						УстановкаЦенКлиентСервер.ЗаполнитьИндексКартинкиСтрокиДереваЦен(ЭлементХарактеристика);
						
						НоваяСтрокаТЗ = НоваяСтрокаТаблицыСоответствия(КэшДанных, ЭлементХарактеристика, ДеревоЦенЭтоДанныеФормыДерево);
						
						ЗаполнитьЗначенияСвойств(ТаблицаНоменклатуры.Добавить(), НоваяСтрокаТЗ);
						
						Если Форма.ИспользоватьУпаковкиНоменклатуры Тогда
							
							ПараметрыПоиска = Новый Структура("Номенклатура,Характеристика", ЭлементХарактеристика.Номенклатура, ЭлементХарактеристика.Характеристика);
							
							НайденныеСтроки = Упаковки.НайтиСтроки(ПараметрыПоиска);
							Для Каждого ВыборкаУпаковки Из НайденныеСтроки Цикл
								ЭлементХарактеристика["Упаковка" + ИмяКолонкиПоВидуЦены(ВыборкаУпаковки.ВидЦены, КэшДанных)] = ВыборкаУпаковки.Упаковка;
							КонецЦикла;
							
						КонецЕсли;
						
						ЗаполнитьФормулу(ВыбранныеСтрокиВидовЦен, ЭлементХарактеристика);
						ЗаполнитьВалюту(ВыбранныеСтрокиВидовЦен, ЭлементХарактеристика);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СохранитьТаблицуСоответвияНоменклатуры(Форма, КэшДанных.ТаблицаСоответствияНоменклатурыСтрокамДереваТоваров);
	Возврат ТаблицаНоменклатуры;
	
КонецФункции


&ИзменениеИКонтроль("СоздатьТаблицуНоменклатуры")
Функция асп_СоздатьТаблицуНоменклатуры(Форма)
	ТаблицаЗначений = Новый ТаблицаЗначений();

	ТаблицаЗначений.Колонки.Добавить("НоменклатураПартнера",   Новый ОписаниеТипов("СправочникСсылка.НоменклатураКонтрагентов"));
	#Вставка
	ТаблицаЗначений.Колонки.Добавить("НоменклатураКлиента", Новый ОписаниеТипов("СправочникСсылка.НоменклатураКонтрагентов"));
	#КонецВставки
	ТаблицаЗначений.Колонки.Добавить("Номенклатура",           Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Если Форма.ИспользуетсяЦенообразование25 Тогда
		ТаблицаЗначений.Колонки.Добавить("Характеристика",     Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ТаблицаЗначений.Колонки.Добавить("ХарактеристикаЦО",   Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатурыДляЦенообразования"));
		ТаблицаЗначений.Колонки.Добавить("СерияЦО",            Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатурыДляЦенообразования"));
		ТаблицаЗначений.Колонки.Добавить("СерияЦОДляСвязи",    Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатурыДляЦенообразования"));
		ТаблицаЗначений.Колонки.Добавить("УпаковкаЦО",         Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
		ТаблицаЗначений.Колонки.Добавить("УпаковкаЦОДляСвязи", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	Иначе	
		ТаблицаЗначений.Колонки.Добавить("Характеристика",     Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	КонецЕсли;

	Возврат ТаблицаЗначений;

КонецФункции

&ИзменениеИКонтроль("СоздатьТаблицуТовары")
Функция асп_СоздатьТаблицуТовары(ЭтоРегистрацияЦенПоставщика, ИспользуетсяЦенообразование25)

	ТаблицаЗначений = Новый ТаблицаЗначений();

	ТаблицаЗначений.Колонки.Добавить("НоменклатураПартнера", Новый ОписаниеТипов("СправочникСсылка.НоменклатураКонтрагентов"));
	ТаблицаЗначений.Колонки.Добавить("Номенклатура",           Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Если ИспользуетсяЦенообразование25 Тогда 
		ТаблицаЗначений.Колонки.Добавить("ХарактеристикаЦО",   Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатурыДляЦенообразования"));		
		ТаблицаЗначений.Колонки.Добавить("СерияЦО",            Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатурыДляЦенообразования"));		
		ТаблицаЗначений.Колонки.Добавить("СерияЦОДляСвязи",    Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатурыДляЦенообразования"));		
		ТаблицаЗначений.Колонки.Добавить("УпаковкаЦО",         Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
		ТаблицаЗначений.Колонки.Добавить("УпаковкаЦОДляСвязи", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	Иначе			
		ТаблицаЗначений.Колонки.Добавить("Характеристика",         Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	КонецЕсли;
	Если ЭтоРегистрацияЦенПоставщика Тогда
		ТаблицаЗначений.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦенПоставщиков"));
		ТаблицаЗначений.Колонки.Добавить("УпаковкаЗаказа", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
		ТаблицаЗначений.Колонки.Добавить("УпаковкаИмя", Новый ОписаниеТипов("Строка"));
		ТаблицаЗначений.Колонки.Добавить("МинимальнаяПартияПоставки", Новый ОписаниеТипов("Число"));
		ТаблицаЗначений.Колонки.Добавить("УстановкаУсловий", Новый ОписаниеТипов("Булево"));
	Иначе
		ТаблицаЗначений.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
		ТаблицаЗначений.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
		#Вставка
		ТаблицаЗначений.Колонки.Добавить("НоменклатураКлиента", Новый ОписаниеТипов("СправочникСсылка.НоменклатураКонтрагентов"));
		#КонецВставки
	КонецЕсли;
	ТаблицаЗначений.Колонки.Добавить("Цена",                   Новый ОписаниеТипов("Число"));
	ТаблицаЗначений.Колонки.Добавить("Упаковка",               Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТаблицаЗначений.Колонки.Добавить("Формула",                Новый ОписаниеТипов("Строка"));

	Возврат ТаблицаЗначений;

КонецФункции

&ИзменениеИКонтроль("ПостроитьДеревоЦен")
Процедура асп_ПостроитьДеревоЦен(Форма)
	
	ИспользуетсяЦенообразование25 = Форма.ИспользуетсяЦенообразование25;
	
	ЭтоРегистрацияЦенПоставщика = ЭтоРегистрацияЦенПоставщика(Форма);
	
	ДобавляемыеКолонкиТаблицыЦен = Новый Массив();
	УдаляемыеКолонкиТаблицыЦен   = Новый Массив();
	УдаляемыеЭлементы            = Новый Массив();
	УсловныеОформления           = Новый Массив();
	
	ВариантГруппировки = Форма.ВариантГруппировки;
	
	Если ТипЗнч(Форма.ДеревоЦен) = Тип("ДанныеФормыКоллекция") Тогда
		ДеревоЗначений = Новый ТаблицаЗначений;
	Иначе
		ДеревоЗначений = Новый ДеревоЗначений;
	КонецЕсли;
	
	ДеревоЗначений.Колонки.Добавить("Номенклатура",               Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	#Вставка
	ДеревоЗначений.Колонки.Добавить("НоменклатураКлиента",        Новый ОписаниеТипов("СправочникСсылка.НоменклатураКонтрагентов"));
	#КонецВставки
	ДеревоЗначений.Колонки.Добавить("Характеристика",             Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ДеревоЗначений.Колонки.Добавить("ИндексКартинки",             Новый ОписаниеТипов("Число"));
	ДеревоЗначений.Колонки.Добавить("ЕдиницаИзмерения",           Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ДеревоЗначений.Колонки.Добавить("Артикул",                    Новый ОписаниеТипов("Строка"));
	ДеревоЗначений.Колонки.Добавить("ХарактеристикиИспользуются", Новый ОписаниеТипов("Булево"));
	
	Если ЗначениеЗаполнено(ВариантГруппировки) Тогда
		ДеревоЗначений.Колонки.Добавить("ИерархияЭтоГруппа", Новый ОписаниеТипов("Булево"));
		ДеревоЗначений.Колонки.Добавить("ЭтоИерархия", Новый ОписаниеТипов("Булево"));
	КонецЕсли; 
	
	Если ЭтоРегистрацияЦенПоставщика Тогда
		
		ДеревоЗначений.Колонки.Добавить("НоменклатураПартнера",     Новый ОписаниеТипов("СправочникСсылка.НоменклатураКонтрагентов"));
		
		Если ЭтоЗагрузкаЦенПоставщикаИзВнешнихФайлов(Форма) Тогда
			ДеревоЗначений.Колонки.Добавить("Код",                                   Новый ОписаниеТипов("Строка"));
			ДеревоЗначений.Колонки.Добавить("НоменклатураНаименование",              Новый ОписаниеТипов("Строка"));
			ДеревоЗначений.Колонки.Добавить("ХарактеристикаНаименование",            Новый ОписаниеТипов("Строка"));
			ДеревоЗначений.Колонки.Добавить("СерияНаименование",                     Новый ОписаниеТипов("Строка"));
			ДеревоЗначений.Колонки.Добавить("УпаковкаНаименование",                  Новый ОписаниеТипов("Строка"));
			ДеревоЗначений.Колонки.Добавить("НоменклатураСопоставленаАвтоматически", Новый ОписаниеТипов("Булево"));
			ДеревоЗначений.Колонки.Добавить("ЭтоДубль",                              Новый ОписаниеТипов("Булево"));
			ДеревоЗначений.Колонки.Добавить("СтрокаСопоставлена",                    Новый ОписаниеТипов("Булево"));
			ДеревоЗначений.Колонки.Добавить("КоличествоНоменклатурыДляВыбора",       Новый ОписаниеТипов("Число"));
			ДеревоЗначений.Колонки.Добавить("КодОтличается",                         Новый ОписаниеТипов("Булево"));
			ДеревоЗначений.Колонки.Добавить("АртикулОтличается",                     Новый ОписаниеТипов("Булево"));
			ДеревоЗначений.Колонки.Добавить("НоменклатураНаименованиеОтличается",    Новый ОписаниеТипов("Булево"));
			ДеревоЗначений.Колонки.Добавить("ЦенаНеРаспознана",                      Новый ОписаниеТипов("Булево"));
			ДеревоЗначений.Колонки.Добавить("ЦеныИзменены",                          Новый ОписаниеТипов("Булево"));
			
			ДеревоЗначений.Колонки.Добавить("Серия",                                 Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
			ДеревоЗначений.Колонки.Добавить("Упаковка",                              Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
		КонецЕсли;
		
	Иначе
		ДеревоЗначений.Колонки.Добавить("ВидНоменклатуры",            Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
		ДеревоЗначений.Колонки.Добавить("ХарактеристикаЦО",           Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатурыДляЦенообразования"));
		ДеревоЗначений.Колонки.Добавить("СерияЦО",                    Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатурыДляЦенообразования"));
		ДеревоЗначений.Колонки.Добавить("УпаковкаЦО",                 Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
		ДеревоЗначений.Колонки.Добавить("СерииИспользуются",          Новый ОписаниеТипов("Булево"));
		ДеревоЗначений.Колонки.Добавить("УпаковкиИспользуются",       Новый ОписаниеТипов("Булево"));
		
		ДеревоЗначений.Колонки.Добавить("ЦеноваяГруппа",              Новый ОписаниеТипов("СправочникСсылка.ЦеновыеГруппы"));
		ДеревоЗначений.Колонки.Добавить("РеквизитСортировки",         Новый ОписаниеТипов("Число"));
	КонецЕсли;
	
	Для Каждого ВидЦены Из Форма.ВыбранныеЦены Цикл
		
		Если ВидЦены.Выбрана Или ВидЦены.Влияет Тогда
			
			ИмяКолонки = ВидЦены.ИмяКолонки;
			
			Если ЭтоРегистрацияЦенПоставщика Тогда
				ДеревоЗначений.Колонки.Добавить(                          ИмяКолонки, ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля(ДопустимыйЗнак.Неотрицательный), ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("СтараяЦена"              + ИмяКолонки, ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля(ДопустимыйЗнак.Неотрицательный), ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("ПроцентИзменения"        + ИмяКолонки, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(05, 2, ДопустимыйЗнак.Любой)),            ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("СуммаИзменения"          + ИмяКолонки, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)),            ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("ИзмененаВручную"         + ИмяКолонки, Новый ОписаниеТипов("Булево"),                                                                  ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("ИзмененаАвтоматически"   + ИмяКолонки, Новый ОписаниеТипов("Булево"),                                                                  ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("ЗапретРедактирования"    + ИмяКолонки, Новый ОписаниеТипов("Булево"),                                                                  ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("КартинкаИзмененаВручную" + ИмяКолонки, Новый ОписаниеТипов("Число"),                                                                   ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("МинимальнаяПартияПоставки"+ ИмяКолонки, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный)), ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("УстановкаУсловий"        + ИмяКолонки, Новый ОписаниеТипов("Булево"), НСтр("ru='Установка условий'"));
				
				Если Форма.ИспользоватьУпаковкиНоменклатуры Тогда
					ДеревоЗначений.Колонки.Добавить("Упаковка" + ИмяКолонки, Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"), "Упаковка");
					ДеревоЗначений.Колонки.Добавить("УпаковкаЗаказа"   + ИмяКолонки, Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"), НСтр("ru='Упаковка заказа'"));
					Если Форма.КодФормы = "ЗагрузкаЦенПоставщикаИзВнешнихФайлов" Тогда
						ДеревоЗначений.Колонки.Добавить("УпаковкаЗаполнена" + ИмяКолонки, Новый ОписаниеТипов("Булево"), НСтр("ru='Упаковка заполнена'"));
						ДеревоЗначений.Колонки.Добавить("УпаковкаИмя" + ИмяКолонки, Новый ОписаниеТипов("Строка"), НСтр("ru='Упаковка наименование'"));
					КонецЕсли;
				КонецЕсли;
			Иначе
				ДеревоЗначений.Колонки.Добавить(                          ИмяКолонки, ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля(ДопустимыйЗнак.Неотрицательный), ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("Валюта"                  + ИмяКолонки, Новый ОписаниеТипов("СправочникСсылка.Валюты"), ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("СтараяЦена"              + ИмяКолонки, ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля(ДопустимыйЗнак.Неотрицательный), ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("Формула"                 + ИмяКолонки, Новый ОписаниеТипов("Строка"), ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("ПроцентИзменения"        + ИмяКолонки, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(05, 2, ДопустимыйЗнак.Любой)),           ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("СуммаИзменения"          + ИмяКолонки, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)),           ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("ИзмененаВручную"         + ИмяКолонки, Новый ОписаниеТипов("Булево"),                                                                 ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("ФормулаИзмененаВручную"  + ИмяКолонки, Новый ОписаниеТипов("Булево"),                                                                 ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("ИзмененаАвтоматически"   + ИмяКолонки, Новый ОписаниеТипов("Булево"),                                                                 ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("КартинкаИзмененаВручную" + ИмяКолонки, Новый ОписаниеТипов("Число"),                                                                  ВидЦены.Наименование);
				ДеревоЗначений.Колонки.Добавить("ЗапретРедактирования"    + ИмяКолонки, Новый ОписаниеТипов("Булево"),                                                                 ВидЦены.Наименование);
				
				Если Форма.ИспользоватьУпаковкиНоменклатуры Тогда
					ДеревоЗначений.Колонки.Добавить("Упаковка" + ИмяКолонки, Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"), "Упаковка");
				КонецЕсли;
					
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	КолонкаОтступ = ДеревоЗначений.Колонки.Добавить("Отступ", Новый ОписаниеТипов("Строка"), НСтр("ru = 'Отступ'"));
	
	Если ТипЗнч(Форма.ДеревоЦен) = Тип("ДанныеФормыДерево") Или ТипЗнч(Форма.ДеревоЦен) = Тип("ДанныеФормыКоллекция") Тогда
			
		РеквизитыТаблицыЦен = Форма.ПолучитьРеквизиты("ДеревоЦен");
		Для Каждого Реквизит Из РеквизитыТаблицыЦен Цикл
			Если СтрНайти(Реквизит.Имя, "ВидЦены")
				Или СтрНайти(Реквизит.Имя, "Отступ") Тогда
				УдаляемыеКолонкиТаблицыЦен.Добавить("ДеревоЦен." + Реквизит.Имя);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Колонка Из ДеревоЗначений.Колонки Цикл
			Если СтрНайти(Колонка.Имя, "ВидЦены") Тогда
				УдаляемаяКолонка = УдаляемыеКолонкиТаблицыЦен.Найти("ДеревоЦен." + Колонка.Имя);
				Если УдаляемаяКолонка <> Неопределено Тогда
					УдаляемыеКолонкиТаблицыЦен.Удалить(УдаляемаяКолонка);
				Иначе
					ДобавляемыеКолонкиТаблицыЦен.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ДеревоЦен", Колонка.Заголовок, Истина));
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	
		ДобавляемыеКолонкиТаблицыЦен.Добавить(Новый РеквизитФормы(КолонкаОтступ.Имя, КолонкаОтступ.ТипЗначения, "ДеревоЦен", КолонкаОтступ.Заголовок, Истина));
		
		Если УдаляемыеКолонкиТаблицыЦен.Количество() > 0 Или ДобавляемыеКолонкиТаблицыЦен.Количество() > 0 Тогда
			Форма.ИзменитьРеквизиты(ДобавляемыеКолонкиТаблицыЦен, УдаляемыеКолонкиТаблицыЦен);
		КонецЕсли;
		
		ПодчиненныеЭлементыТаблицы = Форма.Элементы["ДеревоЦен"].ПодчиненныеЭлементы; // ЭлементыФормы
		Для Каждого ТекЭлемент Из ПодчиненныеЭлементыТаблицы Цикл
			Если СтрНайти(ТекЭлемент.Имя, "ВидЦены")
				Или СтрНайти(ТекЭлемент.Имя, "Отступ") Тогда
				УдаляемыеЭлементы.Добавить(ТекЭлемент);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
			Форма.Элементы.Удалить(УдаляемыйЭлемент);
		КонецЦикла;
		
		Для Каждого Оформление Из Форма.УсловноеОформление.Элементы Цикл
			Если Оформление.Представление = "СозданоПрограммно" Тогда
				УсловныеОформления.Добавить(Оформление);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Оформление Из УсловныеОформления Цикл
			Форма.УсловноеОформление.Элементы.Удалить(Оформление);
		КонецЦикла;
		
		Для Каждого ВидЦены Из Форма.ВыбранныеЦены Цикл
			
			ИмяКолонки = ВидЦены.ИмяКолонки;
			
			ПоказыватьВлияющуюЦену = Форма.ОтображатьВлияющиеЦены 
										И ВидЦены.Влияет
										И НЕ ВидЦены.ЗапрещенныйВидЦены;
			
			Если ВидЦены.Выбрана
				Или ПоказыватьВлияющуюЦену Тогда
				
				ЦветЗаголовка = Неопределено;
				ЦветФона      = Неопределено;
				КартинкаШапки = Неопределено;
				
				Если ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.Вручную 
					Или ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.НаценкаНаЦенуПоступления
					Или ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.НаценкаНаЦенуВводаОстатков Тогда
					
					КартинкаШапки = БиблиотекаКартинок.СпособыЗаданияЦенЗадаватьВручную;
					
				ИначеЕсли ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБ
					Или ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБПриПоступлении
					Или ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБПоКонкурентам
					Или ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБПоПоставщикам
					Или ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБПоСебестоимости Тогда
					
					КартинкаШапки = БиблиотекаКартинок.СпособыЗаданияЦенЗаполнятьПоДаннымИБ;
					
				ИначеЕсли ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.РассчитыватьПоФормуламОтДругихВидовЦен
					Или ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.НаценкаНаДругойВидЦен Тогда

					КартинкаШапки = БиблиотекаКартинок.СпособыЗаданияЦенРассчитыватьПоФормуламОтДругихВидовЦен;
					
				КонецЕсли;
				
				Если ЭтоРегистрацияЦенПоставщика Тогда
		
					НоваяГруппа = ДобавитьГруппуФормы(Форма, "ГруппаЦены" + ИмяКолонки, Строка(ВидЦены.Ссылка) + ", " + Строка(ВидЦены.Валюта), Истина, КартинкаШапки, ГруппировкаКолонок.Горизонтальная, Неопределено);
					
				Иначе
					
					НоваяГруппа = ДобавитьГруппуФормы(Форма, "ГруппаЦены" + ИмяКолонки, ?(Строка(ВидЦены.Идентификатор)=Строка(ВидЦены.Ссылка), Строка(ВидЦены.Ссылка), Строка(ВидЦены.Ссылка) + " ["+ Строка(ВидЦены.Идентификатор) +"]") + ", " + Строка(ВидЦены.Валюта), Истина, КартинкаШапки, ГруппировкаКолонок.Горизонтальная, Неопределено);
					
				КонецЕсли;		
				
				Если ПодборТоваровКлиентСервер.ЭтоФормаПрайсЛиста(Форма) Или
					ПодборТоваровКлиентСервер.ЭтоФормаПрайсЛистаПоставщиков(Форма) Тогда
					
					Если ЗначениеЗаполнено(Форма.ДатаДействующихЦен) Тогда
						ДатаДействующихЦен = КонецДня(Форма.ДатаДействующихЦен);
					Иначе
						ДатаДействующихЦен = НачалоДня(Форма.Дата)-1;
					КонецЕсли;
					ЗаголовокКолонкиСтараяЦена = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Цена на %1'"), Формат(ДатаДействующихЦен, "ДЛФ=D"));
					
				Иначе
					
					ЗаголовокКолонкиСтараяЦена = ?(ВидЦены.Выбрана, НСтр("ru='Действующая цена'"), НСтр("ru='Цена'"));
					
				КонецЕсли;
				
				Если ВидЦены.Выбрана Тогда
					НоваяГруппаТехническая = ДобавитьГруппуФормы(Форма, "ГруппаТехническая" + ИмяКолонки, НСтр("ru='Группа'"), Ложь, Неопределено, ГруппировкаКолонок.Горизонтальная, НоваяГруппа);
					
					СтруктураПараметров = Новый Структура();
					СтруктураПараметров.Вставить("Заголовок",              ЗаголовокКолонкиСтараяЦена);
					СтруктураПараметров.Вставить("ШиринаПоля",             12);
					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
					СтруктураПараметров.Вставить("Родитель",               НоваяГруппаТехническая);
					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     Истина);
					
					НовоеПоле = ДобавитьПолеФормы(Форма, "СтараяЦена" + ИмяКолонки, СтруктураПараметров);
					НовоеПоле.Подсказка = НСтр("ru = 'Текущая установленная цена'");
					НовоеПоле.ЦветТекста = WebЦвета.Серый;
					
					Если Не ЭтоРегистрацияЦенПоставщика Тогда
						НоваяГруппаФормула = ДобавитьГруппуФормы(Форма, "ГруппаТехническаяФормула" + ИмяКолонки, НСтр("ru='Группа формула'"), Ложь, Неопределено, ГруппировкаКолонок.ВЯчейке, НоваяГруппаТехническая);
						
						НовоеПоле                     = Форма.Элементы.Добавить("ДеревоЦен" + "Формула" + "Картинка" + ИмяКолонки, Тип("ПолеФормы"), НоваяГруппаФормула);
						НовоеПоле.ПутьКДанным         = "ДеревоЦен.ФормулаИзмененаВручную" + ИмяКолонки;
						НовоеПоле.Заголовок           = "";
						НовоеПоле.ПоложениеЗаголовка  = ПоложениеЗаголовкаЭлементаФормы.Нет;
						НовоеПоле.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
						НовоеПоле.Вид                 = ВидПоляФормы.ПолеКартинки;
						НовоеПоле.ТолькоПросмотр      = Истина;
						НовоеПоле.Ширина              = 2;
						НовоеПоле.ОтображатьВШапке    = Ложь;
						НовоеПоле.КартинкаЗначений    = БиблиотекаКартинок.Внимание16;
						НовоеПоле.Видимость           = ВидЦены.ФормулаРедактируется;
						НовоеПоле.РастягиватьПоГоризонтали = Ложь;
						
						НовоеПоле.Подсказка = НСтр("ru = 'Формула изменена'");

						СтруктураПараметров = Новый Структура();
						СтруктураПараметров.Вставить("Заголовок",              НСтр("ru='Формула'"));
						СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенФормулаПриИзменении");
						СтруктураПараметров.Вставить("ОбработчикНачалоВыбора", "Подключаемый_ДеревоЦенФормулаНачалоВыбора");
						СтруктураПараметров.Вставить("ШиринаПоля",             12);
						СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
						СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
						СтруктураПараметров.Вставить("Родитель",               НоваяГруппаФормула);
						СтруктураПараметров.Вставить("Видимость",              ВидЦены.ФормулаРедактируется);
						СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     НЕ ВидЦены.Редактировать);
						СтруктураПараметров.Вставить("ГоризонтальноеПоложение", ГоризонтальноеПоложениеЭлемента.Право);
						СтруктураПараметров.Вставить("РедактированиеТекста", Ложь);
						
						НовоеПоле = ДобавитьПолеФормы(Форма, "Формула" + ИмяКолонки, СтруктураПараметров);
						НовоеПоле.Подсказка = НСтр("ru = 'Формула для расчета цены'");
						НовоеПоле.ЦветТекста = WebЦвета.Серый;
						НовоеПоле.РедактированиеТекста = Ложь;
						НовоеПоле.КнопкаОчистки = Истина;
						
					КонецЕсли;
					
					СтруктураПараметров = Новый Структура();
					СтруктураПараметров.Вставить("Заголовок",              НСтр("ru='Изменение'"));
					СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенЦенаПриИзменении");
					СтруктураПараметров.Вставить("ШиринаПоля",             12);
					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
					СтруктураПараметров.Вставить("Родитель",               НоваяГруппаТехническая);
					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     ?(ЭтоРегистрацияЦенПоставщика, Ложь, НЕ ВидЦены.Редактировать));
					
					НовоеПоле = ДобавитьПолеФормы(Форма, "СуммаИзменения" + ИмяКолонки, СтруктураПараметров);
					
					НовоеПоле.ЦветТекста = WebЦвета.Серый;
					НовоеПоле.ВыделятьОтрицательные = Истина;
					НовоеПоле.Подсказка = НСтр("ru = 'Изменение цены'");
					
					СтруктураПараметров = Новый Структура();
					СтруктураПараметров.Вставить("Заголовок",              "%");
					СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенЦенаПриИзменении");
					СтруктураПараметров.Вставить("ШиринаПоля",             6);
					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
					СтруктураПараметров.Вставить("Родитель",               НоваяГруппаТехническая);
					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     ?(ЭтоРегистрацияЦенПоставщика, Ложь, НЕ ВидЦены.Редактировать));
					
					НовоеПоле = ДобавитьПолеФормы(Форма, "ПроцентИзменения" + ИмяКолонки, СтруктураПараметров);
					НовоеПоле.ЦветТекста = WebЦвета.Серый;
					НовоеПоле.ВыделятьОтрицательные = Истина;
					НовоеПоле.Подсказка = НСтр("ru = 'Процент изменения цены'");
					
					НоваяГруппаЦена = ДобавитьГруппуФормы(Форма, "ГруппаЦена" + ИмяКолонки, НСтр("ru='Группа цена'"), Ложь, Неопределено, ГруппировкаКолонок.ВЯчейке, НоваяГруппа);
					
					НовоеПоле                     = Форма.Элементы.Добавить("ЗапретРедактирования" + ИмяКолонки, Тип("ПолеФормы"), НоваяГруппаЦена);
					НовоеПоле.ПутьКДанным         = "ДеревоЦен.ЗапретРедактирования" + ИмяКолонки;
					НовоеПоле.Заголовок           = "Запрет редактирования";
					НовоеПоле.ПоложениеЗаголовка  = ПоложениеЗаголовкаЭлементаФормы.Нет;
					НовоеПоле.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
					НовоеПоле.Вид                 = ВидПоляФормы.ПолеКартинки;
					НовоеПоле.ТолькоПросмотр      = Истина;
					НовоеПоле.Ширина              = 2;
					НовоеПоле.ОтображатьВШапке    = Ложь;
					НовоеПоле.КартинкаЗначений    = БиблиотекаКартинок.ВидыЦенТолькоПросмотр;
					НовоеПоле.КартинкаШапки       = БиблиотекаКартинок.ВидыЦенТолькоПросмотр;
					НовоеПоле.Видимость           = ?(ЭтоРегистрацияЦенПоставщика, Ложь, НЕ ВидЦены.Редактировать);
					НовоеПоле.РастягиватьПоГоризонтали = Ложь;
					НовоеПоле.Подсказка = НСтр("ru = 'Запрет редактирования цены'");
					
					НовоеПоле                     = Форма.Элементы.Добавить("ДеревоЦен" + "Картинка" + ИмяКолонки, Тип("ПолеФормы"), НоваяГруппаЦена);
					НовоеПоле.ПутьКДанным         = "ДеревоЦен.ИзмененаВручную" + ИмяКолонки;
					НовоеПоле.Заголовок           = "";
					НовоеПоле.ПоложениеЗаголовка  = ПоложениеЗаголовкаЭлементаФормы.Нет;
					НовоеПоле.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
					НовоеПоле.Вид                 = ВидПоляФормы.ПолеКартинки;
					НовоеПоле.ТолькоПросмотр      = Истина;
					НовоеПоле.Ширина              = 2;
					НовоеПоле.ОтображатьВШапке    = Ложь;
					НовоеПоле.КартинкаЗначений    = БиблиотекаКартинок.УстановитьЦены;
					НовоеПоле.КартинкаШапки       = БиблиотекаКартинок.УстановитьЦены;
					НовоеПоле.Видимость           = ?(ЭтоРегистрацияЦенПоставщика, Истина, ВидЦены.Редактировать);
					НовоеПоле.РастягиватьПоГоризонтали = Ложь;
					НовоеПоле.Подсказка = НСтр("ru = 'Цена изменена вручную'");

					СтруктураПараметров = Новый Структура();
					СтруктураПараметров.Вставить("Заголовок",              НСтр("ru='Цена'"));
					СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенЦенаПриИзменении");
					СтруктураПараметров.Вставить("ШиринаПоля",             12);
					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
					СтруктураПараметров.Вставить("Родитель",               НоваяГруппаЦена);
					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     ?(ЭтоРегистрацияЦенПоставщика, Ложь, НЕ ВидЦены.Редактировать));
					НовоеПоле = ДобавитьПолеФормы(Форма, ИмяКолонки, СтруктураПараметров);
					НовоеПоле.Подсказка = НСтр("ru = 'Устанавливаемая цена'");
					
					Если Не ЭтоРегистрацияЦенПоставщика Тогда
						НоваяГруппаВалюта = ДобавитьГруппуФормы(Форма, "ГруппаВалюта" + ИмяКолонки, НСтр("ru='Группа валюта'"), Ложь, Неопределено, ГруппировкаКолонок.Горизонтальная, НоваяГруппаТехническая);
	
						СтруктураПараметров = Новый Структура();
						СтруктураПараметров.Вставить("Заголовок",              НСтр("ru='Валюта'"));
						СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенВалютаПриИзменении");
						СтруктураПараметров.Вставить("ШиринаПоля",             6);
						СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
						СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
						СтруктураПараметров.Вставить("Родитель",               НоваяГруппаВалюта);
						СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     ?(ЭтоРегистрацияЦенПоставщика, Ложь, НЕ ВидЦены.Редактировать));
						
						НовоеПоле = ДобавитьПолеФормы(Форма, "Валюта" + ИмяКолонки, СтруктураПараметров);
						НовоеПоле.Подсказка = НСтр("ru = 'Валюта цены'");
						НовоеПоле.БыстрыйВыбор = Ложь;
					КонецЕсли;
					
				Иначе
					
					СтруктураПараметров = Новый Структура();
					СтруктураПараметров.Вставить("Заголовок",              ЗаголовокКолонкиСтараяЦена);
					СтруктураПараметров.Вставить("ШиринаПоля",             12);
					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
					СтруктураПараметров.Вставить("Родитель",               НоваяГруппа);
					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     Истина);
					
					НовоеПоле = ДобавитьПолеФормы(Форма, "СтараяЦена" + ИмяКолонки, СтруктураПараметров);
					
					НовоеПоле.ЦветТекста = WebЦвета.Серый;
					
				КонецЕсли;
				
				Если Форма.ИспользоватьУпаковкиНоменклатуры Тогда
					НоваяГруппаУпаковка = ДобавитьГруппуФормы(Форма, "ГруппаУпаковки" + ИмяКолонки, НСтр("ru='Ед. изм.'"), Ложь, Неопределено, ГруппировкаКолонок.ВЯчейке, НоваяГруппа);
					
					НоваяСвязь = Новый СвязьПараметраВыбора("Номенклатура", "Элементы.ДеревоЦен.ТекущиеДанные.Номенклатура", РежимИзмененияСвязанногоЗначения.НеИзменять);
					НовыйМассив = Новый Массив();
					НовыйМассив.Добавить(НоваяСвязь);
					НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
					
					СтруктураПараметров = Новый Структура();
					СтруктураПараметров.Вставить("Заголовок",              НСтр("ru='Упаковка'"));
					СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенУпаковкаПриИзменении");
					СтруктураПараметров.Вставить("ОбработчикНачалоВыбора", "Подключаемый_ДеревоЦенУпаковкаНачалоВыбора");
					СтруктураПараметров.Вставить("ШиринаПоля",             3);
					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
					СтруктураПараметров.Вставить("Родитель",               НоваяГруппаУпаковка);
					СтруктураПараметров.Вставить("СвязиПараметровВыбора",  НовыеСвязи);
					СтруктураПараметров.Вставить("ОтображатьВШапке",       Ложь);
					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     ?(ЭтоРегистрацияЦенПоставщика, Ложь, НЕ ВидЦены.Редактировать));
					
					ДобавитьПолеФормы(Форма, "Упаковка" + ИмяКолонки, СтруктураПараметров);
					
					СтруктураПараметров = Новый Структура();
					СтруктураПараметров.Вставить("Заголовок",              НСтр("ru='Ед. изм.'"));
					СтруктураПараметров.Вставить("ШиринаПоля",             3);
					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
					СтруктураПараметров.Вставить("Родитель",               НоваяГруппаУпаковка);
					СтруктураПараметров.Вставить("ПутьКДанным",            "ДеревоЦен.Номенклатура.ЕдиницаИзмерения");
					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     Истина);
				
					ДобавитьПолеФормы(Форма, "ЕдиницаИзмерения" + ИмяКолонки, СтруктураПараметров);

					Если ЭтоРегистрацияЦенПоставщика Тогда
						
						СтруктураПараметров = Новый Структура();
						СтруктураПараметров.Вставить("Заголовок",              НСтр("ru = 'Упаковка заказа'"));
						СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенУпаковкаЗаказаПриИзменении");
						СтруктураПараметров.Вставить("ШиринаПоля",             9);
						СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
						СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
						СтруктураПараметров.Вставить("Родитель",               НоваяГруппа);
						СтруктураПараметров.Вставить("СвязиПараметровВыбора",  НовыеСвязи);
						СтруктураПараметров.Вставить("ОтображатьВШапке",       Истина);
						
						ДобавитьПолеФормы(Форма,"УпаковкаЗаказа" + ИмяКолонки, СтруктураПараметров);
						
						Если Форма.КодФормы = "ЗагрузкаЦенПоставщикаИзВнешнихФайлов" Тогда
							СтруктураПараметров = Новый Структура();
							СтруктураПараметров.Вставить("Заголовок",              НСтр("ru = 'Упаковка заполнена'"));
							СтруктураПараметров.Вставить("ШиринаПоля",             9);
							СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
							СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
							СтруктураПараметров.Вставить("Родитель",               НоваяГруппа);
							СтруктураПараметров.Вставить("СвязиПараметровВыбора",  НовыеСвязи);
							СтруктураПараметров.Вставить("ОтображатьВШапке",       Истина);
							СтруктураПараметров.Вставить("Видимость",              Ложь);
							
							ДобавитьПолеФормы(Форма,"УпаковкаЗаполнена" + ИмяКолонки, СтруктураПараметров);
							
							СтруктураПараметров = Новый Структура();
							СтруктураПараметров.Вставить("Заголовок",              НСтр("ru = 'Наименование упак.'"));
							СтруктураПараметров.Вставить("ШиринаПоля",             9);
							СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
							СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
							СтруктураПараметров.Вставить("Родитель",               НоваяГруппа);
							СтруктураПараметров.Вставить("СвязиПараметровВыбора",  НовыеСвязи);
							СтруктураПараметров.Вставить("ОтображатьВШапке",       Истина);
							СтруктураПараметров.Вставить("Видимость",              Истина);
							СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     Истина);
							
							ДобавитьПолеФормы(Форма,"УпаковкаИмя" + ИмяКолонки, СтруктураПараметров);
						КонецЕсли;
					КонецЕсли;
					
				Иначе
					СтруктураПараметров = Новый Структура();
					СтруктураПараметров.Вставить("Заголовок",              НСтр("ru='Ед. изм.'"));
					СтруктураПараметров.Вставить("ШиринаПоля",             3);
					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
					СтруктураПараметров.Вставить("Родитель",               НоваяГруппа);
					СтруктураПараметров.Вставить("ПутьКДанным",            "ДеревоЦен.Номенклатура.ЕдиницаИзмерения");
					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     Истина);
					
					ДобавитьПолеФормы(Форма, "ЕдиницаИзмерения" + ИмяКолонки, СтруктураПараметров);
				КонецЕсли;
				
				Если ЭтоРегистрацияЦенПоставщика Тогда
					
					СтруктураПараметров = Новый Структура();
					СтруктураПараметров.Вставить("Заголовок",              НСтр("ru = 'Мин. партия поставки'"));
					СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенМинимальнаяПартияПриИзменении");
					СтруктураПараметров.Вставить("ШиринаПоля",             8);
					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
					СтруктураПараметров.Вставить("Родитель",               НоваяГруппа);
					СтруктураПараметров.Вставить("ОтображатьВШапке",       Истина);
				
					НовоеПоле = ДобавитьПолеФормы(Форма, "МинимальнаяПартияПоставки" + ИмяКолонки, СтруктураПараметров);
				
					СтруктураПараметров = Новый Структура();
					СтруктураПараметров.Вставить("Заголовок",              НСтр("ru = 'Условия'"));
					СтруктураПараметров.Вставить("ШиринаПоля",             8);
					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
					СтруктураПараметров.Вставить("Родитель",               НоваяГруппа);
					СтруктураПараметров.Вставить("ОтображатьВШапке",       Истина);
					СтруктураПараметров.Вставить("Вид",                    ВидПоляФормы.ПолеКартинки);
					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     Ложь);
					СтруктураПараметров.Вставить("КартинкаЗначений",       БиблиотекаКартинок.Изменить);
					СтруктураПараметров.Вставить("КартинкаШапки",          БиблиотекаКартинок.Изменить);
					СтруктураПараметров.Вставить("Видимость",              Ложь);
					
					ДобавитьПолеФормы(Форма,"УстановкаУсловий" + ИмяКолонки, СтруктураПараметров);
				КонецЕсли;
				
				Если Не ЭтоРегистрацияЦенПоставщика Тогда
					Если ВидЦены.ФормулаРедактируется Тогда
							
						// Условное изменения формулы
						НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
						НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Формула"+ ИмяКолонки;
						НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
						НовыйЭлементУсловногоОформления.Использование = Истина;
						
						ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
						ЭлементОтбора.Использование = Истина;
						ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ФормулаИзмененаВручную"+ ИмяКолонки);
						ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
						ЭлементОтбора.ПравоеЗначение = Истина;
						
						НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
						НовоеПоле.Использование = Истина;
						НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "Формула"+ ИмяКолонки);
						
						НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноСиний);
			
						// Условное изменения формулы
						НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
						НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Формула"+ ИмяКолонки;
						НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
						НовыйЭлементУсловногоОформления.Использование = Истина;
						
						ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
						ЭлементОтбора.Использование = Истина;
						ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ФормулаИзмененаВручную"+ ИмяКолонки);
						ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
						ЭлементОтбора.ПравоеЗначение = Ложь;
						
						НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
						НовоеПоле.Использование = Истина;
						НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "Формула"+ ИмяКолонки);
						
						НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
						
					Иначе
						// Условное изменения формулы
						НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
						НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Формула"+ ИмяКолонки;
						НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
						НовыйЭлементУсловногоОформления.Использование = Истина;
						
						НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
						НовоеПоле.Использование = Истина;
						НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "Формула"+ ИмяКолонки);
						
						НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<формулы не используются>'"));
						НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
						НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
						
					КонецЕсли;
				КонецЕсли;

				// Условное оформление увеличившихся цен
				НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
				НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = ИмяКолонки;
				НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
				НовыйЭлементУсловногоОформления.Использование = Истина;
				
				ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен." + ИмяКолонки);
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
				ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.СтараяЦена" + ИмяКолонки);
				
				НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
				НовоеПоле.Использование = Истина;
				НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + ИмяКолонки);
				
				НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноСиний);
				
				// Условное оформление уменьшившихся цен
				НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
				НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = ИмяКолонки;
				НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
				НовыйЭлементУсловногоОформления.Использование = Истина;
				
				ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен." + ИмяКолонки);
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
				ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.СтараяЦена" + ИмяКолонки);
				
				НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
				НовоеПоле.Использование = Истина;
				НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + ИмяКолонки);
				
				НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноЗеленый);
				
				// Условное оформление единиц измерения
				ПараметрыУсловногоОформления = НоменклатураСервер.НовыеПараметрыУсловногоОформленияЕдиницИзмерения();
				ПараметрыУсловногоОформления.ИмяПоляЕдиницаИзмерения = "ДеревоЦен" + "ЕдиницаИзмерения" + ИмяКолонки;
				ПараметрыУсловногоОформления.ПутьКПолюУпаковка = "ДеревоЦен.Упаковка" + ИмяКолонки;
				НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(Форма, ПараметрыУсловногоОформления);
				
				Если НЕ ЭтоРегистрацияЦенПоставщика и ИспользуетсяЦенообразование25 Тогда
					
					НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
					НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = ИмяКолонки;
					НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
					НовыйЭлементУсловногоОформления.Использование = Истина;
					
					ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбора.Использование = Истина;
					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.УпаковкиИспользуются");
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					ЭлементОтбора.ПравоеЗначение = Истина;
					
					НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
					НовоеПоле.Использование = Истина;
					НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "Упаковка" + ИмяКолонки);
					
					НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
					
				КонецЕсли;
				
				// Условное оформление запрета редактирования
				НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
				НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = ИмяКолонки;
				НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
				НовыйЭлементУсловногоОформления.Использование = Истина;
				
				ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ЗапретРедактирования" + ИмяКолонки);
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение = Истина;
				
				НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
				НовоеПоле.Использование = Истина;
				НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + ИмяКолонки);
				
				НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
				НовоеПоле.Использование = Истина;
				НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "Формула" + ИмяКолонки);
				
				НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
				НовоеПоле.Использование = Истина;
				НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "СуммаИзменения" + ИмяКолонки);
				
				НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
				НовоеПоле.Использование = Истина;
				НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "ПроцентИзменения" + ИмяКолонки);
				
				НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
				НовоеПоле.Использование = Истина;
				НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "Валюта" + ИмяКолонки);

				Если НЕ ЭтоРегистрацияЦенПоставщика Тогда
					НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
					НовоеПоле.Использование = Истина;
					НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "Упаковка" + ИмяКолонки);
				КонецЕсли;
				
				НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
				НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Запрет редактирования>'"));

				Если ЭтоРегистрацияЦенПоставщика Тогда
					
					// В регистрации цен поставщика - пустая цена не регистрируется при проведении
					НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
					НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = ИмяКолонки;
					НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
					НовыйЭлементУсловногоОформления.Использование = Истина;
					
					ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбора.Использование = Истина;
					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен." + ИмяКолонки);
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					ЭлементОтбора.ПравоеЗначение = 0;
					
					ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбора.Использование = Истина;
					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ХарактеристикиИспользуются");
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					ЭлементОтбора.ПравоеЗначение = Ложь;
					
					НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
					НовоеПоле.Использование = Истина;
					НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + ИмяКолонки);
					
					НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Не изменяется>'"));
					НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
					
					//
					
					НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
					НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = ИмяКолонки;
					НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
					НовыйЭлементУсловногоОформления.Использование = Истина;
					
					ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбора.Использование = Истина;
					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен." + ИмяКолонки);
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					ЭлементОтбора.ПравоеЗначение = 0;
					
					ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбора.Использование = Истина;
					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.Характеристика");
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
					
					НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
					НовоеПоле.Использование = Истина;
					НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + ИмяКолонки);
					
					НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Не изменяется>'"));
					НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
					
					// В регистрации цен поставщика - пустая цена не регистрируется при проведении
					НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
					НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = ИмяКолонки;
					НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
					НовыйЭлементУсловногоОформления.Использование = Истина;
					
					ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементОтбора.Использование = Истина;
					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен." + ИмяКолонки);
					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					ЭлементОтбора.ПравоеЗначение = 0;
					
					НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
					НовоеПоле.Использование = Истина;
					НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "ПроцентИзменения" + ИмяКолонки);
					
					НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
					НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
					НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВариантГруппировки) Тогда
			
				СписокИндексовКартинкиЭлемента = Новый СписокЗначений;
				СписокИндексовКартинкиЭлемента.Добавить(0);
				СписокИндексовКартинкиЭлемента.Добавить(2);
				//
				
				НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
				НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "СтрокиТолькоПросмотр";
				НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
				НовыйЭлементУсловногоОформления.Использование = Истина;
				
				ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.Использование = Истина;
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ИндексКартинки");
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
				ЭлементОтбора.ПравоеЗначение = СписокИндексовКартинкиЭлемента;
				
				НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
				НовоеПоле.Использование = Истина;
				НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен");
				
				НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
			
			КонецЕсли; 
		КонецЦикла;
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("ШиринаПоля",             30);
		СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     Истина);
		
		НовоеПоле = ДобавитьПолеФормы(Форма, "Отступ", СтруктураПараметров);
		НовоеПоле.ЦветТекста = WebЦвета.Серый;
		НовоеПоле.Видимость  = Истина;
		НовоеПоле.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовоеПоле.РастягиватьПоГоризонтали = Истина;
	
		ДеревоЦенЗначение = Форма.РеквизитФормыВЗначение("ДеревоЦен"); // ДеревоЗначений
		ДеревоЦенЗначение.Колонки.Очистить();
		
		Для Каждого Колонка Из ДеревоЗначений.Колонки Цикл
			ДеревоЦенЗначение.Колонки.Добавить(Колонка.Имя);
		КонецЦикла;
		
		Форма.ЗначениеВРеквизитФормы(ДеревоЦенЗначение, "ДеревоЦен");
		Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма, "ВыбранныеЦеныИзменены") Тогда
			Форма.ВыбранныеЦеныИзменены = Ложь;
		КонецЕсли;

		Если Не ЭтоРегистрацияЦенПоставщика Тогда
			УстановитьПометкуИзмененныхФормул(Форма, ДеревоЦенЗначение);
		КонецЕсли;
		
	Иначе
		
		Форма["ДеревоЦен"] = ДеревоЗначений.Скопировать();
		
	КонецЕсли;
	
КонецПроцедуры

#Область Архив 
//&ИзменениеИКонтроль("ПостроитьДеревоЦен")
//Процедура асп_ПостроитьДеревоЦен(Форма, ИмяТаблицы)
//	
//	ИспользуетсяЦенообразование25 = Форма.ИспользуетсяЦенообразование25;
//	
//	ЭтоРегистрацияЦенПоставщика = ЭтоРегистрацияЦенПоставщика(Форма);
//	
//	ДобавляемыеКолонкиТаблицыЦен = Новый Массив();
//	УдаляемыеКолонкиТаблицыЦен   = Новый Массив();
//	УдаляемыеЭлементы            = Новый Массив();
//	УсловныеОформления           = Новый Массив();
//	
//	ВариантГруппировки = Форма.ВариантГруппировки;
//	
//	Если ТипЗнч(Форма.ДеревоЦен) = Тип("ДанныеФормыКоллекция") Тогда
//		ДеревоЗначений = Новый ТаблицаЗначений;
//	Иначе
//		ДеревоЗначений = Новый ДеревоЗначений;
//	КонецЕсли;
//	
//	ДеревоЗначений.Колонки.Добавить("Номенклатура",               Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//	#Вставка
//	ДеревоЗначений.Колонки.Добавить("НоменклатураКлиента",        Новый ОписаниеТипов("СправочникСсылка.НоменклатураКонтрагентов"));
//	#КонецВставки
//	ДеревоЗначений.Колонки.Добавить("Характеристика",             Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
//	ДеревоЗначений.Колонки.Добавить("ИндексКартинки",             Новый ОписаниеТипов("Число"));
//	ДеревоЗначений.Колонки.Добавить("ЕдиницаИзмерения",           Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
//	ДеревоЗначений.Колонки.Добавить("Артикул",                    Новый ОписаниеТипов("Строка"));
//	ДеревоЗначений.Колонки.Добавить("ХарактеристикиИспользуются", Новый ОписаниеТипов("Булево"));
//	
//	Если ЗначениеЗаполнено(ВариантГруппировки) Тогда
//		ДеревоЗначений.Колонки.Добавить("ИерархияЭтоГруппа", Новый ОписаниеТипов("Булево"));
//		ДеревоЗначений.Колонки.Добавить("ЭтоИерархия", Новый ОписаниеТипов("Булево"));
//	КонецЕсли; 
//	
//	Если ЭтоРегистрацияЦенПоставщика Тогда
//		
//		ДеревоЗначений.Колонки.Добавить("НоменклатураПартнера",     Новый ОписаниеТипов("СправочникСсылка.НоменклатураКонтрагентов"));
//		
//		Если ЭтоЗагрузкаЦенПоставщикаИзВнешнихФайлов(Форма) Тогда
//			ДеревоЗначений.Колонки.Добавить("Код",                                   Новый ОписаниеТипов("Строка"));
//			ДеревоЗначений.Колонки.Добавить("НоменклатураНаименование",              Новый ОписаниеТипов("Строка"));
//			ДеревоЗначений.Колонки.Добавить("ХарактеристикаНаименование",            Новый ОписаниеТипов("Строка"));
//			ДеревоЗначений.Колонки.Добавить("СерияНаименование",                     Новый ОписаниеТипов("Строка"));
//			ДеревоЗначений.Колонки.Добавить("УпаковкаНаименование",                  Новый ОписаниеТипов("Строка"));
//			ДеревоЗначений.Колонки.Добавить("НоменклатураСопоставленаАвтоматически", Новый ОписаниеТипов("Булево"));
//			ДеревоЗначений.Колонки.Добавить("ЭтоДубль",                              Новый ОписаниеТипов("Булево"));
//			ДеревоЗначений.Колонки.Добавить("СтрокаСопоставлена",                    Новый ОписаниеТипов("Булево"));
//			ДеревоЗначений.Колонки.Добавить("КоличествоНоменклатурыДляВыбора",       Новый ОписаниеТипов("Число"));
//			ДеревоЗначений.Колонки.Добавить("КодОтличается",                         Новый ОписаниеТипов("Булево"));
//			ДеревоЗначений.Колонки.Добавить("АртикулОтличается",                     Новый ОписаниеТипов("Булево"));
//			ДеревоЗначений.Колонки.Добавить("НоменклатураНаименованиеОтличается",    Новый ОписаниеТипов("Булево"));
//			ДеревоЗначений.Колонки.Добавить("ЦенаНеРаспознана",                      Новый ОписаниеТипов("Булево"));
//			ДеревоЗначений.Колонки.Добавить("ЦеныИзменены",                          Новый ОписаниеТипов("Булево"));
//			
//			ДеревоЗначений.Колонки.Добавить("Серия",                                 Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
//			ДеревоЗначений.Колонки.Добавить("Упаковка",                              Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
//		КонецЕсли;
//		
//	Иначе
//		ДеревоЗначений.Колонки.Добавить("ВидНоменклатуры",            Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
//		ДеревоЗначений.Колонки.Добавить("ХарактеристикаЦО",           Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатурыДляЦенообразования"));
//		ДеревоЗначений.Колонки.Добавить("СерияЦО",                    Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатурыДляЦенообразования"));
//		ДеревоЗначений.Колонки.Добавить("УпаковкаЦО",                 Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
//		ДеревоЗначений.Колонки.Добавить("СерииИспользуются",          Новый ОписаниеТипов("Булево"));
//		ДеревоЗначений.Колонки.Добавить("УпаковкиИспользуются",       Новый ОписаниеТипов("Булево"));
//		
//		ДеревоЗначений.Колонки.Добавить("ЦеноваяГруппа",              Новый ОписаниеТипов("СправочникСсылка.ЦеновыеГруппы"));
//		ДеревоЗначений.Колонки.Добавить("РеквизитСортировки",         Новый ОписаниеТипов("Число"));
//	КонецЕсли;
//	
//	Для Каждого ВидЦены Из Форма.ВыбранныеЦены Цикл
//		
//		Если ВидЦены.Выбрана Или ВидЦены.Влияет Тогда
//			
//			ИмяКолонки = ВидЦены.ИмяКолонки;
//			
//			Если ЭтоРегистрацияЦенПоставщика Тогда
//				ДеревоЗначений.Колонки.Добавить(                          ИмяКолонки, ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля(ДопустимыйЗнак.Неотрицательный), ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("СтараяЦена"              + ИмяКолонки, ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля(ДопустимыйЗнак.Неотрицательный), ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("ПроцентИзменения"        + ИмяКолонки, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(05, 2, ДопустимыйЗнак.Любой)),            ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("СуммаИзменения"          + ИмяКолонки, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)),            ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("ИзмененаВручную"         + ИмяКолонки, Новый ОписаниеТипов("Булево"),                                                                  ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("ИзмененаАвтоматически"   + ИмяКолонки, Новый ОписаниеТипов("Булево"),                                                                  ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("ЗапретРедактирования"    + ИмяКолонки, Новый ОписаниеТипов("Булево"),                                                                  ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("КартинкаИзмененаВручную" + ИмяКолонки, Новый ОписаниеТипов("Число"),                                                                   ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("МинимальнаяПартияПоставки"+ ИмяКолонки, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный)), ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("УстановкаУсловий"        + ИмяКолонки, Новый ОписаниеТипов("Булево"), НСтр("ru='Установка условий'"));
//				
//				Если Форма.ИспользоватьУпаковкиНоменклатуры Тогда
//					ДеревоЗначений.Колонки.Добавить("Упаковка" + ИмяКолонки, Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"), "Упаковка");
//					ДеревоЗначений.Колонки.Добавить("УпаковкаЗаказа"   + ИмяКолонки, Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"), НСтр("ru='Упаковка заказа'"));
//					Если Форма.КодФормы = "ЗагрузкаЦенПоставщикаИзВнешнихФайлов" Тогда
//						ДеревоЗначений.Колонки.Добавить("УпаковкаЗаполнена" + ИмяКолонки, Новый ОписаниеТипов("Булево"), НСтр("ru='Упаковка заполнена'"));
//						ДеревоЗначений.Колонки.Добавить("УпаковкаИмя" + ИмяКолонки, Новый ОписаниеТипов("Строка"), НСтр("ru='Упаковка наименование'"));
//					КонецЕсли;
//				КонецЕсли;
//			Иначе
//				ДеревоЗначений.Колонки.Добавить(                          ИмяКолонки, ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля(ДопустимыйЗнак.Неотрицательный), ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("Валюта"                  + ИмяКолонки, Новый ОписаниеТипов("СправочникСсылка.Валюты"), ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("СтараяЦена"              + ИмяКолонки, ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля(ДопустимыйЗнак.Неотрицательный), ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("Формула"                 + ИмяКолонки, Новый ОписаниеТипов("Строка"), ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("ПроцентИзменения"        + ИмяКолонки, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(05, 2, ДопустимыйЗнак.Любой)),           ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("СуммаИзменения"          + ИмяКолонки, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Любой)),           ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("ИзмененаВручную"         + ИмяКолонки, Новый ОписаниеТипов("Булево"),                                                                 ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("ФормулаИзмененаВручную"  + ИмяКолонки, Новый ОписаниеТипов("Булево"),                                                                 ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("ИзмененаАвтоматически"   + ИмяКолонки, Новый ОписаниеТипов("Булево"),                                                                 ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("КартинкаИзмененаВручную" + ИмяКолонки, Новый ОписаниеТипов("Число"),                                                                  ВидЦены.Наименование);
//				ДеревоЗначений.Колонки.Добавить("ЗапретРедактирования"    + ИмяКолонки, Новый ОписаниеТипов("Булево"),                                                                 ВидЦены.Наименование);
//				
//				Если Форма.ИспользоватьУпаковкиНоменклатуры Тогда
//					ДеревоЗначений.Колонки.Добавить("Упаковка" + ИмяКолонки, Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"), "Упаковка");
//				КонецЕсли;
//					
//			КонецЕсли;
//			
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	КолонкаОтступ = ДеревоЗначений.Колонки.Добавить("Отступ", Новый ОписаниеТипов("Строка"), НСтр("ru = 'Отступ'"));
//	
//	Если ТипЗнч(Форма.ДеревоЦен) = Тип("ДанныеФормыДерево") Или ТипЗнч(Форма.ДеревоЦен) = Тип("ДанныеФормыКоллекция") Тогда
//			
//		РеквизитыТаблицыЦен = Форма.ПолучитьРеквизиты("ДеревоЦен");
//		Для Каждого Реквизит Из РеквизитыТаблицыЦен Цикл
//			Если СтрНайти(Реквизит.Имя, "ВидЦены")
//				Или СтрНайти(Реквизит.Имя, "Отступ") Тогда
//				УдаляемыеКолонкиТаблицыЦен.Добавить("ДеревоЦен." + Реквизит.Имя);
//			КонецЕсли;
//		КонецЦикла;
//		
//		Для Каждого Колонка Из ДеревоЗначений.Колонки Цикл
//			Если СтрНайти(Колонка.Имя, "ВидЦены") Тогда
//				УдаляемаяКолонка = УдаляемыеКолонкиТаблицыЦен.Найти("ДеревоЦен." + Колонка.Имя);
//				Если УдаляемаяКолонка <> Неопределено Тогда
//					УдаляемыеКолонкиТаблицыЦен.Удалить(УдаляемаяКолонка);
//				Иначе
//					ДобавляемыеКолонкиТаблицыЦен.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "ДеревоЦен", Колонка.Заголовок, Истина));
//				КонецЕсли;
//			КонецЕсли;
//		КонецЦикла;
//	
//		ДобавляемыеКолонкиТаблицыЦен.Добавить(Новый РеквизитФормы(КолонкаОтступ.Имя, КолонкаОтступ.ТипЗначения, "ДеревоЦен", КолонкаОтступ.Заголовок, Истина));
//		
//		Если УдаляемыеКолонкиТаблицыЦен.Количество() > 0 Или ДобавляемыеКолонкиТаблицыЦен.Количество() > 0 Тогда
//			Форма.ИзменитьРеквизиты(ДобавляемыеКолонкиТаблицыЦен, УдаляемыеКолонкиТаблицыЦен);
//		КонецЕсли;
//		
//		ПодчиненныеЭлементыТаблицы = Форма.Элементы["ДеревоЦен"].ПодчиненныеЭлементы; // ЭлементыФормы
//		Для Каждого ТекЭлемент Из ПодчиненныеЭлементыТаблицы Цикл
//			Если СтрНайти(ТекЭлемент.Имя, "ВидЦены")
//				Или СтрНайти(ТекЭлемент.Имя, "Отступ") Тогда
//				УдаляемыеЭлементы.Добавить(ТекЭлемент);
//			КонецЕсли;
//		КонецЦикла;
//		
//		Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
//			Форма.Элементы.Удалить(УдаляемыйЭлемент);
//		КонецЦикла;
//		
//		Для Каждого Оформление Из Форма.УсловноеОформление.Элементы Цикл
//			Если Оформление.Представление = "СозданоПрограммно" Тогда
//				УсловныеОформления.Добавить(Оформление);
//			КонецЕсли;
//		КонецЦикла;
//		
//		Для Каждого Оформление Из УсловныеОформления Цикл
//			Форма.УсловноеОформление.Элементы.Удалить(Оформление);
//		КонецЦикла;
//		
//		Для Каждого ВидЦены Из Форма.ВыбранныеЦены Цикл
//			
//			ИмяКолонки = ВидЦены.ИмяКолонки;
//			
//			ПоказыватьВлияющуюЦену = Форма.ОтображатьВлияющиеЦены 
//										И ВидЦены.Влияет
//										И НЕ ВидЦены.ЗапрещенныйВидЦены;
//			
//			Если ВидЦены.Выбрана
//				Или ПоказыватьВлияющуюЦену Тогда
//				
//				ЦветЗаголовка = Неопределено;
//				ЦветФона      = Неопределено;
//				КартинкаШапки = Неопределено;
//				
//				Если ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.Вручную 
//					Или ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.НаценкаНаЦенуПоступления
//					Или ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.НаценкаНаЦенуВводаОстатков Тогда
//					
//					КартинкаШапки = БиблиотекаКартинок.СпособыЗаданияЦенЗадаватьВручную;
//					
//				ИначеЕсли ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБ
//					Или ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБПриПоступлении
//					Или ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБПоКонкурентам
//					Или ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБПоПоставщикам
//					Или ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗаполнятьПоДаннымИБПоСебестоимости Тогда
//					
//					КартинкаШапки = БиблиотекаКартинок.СпособыЗаданияЦенЗаполнятьПоДаннымИБ;
//					
//				ИначеЕсли ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.РассчитыватьПоФормуламОтДругихВидовЦен
//					Или ВидЦены.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.НаценкаНаДругойВидЦен Тогда

//					КартинкаШапки = БиблиотекаКартинок.СпособыЗаданияЦенРассчитыватьПоФормуламОтДругихВидовЦен;
//					
//				КонецЕсли;
//				
//				Если ЭтоРегистрацияЦенПоставщика Тогда
//		
//					НоваяГруппа = ДобавитьГруппуФормы(Форма, "ГруппаЦены" + ИмяКолонки, Строка(ВидЦены.Ссылка) + ", " + Строка(ВидЦены.Валюта), Истина, КартинкаШапки, ГруппировкаКолонок.Горизонтальная, Неопределено);
//					
//				Иначе
//					
//					НоваяГруппа = ДобавитьГруппуФормы(Форма, "ГруппаЦены" + ИмяКолонки, ?(Строка(ВидЦены.Идентификатор)=Строка(ВидЦены.Ссылка), Строка(ВидЦены.Ссылка), Строка(ВидЦены.Ссылка) + " ["+ Строка(ВидЦены.Идентификатор) +"]") + ", " + Строка(ВидЦены.Валюта), Истина, КартинкаШапки, ГруппировкаКолонок.Горизонтальная, Неопределено);
//					
//				КонецЕсли;		
//				
//				Если ПодборТоваровКлиентСервер.ЭтоФормаПрайсЛиста(Форма) Или
//					ПодборТоваровКлиентСервер.ЭтоФормаПрайсЛистаПоставщиков(Форма) Тогда
//					
//					Если ЗначениеЗаполнено(Форма.ДатаДействующихЦен) Тогда
//						ДатаДействующихЦен = КонецДня(Форма.ДатаДействующихЦен);
//					Иначе
//						ДатаДействующихЦен = НачалоДня(Форма.Дата)-1;
//					КонецЕсли;
//					ЗаголовокКолонкиСтараяЦена = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Цена на %1'"), Формат(ДатаДействующихЦен, "ДЛФ=D"));
//					
//				Иначе
//					
//					ЗаголовокКолонкиСтараяЦена = ?(ВидЦены.Выбрана, НСтр("ru='Действующая цена'"), НСтр("ru='Цена'"));
//					
//				КонецЕсли;
//				
//				Если ВидЦены.Выбрана Тогда
//					НоваяГруппаТехническая = ДобавитьГруппуФормы(Форма, "ГруппаТехническая" + ИмяКолонки, НСтр("ru='Группа'"), Ложь, Неопределено, ГруппировкаКолонок.Горизонтальная, НоваяГруппа);
//					
//					СтруктураПараметров = Новый Структура();
//					СтруктураПараметров.Вставить("Заголовок",              ЗаголовокКолонкиСтараяЦена);
//					СтруктураПараметров.Вставить("ШиринаПоля",             12);
//					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
//					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
//					СтруктураПараметров.Вставить("Родитель",               НоваяГруппаТехническая);
//					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     Истина);
//					
//					НовоеПоле = ДобавитьПолеФормы(Форма, "СтараяЦена" + ИмяКолонки, СтруктураПараметров);
//					НовоеПоле.Подсказка = НСтр("ru = 'Текущая установленная цена'");
//					НовоеПоле.ЦветТекста = WebЦвета.Серый;
//					
//					Если Не ЭтоРегистрацияЦенПоставщика Тогда
//						НоваяГруппаФормула = ДобавитьГруппуФормы(Форма, "ГруппаТехническаяФормула" + ИмяКолонки, НСтр("ru='Группа формула'"), Ложь, Неопределено, ГруппировкаКолонок.ВЯчейке, НоваяГруппаТехническая);
//						
//						НовоеПоле                     = Форма.Элементы.Добавить("ДеревоЦен" + "Формула" + "Картинка" + ИмяКолонки, Тип("ПолеФормы"), НоваяГруппаФормула);
//						НовоеПоле.ПутьКДанным         = "ДеревоЦен.ФормулаИзмененаВручную" + ИмяКолонки;
//						НовоеПоле.Заголовок           = "";
//						НовоеПоле.ПоложениеЗаголовка  = ПоложениеЗаголовкаЭлементаФормы.Нет;
//						НовоеПоле.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
//						НовоеПоле.Вид                 = ВидПоляФормы.ПолеКартинки;
//						НовоеПоле.ТолькоПросмотр      = Истина;
//						НовоеПоле.Ширина              = 2;
//						НовоеПоле.ОтображатьВШапке    = Ложь;
//						НовоеПоле.КартинкаЗначений    = БиблиотекаКартинок.Внимание16;
//						НовоеПоле.Видимость           = ВидЦены.ФормулаРедактируется;
//						НовоеПоле.РастягиватьПоГоризонтали = Ложь;
//						
//						НовоеПоле.Подсказка = НСтр("ru = 'Формула изменена'");

//						СтруктураПараметров = Новый Структура();
//						СтруктураПараметров.Вставить("Заголовок",              НСтр("ru='Формула'"));
//						СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенФормулаПриИзменении");
//						СтруктураПараметров.Вставить("ОбработчикНачалоВыбора", "Подключаемый_ДеревоЦенФормулаНачалоВыбора");
//						СтруктураПараметров.Вставить("ШиринаПоля",             12);
//						СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
//						СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
//						СтруктураПараметров.Вставить("Родитель",               НоваяГруппаФормула);
//						СтруктураПараметров.Вставить("Видимость",              ВидЦены.ФормулаРедактируется);
//						СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     НЕ ВидЦены.Редактировать);
//						СтруктураПараметров.Вставить("ГоризонтальноеПоложение", ГоризонтальноеПоложениеЭлемента.Право);
//						
//						НовоеПоле = ДобавитьПолеФормы(Форма, "Формула" + ИмяКолонки, СтруктураПараметров);
//						НовоеПоле.Подсказка = НСтр("ru = 'Формула для расчета цены'");
//						НовоеПоле.ЦветТекста = WebЦвета.Серый;
//					КонецЕсли;
//					
//					СтруктураПараметров = Новый Структура();
//					СтруктураПараметров.Вставить("Заголовок",              НСтр("ru='Изменение'"));
//					СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенЦенаПриИзменении");
//					СтруктураПараметров.Вставить("ШиринаПоля",             12);
//					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
//					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
//					СтруктураПараметров.Вставить("Родитель",               НоваяГруппаТехническая);
//					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     ?(ЭтоРегистрацияЦенПоставщика, Ложь, НЕ ВидЦены.Редактировать));
//					
//					НовоеПоле = ДобавитьПолеФормы(Форма, "СуммаИзменения" + ИмяКолонки, СтруктураПараметров);
//					
//					НовоеПоле.ЦветТекста = WebЦвета.Серый;
//					НовоеПоле.ВыделятьОтрицательные = Истина;
//					НовоеПоле.Подсказка = НСтр("ru = 'Изменение цены'");
//					
//					СтруктураПараметров = Новый Структура();
//					СтруктураПараметров.Вставить("Заголовок",              "%");
//					СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенЦенаПриИзменении");
//					СтруктураПараметров.Вставить("ШиринаПоля",             6);
//					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
//					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
//					СтруктураПараметров.Вставить("Родитель",               НоваяГруппаТехническая);
//					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     ?(ЭтоРегистрацияЦенПоставщика, Ложь, НЕ ВидЦены.Редактировать));
//					
//					НовоеПоле = ДобавитьПолеФормы(Форма, "ПроцентИзменения" + ИмяКолонки, СтруктураПараметров);
//					НовоеПоле.ЦветТекста = WebЦвета.Серый;
//					НовоеПоле.ВыделятьОтрицательные = Истина;
//					НовоеПоле.Подсказка = НСтр("ru = 'Процент изменения цены'");
//					
//					НоваяГруппаЦена = ДобавитьГруппуФормы(Форма, "ГруппаЦена" + ИмяКолонки, НСтр("ru='Группа цена'"), Ложь, Неопределено, ГруппировкаКолонок.ВЯчейке, НоваяГруппа);
//					
//					НовоеПоле                     = Форма.Элементы.Добавить("ЗапретРедактирования" + ИмяКолонки, Тип("ПолеФормы"), НоваяГруппаЦена);
//					НовоеПоле.ПутьКДанным         = "ДеревоЦен.ЗапретРедактирования" + ИмяКолонки;
//					НовоеПоле.Заголовок           = "Запрет редактирования";
//					НовоеПоле.ПоложениеЗаголовка  = ПоложениеЗаголовкаЭлементаФормы.Нет;
//					НовоеПоле.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
//					НовоеПоле.Вид                 = ВидПоляФормы.ПолеКартинки;
//					НовоеПоле.ТолькоПросмотр      = Истина;
//					НовоеПоле.Ширина              = 2;
//					НовоеПоле.ОтображатьВШапке    = Ложь;
//					НовоеПоле.КартинкаЗначений    = БиблиотекаКартинок.ВидыЦенТолькоПросмотр;
//					НовоеПоле.КартинкаШапки       = БиблиотекаКартинок.ВидыЦенТолькоПросмотр;
//					НовоеПоле.Видимость           = ?(ЭтоРегистрацияЦенПоставщика, Ложь, НЕ ВидЦены.Редактировать);
//					НовоеПоле.РастягиватьПоГоризонтали = Ложь;
//					НовоеПоле.Подсказка = НСтр("ru = 'Запрет редактирования цены'");
//					
//					НовоеПоле                     = Форма.Элементы.Добавить("ДеревоЦен" + "Картинка" + ИмяКолонки, Тип("ПолеФормы"), НоваяГруппаЦена);
//					НовоеПоле.ПутьКДанным         = "ДеревоЦен.ИзмененаВручную" + ИмяКолонки;
//					НовоеПоле.Заголовок           = "";
//					НовоеПоле.ПоложениеЗаголовка  = ПоложениеЗаголовкаЭлементаФормы.Нет;
//					НовоеПоле.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
//					НовоеПоле.Вид                 = ВидПоляФормы.ПолеКартинки;
//					НовоеПоле.ТолькоПросмотр      = Истина;
//					НовоеПоле.Ширина              = 2;
//					НовоеПоле.ОтображатьВШапке    = Ложь;
//					НовоеПоле.КартинкаЗначений    = БиблиотекаКартинок.УстановитьЦены;
//					НовоеПоле.КартинкаШапки       = БиблиотекаКартинок.УстановитьЦены;
//					НовоеПоле.Видимость           = ?(ЭтоРегистрацияЦенПоставщика, Истина, ВидЦены.Редактировать);
//					НовоеПоле.РастягиватьПоГоризонтали = Ложь;
//					НовоеПоле.Подсказка = НСтр("ru = 'Цена изменена вручную'");

//					СтруктураПараметров = Новый Структура();
//					СтруктураПараметров.Вставить("Заголовок",              НСтр("ru='Цена'"));
//					СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенЦенаПриИзменении");
//					СтруктураПараметров.Вставить("ШиринаПоля",             12);
//					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
//					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
//					СтруктураПараметров.Вставить("Родитель",               НоваяГруппаЦена);
//					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     ?(ЭтоРегистрацияЦенПоставщика, Ложь, НЕ ВидЦены.Редактировать));
//					НовоеПоле = ДобавитьПолеФормы(Форма, ИмяКолонки, СтруктураПараметров);
//					НовоеПоле.Подсказка = НСтр("ru = 'Устанавливаемая цена'");
//					
//					Если Не ЭтоРегистрацияЦенПоставщика Тогда
//						НоваяГруппаВалюта = ДобавитьГруппуФормы(Форма, "ГруппаВалюта" + ИмяКолонки, НСтр("ru='Группа валюта'"), Ложь, Неопределено, ГруппировкаКолонок.Горизонтальная, НоваяГруппаТехническая);
//	
//						СтруктураПараметров = Новый Структура();
//						СтруктураПараметров.Вставить("Заголовок",              НСтр("ru='Валюта'"));
//						СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенВалютаПриИзменении");
//						СтруктураПараметров.Вставить("ШиринаПоля",             6);
//						СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
//						СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
//						СтруктураПараметров.Вставить("Родитель",               НоваяГруппаВалюта);
//						СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     ?(ЭтоРегистрацияЦенПоставщика, Ложь, НЕ ВидЦены.Редактировать));
//						
//						НовоеПоле = ДобавитьПолеФормы(Форма, "Валюта" + ИмяКолонки, СтруктураПараметров);
//						НовоеПоле.Подсказка = НСтр("ru = 'Валюта цены'");
//						НовоеПоле.БыстрыйВыбор = Ложь;
//					КонецЕсли;
//					
//				Иначе
//					
//					СтруктураПараметров = Новый Структура();
//					СтруктураПараметров.Вставить("Заголовок",              ЗаголовокКолонкиСтараяЦена);
//					СтруктураПараметров.Вставить("ШиринаПоля",             12);
//					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
//					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
//					СтруктураПараметров.Вставить("Родитель",               НоваяГруппа);
//					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     Истина);
//					
//					НовоеПоле = ДобавитьПолеФормы(Форма, "СтараяЦена" + ИмяКолонки, СтруктураПараметров);
//					
//					НовоеПоле.ЦветТекста = WebЦвета.Серый;
//					
//				КонецЕсли;
//				
//				Если Форма.ИспользоватьУпаковкиНоменклатуры Тогда
//					НоваяГруппаУпаковка = ДобавитьГруппуФормы(Форма, "ГруппаУпаковки" + ИмяКолонки, НСтр("ru='Ед. изм.'"), Ложь, Неопределено, ГруппировкаКолонок.ВЯчейке, НоваяГруппа);
//					
//					НоваяСвязь = Новый СвязьПараметраВыбора("Номенклатура", "Элементы.ДеревоЦен.ТекущиеДанные.Номенклатура", РежимИзмененияСвязанногоЗначения.НеИзменять);
//					НовыйМассив = Новый Массив();
//					НовыйМассив.Добавить(НоваяСвязь);
//					НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
//					
//					СтруктураПараметров = Новый Структура();
//					СтруктураПараметров.Вставить("Заголовок",              НСтр("ru='Упаковка'"));
//					СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенУпаковкаПриИзменении");
//					СтруктураПараметров.Вставить("ОбработчикНачалоВыбора", "Подключаемый_ДеревоЦенУпаковкаНачалоВыбора");
//					СтруктураПараметров.Вставить("ШиринаПоля",             3);
//					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
//					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
//					СтруктураПараметров.Вставить("Родитель",               НоваяГруппаУпаковка);
//					СтруктураПараметров.Вставить("СвязиПараметровВыбора",  НовыеСвязи);
//					СтруктураПараметров.Вставить("ОтображатьВШапке",       Ложь);
//					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     ?(ЭтоРегистрацияЦенПоставщика, Ложь, НЕ ВидЦены.Редактировать));
//					
//					ДобавитьПолеФормы(Форма, "Упаковка" + ИмяКолонки, СтруктураПараметров);
//					
//					СтруктураПараметров = Новый Структура();
//					СтруктураПараметров.Вставить("Заголовок",              НСтр("ru='Ед. изм.'"));
//					СтруктураПараметров.Вставить("ШиринаПоля",             3);
//					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
//					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
//					СтруктураПараметров.Вставить("Родитель",               НоваяГруппаУпаковка);
//					СтруктураПараметров.Вставить("ПутьКДанным",            "ДеревоЦен.Номенклатура.ЕдиницаИзмерения");
//					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     Истина);
//				
//					ДобавитьПолеФормы(Форма, "ЕдиницаИзмерения" + ИмяКолонки, СтруктураПараметров);

//					Если ЭтоРегистрацияЦенПоставщика Тогда
//						
//						СтруктураПараметров = Новый Структура();
//						СтруктураПараметров.Вставить("Заголовок",              НСтр("ru = 'Упаковка заказа'"));
//						СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенУпаковкаЗаказаПриИзменении");
//						СтруктураПараметров.Вставить("ШиринаПоля",             9);
//						СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
//						СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
//						СтруктураПараметров.Вставить("Родитель",               НоваяГруппа);
//						СтруктураПараметров.Вставить("СвязиПараметровВыбора",  НовыеСвязи);
//						СтруктураПараметров.Вставить("ОтображатьВШапке",       Истина);
//						
//						ДобавитьПолеФормы(Форма,"УпаковкаЗаказа" + ИмяКолонки, СтруктураПараметров);
//						
//						Если Форма.КодФормы = "ЗагрузкаЦенПоставщикаИзВнешнихФайлов" Тогда
//							СтруктураПараметров = Новый Структура();
//							СтруктураПараметров.Вставить("Заголовок",              НСтр("ru = 'Упаковка заполнена'"));
//							СтруктураПараметров.Вставить("ШиринаПоля",             9);
//							СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
//							СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
//							СтруктураПараметров.Вставить("Родитель",               НоваяГруппа);
//							СтруктураПараметров.Вставить("СвязиПараметровВыбора",  НовыеСвязи);
//							СтруктураПараметров.Вставить("ОтображатьВШапке",       Истина);
//							СтруктураПараметров.Вставить("Видимость",              Ложь);
//							
//							ДобавитьПолеФормы(Форма,"УпаковкаЗаполнена" + ИмяКолонки, СтруктураПараметров);
//							
//							СтруктураПараметров = Новый Структура();
//							СтруктураПараметров.Вставить("Заголовок",              НСтр("ru = 'Наименование упак.'"));
//							СтруктураПараметров.Вставить("ШиринаПоля",             9);
//							СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
//							СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
//							СтруктураПараметров.Вставить("Родитель",               НоваяГруппа);
//							СтруктураПараметров.Вставить("СвязиПараметровВыбора",  НовыеСвязи);
//							СтруктураПараметров.Вставить("ОтображатьВШапке",       Истина);
//							СтруктураПараметров.Вставить("Видимость",              Истина);
//							СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     Истина);
//							
//							ДобавитьПолеФормы(Форма,"УпаковкаИмя" + ИмяКолонки, СтруктураПараметров);
//						КонецЕсли;
//					КонецЕсли;
//					
//				Иначе
//					СтруктураПараметров = Новый Структура();
//					СтруктураПараметров.Вставить("Заголовок",              НСтр("ru='Ед. изм.'"));
//					СтруктураПараметров.Вставить("ШиринаПоля",             3);
//					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
//					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
//					СтруктураПараметров.Вставить("Родитель",               НоваяГруппа);
//					СтруктураПараметров.Вставить("ПутьКДанным",            "ДеревоЦен.Номенклатура.ЕдиницаИзмерения");
//					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     Истина);
//					
//					ДобавитьПолеФормы(Форма, "ЕдиницаИзмерения" + ИмяКолонки, СтруктураПараметров);
//				КонецЕсли;
//				
//				Если ЭтоРегистрацияЦенПоставщика Тогда
//					
//					СтруктураПараметров = Новый Структура();
//					СтруктураПараметров.Вставить("Заголовок",              НСтр("ru = 'Мин. партия поставки'"));
//					СтруктураПараметров.Вставить("ОбработчикПриИзменении", "Подключаемый_ДеревоЦенМинимальнаяПартияПриИзменении");
//					СтруктураПараметров.Вставить("ШиринаПоля",             8);
//					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
//					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
//					СтруктураПараметров.Вставить("Родитель",               НоваяГруппа);
//					СтруктураПараметров.Вставить("ОтображатьВШапке",       Истина);
//				
//					НовоеПоле = ДобавитьПолеФормы(Форма, "МинимальнаяПартияПоставки" + ИмяКолонки, СтруктураПараметров);
//				
//					СтруктураПараметров = Новый Структура();
//					СтруктураПараметров.Вставить("Заголовок",              НСтр("ru = 'Условия'"));
//					СтруктураПараметров.Вставить("ШиринаПоля",             8);
//					СтруктураПараметров.Вставить("ЦветФона",               ЦветФона);
//					СтруктураПараметров.Вставить("ЦветФонаЗаголовка",      ЦветЗаголовка);
//					СтруктураПараметров.Вставить("Родитель",               НоваяГруппа);
//					СтруктураПараметров.Вставить("ОтображатьВШапке",       Истина);
//					СтруктураПараметров.Вставить("Вид",                    ВидПоляФормы.ПолеКартинки);
//					СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     Ложь);
//					СтруктураПараметров.Вставить("КартинкаЗначений",       БиблиотекаКартинок.Изменить);
//					СтруктураПараметров.Вставить("КартинкаШапки",          БиблиотекаКартинок.Изменить);
//					СтруктураПараметров.Вставить("Видимость",              Ложь);
//					
//					ДобавитьПолеФормы(Форма,"УстановкаУсловий" + ИмяКолонки, СтруктураПараметров);
//				КонецЕсли;
//				
//				Если Не ЭтоРегистрацияЦенПоставщика Тогда
//					Если ВидЦены.ФормулаРедактируется Тогда
//							
//						// Условное изменения формулы
//						НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
//						НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Формула"+ ИмяКолонки;
//						НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
//						НовыйЭлементУсловногоОформления.Использование = Истина;
//						
//						ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//						ЭлементОтбора.Использование = Истина;
//						ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ФормулаИзмененаВручную"+ ИмяКолонки);
//						ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//						ЭлементОтбора.ПравоеЗначение = Истина;
//						
//						НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
//						НовоеПоле.Использование = Истина;
//						НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "Формула"+ ИмяКолонки);
//						
//						НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноСиний);
//			
//						// Условное изменения формулы
//						НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
//						НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Формула"+ ИмяКолонки;
//						НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
//						НовыйЭлементУсловногоОформления.Использование = Истина;
//						
//						ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//						ЭлементОтбора.Использование = Истина;
//						ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ФормулаИзмененаВручную"+ ИмяКолонки);
//						ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//						ЭлементОтбора.ПравоеЗначение = Ложь;
//						
//						НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
//						НовоеПоле.Использование = Истина;
//						НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "Формула"+ ИмяКолонки);
//						
//						НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
//						
//					Иначе
//						// Условное изменения формулы
//						НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
//						НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "Формула"+ ИмяКолонки;
//						НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
//						НовыйЭлементУсловногоОформления.Использование = Истина;
//						
//						НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
//						НовоеПоле.Использование = Истина;
//						НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "Формула"+ ИмяКолонки);
//						
//						НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<формулы не используются>'"));
//						НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
//						НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
//						
//					КонецЕсли;
//				КонецЕсли;

//				// Условное оформление увеличившихся цен
//				НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
//				НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = ИмяКолонки;
//				НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
//				НовыйЭлементУсловногоОформления.Использование = Истина;
//				
//				ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//				ЭлементОтбора.Использование = Истина;
//				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен." + ИмяКолонки);
//				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
//				ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.СтараяЦена" + ИмяКолонки);
//				
//				НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
//				НовоеПоле.Использование = Истина;
//				НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + ИмяКолонки);
//				
//				НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноСиний);
//				
//				// Условное оформление уменьшившихся цен
//				НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
//				НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = ИмяКолонки;
//				НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
//				НовыйЭлементУсловногоОформления.Использование = Истина;
//				
//				ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//				ЭлементОтбора.Использование = Истина;
//				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен." + ИмяКолонки);
//				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
//				ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.СтараяЦена" + ИмяКолонки);
//				
//				НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
//				НовоеПоле.Использование = Истина;
//				НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + ИмяКолонки);
//				
//				НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноЗеленый);
//				
//				// Условное оформление единиц измерения
//				НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(Форма, "ДеревоЦен" + "ЕдиницаИзмерения" + ИмяКолонки, "ДеревоЦен.Упаковка" + ИмяКолонки);
//				
//				Если НЕ ЭтоРегистрацияЦенПоставщика и ИспользуетсяЦенообразование25 Тогда
//					
//					НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
//					НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = ИмяКолонки;
//					НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
//					НовыйЭлементУсловногоОформления.Использование = Истина;
//					
//					ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//					ЭлементОтбора.Использование = Истина;
//					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.УпаковкиИспользуются");
//					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//					ЭлементОтбора.ПравоеЗначение = Истина;
//					
//					НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
//					НовоеПоле.Использование = Истина;
//					НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "Упаковка" + ИмяКолонки);
//					
//					НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
//					
//				КонецЕсли;
//				
//				// Условное оформление запрета редактирования
//				НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
//				НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = ИмяКолонки;
//				НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
//				НовыйЭлементУсловногоОформления.Использование = Истина;
//				
//				ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//				ЭлементОтбора.Использование = Истина;
//				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ЗапретРедактирования" + ИмяКолонки);
//				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//				ЭлементОтбора.ПравоеЗначение = Истина;
//				
//				НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
//				НовоеПоле.Использование = Истина;
//				НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + ИмяКолонки);
//				
//				НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
//				НовоеПоле.Использование = Истина;
//				НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "Формула" + ИмяКолонки);
//				
//				НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
//				НовоеПоле.Использование = Истина;
//				НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "СуммаИзменения" + ИмяКолонки);
//				
//				НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
//				НовоеПоле.Использование = Истина;
//				НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "ПроцентИзменения" + ИмяКолонки);
//				
//				НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
//				НовоеПоле.Использование = Истина;
//				НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "Валюта" + ИмяКолонки);

//				Если НЕ ЭтоРегистрацияЦенПоставщика Тогда
//					НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
//					НовоеПоле.Использование = Истина;
//					НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "Упаковка" + ИмяКолонки);
//				КонецЕсли;
//				
//				НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
//				НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Запрет редактирования>'"));

//				Если ЭтоРегистрацияЦенПоставщика Тогда
//					
//					// В регистрации цен поставщика - пустая цена не регистрируется при проведении
//					НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
//					НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = ИмяКолонки;
//					НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
//					НовыйЭлементУсловногоОформления.Использование = Истина;
//					
//					ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//					ЭлементОтбора.Использование = Истина;
//					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен." + ИмяКолонки);
//					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//					ЭлементОтбора.ПравоеЗначение = 0;
//					
//					ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//					ЭлементОтбора.Использование = Истина;
//					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ХарактеристикиИспользуются");
//					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//					ЭлементОтбора.ПравоеЗначение = Ложь;
//					
//					НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
//					НовоеПоле.Использование = Истина;
//					НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + ИмяКолонки);
//					
//					НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Не изменяется>'"));
//					НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
//					
//					//
//					
//					НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
//					НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = ИмяКолонки;
//					НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
//					НовыйЭлементУсловногоОформления.Использование = Истина;
//					
//					ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//					ЭлементОтбора.Использование = Истина;
//					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен." + ИмяКолонки);
//					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//					ЭлементОтбора.ПравоеЗначение = 0;
//					
//					ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//					ЭлементОтбора.Использование = Истина;
//					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.Характеристика");
//					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
//					
//					НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
//					НовоеПоле.Использование = Истина;
//					НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + ИмяКолонки);
//					
//					НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Не изменяется>'"));
//					НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
//					
//					// В регистрации цен поставщика - пустая цена не регистрируется при проведении
//					НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
//					НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = ИмяКолонки;
//					НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
//					НовыйЭлементУсловногоОформления.Использование = Истина;
//					
//					ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//					ЭлементОтбора.Использование = Истина;
//					ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен." + ИмяКолонки);
//					ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
//					ЭлементОтбора.ПравоеЗначение = 0;
//					
//					НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
//					НовоеПоле.Использование = Истина;
//					НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен" + "ПроцентИзменения" + ИмяКолонки);
//					
//					НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", "");
//					НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
//					НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
//					
//				КонецЕсли;
//				
//			КонецЕсли;
//			
//			Если ЗначениеЗаполнено(ВариантГруппировки) Тогда
//			
//				СписокИндексовКартинкиЭлемента = Новый СписокЗначений;
//				СписокИндексовКартинкиЭлемента.Добавить(0);
//				СписокИндексовКартинкиЭлемента.Добавить(2);
//				//
//				
//				НовыйЭлементУсловногоОформления = Форма.УсловноеОформление.Элементы.Добавить();
//				НовыйЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "СтрокиТолькоПросмотр";
//				НовыйЭлементУсловногоОформления.Представление = "СозданоПрограммно";
//				НовыйЭлементУсловногоОформления.Использование = Истина;
//				
//				ЭлементОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
//				ЭлементОтбора.Использование = Истина;
//				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЦен.ИндексКартинки");
//				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
//				ЭлементОтбора.ПравоеЗначение = СписокИндексовКартинкиЭлемента;
//				
//				НовоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
//				НовоеПоле.Использование = Истина;
//				НовоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЦен");
//				
//				НовыйЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
//			
//			КонецЕсли; 
//		КонецЦикла;
//		
//		СтруктураПараметров = Новый Структура();
//		СтруктураПараметров.Вставить("ШиринаПоля",             30);
//		СтруктураПараметров.Вставить("ТолькоПросмотрПоля",     Истина);
//		
//		НовоеПоле = ДобавитьПолеФормы(Форма, "Отступ", СтруктураПараметров);
//		НовоеПоле.ЦветТекста = WebЦвета.Серый;
//		НовоеПоле.Видимость  = Истина;
//		НовоеПоле.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
//		НовоеПоле.РастягиватьПоГоризонтали = Истина;
//	
//		ДеревоЦенЗначение = Форма.РеквизитФормыВЗначение("ДеревоЦен"); // ДеревоЗначений
//		ДеревоЦенЗначение.Колонки.Очистить();
//		
//		Для Каждого Колонка Из ДеревоЗначений.Колонки Цикл
//			ДеревоЦенЗначение.Колонки.Добавить(Колонка.Имя);
//		КонецЦикла;
//		
//		Форма.ЗначениеВРеквизитФормы(ДеревоЦенЗначение, "ДеревоЦен");
//		Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма, "ВыбранныеЦеныИзменены") Тогда
//			Форма.ВыбранныеЦеныИзменены = Ложь;
//		КонецЕсли;

//		Если Не ЭтоРегистрацияЦенПоставщика Тогда
//			УстановитьПометкуИзмененныхФормул(Форма, ДеревоЦенЗначение);
//		КонецЕсли;
//		
//	Иначе
//		
//		Форма["ДеревоЦен"] = ДеревоЗначений.Скопировать();
//		
//	КонецЕсли;
//	
//КонецПроцедуры


//&ИзменениеИКонтроль("СоздатьТаблицуТовары")
//Функция асп_СоздатьТаблицуТовары(ЭтоРегистрацияЦенПоставщика)
//	
//	ТаблицаЗначений = Новый ТаблицаЗначений();
//	
//	ТаблицаЗначений.Колонки.Добавить("НоменклатураПартнера", Новый ОписаниеТипов("СправочникСсылка.НоменклатураКонтрагентов"));
//	ТаблицаЗначений.Колонки.Добавить("Номенклатура",           Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//	Если ИспользуетсяЦенообразование25 Тогда 
//		ТаблицаЗначений.Колонки.Добавить("ХарактеристикаЦО",   Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатурыДляЦенообразования"));		
//		ТаблицаЗначений.Колонки.Добавить("СерияЦО",            Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатурыДляЦенообразования"));		
//		ТаблицаЗначений.Колонки.Добавить("СерияЦОДляСвязи",    Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатурыДляЦенообразования"));		
//		ТаблицаЗначений.Колонки.Добавить("УпаковкаЦО",         Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
//		ТаблицаЗначений.Колонки.Добавить("УпаковкаЦОДляСвязи", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
//	Иначе			
//		ТаблицаЗначений.Колонки.Добавить("Характеристика",         Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
//	КонецЕсли;
//	Если ЭтоРегистрацияЦенПоставщика Тогда
//		ТаблицаЗначений.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦенПоставщиков"));
//		ТаблицаЗначений.Колонки.Добавить("УпаковкаЗаказа", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
//		ТаблицаЗначений.Колонки.Добавить("УпаковкаИмя", Новый ОписаниеТипов("Строка"));
//		ТаблицаЗначений.Колонки.Добавить("МинимальнаяПартияПоставки", Новый ОписаниеТипов("Число"));
//		ТаблицаЗначений.Колонки.Добавить("УстановкаУсловий", Новый ОписаниеТипов("Булево"));
//	Иначе
//		ТаблицаЗначений.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
//		ТаблицаЗначений.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
//		#Вставка
//		ТаблицаЗначений.Колонки.Добавить("НоменклатураКлиента", Новый ОписаниеТипов("СправочникСсылка.НоменклатураКонтрагентов"));
//		#КонецВставки
//	КонецЕсли;
//	ТаблицаЗначений.Колонки.Добавить("Цена",                   Новый ОписаниеТипов("Число"));
//	ТаблицаЗначений.Колонки.Добавить("Упаковка",               Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
//	ТаблицаЗначений.Колонки.Добавить("Формула",                Новый ОписаниеТипов("Строка"));
//	
//	Возврат ТаблицаЗначений;
//	
//КонецФункции
#КонецОбласти