&НаСервере
Процедура ЗаполнитьПоЗаказуКлиентаНаСервере()
	//Асист-про. Ранее если этот документ не записан выходила ошибка, добавил условие
	Если ЗначениеЗаполнено( Объект.Ссылка) Тогда	
		об = Объект.Ссылка.ПолучитьОбъект();
		об.Заполнить(Объект.ЗаказКлиента);
		об.Записать(РежимЗаписиДокумента.Запись);
		ЭтаФорма.Прочитать();
		
		ЗаполнитьДанныеНаСервере(Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо записать этот документ перед заполнением");	
	КонецЕсли;
КонецПроцедуры//ЗаполнитьПоЗаказуКлиентаНаСервере()	

&НаСервере
Процедура ЗаполнитьДанныеНаСервере(ПерезаполнитьСуммы = Ложь, Отказ = Ложь)
	
	ЗаказанныеУслуги.Очистить();
	Элементы.Услуга.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура,
	|	СУММА(ЗаказКлиентаТовары.Сумма) КАК Сумма
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &ЗаказКлиента
	|	И ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И (НЕ ЗаказКлиентаТовары.Номенклатура.Наименование ПОДОБНО ""%Доставка%"")
	|	И (НЕ ЗаказКлиентаТовары.Номенклатура.Наименование ПОДОБНО ""%ДОСТАВКА%"")
	|	И (НЕ ЗаказКлиентаТовары.Номенклатура.Наименование ПОДОБНО ""%Аренда%"")
	|	И (НЕ ЗаказКлиентаТовары.Отменено)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура";
	Запрос.УстановитьПараметр("ЗаказКлиента", Объект.ЗаказКлиента);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = ЗаказанныеУслуги.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
		Элементы.Услуга.СписокВыбора.Добавить(Выборка.Номенклатура);
	КонецЦикла;
	
	Если ЗаказанныеУслуги.Количество() = 0 Тогда
		Сообщить("Услуги в заказе клиента " + Объект.ЗаказКлиента + " не найдены!");
				
		//Асист-Про. Еще одна проверка - если услуга заполнена, но в реализации услуг нет тогда добавляем в список выбора её одну
		Если ЗначениеЗаполнено(Объект.Услуга) Тогда
			Элементы.Услуга.СписокВыбора.Добавить(Объект.Услуга);
		КонецЕсли;
		
		//Асист-про. Если роль недоступна просто не создаем заказ на услуги
		Если ПерезаполнитьСуммы И Не РольДоступна("ASP_РуководительПодразделения") И Не РольДоступна("ASP_ЗаявкиНаУслугиБезУслугВЗаказе") Тогда
			Отказ = Истина;
			Объект.СуммаУслуги = 0;
			Возврат;
			
		КонецЕсли;
		//Асист-про. Если роль доступна то разрешаем выбор услуг и номенклатуры и редактирование поля сумма услуги
		Если  РольДоступна("ASP_РуководительПодразделения") ИЛИ РольДоступна("ASP_ЗаявкиНаУслугиБезУслугВЗаказе") Тогда
			Элементы.Услуга.РежимВыбораИзСписка=Ложь;
			Элементы.СуммаУслуги.Вид=ВидПоляФормы.ПолеВвода;
		КонецЕсли;
	КонецЕсли;	
	//Асист-про. Если количество услуг больше нуля тогда можно взять сумму и номенклатуру из первой строки	
	Если ПерезаполнитьСуммы И НЕ ЗаказанныеУслуги.Количество() = 0 Тогда
		
		Объект.Услуга = ЗаказанныеУслуги[0].Номенклатура;
		//ГТС корректируем сумму услуги на -16.7%
		Объект.СуммаУслуги = ЗаказанныеУслуги[0].Сумма-ЗаказанныеУслуги[0].Сумма*(Объект.ПроцентЗаСложность/100);
		Объект.СуммаУслугиПоЗаказу=ЗаказанныеУслуги[0].Сумма;
		
	КонецЕсли;
	
	Если ПерезаполнитьСуммы Тогда
		//Объект.ПроцентЗаСрочность = 7;
		//Объект.СуммаЗаСрочность = Окр(Объект.СуммаУслуги*Объект.ПроцентЗаСрочность / 100);
		//Объект.СуммаЗаСрочность = Окр(Объект.Товары.Итог("Сумма")*Объект.ПроцентЗаСрочность / 100);
	КонецЕсли;
	
	СуммаВсего = Объект.СуммаЗаСложность + Объект.СуммаЗаСрочность + Объект.СуммаУслуги;
	
	ЗаполнитьСписокРеализацийНаСервере();
	Попытка
	Если Параметры.ЗаполнитьРеализацию Тогда
		
		Объект.ДокументРеализации = Параметры.ДокументРеализации;
		Объект.ФактическаяДатаВыполнения = Объект.ДокументРеализации.Дата;
		Объект.Статус = Перечисления.СтатусыЗаявокНаУслуги.Выполнено;
		Модифицированность = Истина;
	
	КонецЕсли;	
	Исключение
	КонецПопытки;
КонецПроцедуры//ИнициализироватьДокументНаСервере	

&НаСервере
Функция ПолучитьРеквизитЭлементаСервер(Элемент,ИмяРеквизита)
	Возврат Элемент[ИмяРеквизита];
КонецФункции	

&НаСервере
Процедура ЗаполнитьСписокРеализацийНаСервере()
	
	// заполним список возможных реализаций услуги
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугТовары.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка.Проведен
	|	И РеализацияТоваровУслугТовары.Ссылка.ЗаказКлиента = &ЗаказКлиента
	|	И РеализацияТоваровУслугТовары.Номенклатура = &Номенклатура";
	Запрос.УстановитьПараметр("ЗаказКлиента", Объект.ЗаказКлиента);
	Запрос.УстановитьПараметр("Номенклатура", Объект.Услуга);
	
	Элементы.ДокументРеализации.СписокВыбора.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Элементы.ДокументРеализации.СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.ДокументРеализации) И Элементы.ДокументРеализации.СписокВыбора.НайтиПоЗначению(Объект.ДокументРеализации) = Неопределено Тогда
		Элементы.ДокументРеализации.СписокВыбора.Добавить(Объект.ДокументРеализации);
	КонецЕсли;	
		
КонецПроцедуры//ЗаполнитьСписокРеализацийНаСервере()	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма); 
	
	Если НЕ ЗначениеЗаполнено(Объект.ПроцентЗаСложность) Тогда 
		Объект.ПроцентЗаСложность=16.7
	Иначе 
	КонецЕсли;
	
	//Асист-про. Этот реквизит используется для отбора при выборе услуги, должен быть всегда заполнен.
	Если  Не ЗначениеЗаполнено(Объект.ВидНоменклатурыУслуга) Тогда
		Объект.ВидНоменклатурыУслуга=Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуга",Истина);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ЗаказКлиента) И НЕ ПараметрыСеанса.ТекущийПользователь.Подразделение=Справочники.СтруктураПредприятия.НайтиПоКоду("0--000005") и НЕ значениезаполнено(Объект.Ссылка) Тогда
		Отказ = Истина;
	КонецЕсли;	
	УстановитьПривилегированныйРежим(Истина);
	Если РольДоступна("ПолныеПрава") = Истина Тогда
	Элементы.СуммаУслуги.ТолькоПросмотр = Ложь;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	ЗаполнитьДанныеНаСервере(НЕ ЗначениеЗаполнено(Параметры.Ключ), Отказ);   
	
	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
		ГиперссылкаФайлов = МодульРаботаСФайлами.ГиперссылкаФайлов();
		ГиперссылкаФайлов.Размещение = "КоманднаяПанель";
		МодульРаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ГиперссылкаФайлов);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	Если ЗначениеЗаполнено(Объект.ЗаявкаНаТранспорт) Тогда
	Склад=Объект.ЗаявкаНаТранспорт.Склад;
	КонецЕсли;
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаСервере
Процедура ДокументРеализацииПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.ДокументРеализации) Тогда
		Если НЕ Объект.ДокументРеализации.Проведен Тогда
			Сообщить("Необходимо выбрать проведенный документ");
			Возврат;
		КонецЕсли;	
		Объект.ФактическаяДатаВыполнения = Объект.ДокументРеализации.Дата;
		Объект.Статус = Перечисления.СтатусыЗаявокНаУслуги.Выполнено;
	КонецЕсли;	
КонецПроцедуры//ДокументРеализацииПриИзмененииНаСервере

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.ПланируемаяДатаВыполнения) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Объект.ПланируемаяДатаВыполнения";
		Сообщение.Текст = "Укажите планируемую дату выполнения услуги.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаУслуги.Выполнено") И НЕ ЗначениеЗаполнено(Объект.ФактическаяДатаВыполнения) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Объект.ФактическаяДатаВыполнения";
		Сообщение.Текст = "Укажите дату фактического выполнения услуги.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	//Асист-Про. Если количество услуг в документе 0, или доступна роль РуководительПодразделения тогда можно без реализации
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаУслуги.Выполнено") И (НЕ ЗначениеЗаполнено(Объект.ДокументРеализации) И Не ЗаказанныеУслуги.Количество()=0 И Не Альтерлого.РолиДоступны("ASP_РуководительПодразделения") И Не Альтерлого.РолиДоступны("ASP_ЗаявкиНаУслугиБезУслугВЗаказе")) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Объект.ДокументРеализации";
		Сообщение.Текст = "Укажите документ выполнения услуги.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	Если Объект.Оплачено И НЕ ЗначениеЗаполнено(Объект.ДатаОплаты) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Поле = "Объект.ДатаОплаты";
		Сообщение.Текст = "Укажите дату оплаты услуги.";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	 //Асист-Про. Если количество услуг в документе 0, или доступна роль РуководительПодразделения тогда можно без реализации
	Если НЕ ЗначениеЗаполнено(Объект.ДокументРеализации) И Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаУслуги.Выполнено")  И Не ЗаказанныеУслуги.Количество()=0 И Не Альтерлого.РолиДоступны("ASP_РуководительПодразделения") И Не Альтерлого.РолиДоступны("ASP_ЗаявкиНаУслугиБезУслугВЗаказе") Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаУслуги.Запланировано");
	КонецЕсли;	
КонецПроцедуры//ПередЗаписью

&НаКлиенте
Процедура ПроцентЗаСрочностьПриИзменении(Элемент)
	
	Если Объект.ПроцентЗаСрочность = 0 Тогда
		Объект.ПроцентЗаСрочность = 7;
	ИначеЕсли Объект.ПроцентЗаСрочность >= 50 Тогда
		Сообщить("Слишком большой процент!");
		Объект.ПроцентЗаСрочность = 7;
	КонецЕсли;	
	//Объект.СуммаЗаСрочность = Окр(Объект.СуммаУслуги*Объект.ПроцентЗаСрочность / 100);
	Объект.СуммаЗаСрочность = Окр(Объект.Товары.Итог("Сумма")*Объект.ПроцентЗаСрочность / 100);
	СуммаВсего = Объект.СуммаЗаСложность + Объект.СуммаЗаСрочность + Объект.СуммаУслуги;
КонецПроцедуры

&НаКлиенте
Процедура ПроцентЗаСложностьПриИзменении(Элемент)
	 Объект.СуммаУслуги = ЗаказанныеУслуги[0].Сумма-ЗаказанныеУслуги[0].Сумма*(Объект.ПроцентЗаСложность/100);
	Объект.СуммаУслугиПоЗаказу=ЗаказанныеУслуги[0].Сумма;

	//Объект.СуммаЗаСложность = Окр(Объект.Товары.Итог("Сумма")*Объект.ПроцентЗаСложность / 100, 2);
	//СуммаВсего = Объект.СуммаЗаСложность + Объект.СуммаЗаСрочность + Объект.СуммаУслуги;
КонецПроцедуры

&НаКлиенте
Процедура УслугаПриИзменении(Элемент)
	
	СтрокиУслуги = ЗаказанныеУслуги.НайтиСтроки(Новый Структура("Номенклатура", Объект.Услуга));
	Если СтрокиУслуги.Количество() = 0 Тогда
		Объект.СуммаУслуги = 0;
	Иначе
		Объект.СуммаУслуги = СтрокиУслуги[0].Сумма-СтрокиУслуги[0].Сумма*(Объект.ПроцентЗаСложность/100);
	КонецЕсли;	
	СуммаВсего = Объект.СуммаЗаСложность + Объект.СуммаЗаСрочность + Объект.СуммаУслуги;
	СуммаУслугиПоЗаказу=ЗаказанныеУслуги[0].Сумма;
	ЗаполнитьСписокРеализацийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоставщикПриИзменении(Элемент)
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер, Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура АдресНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	Элементы.Адрес.СписокВыбора.Очистить();
	СоответствиеАдресов = ПродажиСервер1.ПолучитьСписокАдресов(ПолучитьРеквизитЭлементаСервер(Объект.ЗаказКлиента,"Партнер"));
		
	Для Каждого Адрес Из СоответствиеАдресов Цикл
		Элементы.Адрес.СписокВыбора.Добавить(Адрес.Ключ, Адрес.Значение);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДокументРеализацииПриИзменении(Элемент)
	ДокументРеализацииПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗаказуКлиента(Команда)
	ЗаполнитьПоЗаказуКлиентаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СуммаУслугиПриИзменении(Элемент)
	СуммаВсего = Объект.СуммаЗаСложность + Объект.СуммаЗаСрочность + Объект.СуммаУслуги;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи) 
	Если ЗначениеЗаполнено(ТекущийОбъект.ЗаказКлиента) Тогда 
		Если ТекущийОбъект.Статус=Перечисления.СтатусыЗаявокНаУслуги.Выполнено И ТекущийОбъект.ЗаказКлиента.ЗаявкаНаУслугиВыполнена=Ложь Тогда
		ЗаказК=ТекущийОбъект.ЗаказКлиента.ПолучитьОбъект();
		ЗаказК.ЗаявкаНаУслугиВыполнена=Истина;      
		ЗаказК.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
СобытияФорм.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);


КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры                                         



// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиКлиент");
		МодульРаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ФайловВложеноНажатие(Элемент, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВладелецФайла",  Объект.Ссылка); 
	//ПараметрыФормы.Вставить("ТолькоПросмотр", ПараметрыВыполненияКоманды.Источник.ТолькоПросмотр);
	
	ОткрытьФорму("Обработка.РаботаСФайлами.Форма.ПрисоединенныеФайлы",
	             ПараметрыФормы,
	            // ПараметрыВыполненияКоманды.Источник,
	            // ПараметрыВыполненияКоманды.Уникальность,
	            // ПараметрыВыполненияКоманды.Окно
				);
КонецПроцедуры



&НаСервере
Процедура ЗаявкаНаТранспортПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.ЗаявкаНаТранспорт) Тогда
	Склад=Объект.ЗаявкаНаТранспорт.Склад;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаТранспортПриИзменении(Элемент)
	ЗаявкаНаТранспортПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СуммаУслугиПоЗаказуПриИзменении(Элемент)
	Объект.СуммаУслуги=Объект.СуммаУслугиПоЗаказу-Объект.СуммаУслугиПоЗаказу*(Объект.ПроцентЗаСложность/100);
	СуммаВсего= Объект.СуммаУслуги;
КонецПроцедуры


