#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения:
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов объекта.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением.
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	#Область РаспределениеВзаиморасчетовПоСрокам
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РаспределениеВзаиморасчетовПоСрокам";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
		"ru = 'Распределение взаиморасчетов по срокам'", КодыЯзыков); // @НСтр-2
	
	РегистрОчереди = Метаданные.РегистрыСведений.Найти("ЗаданияКРаспределениюВзаиморасчетов");
	Элемент.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(РегистрОчереди.ПолноеИмя());
	Элемент.МаксимальнаяПорция = 1000;
	Элемент.НомерОчереди = 1;
	
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Комментарий",
		"ru = 'Выполняется распределение расчетов по текущим заданиям к распределению в регистре ""Задания к распределению взаиморасчетов""'",
		КодыЯзыков); // @НСтр-2
	
	#Область ЧитаемыеРегистры
	
	Элемент.ЧитаемыеРегистры = ТабличныеЧасти.ЧитаемыеРегистры.Скопировать();
	
	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСКлиентами");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить(); 
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСПоставщиками");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	#КонецОбласти
	
	#Область ИзменяемыеРегистры
	
	Элемент.ИзменяемыеРегистры = ТабличныеЧасти.ИзменяемыеРегистры.Скопировать();
	
	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСКлиентамиПоСрокам");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСКлиентамиПланОплат");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСКлиентамиПланОтгрузок");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСПоставщикамиПоСрокам");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСПоставщикамиПланОплат");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСПоставщикамиПланПоставок");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	#КонецОбласти
	
	#КонецОбласти //РаспределениеВзаиморасчетовПоСрокам

	#Область АктуализацияСуммДокументовВВалютахУчета
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АктуализацияСуммДокументовВВалютахУчета";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
		"ru = 'Актуализация сумм документов в валютах учета'", КодыЯзыков); // @НСтр-2
	
	РегистрОчереди = Метаданные.РегистрыСведений.Найти("ЗаданияНеоперативногоДопроведенияДокументов");
	Элемент.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(РегистрОчереди.ПолноеИмя());
	Элемент.МаксимальнаяПорция = 100;
	Элемент.НомерОчереди = 1;
	
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Комментарий",
		"ru = 'Выполняется расчет сумм документов в валютах учета по тем документам, у которых не рассчитаны суммы в валютах регламентированного и управленческого учета или же они отличаются от сумм движений документа по регистрам расчетов.'",
		КодыЯзыков); // @НСтр-2
	
	#Область ЧитаемыеРегистры
	
	Элемент.ЧитаемыеРегистры = ТабличныеЧасти.ЧитаемыеРегистры.Скопировать();
	
	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСКлиентамиПоСрокам");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСПоставщикамиПоСрокам");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыСведений.Найти("СуммыДокументовВВалютахУчета");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	#КонецОбласти
	
	#Область ИзменяемыеРегистры
	
	Элемент.ИзменяемыеРегистры = ТабличныеЧасти.ИзменяемыеРегистры.Скопировать();
	
	Регистр = Метаданные.РегистрыСведений.Найти("СуммыДокументовВВалютахУчета");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ПроцентныеРасходыДисконтирования");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	#КонецОбласти
	
	#КонецОбласти //АктуализацияСуммДокументовВВалютахУчета
	
	#Область АктуализацияДвиженийПоФинансовымРегистрам
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АктуализацияДвиженийПоФинансовымРегистрам";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
		"ru = 'Актуализация движений по финансовым регистрам'", КодыЯзыков); // @НСтр-2
	
	РегистрОчереди = Метаданные.РегистрыСведений.Найти("ЗаданияНеоперативногоДопроведенияДокументов");
	Элемент.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(РегистрОчереди.ПолноеИмя());
	Элемент.МаксимальнаяПорция = 100;
	Элемент.НомерОчереди = 1;
	
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Комментарий",
		"ru = 'По документам выполняется синхронизация сумм в учетных регистрах по данным ""Суммы документов в валютах учета""'",
		КодыЯзыков); // @НСтр-2
		
	#Область ЧитаемыеРегистры
	
	Элемент.ЧитаемыеРегистры = ТабличныеЧасти.ЧитаемыеРегистры.Скопировать();
	
	Регистр = Метаданные.РегистрыСведений.Найти("СуммыДокументовВВалютахУчета");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	#КонецОбласти
	
	#Область ИзменяемыеРегистры
	
	Элемент.ИзменяемыеРегистры = ТабличныеЧасти.ИзменяемыеРегистры.Скопировать();
	
	Регистр = Метаданные.РегистрыНакопления.Найти("НДСПредъявленный");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("НДСАвансыВыданные");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("НДСАвансыПолученные");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ПартииНДСКРаспределению");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДвиженияПоНДС");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ПрочиеДоходы");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ПрочиеРасходы");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ПартииПрочихРасходов");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ПрочаяВыручка");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("СебестоимостьТоваров");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ВыручкаИСебестоимостьПродаж");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("Закупки");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ПрочиеАктивыПассивы");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДвиженияКонтрагентДоходыРасходы");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДвиженияКонтрагентКонтрагент");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДвиженияПоПрочимАктивамПассивам");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ТоварыКОформлениюОтчетовКомитенту");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("УслугиКОформлениюОтчетовПринципалу");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	
	//++ Локализация
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ПартииТоваровОрганизаций");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ПартииПроизводственныхЗатрат");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыСведений.Найти("ЖурналУчетаСчетовФактур");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());

	Регистр = Метаданные.РегистрыСведений.Найти("ДанныеОснованийСчетовФактур");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("НДСЗаписиКнигиПродаж");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("НДСЗаписиКнигиПокупок");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	//-- Локализация
	
	
	#КонецОбласти
	
	#КонецОбласти //АктуализацияДвиженийПоФинансовымРегистрам
	
	#Область АктуализацияДвиженияДенежныеСредстваКонтрагентКлиенты
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АктуализацияДвиженияДенежныеСредстваКонтрагентКлиенты";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
		"ru = 'Актуализация движений по регистру ""Движения Денежные средства - Контрагент"" (клиенты)'", КодыЯзыков); // @НСтр-2
	
	РегистрОчереди = Метаданные.РегистрыСведений.Найти("ЗаданияНеоперативногоДопроведенияДокументов");
	Элемент.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(РегистрОчереди.ПолноеИмя());
	Элемент.МаксимальнаяПорция = 100;
	Элемент.НомерОчереди = 1;
	
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Комментарий",
		"ru = 'По документам выполняется формирование движений в регистре ""Движения Денежные средства - Контрагент"" по клиентам'",
		КодыЯзыков); // @НСтр-2
	
	#Область ЧитаемыеРегистры
	
	Элемент.ЧитаемыеРегистры = ТабличныеЧасти.ЧитаемыеРегистры.Скопировать();
	
	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСКлиентамиПоСрокам");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДвиженияДенежныеСредстваКонтрагент");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	#КонецОбласти
	
	#Область ИзменяемыеРегистры
	
	Элемент.ИзменяемыеРегистры = ТабличныеЧасти.ИзменяемыеРегистры.Скопировать();
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДвиженияДенежныеСредстваКонтрагент");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	#КонецОбласти
	
	#КонецОбласти //АктуализацияДвиженияДенежныеСредстваКонтрагентКлиенты
	
	#Область АктуализацияДвиженияДенежныеСредстваКонтрагентПоставщики
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АктуализацияДвиженияДенежныеСредстваКонтрагентПоставщики";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
		"ru = 'Актуализация движений по регистру ""Движения Денежные средства - Контрагент"" (поставщики)'", КодыЯзыков); // @НСтр-2
	
	РегистрОчереди = Метаданные.РегистрыСведений.Найти("ЗаданияНеоперативногоДопроведенияДокументов");
	Элемент.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(РегистрОчереди.ПолноеИмя());
	Элемент.МаксимальнаяПорция = 100;
	Элемент.НомерОчереди = 1;
	
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Комментарий",
		"ru = 'По документам выполняется формирование движений в регистре ""Движения Денежные средства - Контрагент"" по клиентам'",
		КодыЯзыков); // @НСтр-2
	
	#Область ЧитаемыеРегистры
	
	Элемент.ЧитаемыеРегистры = ТабличныеЧасти.ЧитаемыеРегистры.Скопировать();
	
	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСПоставщикамиПоСрокам");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДвиженияДенежныеСредстваКонтрагент");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	#КонецОбласти
	
	#Область ИзменяемыеРегистры
	
	Элемент.ИзменяемыеРегистры = ТабличныеЧасти.ИзменяемыеРегистры.Скопировать();
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДвиженияДенежныеСредстваКонтрагент");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	#КонецОбласти
	
	#КонецОбласти //АктуализацияДвиженияДенежныеСредстваКонтрагентПоставщики
	
	#Область АктуализацияДвиженияКонтрагентКонтрагент
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АктуализацияДвиженияКонтрагентКонтрагент";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
		"ru = 'Актуализация движений по регистру ""Движения Контрагент - Контрагент""'", КодыЯзыков); // @НСтр-2
	
	РегистрОчереди = Метаданные.РегистрыСведений.Найти("ЗаданияНеоперативногоДопроведенияДокументов");
	Элемент.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(РегистрОчереди.ПолноеИмя());
	
	Элемент.МаксимальнаяПорция = 100;
	Элемент.НомерОчереди = 1;
	
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Комментарий",
		"ru = 'По документам выполняется формирование движений в регистре ""Движения Контрагент - Контрагент""'",
		КодыЯзыков); // @НСтр-2
	
	#Область ЧитаемыеРегистры
	
	Элемент.ЧитаемыеРегистры = ТабличныеЧасти.ЧитаемыеРегистры.Скопировать();
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДвиженияКонтрагентКонтрагент");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ПроцентныеРасходыДисконтирования");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСПоставщикамиПоСрокам");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());

	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСКлиентамиПоСрокам");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());

	
	#КонецОбласти
	
	#Область ИзменяемыеРегистры
	
	Элемент.ИзменяемыеРегистры = ТабличныеЧасти.ИзменяемыеРегистры.Скопировать();
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДвиженияКонтрагентКонтрагент");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	#КонецОбласти
	
	#КонецОбласти //АктуализацияДвиженияКонтрагентКонтрагент
	
	#Область ОтражениеДвиженийПоУправленческомуБалансу
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтражениеДвиженийПоУправленческомуБалансу";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
		"ru = 'Отражение движений по управленческому балансу'", КодыЯзыков); // @НСтр-2
	
	РегистрОчереди = Метаданные.РегистрыСведений.Найти("ЗаданияНеоперативногоДопроведенияДокументов");
	Элемент.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(РегистрОчереди.ПолноеИмя());
	Элемент.МаксимальнаяПорция = 100;
	Элемент.НомерОчереди = 1;
	
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Комментарий",
		"ru = 'По документам выполняется формирование движений в регистре ""Активы и пассивы""'", КодыЯзыков); // @НСтр-2
	
	#Область ЧитаемыеРегистры
	
	Элемент.ЧитаемыеРегистры = ТабличныеЧасти.ЧитаемыеРегистры.Скопировать();
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДенежныеСредстваБезналичные");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДенежныеСредстваНаличные");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДенежныеСредстваВКассахККМ");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДенежныеСредстваВПути");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДенежныеСредстваУПодотчетныхЛиц");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());

	
	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСКлиентамиПоСрокам");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());

	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСПоставщиками");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());

	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСКлиентами");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());

	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыСПоставщикамиПоСрокам");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("РасчетыПоФинансовымИнструментам");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());

	Регистр = Метаданные.РегистрыНакопления.Найти("ПодарочныеСертификаты");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());

	Регистр = Метаданные.РегистрыНакопления.Найти("ПереданнаяВозвратнаяТара");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());

	Регистр = Метаданные.РегистрыНакопления.Найти("ПринятаяВозвратнаяТара");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ПрочиеДоходы");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ПрочиеРасходы");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("СебестоимостьТоваров");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ТоварыКОформлениюОтчетовКомитенту");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("УслугиКОформлениюОтчетовПринципалу");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ПроцентныеРасходыДисконтирования");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ОтклоненияВСтоимостиТоваров");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ПрочиеАктивыПассивы");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДвиженияПоАкцизам");
	СтрокаТабличнойЧасти = Элемент.ЧитаемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());

	#КонецОбласти
	
	#Область ИзменяемыеРегистры
	
	Элемент.ИзменяемыеРегистры = ТабличныеЧасти.ИзменяемыеРегистры.Скопировать();
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ПрочиеАктивыПассивы");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	#КонецОбласти
	
	#КонецОбласти //ОтражениеДвиженийПоУправленческомуБалансу
	
	
	
	#Область РасчетСуммАкциза
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОтражениеДвиженийПоАкцизам";
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование",
		"ru = 'Отражение движений по акцизам'", КодыЯзыков); // @НСтр-2
	
	РегистрОчереди = Метаданные.РегистрыСведений.Найти("ЗаданияНеоперативногоДопроведенияДокументов");
	Элемент.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(РегистрОчереди.ПолноеИмя());
	
	Элемент.МаксимальнаяПорция = 100;
	Элемент.НомерОчереди = 1;
	
	МультиязычностьСервер.ЗаполнитьМультиязычныйРеквизит(Элемент, "Комментарий",
		"ru = 'По документам выполняется формирование движений в регистре ""Движения по акцизам""'",
		КодыЯзыков); // @НСтр-2
	
	#Область ИзменяемыеРегистры
	
	Элемент.ИзменяемыеРегистры = ТабличныеЧасти.ИзменяемыеРегистры.Скопировать();
	
	Регистр = Метаданные.РегистрыНакопления.Найти("ДвиженияПоАкцизам");
	СтрокаТабличнойЧасти = Элемент.ИзменяемыеРегистры.Добавить();
	СтрокаТабличнойЧасти.Регистр = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Регистр.ПолноеИмя());
	
	#КонецОбласти
	
	#КонецОбласти //РасчетСуммАкциза
	
	
КонецПроцедуры

// Вызывается при начальном заполнении создаваемого элемента.
//
// Параметры:
//  Объект                  - СправочникОбъект.НастройкиХозяйственныхОпераций - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения.
//  ДополнительныеПараметры - Структура - Дополнительные параметры.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	Возврат;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// Возвращает реквизиты справочника, которые образуют естественный ключ для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - имена реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("ИмяПредопределенныхДанных");
	
	Возврат Результат;
	
КонецФункции

// Конец ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.БазоваяФункциональность
	МультиязычностьСервер.ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка, Метаданные.Справочники.ВидыНеоперативныхЗаданий);
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
	
КонецПроцедуры

#КонецЕсли

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.БазоваяФункциональность
	МультиязычностьКлиентСервер.ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка);
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.БазоваяФункциональность
	МультиязычностьКлиентСервер.ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка);
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "Справочники.ВидыНеоперативныхЗаданий.ЗаполнитьПредопределенныеНастройкиВидовНеоперативныхЗаданий";
	Обработчик.Версия = "*";
	Обработчик.РежимВыполнения = "Оперативно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("cd45555d-f1f6-4a32-a02a-c00bf89351c1");
	Обработчик.Комментарий = НСтр("ru = 'Обновляет реквизиты предопределенных элементов справочника  ""Виды неоперативных заданий""'");
	Обработчик.ОбщиеДанные = Истина;
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.Справочники.ВидыНеоперативныхЗаданий.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
КонецПроцедуры

Процедура ЗаполнитьПредопределенныеНастройкиВидовНеоперативныхЗаданий(Параметры = Неопределено) Экспорт
	
	// 1. Удаление элементов справочника, не являющихся предопределенными.
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВидыНеоперативныхЗаданий.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыНеоперативныхЗаданий КАК ВидыНеоперативныхЗаданий
	|ГДЕ
	|	НЕ ВидыНеоперативныхЗаданий.Предопределенный";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВидНеоперативныхЗаданийОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ВидНеоперативныхЗаданийОбъект.ОбменДанными.Загрузка = Истина;
		ВидНеоперативныхЗаданийОбъект.Удалить();
	КонецЦикла;
	
	// 2. Обработка предопределенных видов неоперативных заданий.
	МетаданныеОбъекта = Метаданные.Справочники.ВидыНеоперативныхЗаданий;
	НастройкиОбновления = МультиязычностьСервер.НастройкиОбновлениеПредопределенныхДанных(МетаданныеОбъекта);
	
	ТабличныеЧасти = Новый Массив;
	ТабличныеЧасти.Добавить("ЧитаемыеРегистры");
	ТабличныеЧасти.Добавить("ИзменяемыеРегистры");
	
	Для Каждого ДанныеЭлемента Из НастройкиОбновления.ПредопределенныеДанные Цикл
		
		ЭлементСсылка = Справочники.ВидыНеоперативныхЗаданий[ДанныеЭлемента.ИмяПредопределенныхДанных];
		ЭлементОбъект = ЭлементСсылка.ПолучитьОбъект();
		
		ЗаполнитьЗначенияСвойств(ЭлементОбъект, ДанныеЭлемента, ,
			"Ссылка, ПометкаУдаления, МаксимальнаяПорция, НомерОчереди");
		
		Если Не ЗначениеЗаполнено(ЭлементОбъект.МаксимальнаяПорция) Тогда
			ЭлементОбъект.МаксимальнаяПорция = ДанныеЭлемента.МаксимальнаяПорция;
		КонецЕсли;
		
		Для Каждого ИмяТабличнойЧасти Из ТабличныеЧасти Цикл
			ЭлементОбъект[ИмяТабличнойЧасти].Загрузить(ДанныеЭлемента[ИмяТабличнойЧасти]);
		КонецЦикла;
		
		Если ОбщегоНазначения.РазделениеВключено() Тогда
			
			Для Каждого ЛокализуемыйРеквизитОбъекта Из НастройкиОбновления.ЛокализуемыеРеквизитыОбъекта Цикл
				Имя = ЛокализуемыйРеквизитОбъекта.Ключ;
				ЭлементОбъект[Имя] = ДанныеЭлемента[Имя + "_" + НастройкиОбновления.ОсновнойЯзык];

				СведенияОбЯзыках = МультиязычностьСервер.СведенияОЯзыках();
				Для Каждого ЯзыкИспользуется Из СведенияОбЯзыках.Используется Цикл
					Если ЯзыкИспользуется.Значение Тогда
						КодЯзыка = СведенияОбЯзыках[ЯзыкИспользуется.Ключ];
						ЭлементОбъект[Имя + ЯзыкИспользуется.Ключ] = ДанныеЭлемента[Имя + "_" + КодЯзыка];
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
		
		ЭлементОбъект.ОбменДанными.Загрузка = Истина;
		ЭлементОбъект.Записать();
		
	КонецЦикла;
	
	ЗаполнитьНомерОчередиВидовНеоперативныхЗаданий();

КонецПроцедуры

Процедура ЗаполнитьНомерОчередиВидовНеоперативныхЗаданий()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЧитаемыеРегистры.Ссылка КАК ВидЗадания,
	|	ЧитаемыеРегистры.Регистр КАК РегистрЧтение
	|ПОМЕСТИТЬ ВТ_РегистрыЧтение
	|ИЗ
	|	Справочник.ВидыНеоперативныхЗаданий.ЧитаемыеРегистры КАК ЧитаемыеРегистры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНеоперативныхЗаданий.ИзменяемыеРегистры КАК ИзменяемыеРегистры
	|		ПО ЧитаемыеРегистры.Ссылка = ИзменяемыеРегистры.Ссылка
	|		И ИзменяемыеРегистры.Регистр = ЧитаемыеРегистры.Регистр
	|ГДЕ
	|	ИзменяемыеРегистры.Ссылка ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистрЧтение,
	|	ВидЗадания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВидыНеоперативныхЗаданийИзменяемыеРегистры.Ссылка КАК ВидЗадания,
	|	ВидыНеоперативныхЗаданийИзменяемыеРегистры.Регистр КАК РегистрЗапись
	|ПОМЕСТИТЬ ВТ_РегистрыЗапись
	|ИЗ
	|	Справочник.ВидыНеоперативныхЗаданий.ИзменяемыеРегистры КАК ВидыНеоперативныхЗаданийИзменяемыеРегистры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистрЗапись,
	|	ВидЗадания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РегистрыЧтение.РегистрЧтение КАК РегистрЧтениеЗависит,
	|	ВТ_РегистрыЧтение.ВидЗадания КАК ВидЗаданияЧтение,
	|	ВТ_РегистрыЗапись.ВидЗадания КАК ВидЗаданияЗапись
	|ПОМЕСТИТЬ ВТ_ЗависимостьРегистров
	|ИЗ
	|	ВТ_РегистрыЧтение КАК ВТ_РегистрыЧтение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_РегистрыЗапись КАК ВТ_РегистрыЗапись
	|		ПО ВТ_РегистрыЧтение.РегистрЧтение = ВТ_РегистрыЗапись.РегистрЗапись
	|		И ВТ_РегистрыЗапись.ВидЗадания <> ВТ_РегистрыЧтение.ВидЗадания
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидЗаданияЧтение,
	|	ВидЗаданияЗапись
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ЗависимостьРегистров.ВидЗаданияЧтение КАК ВидЗаданияЧтение,
	|	ВТ_ЗависимостьРегистров.ВидЗаданияЗапись КАК ВидЗаданияЗапись
	|ПОМЕСТИТЬ ВТ_ЗависимостьВидовЗаданий
	|ИЗ
	|	ВТ_ЗависимостьРегистров КАК ВТ_ЗависимостьРегистров
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВидЗаданияЧтение,
	|	ВидЗаданияЗапись
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗависимостьЧтениеЗапись.ВидЗаданияЧтение.Наименование КАК ВидЗаданияЧтение,
	|	ЗависимостьЧтениеЗапись.ВидЗаданияЗапись.Наименование КАК ВидЗаданияЗапись,
	|	ЗависимостьЗаписьЧтение.ВидЗаданияЧтение КАК Конфликт
	|ИЗ
	|	ВТ_ЗависимостьВидовЗаданий КАК ЗависимостьЗаписьЧтение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗависимостьВидовЗаданий КАК ЗависимостьЧтениеЗапись
	|		ПО ЗависимостьЧтениеЗапись.ВидЗаданияЗапись = ЗависимостьЗаписьЧтение.ВидЗаданияЧтение
	|		И ЗависимостьЧтениеЗапись.ВидЗаданияЧтение = ЗависимостьЗаписьЧтение.ВидЗаданияЗапись
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗависимостьВидовЗаданий.ВидЗаданияЧтение КАК ВидЗаданияЧтение,
	|	ВТ_ЗависимостьВидовЗаданий.ВидЗаданияЗапись КАК ВидЗаданияЗапись
	|ИЗ
	|	ВТ_ЗависимостьВидовЗаданий КАК ВТ_ЗависимостьВидовЗаданий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыНеоперативныхЗаданий.Ссылка КАК Ссылка,
	|	ВидыНеоперативныхЗаданий.НомерОчереди КАК НомерОчереди
	|ИЗ
	|	Справочник.ВидыНеоперативныхЗаданий КАК ВидыНеоперативныхЗаданий
	|ГДЕ
	|	НЕ ВидыНеоперативныхЗаданий.Ссылка В (&ИсключаемыеВидыЗаданий)";
	
	// Исключаемые виды заданий указаны в справочнике справочно.
	// В механизме неоперативной очереди по ним не должны регистрироваться и обрабатываться задания.
	ИсключаемыеВидыЗаданий = Новый Массив;
	
	
	
	Запрос.УстановитьПараметр("ИсключаемыеВидыЗаданий", ИсключаемыеВидыЗаданий);
	
	ПакетыЗапросов = Запрос.ВыполнитьПакет();
	
	ЦиклическаяЗависимость = ПакетыЗапросов[4].Выгрузить();
	
	Если ЦиклическаяЗависимость.Количество() > 0 Тогда
		
		СписокОписаний = Новый Массив;
		СписокОписаний.Добавить(НСтр("ru = 'При определении номера очереди видов заданий обнаружены циклические зависимости:'"));
		
		Для каждого Зависимость Из ЦиклическаяЗависимость Цикл
			
			СписокОписаний.Добавить(СтрШаблон(НСтр("ru = '- вид задания ""%1"" зависит от ""%2""'"),
				Зависимость.ВидЗаданияЧтение, Зависимость.ВидЗаданияЗапись));
			
		КонецЦикла;
		
		ТекстИсключения = СтрСоединить(СписокОписаний, Символы.ПС);
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
	ЗависимостьВидовЗаданий = ПакетыЗапросов[5].Выгрузить();
	ЗависимостьВидовЗаданий.Индексы.Добавить("ВидЗаданияЧтение");

	СписокВидовЗаданий = ПакетыЗапросов[6].Выгрузить();
	
	ПорядокЗаданийОчереди = Новый Соответствие;
	
	// Первоначальное заполнение номеров очереди для последующего расчета
	Для каждого ВидЗадания Из СписокВидовЗаданий Цикл
		ПорядокЗаданийОчереди.Вставить(ВидЗадания.Ссылка, 1);
	КонецЦикла;
	
	// Определение номера очереди с учетом зависимости видов заданий
	Для каждого ВидЗадания Из СписокВидовЗаданий Цикл
		ОпределитьНомерЗаданияПоЗависимости(ВидЗадания.Ссылка, ЗависимостьВидовЗаданий, 0, ПорядокЗаданийОчереди);
	КонецЦикла;
	
	НомерОчередиОтраженияДокументов = 0;
	Для каждого ВидЗадания Из СписокВидовЗаданий Цикл
		НомерОчереди = ПорядокЗаданийОчереди.Получить(ВидЗадания.Ссылка);
		НомерОчередиОтраженияДокументов = Макс(НомерОчередиОтраженияДокументов, НомерОчереди);
		Если Не НомерОчереди = ВидЗадания.НомерОчереди Тогда
			ВидЗаданияОбъект = ВидЗадания.Ссылка.ПолучитьОбъект();
			ВидЗаданияОбъект.НомерОчереди = НомерОчереди;
			ВидЗаданияОбъект.ОбменДанными.Загрузка = Истина;
			ВидЗаданияОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ОпределитьНомерЗаданияПоЗависимости(ВидЗадания, ЗависимостьВидовЗаданий, НомерЗадания, ПорядокЗаданийОчереди) 
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ВидЗаданияЧтение", ВидЗадания);
	
	НайденнаяЗависимость = ЗависимостьВидовЗаданий.НайтиСтроки(СтруктураОтбора);
	Если НайденнаяЗависимость.Количество() > 0 Тогда
		
		Для каждого ТекЗависимость Из НайденнаяЗависимость Цикл
			
			НомерЗадания = ПорядокЗаданийОчереди.Получить(ТекЗависимость.ВидЗаданияЗапись);
			ОпределитьНомерЗаданияПоЗависимости(ТекЗависимость.ВидЗаданияЗапись, ЗависимостьВидовЗаданий, НомерЗадания, ПорядокЗаданийОчереди);
			ПорядокЗаданийОчереди.Вставить(ТекЗависимость.ВидЗаданияЗапись, НомерЗадания);
			НомерЗадания = НомерЗадания + 1;
			
			Если ПорядокЗаданийОчереди.Получить(ВидЗадания) < НомерЗадания Тогда
				ПорядокЗаданийОчереди.Вставить(ВидЗадания, НомерЗадания);
			КонецЕсли;
			
		КонецЦикла;
			
	Иначе
		
		НомерЗадания = 1;
		ПорядокЗаданийОчереди.Вставить(ВидЗадания, НомерЗадания); 
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#КонецОбласти

#КонецЕсли

