#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
		ЕстьАктуальныеНастройки  = ЕстьАктуальныеНастройкиЯндексМаркетФулфилмент();
		
		Если ЕстьАктуальныеНастройки Тогда
			
			ОткрытьФорму(
			"Обработка.ЯндексМаркетВитринаФулфилмент.Форма.ВыгрузкаТоварногоКаталога",
			,,Истина);
			
		Иначе
			
			ОткрытьФорму(
			"Обработка.ЯндексМаркетВитринаФулфилмент.Форма.ПодключениеКСервису",
			,,Истина);
				
		КонецЕсли;


КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Функция ЕстьАктуальныеНастройкиЯндексМаркетФулфилмент()
	
	ЕстьАктуальныеНастройки = Ложь;
	
	Организация = ИнтеграцияСЯндексМаркетСервер.ТекущиеДанныеАвторизацииОрганизация();
	
	Если Организация <> Неопределено И ТипЗнч(Организация) = Тип("СправочникСсылка.Организации") Тогда
		ДанныеАвторизации = ИнтеграцияСЯндексМаркетСервер.ТекущиеДанныеАвторизации(Организация);
		Если ДанныеАвторизации.Свойство("access_token") 
			И ДанныеАвторизации.Свойство("access_token_expires")
			И ДанныеАвторизации.Свойство("refresh_token") Тогда
			
				ЕстьАктуальныеНастройки = Истина;
				
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЕстьАктуальныеНастройки;
	
КонецФункции

#КонецОбласти
