
&После("ПодготовитьНаборыЗаписейКРегистрацииДвижений")
Процедура асп_ПодготовитьНаборыЗаписейКРегистрацииДвижений(Объект, ЭтоНовый = Ложь, ДвиженияМетаданные = НеОпределено, ОтключитьПроверкуДатыЗапретаИзменения = Ложь) Экспорт
	
	//+++ {{ ASP 25.03.2021 000010119 }}
	ЭтоНовыйДокумент = Неопределено;
	
	Если НЕ Объект.ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовыйДокумент) Тогда
		ЭтоНовыйДокумент = ЭтоНовый;
	КонецЕсли;
	
	Если НЕ ЭтоНовыйДокумент Тогда
		ТипДокумента = ТипЗнч(Объект.Ссылка);
		
		Если ТипДокумента = Тип("ДокументСсылка.ЗаказКлиента") Тогда
			ЗапросЗаписей = Новый Запрос;
			ЗапросЗаписей.Текст =
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	ИСТИНА КАК Поле1
				|ИЗ
				|	РегистрСведений.ASP_Битрикс24ДанныеОСебестоимостиЗаказКлиента КАК ASP_Битрикс24ДанныеОСебестоимостиЗаказКлиента
				|ГДЕ
				|	ASP_Битрикс24ДанныеОСебестоимостиЗаказКлиента.Регистратор = &СсылкаНаРегистратор";
			ЗапросЗаписей.УстановитьПараметр("СсылкаНаРегистратор", Объект.Ссылка);
			Если Не ЗапросЗаписей.Выполнить().Пустой() Тогда
				Объект.Движения.ASP_Битрикс24ДанныеОСебестоимостиЗаказКлиента.Записывать = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//--- {{ ASP 25.03.2021 000010119 }}
	
КонецПроцедуры