///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
		
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
    //ASP__A.Zhel 28.03.2019 
	//Если ПараметрыСеанса.РабочееМестоКлиента = Справочники.РабочиеМеста.НайтиПоКоду("594E1D3A-F527-40AF-932F-47C0A4D97761") Тогда
	//	РабочееМесто = Справочники.РабочиеМеста.НайтиПоКоду("ACB4DE4D-8C2F-4370-8318-9AFE3EA9562F");
	//	МенеджерОборудованияВызовСервера.УстановитьРабочееМестоКлиента(РабочееМесто);
	//КонецЕсли;
	//__APS
	#Если НЕ МобильныйКлиент И НЕ МобильноеПриложениеКлиент И НЕ МобильныйАвтономныйСервер Тогда
	//ГТС 29.06.2021
	Попытка
		Если ПараметрыСеанса.РабочееМестоКлиента = Справочники.РабочиеМеста.НайтиПоКоду("3CFE6A76-5767-449E-9200-1448838A55F8") Тогда		
			РабочееМесто = Справочники.РабочиеМеста.НайтиПоКоду("543340DB-989B-4AA0-AFB5-9FA6AE9F942D");
			МенеджерОборудованияВызовСервера.УстановитьРабочееМестоКлиента(РабочееМесто);
		КонецЕсли; 
	Исключение
	КонецПопытки;
	#КонецЕсли
КонецПроцедуры

#КонецОбласти

#КонецЕсли