#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "БланкЗаказа") Тогда
		//++ ASP_Спиряева 000026255 27.02.2025 Изменила вывод для печати табличного док. вместо одной, если есть 2 форма,
		// то выведетя в текущий табличный док. 000026255
		
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		//КоллекцияПечатныхФорм,
		//"БланкЗаказа",
		//"Бланк заказа",
		//ПечатьБланкаДоставки(МассивОбъектов, ОбъектыПечати)
		//); 
				
		// Формируем первую печатную форму (БланкЗаказа) 000026255
		ИтоговыйТабДокумент = ПечатьБланкаДоставки(МассивОбъектов, ОбъектыПечати);
		
		// Проверяем, есть ли объекты для второй формы 000026255
		МассивОбъектов = ПроверитьДокументыОтгрузкаБезДокументов(МассивОбъектов);
	
		Если ЗначениеЗаполнено(МассивОбъектов) Тогда
			// Формируем вторую печатную форму (Отгрузка без документов) 000026255
			ПФ_Отгрузка = ПечатьБланкаДоставкиОтгрузкаБезДокументов(МассивОбъектов, ОбъектыПечати);
			
			//Чтобы последний док БланкЗаказа не был с док отгрузкой на одной странице 000026255
			ИтоговыйТабДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 

			// Добавляем вторую форму в итоговый документ 000026255
			ИтоговыйТабДокумент.Вывести(ПФ_Отгрузка);
			
		КонецЕсли;
		
		// Выводим общий табличный документ в коллекцию печатных форм 000026255
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		"БланкЗаказа",
		"Бланк заказа",
		ИтоговыйТабДокумент);

		//-- ASP_Спиряева 000026255 27.02.2025 
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьБланкаДоставки(МассивОбъектов, ОбъектыПечати) Экспорт
	ТабличныйДокумент= Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_БЛАЕНКЗАКАЗА";
	Макет=Документы.ЗаявкаНаТранспорт.ПолучитьМакет("БланкЗаказа");
	
	ЗапросДанныхПечатнойФормы = Новый Запрос;
	ЗапросДанныхПечатнойФормы.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаТранспорт.ДокументОснование.Номер КАК НомерЗаказаКлиента,
	|	ЗаявкаНаТранспорт.ДокументОснование.Контрагент.НаименованиеПолное КАК Контрагент,
	|	ЗаявкаНаТранспорт.ДокументОснование.Контрагент.ИНН КАК ИНН,
	|	ЕСТЬNULL(ЗаявкаНаТранспорт.ДокументОснование.ОтгрузкаБезДокументов, ЛОЖЬ) КАК ОтгрузкаБезДокументов,
	|	ЗаявкаНаТранспорт.АдресДоставки КАК АдресДоставки,
	|	ЗаявкаНаТранспорт.ТелефонКлиента КАК ТелефонКлиента,
	|	ЗаявкаНаТранспорт.Комментарий КАК Комментарий,
	|	ЗаявкаНаТранспорт.Город КАК Город,
	|	ЗаявкаНаТранспорт.Товары.(
	|		МИНИМУМ(НомерСтроки) КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Номенклатура.Артикул КАК Артикул,
	|		СУММА(Количество) КАК Количество,
	|		МИНИМУМ(ВЫБОР
	|				КОГДА ЗаявкаНаТранспорт.Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					ТОГДА ЗаявкаНаТранспорт.Товары.Номенклатура.ЕдиницаИзмерения
	|				ИНАЧЕ ЗаявкаНаТранспорт.Товары.Упаковка
	|			КОНЕЦ) КАК Упаковка
	|	) КАК Товары,
	|	ЗаявкаНаТранспорт.ОплатаНаличными КАК ОплатаНаличными,
	|	ЗаявкаНаТранспорт.СуммаПолучаемыхНаличных КАК СуммаПолучаемыхНаличных,
	|	ЗаявкаНаТранспорт.Водитель КАК Водитель,
	|	ЗаявкаНаТранспорт.Менеджер КАК Менеджер,
	|	ЗаявкаНаТранспорт.ОплатаКартойДистанционная КАК ОплатаКартойДистанционная,
	|	ЗаявкаНаТранспорт.ПолучательФИО КАК ПолучательФИО,
	|	ЗаявкаНаТранспорт.КомментарийСклад КАК КомментарийСклад
	|ИЗ
	|	Документ.ЗаявкаНаТранспорт КАК ЗаявкаНаТранспорт
	|ГДЕ
	|	ЗаявкаНаТранспорт.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаТранспорт.Товары.(Номенклатура.Артикул,
	|	Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Водитель";
	
	ЗапросДанныхПечатнойФормы.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	ВыборкаЗапросаДанныхПечатнойФормы=ЗапросДанныхПечатнойФормы.Выполнить().Выбрать();
	
	Пока ВыборкаЗапросаДанныхПечатнойФормы.Следующий() Цикл
		//++ ASP_Спиряева 20.02.2025 000026255 
		Если ВыборкаЗапросаДанныхПечатнойФормы.ОтгрузкаБезДокументов И ЗначениеЗаполнено(ВыборкаЗапросаДанныхПечатнойФормы.КомментарийСклад) Тогда
			ОбластьШапка=Макет.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(ОбластьШапка);
		КонецЕсли;
        //-- ASP_Спиряева 20.02.2025 000026255

		ОбластьСтраницы=Макет.ПолучитьОбласть("ОбластьСтраницы");
	

		ОбластьСтраницы.Параметры.Заполнить(ВыборкаЗапросаДанныхПечатнойФормы);
		
		ОбластьСтраницы.Параметры.НомерЗаказаКлиента=	 ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаЗапросаДанныхПечатнойФормы.НомерЗаказаКлиента, Ложь, Истина);
		
		
		попытка
		КонтактыМенеджера = ", "+строка(УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ВыборкаЗапросаДанныхПечатнойФормы.Менеджер, Справочники.ВидыКонтактнойИнформации.ТелефонПользователя)); 
		исключение
		КонтактыМенеджера = "";
		конецпопытки;
		ОбластьСтраницы.Параметры.Менеджер=строка(ВыборкаЗапросаДанныхПечатнойФормы.Менеджер)+КонтактыМенеджера; 

		ТабличныйДокумент.Вывести(ОбластьСтраницы);
		
		ВыборкаТоваров=ВыборкаЗапросаДанныхПечатнойФормы.Товары.Выбрать();
		НомерСтроки=1;
		Пока ВыборкаТоваров.Следующий() Цикл
			ОбластьСтрока=Макет.ПолучитьОбласть("ОбластьСтрока");
			ОбластьСтрока.Параметры.Заполнить(ВыборкаТоваров);
			ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
			НомерСтроки=НомерСтроки+1;
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			   	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	ВариантыКомплектацииНоменклатурыТовары.Количество КАК Количество,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура.ЕдиницаИзмерения КАК Упаковка,
		|	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|ГДЕ
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Основной = &Основной
		|	И ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец = &Владелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("Владелец", ВыборкаТоваров.Номенклатура);
	Запрос.УстановитьПараметр("Основной", Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Индекс = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если Индекс = 0 Тогда
				ОбластьПредСтроки = Макет.ПолучитьОбласть("ОбластьПредСтрока");
				ТабличныйДокумент.Вывести(ОбластьПредСтроки);	
			КонецЕсли;
			Индекс = Индекс + 1;
		  	ОбластьПодСтроки=Макет.ПолучитьОбласть("ОбластьПодСтроки");
			ОбластьПодСтроки.Параметры.НомерСтроки = Индекс;
			ОбластьПодСтроки.Параметры.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			ОбластьПодСтроки.Параметры.Количество = ВыборкаДетальныеЗаписи.Количество*ВыборкаТоваров.Количество;
			ОбластьПодСтроки.Параметры.Упаковка = ВыборкаДетальныеЗаписи.Упаковка;
			//ОбластьПодСтроки.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабличныйДокумент.Вывести(ОбластьПодСтроки);
	КонецЦикла;
			
	КонецЦикла;

	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб=Истина;
	//ASP_Dante 09/09/19 была ошибка печати	
	//ASP__A.Zhel 25.12.2018
	//Если ТипЗнч(МассивОбъектов) = Тип("Массив") Тогда
		Для каждого Ссылка Из МассивОбъектов Цикл
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 1, ОбъектыПечати, Ссылка);//ASP_Dante 09/09/19"Документ_" + Формат(ОбъектыПечати.Количество() + 1, "ЧН=; ЧГ="));
		КонецЦикла;	
	//Иначе
		//ОбъектыПечати.Добавить(Ссылка, "ОбластьСтраницы");//ASP_Dante 09/09/19"Документ_" + Формат(ОбъектыПечати.Количество() + 1, "ЧН=; ЧГ="));
	//КонецЕсли;
	//__ASP
	//ASP_Dante 09/09/19	
	Возврат ТабличныйДокумент;
	
	
КонецФункции
Функция ПечатьБланкаДоставкиОтгрузкаБезДокументов(МассивОбъектов, ОбъектыПечати) Экспорт
	//++ ASP_Спиряева 000026255 24.02.2025 основной код по заполнению скопирован из Функции ПечатьБланкаДоставки
	ТабличныйДокумент= Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_БЛАЕНКЗАКАЗА";
	Макет=Документы.ЗаявкаНаТранспорт.ПолучитьМакет("БланкЗаказаОтгрузкаБезДокументов");
	
	ЗапросДанныхПечатнойФормы = Новый Запрос;
	ЗапросДанныхПечатнойФормы.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаТранспорт.ДокументОснование.Номер КАК НомерЗаказаКлиента,
	|	ЗаявкаНаТранспорт.ДокументОснование.Контрагент.НаименованиеПолное КАК Контрагент,
	|	ЗаявкаНаТранспорт.ДокументОснование.Контрагент.ИНН КАК ИНН,
	|	ЗаявкаНаТранспорт.ДокументОснование.ОтгрузкаБезДокументов КАК ОтгрузкаБезДокументов,
	|	ЗаявкаНаТранспорт.АдресДоставки КАК АдресДоставки,
	|	ЗаявкаНаТранспорт.ТелефонКлиента КАК ТелефонКлиента,
	|	ЗаявкаНаТранспорт.Комментарий КАК Комментарий,
	|	ЗаявкаНаТранспорт.Город КАК Город,
	|	ЗаявкаНаТранспорт.Товары.(
	|		МИНИМУМ(НомерСтроки) КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Номенклатура.Артикул КАК Артикул,
	|		СУММА(Количество) КАК Количество,
	|		МИНИМУМ(ВЫБОР
	|				КОГДА ЗаявкаНаТранспорт.Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					ТОГДА ЗаявкаНаТранспорт.Товары.Номенклатура.ЕдиницаИзмерения
	|				ИНАЧЕ ЗаявкаНаТранспорт.Товары.Упаковка
	|			КОНЕЦ) КАК Упаковка
	|	) КАК Товары,
	|	ЗаявкаНаТранспорт.ОплатаНаличными КАК ОплатаНаличными,
	|	ЗаявкаНаТранспорт.СуммаПолучаемыхНаличных КАК СуммаПолучаемыхНаличных,
	|	ЗаявкаНаТранспорт.Водитель КАК Водитель,
	|	ЗаявкаНаТранспорт.Менеджер КАК Менеджер,
	|	ЗаявкаНаТранспорт.ОплатаКартойДистанционная КАК ОплатаКартойДистанционная,
	|	ЗаявкаНаТранспорт.ПолучательФИО КАК ПолучательФИО,
	|	ЗаявкаНаТранспорт.КомментарийСклад КАК КомментарийСклад
	|ИЗ
	|	Документ.ЗаявкаНаТранспорт КАК ЗаявкаНаТранспорт
	|ГДЕ
	|	ЗаявкаНаТранспорт.Ссылка В(&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаТранспорт.Товары.(Номенклатура.Артикул,
	|	Номенклатура)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Водитель";
	
	ЗапросДанныхПечатнойФормы.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	ВыборкаЗапросаДанныхПечатнойФормы=ЗапросДанныхПечатнойФормы.Выполнить().Выбрать();
	
	Пока ВыборкаЗапросаДанныхПечатнойФормы.Следующий() Цикл
		
		ОбластьСтраницы=Макет.ПолучитьОбласть("ОбластьСтраницы");
		
		
		ОбластьСтраницы.Параметры.Заполнить(ВыборкаЗапросаДанныхПечатнойФормы);
		
		ОбластьСтраницы.Параметры.НомерЗаказаКлиента=	 ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ВыборкаЗапросаДанныхПечатнойФормы.НомерЗаказаКлиента, Ложь, Истина);
		
		ТабличныйДокумент.Вывести(ОбластьСтраницы);
		
		ВыборкаТоваров=ВыборкаЗапросаДанныхПечатнойФормы.Товары.Выбрать();
		НомерСтроки=1;  
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
	КонецЦикла;                  
	
	ТабличныйДокумент.АвтоМасштаб=Истина;
	//ASP_Dante 09/09/19 была ошибка печати	
	//ASP__A.Zhel 25.12.2018
	//Если ТипЗнч(МассивОбъектов) = Тип("Массив") Тогда
	Для каждого Ссылка Из МассивОбъектов Цикл
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 1, ОбъектыПечати, Ссылка);//ASP_Dante 09/09/19"Документ_" + Формат(ОбъектыПечати.Количество() + 1, "ЧН=; ЧГ="));
	КонецЦикла;	
	//Иначе
	//ОбъектыПечати.Добавить(Ссылка, "ОбластьСтраницы");//ASP_Dante 09/09/19"Документ_" + Формат(ОбъектыПечати.Количество() + 1, "ЧН=; ЧГ="));
	//КонецЕсли;
	//__ASP
	//ASP_Dante 09/09/19	
	Возврат ТабличныйДокумент;
	//-- ASP_Спиряева 000026255 24.02.2025	
КонецФункции

Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры
Функция ПроверитьДокументыОтгрузкаБезДокументов(ОбъектПараметры) Экспорт
	//++ ASP_Спиряева 000026255 24.02.2025 
	МассивОбъектовОтгрузкаБезДокументов = Новый Массив;
	Для Каждого СтрокаОбъекта Из ОбъектПараметры Цикл  
		Если ТипЗнч(СтрокаОбъекта.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента")  И СтрокаОбъекта.ДокументОснование.ОтгрузкаБезДокументов Тогда
			МассивОбъектовОтгрузкаБезДокументов.Добавить(СтрокаОбъекта);
		КонецЕсли;
	КонецЦикла; 
	Возврат МассивОбъектовОтгрузкаБезДокументов; 
	//-- ASP_Спиряева 000026255 24.02.2025
КонецФункции


#КонецЕсли
