

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		Если НЕ ДанныеЗаполнения.Проведен Тогда
			Сообщить("Заказ: " + ДанныеЗаполнения + " должен быть проведен!");
			Возврат;
		КонецЕсли;
		ДокументОснование = ДанныеЗаполнения;

		ЗапросУслуга = Новый Запрос;
		ЗапросУслуга.Текст =
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ЗаказКлиентаТовары.Сумма, 0)) КАК Сумма
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|ГДЕ
		|	ЗаказКлиентаТовары.Ссылка = &Основание
		|	И ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|	И (ЗаказКлиентаТовары.Номенклатура.Наименование ПОДОБНО ""%доставка%"" ИЛИ ЗаказКлиентаТовары.Номенклатура.Наименование ПОДОБНО ""%ДОСТАВКА%""
		|	ИЛИ ЗаказКлиентаТовары.Номенклатура.Наименование ПОДОБНО ""%Доставка%"")
		|	И (НЕ(ЗаказКлиентаТовары.Отменено))";
		ЗапросУслуга.УстановитьПараметр("Основание", ДанныеЗаполнения);
		Результат = ЗапросУслуга.Выполнить();
		Если Результат.Пустой() Тогда
			Сообщить("В заказе: " + ДанныеЗаполнения + " не найдено услуг с наименованием 'доставка'!");
			//Возврат;
		Иначе
			Выборка = Результат.Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.Сумма = 0 ИЛИ Выборка.Сумма = Null Тогда
					Сообщить("В заказе: " + ДанныеЗаполнения + " не найдено услуг с наименованием 'доставка'!");
				//	Возврат;
				Иначе	
					Сумма=Выборка.Сумма;					
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	СУММА(ЕСТЬNULL(ЗаявкаНаТранспорт.Сумма, 0)) КАК Сумма
						|ИЗ
						|	Документ.ЗаявкаНаТранспорт КАК ЗаявкаНаТранспорт
						|ГДЕ
						|	ЗаявкаНаТранспорт.ДокументОснование = &ДокументОснование
						|	И ЗаявкаНаТранспорт.ПометкаУдаления = ЛОЖЬ
						|
						|СГРУППИРОВАТЬ ПО
						|	ЗаявкаНаТранспорт.ДокументОснование";
					
					Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						    Сумма = Выборка.Сумма-ВыборкаДетальныеЗаписи.Сумма;
							сообщить("По данному заказу было уже заказано транспорта на " + строка(ВыборкаДетальныеЗаписи.Сумма)+ ", сумма за доставку уменьшена");
					КонецЦикла;
					
					Если Выборка.Сумма>0 Тогда
					ВариантЗаЧейСчетДоставка=Перечисления.ВариантыЗаЧейСчетДоставка.ЗаСчетКлиента;
					//Сумма=Выборка.Сумма;
					КонецЕсли;
				КонецЕсли;	
			Иначе
				Сообщить("В заказе: " + ДанныеЗаполнения + " не найдено услуг с наименованием 'доставка'!");
				//Возврат;
			КонецЕсли;	
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиентаТовары.Ссылка КАК Ссылка,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ЗаказКлиентаТовары.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ЗаказКлиентаТовары.Номенклатура.ВесЗнаменатель = 0
		|			ТОГДА ЗаказКлиентаТовары.Номенклатура.ВесЧислитель / 1
		|		ИНАЧЕ ЗаказКлиентаТовары.Номенклатура.ВесЧислитель / ЕСТЬNULL(ЗаказКлиентаТовары.Номенклатура.ВесЗнаменатель, 1)
		|	КОНЕЦ КАК Вес,
		|	ЗаказКлиентаТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЗаказКлиентаТовары.Упаковка КАК Упаковка,
		|	Номенклатура1.ОбъемЧислитель КАК ОбъемЧислитель,
		|	Номенклатура1.ОбъемЗнаменатель КАК ОбъемЗнаменатель
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура1
		|		ПО ЗаказКлиентаТовары.Номенклатура = Номенклатура1.Ссылка
		|ГДЕ
		|	ЗаказКлиентаТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И НЕ ЗаказКлиентаТовары.Отменено
		|	И ЗаказКлиентаТовары.Ссылка = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Сообщить("В заказе: " + ДанныеЗаполнения + " нет товаров!");
			Возврат;
		КонецЕсли;	
		
		
		Менеджер = ДокументОснование.Менеджер;
		Подразделение = ДокументОснование.Подразделение;
		ПланируемаяДатаДоставки = ДокументОснование.ЖелаемаяДатаОтгрузки;
		АдресДоставки = ДокументОснование.АдресДоставки;
		Склад = ДокументОснование.Склад;
		//Меняем склад для Сервиса ГТС Подольск
		Если Склад=Справочники.Склады.НайтиПоНаименованию("Склад Сервиса - Подольск",Истина) 
			Тогда Склад=Справочники.Склады.НайтиПоНаименованию("Склад Подольск",Истина)
			Иначе
		КонецЕсли;
		Контрагент = ДокументОснование.Контрагент;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
			СтрокаТЧ.Вес=Выборка.Вес*Выборка.Количество;
			СтрокаТЧ.Объем=(Выборка.ОбъемЧислитель/?(НЕ ЗначениеЗаполнено(Выборка.ОбъемЗнаменатель),1,Выборка.ОбъемЗнаменатель)) * Выборка.КоличествоУпаковок;
			
				Запрос1 = Новый Запрос;
						Запрос1.Текст = 
							"ВЫБРАТЬ
							|	УпаковкиЕдиницыИзмерения.Владелец КАК Владелец,
							|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
							|ИЗ
							|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
							|ГДЕ
							|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
							|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения.Наименование = ""шт""";
						
				Запрос1.УстановитьПараметр("Владелец", СтрокаТЧ.Номенклатура);
						
				РезультатЗапроса1 = Запрос1.Выполнить();
						
				ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
						
					Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
					СтрокаТЧ.Упаковка=ВыборкаДетальныеЗаписи1.Ссылка;
					КонецЦикла;
		КонецЦикла;
	ИначеЕсли ЗначениеЗаполнено(ДанныеЗаполнения) И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Если НЕ ДанныеЗаполнения.Проведен Тогда
			Сообщить("Заказ: " + ДанныеЗаполнения + " должен быть проведен!");
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Ссылка,
		|	ЗаказПоставщикуТовары.Номенклатура,
		|	ЗаказПоставщикуТовары.Характеристика,
		|	ЗаказПоставщикуТовары.Количество,
		|	ЗаказПоставщикуТовары.КоличествоУпаковок * ВЫБОР
		|		КОГДА ЗаказПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ЗаказПоставщикуТовары.Номенклатура.ВесЧислитель / ВЫБОР
		|					КОГДА ЗаказПоставщикуТовары.Номенклатура.ВесЗнаменатель = 0
		|						ТОГДА 1
		|					ИНАЧЕ ЗаказПоставщикуТовары.Номенклатура.ВесЗнаменатель
		|				КОНЕЦ
		|		ИНАЧЕ ЗаказПоставщикуТовары.Упаковка.Вес
		|	КОНЕЦ КАК Вес,
		|	ЗаказПоставщикуТовары.КоличествоУпаковок,
		|	ЗаказПоставщикуТовары.Упаковка,
		|	ЗаказПоставщикуТовары.КоличествоУпаковок * ВЫБОР
		|		КОГДА ЗаказПоставщикуТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ ЗаказПоставщикуТовары.Упаковка.Объем
		|	КОНЕЦ КАК Объем,
		|	Номенклатура1.ОбъемЧислитель,
		|	Номенклатура1.ОбъемЗнаменатель
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура1
		|		ПО ЗаказПоставщикуТовары.Номенклатура = Номенклатура1.Ссылка
		|ГДЕ
		|	ЗаказПоставщикуТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|	И НЕ ЗаказПоставщикуТовары.Отменено
		|	И ЗаказПоставщикуТовары.Ссылка = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Сообщить("В заказе: " + ДанныеЗаполнения + " нет товаров!");
			Возврат;
		КонецЕсли;	
		
		ДокументОснование = ДанныеЗаполнения;
		
		Менеджер = ДокументОснование.Менеджер;
		Подразделение = ДокументОснование.Подразделение;
		ПланируемаяДатаДоставки = ДокументОснование.ЖелаемаяДатаПоступления;
		Склад = ДокументОснование.Склад;
		Контрагент = ДокументОснование.Контрагент;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
			СтрокаТЧ.Объем=(Выборка.ОбъемЧислитель/?(НЕ ЗначениеЗаполнено(Выборка.ОбъемЗнаменатель),1,Выборка.ОбъемЗнаменатель)) * Выборка.КоличествоУпаковок;
			
			Запрос1 = Новый Запрос;
					Запрос1.Текст = 
						"ВЫБРАТЬ
						|	УпаковкиЕдиницыИзмерения.Владелец КАК Владелец,
						|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
						|ИЗ
						|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
						|ГДЕ
						|	УпаковкиЕдиницыИзмерения.Владелец = &Владелец
						|	И УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения.Наименование = ""шт""";
					
			Запрос1.УстановитьПараметр("Владелец", СтрокаТЧ.Номенклатура);
					
					РезультатЗапроса1 = Запрос1.Выполнить();
					
					ВыборкаДетальныеЗаписи1 = РезультатЗапроса1.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
					СтрокаТЧ.Упаковка=ВыборкаДетальныеЗаписи1.Ссылка;
					КонецЦикла;

		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ) 
	//Меняем склад для Сервиса ГТС Подольск

	Если Склад=Справочники.Склады.НайтиПоНаименованию("Склад Сервиса - Подольск",Истина) 
			Тогда Склад=Справочники.Склады.НайтиПоНаименованию("Склад Подольск",Истина)
			Иначе
			КонецЕсли;
			
	//ГТС проверяем и меняем данные в ТТН
	Если ЗначениеЗаполнено(Ссылка) и ЗначениеЗаполнено(Водитель) и Водитель<>Ссылка.Водитель Тогда
	ВодительСпр=Справочники.ВодителиГТС.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВодителиГТС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВодителиГТС КАК ВодителиГТС
		|ГДЕ
		|	ВодителиГТС.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Водитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВодительСпр=ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	ТранспортнаяНакладнаяДокументыОснования.ДокументОснование КАК ДокументОснование,
		|	ТранспортнаяНакладная.Ссылка КАК ТН
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснования
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная КАК ТранспортнаяНакладная
		|			ПО ТранспортнаяНакладнаяДокументыОснования.Ссылка = ТранспортнаяНакладная.Ссылка
		|		ПО ТранспортнаяНакладнаяДокументыОснования.ДокументОснование = РеализацияТоваровУслуг.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслуг.ЗаявкаНаТранспорт = &ЗаявкаНаТранспорт";
	
	Запрос.УстановитьПараметр("ЗаявкаНаТранспорт", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если значениезаполнено(ВодительСпр) и значениезаполнено(ВыборкаДетальныеЗаписи.ТН) тогда
		ТНОбъект=ВыборкаДетальныеЗаписи.ТН.ПолучитьОбъект();
		ТНОбъект.АдресДоставки=АдресДоставки;
		ТНОбъект.АвтомобильМарка=ВодительСпр.АвтомобильМарка;
		ТНОбъект.Водитель = ВодительСпр.Владелец;
		ТНОбъект.АвтомобильГосударственныйНомер = ВодительСпр.АвтомобильНомер;
		ТНОбъект.Перевозчик = ВодительСпр.Контрагент;
		ТНОбъект.УдостоверениеСерия = ВодительСпр.УдостоверениеСерия;
		ТНОбъект.УдостоверениеНомер = ВодительСпр.УдостоверениеНомер;
		ТНОбъект.ВидПеревозки = "Грузовая";
		ТНОбъект.БанковскийСчетПеревозчика = ВодительСпр.БанковскийСчетКонтрагента;
		ТНОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Подразделение) тогда
		Подразделение=ПараметрыСеанса.ТекущийПользователь.Подразделение;
	КонецЕсли;
КонецПроцедуры
