///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ (НА СЕРВЕРЕ)

&НаСервере
Функция ПолучитьГрузоподъемностьРамыНаСервере()
	
	ШиринаЗазора = Число(БалкаВысотаПрофиля1);
	ЗазорРамы = ШиринаЗазора * СекцииКоличествоПолок + 80;
	
	Если БудутСтавитьПоддоныНаПол Тогда 
		//---- учитываем в этом случае отступ от верха =56 мм  от низа 44 мм.
		h1 = 56;
		h2 = 44;
		k = 0;
	Иначе
		//---- учитываем в этом случае отступ от пола = 144 мм.
		//---- учитываем в этом случае отступ от верха = 56 мм. 
		h1 = 56;
		h2 = 144;
		k = 1;
		
		Если СекцииКоличествоПолок = 1 тогда
			СекцииКоличествоПолок = 2;
		КонецЕсли;
	КонецЕсли;
	
	РасчетнаяВысота = РамаВысотаСтеллажа - h1 - h2; 
	
	Если (РасчетнаяВысота / 100) - Цел(РасчетнаяВысота/100) > 0 Тогда
		РасчетнаяВысота = Цел(РасчетнаяВысота/100) * 100 + 100;
	КонецЕсли;
	
	СекцииВысотаПролета = ((РасчетнаяВысота - ЗазорРамы) /(СекцииКоличествоПолок - k));
	
	Если ((СекцииВысотаПролета + ШиринаЗазора) / 100) - Цел((СекцииВысотаПролета + ШиринаЗазора) / 100) > 0 Тогда 
		СекцииВысотаПролета = Цел((СекцииВысотаПролета + ШиринаЗазора)/100) * 100 - ШиринаЗазора;
	КонецЕсли;
	
	СекцииПревышениеРамы = (РасчетнаяВысота + h1 + ?(k = 1, 0, h2)) - (СекцииВысотаПролета)*(СекцииКоличествоПолок - k) - ЗазорРамы;
	
	Если РамаПрофильСтойки = "70" Тогда
		Если РамаТолщинаМеталла = "1.5" Тогда
			Если СекцииВысотаПролета <= 750  Тогда
				ГрРамы = 6900;
			ИначеЕсли (СекцииВысотаПролета > 750) и (СекцииВысотаПролета <= 1000)Тогда
				ГрРамы = 6900;
			ИначеЕсли (СекцииВысотаПролета > 1000) и (СекцииВысотаПролета <= 1250)Тогда
				ГрРамы = 6600;
			ИначеЕсли (СекцииВысотаПролета > 1250) и (СекцииВысотаПролета <= 1500)Тогда
				ГрРамы = 5900;
			ИначеЕсли (СекцииВысотаПролета > 1500) и (СекцииВысотаПролета <= 1750)Тогда
				ГрРамы = 4100;
			ИначеЕсли (СекцииВысотаПролета > 1750) и (СекцииВысотаПролета <= 2000)Тогда
				ГрРамы = 3300;
			ИначеЕсли (СекцииВысотаПролета > 2000) и (СекцииВысотаПролета <= 2250)Тогда
				ГрРамы = 2500;
			ИначеЕсли (СекцииВысотаПролета > 2250) и (СекцииВысотаПролета <= 2500)Тогда
				ГрРамы = 2100;
			ИначеЕсли (СекцииВысотаПролета > 2500) и (СекцииВысотаПролета <= 2750)Тогда
				ГрРамы = 1700;
			ИначеЕсли (СекцииВысотаПролета > 2750) и (СекцииВысотаПролета <= 3000)Тогда
				ГрРамы = 1500;
			ИначеЕсли СекцииВысотаПролета > 3000 Тогда
				ГрРамы = 0;
			КонецЕсли;
		ИначеЕсли РамаТолщинаМеталла = "2.0" Тогда
			Если СекцииВысотаПролета <= 750  Тогда
				ГрРамы = 9200;
			ИначеЕсли (СекцииВысотаПролета > 750) и (СекцииВысотаПролета <= 1000)Тогда
				ГрРамы = 9200;
			ИначеЕсли (СекцииВысотаПролета > 1000) и (СекцииВысотаПролета <= 1250)Тогда
				ГрРамы = 8800;
			ИначеЕсли (СекцииВысотаПролета > 1250) и (СекцииВысотаПролета <= 1500)Тогда
				ГрРамы = 7800;
			ИначеЕсли (СекцииВысотаПролета > 1500) и (СекцииВысотаПролета <= 1750)Тогда
				ГрРамы = 5500;
			ИначеЕсли (СекцииВысотаПролета > 1750) и (СекцииВысотаПролета <= 2000)Тогда
				ГрРамы = 4500;
			ИначеЕсли (СекцииВысотаПролета > 2000) и (СекцииВысотаПролета <= 2250)Тогда
				ГрРамы = 3400;
			ИначеЕсли (СекцииВысотаПролета > 2250) и (СекцииВысотаПролета <= 2500)Тогда
				ГрРамы = 2800;
			ИначеЕсли (СекцииВысотаПролета > 2500) и (СекцииВысотаПролета <= 2750)Тогда
				ГрРамы = 2300;
			ИначеЕсли (СекцииВысотаПролета > 2750) и (СекцииВысотаПролета <= 3000)Тогда
				ГрРамы = 2000;
			ИначеЕсли СекцииВысотаПролета > 3000 Тогда
				ГрРамы = 0;
			КонецЕсли;
		КонецЕсли;       
		
	//Добавляем 85 стойку	
	ИначеЕсли РамаПрофильСтойки = "85" Тогда
		Если РамаТолщинаМеталла = "1.5" Тогда
			Если СекцииВысотаПролета <= 750  Тогда
				ГрРамы = 10800;
			ИначеЕсли (СекцииВысотаПролета > 750) и (СекцииВысотаПролета <= 1000)Тогда
				ГрРамы = 10700;
			ИначеЕсли (СекцииВысотаПролета > 1000) и (СекцииВысотаПролета <= 1250)Тогда
				ГрРамы = 10500;
			ИначеЕсли (СекцииВысотаПролета > 1250) и (СекцииВысотаПролета <= 1500)Тогда
				ГрРамы = 10100;
			ИначеЕсли (СекцииВысотаПролета > 1500) и (СекцииВысотаПролета <= 1750)Тогда
				ГрРамы = 8400;
			ИначеЕсли (СекцииВысотаПролета > 1750) и (СекцииВысотаПролета <= 2000)Тогда
				ГрРамы = 6800;
			ИначеЕсли (СекцииВысотаПролета > 2000) и (СекцииВысотаПролета <= 2250)Тогда
				ГрРамы = 5100;
			ИначеЕсли (СекцииВысотаПролета > 2250) и (СекцииВысотаПролета <= 2500)Тогда
				ГрРамы = 4300;
			ИначеЕсли (СекцииВысотаПролета > 2500) и (СекцииВысотаПролета <= 2750)Тогда
				ГрРамы = 3400;
			ИначеЕсли (СекцииВысотаПролета > 2750) и (СекцииВысотаПролета <= 3000)Тогда
				ГрРамы = 3000;
			ИначеЕсли СекцииВысотаПролета > 3000 Тогда
				ГрРамы = 0;
			КонецЕсли;
		ИначеЕсли РамаТолщинаМеталла = "2.0" Тогда
			Если СекцииВысотаПролета <= 750  Тогда
				ГрРамы = 14600;
			ИначеЕсли (СекцииВысотаПролета > 750) и (СекцииВысотаПролета <= 1000)Тогда
				ГрРамы = 14500;
			ИначеЕсли (СекцииВысотаПролета > 1000) и (СекцииВысотаПролета <= 1250)Тогда
				ГрРамы = 14300;
			ИначеЕсли (СекцииВысотаПролета > 1250) и (СекцииВысотаПролета <= 1500)Тогда
				ГрРамы = 13700;
			ИначеЕсли (СекцииВысотаПролета > 1500) и (СекцииВысотаПролета <= 1750)Тогда
				ГрРамы = 11400;
			ИначеЕсли (СекцииВысотаПролета > 1750) и (СекцииВысотаПролета <= 2000)Тогда
				ГрРамы = 9200;
			ИначеЕсли (СекцииВысотаПролета > 2000) и (СекцииВысотаПролета <= 2250)Тогда
				ГрРамы = 7000;
			ИначеЕсли (СекцииВысотаПролета > 2250) и (СекцииВысотаПролета <= 2500)Тогда
				ГрРамы = 5900;
			ИначеЕсли (СекцииВысотаПролета > 2500) и (СекцииВысотаПролета <= 2750)Тогда
				ГрРамы = 4700;
			ИначеЕсли (СекцииВысотаПролета > 2750) и (СекцииВысотаПролета <= 3000)Тогда
				ГрРамы = 4100;
			ИначеЕсли СекцииВысотаПролета > 3000 Тогда
				ГрРамы = 0;
			КонецЕсли;
		КонецЕсли;
	
		
		
	ИначеЕсли РамаПрофильСтойки = "100" Тогда
		
		Если РамаТолщинаМеталла = "1.5" Тогда
			Если СекцииВысотаПролета <= 750  Тогда
				ГрРамы = 13020;
			ИначеЕсли (СекцииВысотаПролета > 750) и (СекцииВысотаПролета <= 1000)Тогда
				ГрРамы = 12670;
			ИначеЕсли (СекцииВысотаПролета > 1000) и (СекцииВысотаПролета <= 1250)Тогда
				ГрРамы = 12320;
			ИначеЕсли (СекцииВысотаПролета > 1250) и (СекцииВысотаПролета <= 1500)Тогда
				ГрРамы = 11970;
			ИначеЕсли (СекцииВысотаПролета > 1500) и (СекцииВысотаПролета <= 1750)Тогда
				ГрРамы = 11620;
			ИначеЕсли (СекцииВысотаПролета > 1750) и (СекцииВысотаПролета <= 2000)Тогда
				ГрРамы = 9450;
			ИначеЕсли (СекцииВысотаПролета > 2000) и (СекцииВысотаПролета <= 2250)Тогда
				ГрРамы = 7490;
			ИначеЕсли (СекцииВысотаПролета > 2250) и (СекцииВысотаПролета <= 2500)Тогда
				ГрРамы = 6020;
			ИначеЕсли (СекцииВысотаПролета > 2500) и (СекцииВысотаПролета <= 2750)Тогда
				ГрРамы = 4970;
			ИначеЕсли (СекцииВысотаПролета > 2750) и (СекцииВысотаПролета <= 3000)Тогда
				ГрРамы = 4200;
			ИначеЕсли СекцииВысотаПролета > 3000 Тогда
				ГрРамы = 0;
			КонецЕсли;
		ИначеЕсли РамаТолщинаМеталла = "2.0" Тогда
			Если СекцииВысотаПролета <= 750  Тогда
				ГрРамы = 18200;
			ИначеЕсли (СекцииВысотаПролета > 750) и (СекцииВысотаПролета <= 1000)Тогда
				ГрРамы = 18100;
			ИначеЕсли (СекцииВысотаПролета > 1000) и (СекцииВысотаПролета <= 1250)Тогда
				ГрРамы = 17900;
			ИначеЕсли (СекцииВысотаПролета > 1250) и (СекцииВысотаПролета <= 1500)Тогда
				ГрРамы = 17700;
			ИначеЕсли (СекцииВысотаПролета > 1500) и (СекцииВысотаПролета <= 1750)Тогда
				ГрРамы = 17000;
			ИначеЕсли (СекцииВысотаПролета > 1750) и (СекцииВысотаПролета <= 2000)Тогда
				ГрРамы = 15900;
			ИначеЕсли (СекцииВысотаПролета > 2000) и (СекцииВысотаПролета <= 2250)Тогда
				ГрРамы = 12000;
			ИначеЕсли (СекцииВысотаПролета > 2250) и (СекцииВысотаПролета <= 2500)Тогда
				ГрРамы = 10200;
			ИначеЕсли (СекцииВысотаПролета > 2500) и (СекцииВысотаПролета <= 2750)Тогда
				ГрРамы = 8100;
			ИначеЕсли (СекцииВысотаПролета > 2750) и (СекцииВысотаПролета <= 3000)Тогда
				ГрРамы = 7100;
			ИначеЕсли СекцииВысотаПролета > 3000 Тогда
				ГрРамы = 0;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли РамаПрофильСтойки = "130" Тогда
		
		Если РамаТолщинаМеталла = "1.5" Тогда
			Если СекцииВысотаПролета <= 750  Тогда
				ГрРамы = 16400;
			ИначеЕсли (СекцииВысотаПролета > 750) и (СекцииВысотаПролета <= 1000)Тогда
				ГрРамы = 16300;
			ИначеЕсли (СекцииВысотаПролета > 1000) и (СекцииВысотаПролета <= 1250)Тогда
				ГрРамы = 16200;
			ИначеЕсли (СекцииВысотаПролета > 1250) и (СекцииВысотаПролета <= 1500)Тогда
				ГрРамы = 16100;
			ИначеЕсли (СекцииВысотаПролета > 1500) и (СекцииВысотаПролета <= 1750)Тогда
				ГрРамы = 15800;
			ИначеЕсли (СекцииВысотаПролета > 1750) и (СекцииВысотаПролета <= 2000)Тогда
				ГрРамы = 15600;
			ИначеЕсли (СекцииВысотаПролета > 2000) и (СекцииВысотаПролета <= 2250)Тогда
				ГрРамы = 14900;
			ИначеЕсли (СекцииВысотаПролета > 2250) и (СекцииВысотаПролета <= 2500)Тогда
				ГрРамы = 14300;
			ИначеЕсли (СекцииВысотаПролета > 2500) и (СекцииВысотаПролета <= 2750)Тогда
				ГрРамы = 12900;
			ИначеЕсли (СекцииВысотаПролета > 2750) и (СекцииВысотаПролета <= 3000)Тогда
				ГрРамы = 11400;
			ИначеЕсли СекцииВысотаПролета > 3000 Тогда
				ГрРамы = 0;
			КонецЕсли;
		ИначеЕсли РамаТолщинаМеталла = "2.0" Тогда
			Если СекцииВысотаПролета <= 750  Тогда
				ГрРамы = 21900;
			ИначеЕсли (СекцииВысотаПролета > 750) и (СекцииВысотаПролета <= 1000)Тогда
				ГрРамы = 21800;
			ИначеЕсли (СекцииВысотаПролета > 1000) и (СекцииВысотаПролета <= 1250)Тогда
				ГрРамы = 21600;
			ИначеЕсли (СекцииВысотаПролета > 1250) и (СекцииВысотаПролета <= 1500)Тогда
				ГрРамы = 21500;
			ИначеЕсли (СекцииВысотаПролета > 1500) и (СекцииВысотаПролета <= 1750)Тогда
				ГрРамы = 21100;
			ИначеЕсли (СекцииВысотаПролета > 1750) и (СекцииВысотаПролета <= 2000)Тогда
				ГрРамы = 20800;
			ИначеЕсли (СекцииВысотаПролета > 2000) и (СекцииВысотаПролета <= 2250)Тогда
				ГрРамы = 20100;
			ИначеЕсли (СекцииВысотаПролета > 2250) и (СекцииВысотаПролета <= 2500)Тогда
				ГрРамы = 19300;
			ИначеЕсли (СекцииВысотаПролета > 2500) и (СекцииВысотаПролета <= 2750)Тогда
				ГрРамы = 17500;
			ИначеЕсли (СекцииВысотаПролета > 2750) и (СекцииВысотаПролета <= 3000)Тогда
				ГрРамы = 15300;
			ИначеЕсли СекцииВысотаПролета > 3000 Тогда
				ГрРамы = 0;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат ГрРамы;
	
КонецФункции//ПолучитьГрузоподъемностьРамыНаСервере	

&НаСервере
Функция ПолучитьГрузоподъемностьБалкиНаСервере(ДлинаБалки, ВысотаПрофиляБалки, ТолщинаМеталлаБалки,ТолщинаСтойкиВРаме=0)
    ОбработкаОбъект=РеквизитФормыВЗначение("Объект");
	
	
	
	//Асист-Про. Получаем необходимые для расчета макеты
	МакетРасчетаНагрузок=Константы.МакетРасчетаНагрузок.Получить().Получить();	
	Если МакетРасчетаНагрузок=Неопределено Тогда 
		МакетРасчетаНагрузок=ОбработкаОбъект.ПолучитьМакет("МакетРасчетаНагрузок");
	КонецЕсли;
	
	МакетРасчетаPmax=Константы.МакетРасчетаPmax.Получить().Получить();	
	Если МакетРасчетаPmax=Неопределено Тогда 
		МакетРасчетаPmax=ОбработкаОбъект.ПолучитьМакет("МакетРасчетаPmax");
	КонецЕсли;

	
	//Асист-про. Подбираем строку из макета МакетРасчетаНагрузок	
	Профиль = строка(ВысотаПрофиляБалки)+"."+ТолщинаМеталлаБалки;
	Область=МакетРасчетаНагрузок.НайтиТекст(Профиль);
	
	Если Область=Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена строка с данными в макете расчета нагрузок по профилю: "+Профиль+" Необходимо внести данные по указанному профилю в макет расчета нагрузок");
		Возврат 0;
	КонецЕсли;
	
	Строка = Лев(Область.Имя,Найти(Область.Имя,"C")-1);
	//Асист-про. Получаем данные из макета
	Pкритич = Число(МакетРасчетаНагрузок.Область(Строка+"C2").Текст);
	Lкритич = Число(МакетРасчетаНагрузок.Область(Строка+"C3").Текст);
	КоличествоЗацепов = Число(МакетРасчетаНагрузок.Область(Строка+"C4").Текст);
	
	//Асист-про. Расчет Pmax по формуле заложенной в макете
	Кмзапас=Константы.КМЗапас.Получить();
	Если Не ЗначениеЗаполнено(Кмзапас) Тогда
		Кмзапас=0.15;
	КонецЕсли;  
	//Асист-Про. Если передано 0 то расчитываем по формуле для прайс листа
	Если ТолщинаСтойкиВРаме<>0 Тогда
		ТипОкраски=?(РамаТипОкраски<>"Оцинковка","Остальные","Оцинковка");
		Ключ=""+КоличествоЗацепов+"."+Формат(Число(ТолщинаСтойкиВРаме),"ЧДЦ=1; ЧРД=,")+"."+ТипОкраски+"."+ВысотаПрофиляБалки+"."+Формат(Число(ТолщинаМеталлаБалки),"ЧДЦ=1; ЧРД=,");
		Область=МакетРасчетаPmax.НайтиТекст(Ключ);
		
		
		
		Если Область=Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена строка с данными в макете расчета P(max) по ключу: "+Ключ+" Необходимо внести данные по указанному ключу в макет расчета P(max)");
			Возврат 0;
		КонецЕсли;
		
		Строка =Лев(Область.Имя,Найти(Область.Имя,"C")-1);
		Pmax=0;
		Выполнить "Pmax="+МакетРасчетаPmax.Область(Строка+"C2").Текст+";";
	Иначе
		Выполнить "Pmax="+МакетРасчетаPmax.Область("R2C3").Текст+";";
	КонецЕсли;
	
	L = ДлинаБалки;  
	
	//-----------
	Если L <= Lкритич тогда
		Pрасч = Pкритич*(Lкритич/L);
	Иначе
		Pрасч = Pкритич*Pow((Lкритич/L), 2);
	КонецЕсли;
	
	P = Pрасч;
	Если Pрасч >= Pmax тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание! Расчетное значение нагрузки превышает значение Pmax для данного типа балок. Рекомендуется изменить параметры и повторить расчет");
	КонецЕсли;
	
	Если Pрасч >= Pкритич тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Внимание! Расчетное значение нагрузки превышает значение Pкритич для данного типа балок. Рекомендуется изменить параметры и повторить расчет");
	КонецЕсли;

	
	Результат = Цел(P/10)*10;
	
	возврат Результат;
	                             
КонецФункции //ПолучитьГрузподъемностьБалки	

&НаСервере
Процедура ПодобратьНоменклатуруНаСервере()
	//Объект.Товары.Очистить();
	//Комплектующие.Очистить();
	//РезультатыРасчета.Очистить();
	
	ПодобратьРамыНаСервере();
	ПодобратьБалкиНаСервере();
	ПодобратьНастилНаСервере();
	ПодобратьПрофильНаСервере();
	ПодобратьПластиныНаСервере();
	
	РезультатРасчета = РезультатыРасчета.Добавить();
	РезультатРасчета.Параметр = "КолвоУровнейВПролете";
	РезультатРасчета.Значение = СекцииКоличествоПолок + ?(БудутСтавитьПоддоныНаПол, 1, 0);
	
	ЗаполнитьЦеныСуммы();
	
КонецПроцедуры//ПодобратьНоменклатуруНаСервере()	

&НаСервере
Процедура ПодобратьРамыНаСервере()  
	
	// Катанные элементы рамы
	// Для стойки 70мм
	Если РамаПрофильСтойки = "70" Тогда
		k1 = 2*42;
	// Для стойки 85мм
    ИначеЕсли РамаПрофильСтойки = "85" Тогда
        k1 = 2*53.5;
	// Для стойки 100мм	
	ИначеЕсли РамаПрофильСтойки = "100" Тогда
		k1 = 2*68.5;
	// Для стойки 130мм	
	Иначе//Если РамаПрофильСтойки = "130" Тогда
		k1 = 2*86;
	КонецЕсли;
	
	МежОсРасст = РамаГлубинаСтеллажа - k1;
	ДлинаПрямогоРаскоса = МежОсРасст + 2*20;
	
	ДлинаКосогоРаскоса = Окр(Sqrt((МежОсРасст*МежОсРасст) + (600*600)) + 2*20);
	
	КолвоПрямыхРаскосов = 2;
	Если РамаВариантИсполнения = "Вариант 1" Тогда
		КолвоКосыхРаскосов = Цел((РамаВысотаСтеллажа - 200)/600);
		Если (РамаВысотаСтеллажа-200) > КолвоКосыхРаскосов*600 Тогда 
			КолвоКрепежа = КолвоКосыхРаскосов + 1 + КолвоПрямыхРаскосов + 1;
		Иначе 
			КолвоКрепежа = КолвоКосыхРаскосов + 1 + КолвоПрямыхРаскосов;
		КонецЕсли;
	Иначе
		КолвоКосыхРаскосов = 3 + Цел((РамаВысотаСтеллажа - 200)/600);
		Если (РамаВысотаСтеллажа >= 2000) и (РамаВысотаСтеллажа <= 2500)  Тогда
			КолвоПрямыхРаскосов = КолвоПрямыхРаскосов + 1;
		ИначеЕсли  (РамаВысотаСтеллажа > 2500) и (РамаВысотаСтеллажа <= 4300)  Тогда 
			КолвоПрямыхРаскосов = КолвоПрямыхРаскосов + 2;
		ИначеЕсли  (РамаВысотаСтеллажа > 4300) и (РамаВысотаСтеллажа <= 6100)  Тогда 
			КолвоПрямыхРаскосов = КолвоПрямыхРаскосов+3;  
		ИначеЕсли  РамаВысотаСтеллажа > 6100  Тогда 
			КолвоПрямыхРаскосов=КолвоПрямыхРаскосов + 4 + Цел((РамаВысотаСтеллажа - 6100)/1800);
		КонецЕсли;
		//------------------------------------------------------------------------------------------------------------------------------------------------------------
		Если (РамаВысотаСтеллажа - 144 - 56) > КолвоКосыхРаскосов*600 Тогда 
			КолвоКрепежа = КолвоКосыхРаскосов + 1 + КолвоПрямыхРаскосов + 1;
		Иначе 
			КолвоКрепежа = КолвоКосыхРаскосов + 1 + КолвоПрямыхРаскосов;
		КонецЕсли;
		
		//--------------------------------------------------------------------------------
		Если (РамаВысотаСтеллажа-144-56)-Цел((РамаВысотаСтеллажа-144-56)/600)*600=500 Тогда
			КолвоПрямыхРаскосов=КолвоПрямыхРаскосов+1;
			КолвоКрепежа = КолвоКрепежа + 1;
		КонецЕсли;
		
	КонецЕсли;
		
	СумДлинаСтоек = (РамаВысотаСтеллажа*2)/1000;
	
	СумДлинаРаскосов = (ДлинаПрямогоРаскоса*КолвоПрямыхРаскосов + ДлинаКосогоРаскоса*КолвоКосыхРаскосов)/1000;
	
	//	Некатаные элементы рам (КРЕПЕЖ)
	k2 = (РамаВысотаСтеллажа - 200)/600 = Цел((РамаВысотаСтеллажа - 200)/600);
	//  1. Определяем кол-во элементов Винт М8х55
	Если РамаВариантИсполнения = "Вариант 1" Тогда
		КолвоВинтовМ8х55 = КолвоКосыхРаскосов + 3 + ?(k2,0,1);	
	Иначе
		КолвоВинтовМ8х55 = КолвоКосыхРаскосов + 1 + ?(k2,0,1);	
	КонецЕсли;
	
	//  2. Определяем кол-во элементов Втулка 20
	КолвоВтулок20 = 2 + ?(k2,0,2);
	
	
	//  3. Определяем кол-во элементов Подпятников
	КолвоПодпятников = 2;
	
	//  4. Определяем кол-во элементов Болт М8х35
	КолвоБолтовМ8х35 = 4;
	
	//  5. Определяем кол-во элементов Втулка М8
	//Если РамаПрофильСтойки = "70" Тогда
	//	КолвоВтулокМ8 = 0;
	//Иначе
		КолвоВтулокМ8 = 4;
	//КонецЕсли;
	
	//  6. Определяем кол-во элементов Шайба М8
	КолвоШайбМ8 = КолвоВинтовМ8х55*2 + КолвоБолтовМ8х35*2;
	
	//  7. Определяем кол-во элементов Гайка М8
	КолвоГаекМ8 = КолвоВинтовМ8х55 + КолвоБолтовМ8х35;
	
	ОкраскаСтр = "";	
	Если РамаТипОкраски = "Без покрытия" Тогда
		ОкраскаСтр = "Б";
	ИначеЕсли РамаТипОкраски = "Оцинковка" Тогда
		ОкраскаСтр = "О";
	Иначе//Если РамаТипОкраски = "Полимеризация" Тогда
		ОкраскаСтр = "П";
	КонецЕсли;
	
	НаименованиеСтойки 	= "Стойка СЕТ";
	НаименованиеРамы 	= "Рама СЕТ";
	СтрВариант = "";
	Стр1 = "";
	Если РамаПрофильСтойки = "70" Тогда
		Стр1 = "175"; 
	ИначеЕсли  РамаПрофильСтойки = "85" Тогда
		Стр1 = ""; 
	ИначеЕсли  РамаПрофильСтойки = "100" Тогда
		Стр1 = "305"; 
	Иначе//Если  РамаПрофильСтойки = "130" Тогда
		Стр1 = "401"; 
	КонецЕсли;
	
	Если РамаВариантИсполнения = "Вариант 1" Тогда
		СтрВариант = "-1";
	Иначе
		СтрВариант = "-2";
	КонецЕсли;
	
	ЕстьНеНайденныеКомплектующие = Ложь;
	
	НаименованиеРамы = НаименованиеРамы + ОкраскаСтр + СтрВариант + " " + СтрЗаменить(СокрЛП(РамаВысотаСтеллажа), Символы.НПП, "") + "/" + СтрЗаменить(СокрЛП(РамаГлубинаСтеллажа), Символы.НПП, "") 
						+ " (" + РамаПрофильСтойки + "." + РамаТолщинаМеталла + ?(Стр1<>"",".","") + Стр1 + ")";
						
	НоменклатураРамы = НайтиНоменклатуруПоНаименованиюНаСервере(НаименованиеРамы);
	
	ВиртуальнаяРама = Ложь;
	Если Не ЗначениеЗаполнено(НоменклатураРамы) тогда
		ВиртуальнаяРама = Истина;
	КонецЕсли;
						
	КолвоРам = СекцииКоличествоПролетов1 + СекцииКоличествоПролетов2 + 1;
	
	Ключ = СокрЛП(Новый УникальныйИдентификатор);
	
	// Находим стойку по комплектации по имеющейся раме
	Если Не ВиртуальнаяРама тогда
		
			Запрос1 = Новый Запрос;
	Запрос1.Текст = 
		"ВЫБРАТЬ
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка,
		|	ВариантыКомплектацииНоменклатурыТовары.НомерСтроки,
		|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Комплектующая,
		|	ВариантыКомплектацииНоменклатурыТовары.Характеристика,
		|	ВариантыКомплектацииНоменклатурыТовары.Упаковка,
		|	ВариантыКомплектацииНоменклатурыТовары.КоличествоУпаковок,
		|	ВариантыКомплектацииНоменклатурыТовары.ДоляСтоимости,
		|	ВариантыКомплектацииНоменклатурыТовары.Количество
		|ИЗ
		|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
		|ГДЕ
		|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец = &Владелец
		|	И ВариантыКомплектацииНоменклатурыТовары.Ссылка.Основной = ИСТИНА";

	Запрос1.УстановитьПараметр("Владелец", НоменклатураРамы);
     НЗ=Запрос1.Выполнить().Выгрузить();
	
		
		//НЗ = РегистрыСведений.КомплектующиеНоменклатуры.СоздатьНаборЗаписей();
		//НЗ.Отбор.Номенклатура.Установить(НоменклатураРамы);
		//НЗ.Прочитать();	
		Если НЗ.Количество() = 0 тогда 
			ВиртуальнаяРама = Истина;
		Иначе
			СтрокаСтойки = ЗаписьСтойкиВКомплектации(НЗ);
			Если НЕ СтрокаСтойки = неопределено тогда
				СтрокаКомплектующая = Комплектующие.Добавить();
				СтрокаКомплектующая.Номенклатура 	= СтрокаСтойки.Комплектующая;
				СтрокаКомплектующая.НаименованиеНоменклатуры = СтрокаСтойки.Комплектующая.Наименование;
				СтрокаКомплектующая.Количество 		= СтрокаСтойки.Количество;
				СтрокаКомплектующая.Вес 			= СтрокаСтойки.Комплектующая.ВесЧислитель/?(ЗначениеЗаполнено(СтрокаСтойки.Комплектующая.ВесЗнаменатель),СтрокаСтойки.Комплектующая.ВесЗнаменатель,1) * СтрокаСтойки.Количество;
				СтрокаКомплектующая.ВнешнийКлюч 	= Ключ;		
			Иначе
				ЕстьНеНайденныеКомплектующие = Истина;
			Конецесли;
		Конецесли;
	КонецЕсли;
	//
	Если ВиртуальнаяРама тогда // стойку расчитываем по параметрам рамы
		НаименованиеСтойки = НаименованиеСтойки(НаименованиеРамы);
		СтрокаКомплектующая = Комплектующие.Добавить();
		СтрокаКомплектующая.НаименованиеНоменклатуры = НаименованиеСтойки;
		СтрокаКомплектующая.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеСтойки);
		СтрокаКомплектующая.Количество 		= 2;
		СтрокаКомплектующая.Вес 			= РасчетныйВесСтойки(НаименованиеРамы) * 2;
		СтрокаКомплектующая.ВнешнийКлюч 	= Ключ;		
	КонецЕсли;
	
	//Катанные элементы рамы (КРЕПЕЖ)
	НаименованиеРаскосаК = "Раскос СЕТ" + ОкраскаСтр + " " + Формат(ДлинаКосогоРаскоса, "ЧГ=0") + " (к)";
	
	НаименованиеРаскосаПр = "Раскос СЕТ" + ОкраскаСтр + " " + Формат(ДлинаПрямогоРаскоса, "ЧГ=0") + " (пр)";
	
	Если НЕ ДобавитьКомплектующую(НаименованиеРаскосаК, КолвоКосыхРаскосов, Ключ) Тогда
		//ЕстьНеНайденныеКомплектующие = Истина;
		СтрокаКомплектующая = Комплектующие.Добавить();
		СтрокаКомплектующая.НаименованиеНоменклатуры = НаименованиеРаскосаК;
		СтрокаКомплектующая.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеРаскосаК);
		СтрокаКомплектующая.Количество 		= КолвоКосыхРаскосов;
		СтрокаКомплектующая.Вес 			= ДлинаКосогоРаскоса*7.85*1.5*67*0.000001;
		СтрокаКомплектующая.ВнешнийКлюч 	= Ключ;		

	КонецЕсли;
	Если НЕ ДобавитьКомплектующую(НаименованиеРаскосаПр, КолвоПрямыхРаскосов, Ключ) Тогда    //
		//ЕстьНеНайденныеКомплектующие = Истина;
		//ЕстьНеНайденныеКомплектующие = Истина;
		СтрокаКомплектующая = Комплектующие.Добавить();
		СтрокаКомплектующая.НаименованиеНоменклатуры = НаименованиеРаскосаПр;
		СтрокаКомплектующая.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеРаскосаПр);
		СтрокаКомплектующая.Количество 		= КолвоПрямыхРаскосов;
		СтрокаКомплектующая.Вес 			= ДлинаПрямогоРаскоса*7.85*1.5*67*0.000001;
		СтрокаКомплектующая.ВнешнийКлюч 	= Ключ;		

	КонецЕсли;
	
	//Некатаные элементы рам (КРЕПЕЖ)
	Если НЕ ДобавитьКомплектующую("Винт М8х55", КолвоВинтовМ8х55, Ключ) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
	КонецЕсли;
	
	Если НЕ ДобавитьКомплектующую("Втулка 20", КолвоВтулок20, Ключ) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
	КонецЕсли;
	
	Если НЕ ДобавитьКомплектующую("Шайба спец.овал.6вэ.73.334.01", КолвоШайбМ8, Ключ) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
	КонецЕсли;
	
	НаименованиеПодпятника = "";
	РазмерыСтр = "";
	Если РамаПрофильСтойки = "70" Тогда
		РазмерыСтр = "80х90";
	ИначеЕсли РамаПрофильСтойки = "85" Тогда
		РазмерыСтр = "125х140";
	ИначеЕсли РамаПрофильСтойки = "100" Тогда
		РазмерыСтр = "140х150";
	Иначе
		РазмерыСтр = "155х155";
	КонецЕсли;		
		
	ОкраскаСтр = "";
	Если РамаТипОкраски = "Без покрытия" Тогда
		ОкраскаСтр = "СЕТБ";
	ИначеЕсли РамаТипОкраски = "Полимеризация" Тогда
		ОкраскаСтр = "СЕТП";
	Иначе 
		ОкраскаСтр = "СЕТО";
	КонецЕсли;
	НаименованиеПодпятника = "Подпятник " + ОкраскаСтр + " " + РазмерыСтр;
	
	Если НЕ ДобавитьКомплектующую(НаименованиеПодпятника, КолвоПодпятников, Ключ) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
	КонецЕсли;
	
	Если НЕ ДобавитьКомплектующую("Болт М8х35", КолвоБолтовМ8х35, Ключ) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
	КонецЕсли;
	
	Если НЕ ДобавитьКомплектующую("Втулка М8", КолвоВтулокМ8, Ключ) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
	КонецЕсли;
	
	Если НЕ ДобавитьКомплектующую("Гайка М8", КолвоГаекМ8, Ключ) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
	КонецЕсли;
	
	Если ЕстьНеНайденныеКомплектующие Тогда
		Возврат;
	КонецЕсли;
	
	ВесРамы = 0;
	СтрокиКомплектующие = Комплектующие.НайтиСтроки(Новый Структура("ВнешнийКлюч", Ключ));
	Для каждого СтрокаКомплектующая Из СтрокиКомплектующие Цикл
		ВесРамы = ВесРамы + СтрокаКомплектующая.Вес;	
	КонецЦикла;
	
	СтрокаКомплект = Объект.Товары.Добавить();
	СтрокаКомплект.Наименование = НаименованиеРамы;
	СтрокаКомплект.Номенклатура = НоменклатураРамы;
	СтрокаКомплект.Количество 	= КолвоРам;
	СтрокаКомплект.ЕдиницаИзмерения = "шт";
	СтрокаКомплект.Грузоподъемность = РамаГрузоподъемность;
	СтрокаКомплект.Вес 			= ВесРамы;
	СтрокаКомплект.Покрытие 	= РамаТипОкраски;
	СтрокаКомплект.Ключ			= Ключ;
	
	РезультатРасчета = РезультатыРасчета.Добавить();
	РезультатРасчета.Параметр = "ДлинаСтеллажа";
	РезультатРасчета.Значение = ((БалкаДлина1 + 10)*СекцииКоличествоПролетов1) + ((БалкаДлина2 + 10)*СекцииКоличествоПролетов2) + (КолвоРам*РамаПрофильСтойки);
	
КонецПроцедуры  //ПодобратьРамыНаСервере()

&НаСервере
Процедура ПодобратьБалкиНаСервере()
	
	НаименованиеБалкиКомплектующей1 = "Балка СЕТ";
	НаименованиеБалки1 = "Балка СЕТ";
	
	Стр1 = "";
	Если БалкаВысотаПрофиля1 = "90" Тогда
		Стр1 = "179"; 
	ИначеЕсли БалкаВысотаПрофиля1 = "120" Тогда
		Стр1 = "272"; 
	ИначеЕсли БалкаВысотаПрофиля1 = "150" Тогда
		Стр1 = "299"; 
	Иначе//Если БалкаВысотаПрофиля1 = "180" Тогда
		Стр1 = "366"; 
	КонецЕсли;
		
	ОкраскаСтр = "";
	Если  БалкаТипОкраски1 = "Без покрытия" Тогда 
		ОкраскаСтр = "Б"; 
	Иначе//Если БалкаТипОкраски1 = "Полимеризация" Тогда
		ОкраскаСтр = "П"; 
	КонецЕсли;
	
	Если ФлагПолетная = 0 и БалкаВысотаПрофиля1 = "90" тогда //забыли проставить суффикс для балок с высотой профиля 90
		ФлагПолетная = 1;
	КонецЕсли;
	
	//
	РасчитатьГрузоподъемностьБалокНаСервере();
	//
	Если БалкаВысотаПрофиля1 = "90" Тогда
		Если ФлагПолетная = 1 Тогда НадписьПалетная = " паллетная";
		ИначеЕсли ФлагПолетная = 2 Тогда НадписьПалетная = " под настил"; 
		ИначеЕсли ФлагПолетная = 3 И БалкаТолщинаМеталла1 = "2.0" Тогда НадписьПалетная = " жесткости с отстп. под 100 ( 2 сторонняя)";
		ИначеЕсли ФлагПолетная = 4 И БалкаТолщинаМеталла1 = "2.0" Тогда НадписьПалетная = " жесткости с отстп. под 70 ( 2 сторонняя)";
		ИначеЕсли ФлагПолетная = 5 И БалкаТолщинаМеталла1 = "2.0" Тогда НадписьПалетная = " жесткости с отстп. под 85 ( 2 сторонняя)";
		ИначеЕсли ФлагПолетная = 6 И БалкаТолщинаМеталла1 = "2.0" Тогда НадписьПалетная = " жесткости с отстп. под 100";
		ИначеЕсли ФлагПолетная = 7 И БалкаТолщинаМеталла1 = "2.0" Тогда НадписьПалетная = " жесткости с отстп. под 70";
		ИначеЕсли ФлагПолетная = 8 И БалкаТолщинаМеталла1 = "2.0" Тогда НадписьПалетная = " жесткости с отстп. под 85";	
		ИначеЕсли ФлагПолетная = 10 И БалкаТолщинаМеталла1 = "2.0" Тогда НадписьПалетная = " поддонов однорядный";
		ИначеЕсли ФлагПолетная = 9 И БалкаТолщинаМеталла1 = "2.0" Тогда НадписьПалетная = " поддонов двурядный";
		
		
		ИначеЕсли ФлагПолетная > 2 Тогда
			Сообщить("Ошибка, балки жесткости/ограничители доступны только для толщины 2.0");
			Возврат;
		Иначе
		КонецЕсли;
	КонецЕсли;
	//НадписьПалетная = ?(БалкаВысотаПрофиля1 = "90", ?(ФлагПолетная = 1, " паллетная", " под настил"), "");
	СтрокаГрузоподъемность = СтрЗаменить(СокрЛП(БалкаГрузоподъемность1), Символы.НПП, "");
	НаименованиеБалкиКомплектующей1 = НаименованиеБалкиКомплектующей1 + ОкраскаСтр + " (" + БалкаВысотаПрофиля1 + "." + БалкаТолщинаМеталла1 + ")";
	Если ФлагПолетная>2 И ФлагПолетная<9 И БалкаТолщинаМеталла1 = "2.0" И БалкаВысотаПрофиля1 = "90" Тогда
	НаименованиеБалки1 = НаименованиеБалки1 + ОкраскаСтр + " " + СтрЗаменить(СокрЛП(БалкаДлина1), Символы.НПП,"")
	+ " (" + БалкаВысотаПрофиля1 + "." + БалкаТолщинаМеталла1 + ")" + НадписьПалетная;		
	ИначеЕсли ФлагПолетная>8 И БалкаТолщинаМеталла1 = "2.0" И БалкаВысотаПрофиля1 = "90" Тогда
	НаименованиеБалки1 = "Ограничитель СЕТП" + " " + СтрЗаменить(СокрЛП(БалкаДлина1), Символы.НПП,"")
	+ " (" + БалкаВысотаПрофиля1 + "." + БалкаТолщинаМеталла1 + "." + Стр1 + ")" + НадписьПалетная;		
	Иначе
	НаименованиеБалки1 = НаименованиеБалки1 + ОкраскаСтр + " " + СтрЗаменить(СокрЛП(БалкаДлина1), Символы.НПП,"") + "/" + СтрЗаменить(СокрЛП(БалкаГрузоподъемность1), Символы.НПП, "")
	+ " (" + БалкаВысотаПрофиля1 + "." + БалкаТолщинаМеталла1 + "." + Стр1 + ")" + НадписьПалетная;
	КонецЕсли;
	//Асист-Про. Теперь ищем по точному совпадению в том числе и по грузоподъемности	
	//НаименованиеБалкиДляПоиска = СтрЗаменить(НаименованиеБалки1, СтрокаГрузоподъемность, "%");
	НаименованиеБалкиДляПоиска=НаименованиеБалки1;					
	Ключ1 = СокрЛП(Новый УникальныйИдентификатор);
	
	ЕстьНеНайденныеКомплектующие = Ложь;
	
	Если НЕ ДобавитьКомплектующую(НаименованиеБалкиКомплектующей1, (БалкаДлина1 / 1000), Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
	КонецЕсли;
	

	Если  ФлагПолетная>2 И БалкаТолщинаМеталла1 = "2.0" И БалкаВысотаПрофиля1 = "90" Тогда
		Если ФлагПолетная=3 Тогда
			
		Если НЕ ДобавитьКомплектующую("Зацеп б/ж двусторонний под 100", 1, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
	    Если НЕ ДобавитьКомплектующую("Болт М8х20 (для компл.)", 16, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Гайка М8 (для компл.)", 16, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Шайба спец.овал.6вэ.73.334.01 (для компл.)", 32, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;

		ИначеЕсли ФлагПолетная=4 Тогда
		Если НЕ ДобавитьКомплектующую("Зацеп б/ж двусторонний под 70", 1, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
	    Если НЕ ДобавитьКомплектующую("Болт М8х20 (для компл.)", 16, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Гайка М8 (для компл.)", 16, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Шайба спец.овал.6вэ.73.334.01 (для компл.)", 32, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
	
		ИначеЕсли ФлагПолетная=5 Тогда
		Если НЕ ДобавитьКомплектующую("Зацеп б/ж двусторонний под 85", 1, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
	    Если НЕ ДобавитьКомплектующую("Болт М8х20 (для компл.)", 16, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Гайка М8 (для компл.)", 16, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Шайба спец.овал.6вэ.73.334.01 (для компл.)", 32, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;

	
	    ИначеЕсли ФлагПолетная=6 Тогда
		Если НЕ ДобавитьКомплектующую("Зацеп б/ж односторонний под 100", 1, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
	    Если НЕ ДобавитьКомплектующую("Болт М8х20 (для компл.)", 8, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Гайка М8 (для компл.)", 8, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Шайба спец.овал.6вэ.73.334.01 (для компл.)", 16, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;

		ИначеЕсли ФлагПолетная=7 Тогда
		Если НЕ ДобавитьКомплектующую("Зацеп б/ж односторонний под 70", 1, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Болт М8х20 (для компл.)", 8, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Гайка М8 (для компл.)", 8, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Шайба спец.овал.6вэ.73.334.01 (для компл.)", 16, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
	
		ИначеЕсли ФлагПолетная=8 Тогда
		Если НЕ ДобавитьКомплектующую("Зацеп б/ж односторонний под 85", 1, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Болт М8х20 (для компл.)", 8, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Гайка М8 (для компл.)", 8, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Шайба спец.овал.6вэ.73.334.01 (для компл.)", 16, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;

	
	    ИначеЕсли ФлагПолетная=9 Тогда
		Если НЕ ДобавитьКомплектующую("Зацеп ограничитель однорядный", 1, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
	    Если НЕ ДобавитьКомплектующую("Болт М8х20 (для компл.)", 4, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Гайка М8 (для компл.)", 4, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Шайба спец.овал.6вэ.73.334.01 (для компл.)", 8, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;

		ИначеЕсли ФлагПолетная=10 Тогда
		Если НЕ ДобавитьКомплектующую("Зацеп ограничитель двурядный", 1, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
	    Если НЕ ДобавитьКомплектующую("Болт М8х20 (для компл.)", 8, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Гайка М8 (для компл.)", 8, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		Если НЕ ДобавитьКомплектующую("Шайба спец.овал.6вэ.73.334.01 (для компл.)", 16, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;

		Иначе
		КонецЕсли;
		
	Иначе
		
	Если НЕ ДобавитьКомплектующую("Зацеп СЕТ" + Лев(БалкаТипОкраски1, 1) + " (" + БалкаВысотаПрофиля1 + ")", 1, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
	КонецЕсли;

	
	Если НЕ ДобавитьКомплектующую("Фиксатор СЕТ", 2, Ключ1) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
	КонецЕсли;
	
	КонецЕсли;
	
	Если ЕстьНеНайденныеКомплектующие Тогда
		Возврат;
	КонецЕсли;	
	
	ВесБалки1 = 0;
	СтрокиКомплектующие = Комплектующие.НайтиСтроки(Новый Структура("ВнешнийКлюч", Ключ1));
	Для каждого СтрокаКомплектующая Из СтрокиКомплектующие Цикл
		ВесБалки1 = ВесБалки1+ СтрокаКомплектующая.Вес;	
	КонецЦикла;
	
	КолвоБалок1 = СекцииКоличествоПолок*СекцииКоличествоПролетов1*2;
	
	ВидНастилаСтр = "";
	Если ВидНастила = "Фанера" Тогда 
		ВидНастилаСтр = "под фанеру";
	ИначеЕсли ВидНастила = "Металл" Тогда
		ВидНастилаСтр = "под металл";
	КонецЕсли;
	
	СтрокаКомплект = Объект.Товары.Добавить();
	СтрокаКомплект.Наименование = НаименованиеБалки1;
	
	СтрокаКомплект.Номенклатура = НайтиБалкуПоСпецНаименованиюНаСервере(НаименованиеБалкиДляПоиска);//НайтиНоменклатуруПоНаименованиюНаСервере(НаименованиеБалки1 + ВидНастилаСтр);
	СтрокаКомплект.Количество 	= КолвоБалок1;
	СтрокаКомплект.Вес 			= ВесБалки1;
	СтрокаКомплект.Ключ			= Ключ1;
	СтрокаКомплект.Покрытие 	= БалкаТипОкраски1;
	СтрокаКомплект.ЕдиницаИзмерения = "шт";
	СтрокаКомплект.Грузоподъемность = БалкаГрузоподъемность1;
	
	Если БалкаДлина2 > 0 Тогда
		НаименованиеБалкиКомплектующей2 = "Балка СЕТ";
		НаименованиеБалки2 = "Балка СЕТ";
		
		Стр2 = "";
		Если БалкаВысотаПрофиля2 = "90" Тогда
			Стр2 = "179"; 
		ИначеЕсли БалкаВысотаПрофиля2 = "120" Тогда
			Стр2 = "272"; 
		ИначеЕсли БалкаВысотаПрофиля2 = "150" Тогда
			Стр2 = "299"; 
		Иначе//Если БалкаВысотаПрофиля2 = "180" Тогда
			Стр2 = "366"; 
		КонецЕсли;
		
		НаименованиеБалкиКомплектующей2 = НаименованиеБалкиКомплектующей2 + ОкраскаСтр + " (" + БалкаВысотаПрофиля2 + "." + БалкаТолщинаМеталла2 + ")";
		НаименованиеБалки2 = НаименованиеБалки2 + ОкраскаСтр + " " + СтрЗаменить(СокрЛП(БалкаДлина2), Символы.НПП,"") + "/" + СтрЗаменить(СокрЛП(БалкаГрузоподъемность2), Символы.НПП, "")
							+ " (" + БалкаВысотаПрофиля2 + "." + БалкаТолщинаМеталла2 + "." + Стр2 + ")";
		
		Ключ2 = СокрЛП(Новый УникальныйИдентификатор);
		
		ЕстьНеНайденныеКомплектующие = Ложь;
		
		Если НЕ ДобавитьКомплектующую(НаименованиеБалкиКомплектующей2, (БалкаДлина2 / 1000), Ключ2) Тогда
			ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		
		Если НЕ ДобавитьКомплектующую("Зацеп СЕТ" + Лев(БалкаТипОкраски1, 1) + " (" + БалкаВысотаПрофиля2 + ")", 1, Ключ2) Тогда
			ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		
		Если НЕ ДобавитьКомплектующую("Фиксатор СЕТ", 2, Ключ2) Тогда
			ЕстьНеНайденныеКомплектующие = Истина;
		КонецЕсли;
		
		Если ЕстьНеНайденныеКомплектующие Тогда
			Возврат;
		КонецЕсли;	
		
		ВесБалки2 = 0;
		СтрокиКомплектующие = Комплектующие.НайтиСтроки(Новый Структура("ВнешнийКлюч", Ключ2));
		Для каждого СтрокаКомплектующая Из СтрокиКомплектующие Цикл
			ВесБалки2 = ВесБалки2+ СтрокаКомплектующая.Вес;	
		КонецЦикла;
		
		КолвоБалок2 = СекцииКоличествоПолок*СекцииКоличествоПролетов2*2;
		
		СтрокаКомплект = Объект.Товары.Добавить();
		СтрокаКомплект.Наименование = НаименованиеБалки2;
		СтрокаКомплект.Номенклатура = НайтиНоменклатуруПоНаименованиюНаСервере(НаименованиеБалки2 + ВидНастилаСтр);
		СтрокаКомплект.Количество 	= КолвоБалок2;
		СтрокаКомплект.Вес 			= ВесБалки2;
		СтрокаКомплект.Ключ			= Ключ2;
		СтрокаКомплект.Покрытие 	= БалкаТипОкраски1;
		СтрокаКомплект.ЕдиницаИзмерения = "шт";
		СтрокаКомплект.Грузоподъемность = БалкаГрузоподъемность2;
	  
	КонецЕсли;
	
КонецПроцедуры//ПодобратьБалкиНаСервере	

&НаСервере
Процедура ПодобратьНастилНаСервере() 
	
	Если ВидНастила = "Без настила" Тогда 
		Возврат;
	КонецЕсли;	
	//ДобавкаВеса=0;
	Если ВидНастила = "Фанера" Тогда
		НаименованиеНастила = "Настил СЕТ фанерный";
	ИначеЕсли ВидНастила = "Металл СЕТП" Тогда
		НаименованиеНастила = "Настил СЕТП металлический";
	//	ДобавкаВеса=6.28/100000*(НастилШирина+85)+6.28/100000*(НастилДлина+31);
	ИначеЕсли ВидНастила = "Металл СЕТО" Тогда
		НаименованиеНастила = "Настил СЕТО металлический";
	//	ДобавкаВеса=6.28/100000*(НастилШирина+87)+6.28/100000*(НастилДлина+10);
	Иначе//Если ВидНастила = "Сетка" Тогда
		НаименованиеНастила = "Настил СЕТП пешеходный";
	КонецЕсли;                                                                          
	
	Ключ = СокрЛП(Новый УникальныйИдентификатор);
	
	ПлощНастила = НастилДлина*НастилШирина/1000000*НастилКоличество;
	
	//Если ВидНастила = "Фанера" Тогда  
	//	Если (РамаГлубинаСтеллажа > 0) и (РамаГлубинаСтеллажа <= 800)  Тогда
	//		КолФанеры1 = 0;
	//		КолФанеры2 = 0;
	//		
	//		Если БалкаДлина1 <= 1530 Тогда
	//			КолФанеры1 = 1;
	//		ИначеЕсли  (БалкаДлина1 > 1530) и (БалкаДлина1 <= 3000)  Тогда
	//			КолФанеры1 = 2;
	//		КонецЕсли;  
	//		
	//		Если БалкаДлина2 <= 1530 Тогда
	//			КолФанеры2 = 1;
	//		ИначеЕсли  (БалкаДлина2 > 1530) и (БалкаДлина2 <= 3000)  Тогда
	//			КолФанеры2 = 2;
	//		КонецЕсли;  
	//		
	//		ПлощНастила = (СекцииКоличествоПолок * СекцииКоличествоПролетов1 * КолФанеры1)  
	//					+ (СекцииКоличествоПолок * СекцииКоличествоПролетов2 * КолФанеры2);
	//	КонецЕсли;
	//	
	//Иначе//Если ВидНастила = "Металл" ИЛИ ВидНастила = "Сетка" Тогда
	//	ПлощНастила = (РамаГлубинаСтеллажа * СекцииКоличествоПолок / 1000000) 
	//				* ((БалкаДлина1 * СекцииКоличествоПролетов1) + (БалкаДлина2 * СекцииКоличествоПролетов2));		
	//КонецЕсли;	    		 
	
	ЕстьНеНайденныеКомплектующие = Ложь;
	Если НЕ ДобавитьКомплектующую(НаименованиеНастила, НастилДлина*НастилШирина/1000000, Ключ) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
	КонецЕсли;	

	Если ЕстьНеНайденныеКомплектующие Тогда
		Возврат;
	КонецЕсли;
	
	ВесНастила = 0;
	
	СтрокиКомплектующие = Комплектующие.НайтиСтроки(Новый Структура("ВнешнийКлюч", Ключ));
	
	Для каждого СтрокаКомплектующая Из СтрокиКомплектующие Цикл
		ВесНастила = ВесНастила + СтрокаКомплектующая.Вес;
	КонецЦикла;	
	
	СтрокаКомплект = Объект.Товары.Добавить();
	СтрокаКомплект.Наименование = НаименованиеНастила + " " + формат(НастилДлина,"ЧГ=0") +"/"+формат(НастилШирина,"ЧГ=0");
	СтрокаКомплект.Количество 	= НастилКоличество;
	СтрокаКомплект.Вес 			= ВесНастила;
	СтрокаКомплект.Ключ 		= Ключ;
	СтрокаКомплект.ЕдиницаИзмерения = "кв. м.";
		
КонецПроцедуры//ПодобратьНастилНаСервере	

&НаСервере
Процедура ПодобратьПрофильНаСервере() 
	
	Если ПрофильРасчитывать = Ложь Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ПрофильТолщина = "2.0" Тогда
	НаименованиеПрофиля = "Профиль СЕТО (2.0) несущий";
	Иначе НаименованиеПрофиля = "Профиль СЕТО (1.5) несущий";
	КонецЕсли;
	
	Ключ = СокрЛП(Новый УникальныйИдентификатор);
	Если ПрофильШаг=0 тогда 
		ПрофильШаг = РамаГлубинаСтеллажа;
	КонецЕсли;
	Если ПрофильКоличество=0 Тогда
		ПрофильКоличество=1;
	КонецЕсли;
	Если ПрофильДлина=0 тогда 
		Возврат;
	КонецЕсли;
	Если ПрофильТолщина="" тогда 
		ПрофильТолщина="1.5";
		Возврат;
	КонецЕсли;
	
	
	ЕстьНеНайденныеКомплектующие = Ложь;
	Если НЕ ДобавитьКомплектующую(НаименованиеПрофиля, ПрофильДлина/1000, Ключ) Тогда
		ЕстьНеНайденныеКомплектующие = Истина;
	КонецЕсли;	

	Если ЕстьНеНайденныеКомплектующие Тогда
		Возврат;
	КонецЕсли;
	
	ВесПрофиля = 0;
	
	СтрокиКомплектующие = Комплектующие.НайтиСтроки(Новый Структура("ВнешнийКлюч", Ключ));
	
	Для каждого СтрокаКомплектующая Из СтрокиКомплектующие Цикл
		ВесПрофиля = ВесПрофиля + СтрокаКомплектующая.Вес;
	КонецЦикла;	
	НаименованиеПрофиля = "Профиль СЕТО " + формат(ПрофильДлина,"ЧГ=0") + " ("+ПрофильТолщина+") несущий (шаг "+формат(ПрофильШаг,"ЧГ=0")+")";
	СтрокаКомплект = Объект.Товары.Добавить();
	СтрокаКомплект.Наименование = НаименованиеПрофиля;
	СтрокаКомплект.Количество 	= ПрофильКоличество;
	СтрокаКомплект.Вес 			= ВесПрофиля;
	СтрокаКомплект.Ключ 		= Ключ;
	СтрокаКомплект.ЕдиницаИзмерения = "м.";
		
КонецПроцедуры//ПодобратьНастилНаСервере	


&НаСервере
Процедура ПодобратьПластиныНаСервере()
	
	Если НЕ УслугиКреплениеКПолу Тогда
		Возврат;
	КонецЕсли;	
	
	Ключ = СокрЛП(Новый УникальныйИдентификатор);
	
	КолвоРам = СекцииКоличествоПролетов1 + СекцииКоличествоПролетов2 + 1;
	КолвоБолтов = КолвоРам * 2;
	КолвоПластин = КолвоРам * 2;
	
	Если РамаПрофильСтойки = "70" Тогда
		НаименованиеПластины = "Выравнивающая пластина СЕТО 80/90";
	ИначеЕсли РамаПрофильСтойки = "85" Тогда
		НаименованиеПластины = "Выравнивающая пластина СЕТО 125/140";
	ИначеЕсли РамаПрофильСтойки = "100" Тогда
		НаименованиеПластины = "Выравнивающая пластина СЕТО 140/150";
	Иначе//Если РамаПрофильСтойки = "130" Тогда
		НаименованиеПластины = "Выравнивающая пластина СЕТО 155/155";
	КонецЕсли;
	
	ЕстьНеНайданныеКомплектующие = Ложь;
	
	Если НЕ ДобавитьКомплектующую(НаименованиеПластины, 1, Ключ) Тогда
		ЕстьНеНайданныеКомплектующие = Истина;
	КонецЕсли;	
	
	ВесПластин = 0;
	СтрокиКомплектующие = Комплектующие.НайтиСтроки(Новый Структура("ВнешнийКлюч", Ключ));
	
	Для каждого СтрокаКомплектующая Из СтрокиКомплектующие Цикл
		ВесПластин = ВесПластин + СтрокаКомплектующая.Вес;
	КонецЦикла;	
	
	СтрокаКомплект = Объект.Товары.Добавить();
	СтрокаКомплект.Наименование = НаименованиеПластины;
	СтрокаКомплект.Количество 	= КолвоПластин;
	СтрокаКомплект.Вес 			= ВесПластин;
	СтрокаКомплект.Ключ 		= Ключ;
	СтрокаКомплект.ЕдиницаИзмерения = "шт";
	СтрокаКомплект.Номенклатура	= Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеПластины);
	
	Ключ = СокрЛП(Новый УникальныйИдентификатор);
	
	ЕстьНеНайданныеКомплектующие = Ложь;
	
	Если НЕ ДобавитьКомплектующую("12х100 анкер-болт с гайкой", 1, Ключ) Тогда
		ЕстьНеНайданныеКомплектующие = Истина;
	КонецЕсли;
	
	ВесАнкерБолтов = 0;
	СтрокиКомплектующие = Комплектующие.НайтиСтроки(Новый Структура("ВнешнийКлюч", Ключ));
	
	Для каждого СтрокаКомплектующая Из СтрокиКомплектующие Цикл
		ВесАнкерБолтов = ВесАнкерБолтов + СтрокаКомплектующая.Вес;
	КонецЦикла;	
	
	СтрокаКомплект = Объект.Товары.Добавить();
	СтрокаКомплект.Наименование = "12х100 анкер-болт с гайкой";
	СтрокаКомплект.Количество 	= КолвоБолтов;
	СтрокаКомплект.Вес 			= ВесАнкерБолтов;
	СтрокаКомплект.Ключ 		= Ключ;
	СтрокаКомплект.ЕдиницаИзмерения = "шт";
	СтрокаКомплект.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(СтрокаКомплект.Наименование); 
		
КонецПроцедуры//ПодобратьПластиныНаСервере	

&НаСервере
Процедура ЗаполнитьЦеныСуммы()
	
	Если Не ЗначениеЗаполнено(ВидЦены) Тогда
		Сообщить("Укажите вид цен. Цены не будут рассчитаны автоматически!");
		Возврат;
	КонецЕсли;
	
	// Определим товар, чтобы знать, надо ли считать коэффициент при длине балки больше 2700
	ТЗТоваров = Объект.Товары.Выгрузить();
	СтруктураКоэффициентовНаценки = КоэффициентыНаценки();
	//
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаЦен,
	|			ВидЦены = &ВидЦены
	|				И Номенклатура В (&СписокКомплектующих)) КАК ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("ДатаЦен", КонецДня(НаДату));
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("СписокКомплектующих", Комплектующие.Выгрузить(,"Номенклатура"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокиКомплектующие = Комплектующие.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Номенклатура));
		Для каждого СтрокаКомплектующая Из СтрокиКомплектующие Цикл
			//
			стТЗ = ТЗТоваров.Найти(СтрокаКомплектующая.ВнешнийКлюч);
			Если стТЗ = неопределено тогда продолжить конецесли;
			Наименование = стТЗ.Наименование;
			//
			КоэффициентНаценки = 1;
			Если Найти(СтрокаКомплектующая.НаименованиеНоменклатуры, "Балка")>0 тогда
				СтруктураДлинаГрузоподъемность = СтруктураПараметровБалок();
				Если Найти(Наименование, СтруктураДлинаГрузоподъемность.Балка1) > 0 тогда
					КоэффициентНаценки = СтруктураКоэффициентовНаценки.Балка1;
				ИначеЕсли Найти(Наименование, СтруктураДлинаГрузоподъемность.Балка2) > 0 тогда
					КоэффициентНаценки = СтруктураКоэффициентовНаценки.Балка2;
				КонецЕсли;
			КонецЕсли;
			//
			СтрокаКомплектующая.Цена = Выборка.Цена*КоэффициентНаценки;
			СтрокаКомплектующая.Сумма = СтрокаКомплектующая.Цена * СтрокаКомплектующая.Количество;
		КонецЦикла;	
	КонецЦикла;	
	
	// проверяем нулевые цены комплектующих
	Для каждого СтрокаКомплектующая Из Комплектующие Цикл
		Если СтрокаКомплектующая["Цена"] = 0 тогда
			СтрокаКомплектующая["Цена"] = ЦенаКомплектующего(СтрокаКомплектующая["НаименованиеНоменклатуры"]);
			СтрокаКомплектующая["Сумма"] = СтрокаКомплектующая["Цена"]*СтрокаКомплектующая["Количество"];
		КонецЕсли;
	Конеццикла;
	
	// теперь надо рассчитать цену комплектов
	Для каждого СтрокаКомплект из Объект.Товары Цикл
		СтрокиКомплектующие = Комплектующие.НайтиСтроки(Новый Структура("ВнешнийКлюч", СтрокаКомплект.Ключ));
		//ГТС 18.01 изменение расчета цен-сумм
		СтрокаКомплект.Цена=0;
		СтрокаКомплект.Сумма = 0;
		Для каждого СтрокаКомплектующая Из СтрокиКомплектующие Цикл
			СтрокаКомплект.Цена = СтрокаКомплект.Цена + СтрокаКомплектующая.Сумма;
		КонецЦикла;	
		СтрокаКомплект.Цена = Окр(СтрокаКомплект.Цена);
		СтрокаКомплект.Сумма = Окр(СтрокаКомплект.Цена * СтрокаКомплект.Количество,0);
	КонецЦикла;
	
	СуммаТоваров = Объект.Товары.Итог("Сумма");
	
	// расчет услуг
	Если УслугиНеобходимаСборкаИУстановкаСтеллажей и УслугиПроцентСборкаИУстановкаСтеллажей <> 0 Тогда
		СтрокаУслуга = Объект.Товары.Добавить();
		СтрокаУслуга.Наименование = "Услуги по сборке и установке стеллажей";
		СтрокаУслуга.Количество = УслугиПроцентСборкаИУстановкаСтеллажей;
		СтрокаУслуга.ЕдиницаИзмерения = "%";
		СтрокаУслуга.Сумма = Окр(СуммаТоваров * УслугиПроцентСборкаИУстановкаСтеллажей / 100, 0);
		СуммаТоваров = СуммаТоваров + Окр(СуммаТоваров * УслугиПроцентСборкаИУстановкаСтеллажей / 100, 0);
	КонецЕсли;
	
	// расчет скидки
	Если УслугиПредоставитьСкидки и УслугиПроцентСкидки <> 0 Тогда
		СтрокаУслуга = Объект.Товары.Добавить();
		СтрокаУслуга.Наименование = ?(УслугиПроцентСкидки > 0 ,"Скидка", "Наценка");
		СтрокаУслуга.Количество = ?(УслугиПроцентСкидки > 0, УслугиПроцентСкидки, -УслугиПроцентСкидки);
		СтрокаУслуга.ЕдиницаИзмерения = "%";
		СтрокаУслуга.Сумма = -Окр(СуммаТоваров * УслугиПроцентСкидки / 100, 0);
	КонецЕсли;	
	
КонецПроцедуры//ЗаполнитьЦеныСуммы	

&НаСервере
Функция НайтиНоменклатуруПоНаименованиюНаСервере(НаименованиеЭлемента)
	
	//Спр = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеЭлемента, Истина);
	//Если Спр.Пустая() И ДобавлятьЕслиНеНайден Тогда
	//	ВидНом = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товар (пр. ТМЦ)", Истина);
	//	Если ВидНом.Пустая() Тогда
	//		обВидНом = Справочники.ВидыНоменклатуры.СоздатьЭлемент();
	//		обВидНом.Наименование = "Товар (пр. ТМЦ)";
	//		обВидНом.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
	//		обВидНом.Записать();
	//	КонецЕсли;
	//	
	//	обСпр = Справочники.Номенклатура.СоздатьЭлемент();
	//	обСпр.Наименование 			= НаименованиеЭлемента;
	//	обСпр.НаименованиеПолное 	= НаименованиеЭлемента;
	//	обСпр.ЕдиницаИзмерения 		= Справочники.ЕдиницыИзмерения.НайтиПоКоду("796"); //шт
	//	обСпр.СтавкаНДС 			= Перечисления.СтавкиНДС.НДС18;
	//	обСпр.ТипНоменклатуры		= Перечисления.ТипыНоменклатуры.Товар;
	//	обСпр.ВидНоменклатуры		= ВидНом;
	//	обСпр.Записать();
	//	Спр = обСпр.Ссылка; 
	//КонецЕсли;
	
	//Возврат Спр;
	Возврат Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеЭлемента, Истина);
	
КонецФункции //НайтиНоменклатуруПоНаименованиюНаСервере

&НаСервере
Функция НайтиБалкуПоСпецНаименованиюНаСервере(НаименованиеЭлемента)
	
	Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Наименование ПОДОБНО &Наименование";
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Наименование", НаименованиеЭлемента);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	возврат Выборка.Ссылка;
	
КонецФункции

&НаСервере
Функция ДобавитьКомплектующую(Наименование, Колво, Ключ)
	
	Комплектующая = НайтиНоменклатуруПоНаименованиюНаСервере(Наименование);
	Если Комплектующая.Пустая() Тогда
		Сообщить("Не найдена комплектующая: " + Наименование);
		Возврат Ложь;	
	КонецЕсли;
	
	Если Колво = 0 Тогда
		Возврат Истина;
	КонецЕсли;	
		
	СтрокаКомплектующая = Комплектующие.Добавить();
	СтрокаКомплектующая.Номенклатура 				= Комплектующая;
	СтрокаКомплектующая.НаименованиеНоменклатуры 	= Комплектующая.Наименование;
	СтрокаКомплектующая.Количество 					= Колво;
	СтрокаКомплектующая.Вес 						= СтрокаКомплектующая.Номенклатура.ВесЧислитель/?(ЗначениеЗаполнено(СтрокаКомплектующая.Номенклатура.ВесЗнаменатель),СтрокаКомплектующая.Номенклатура.ВесЗнаменатель,1) * Колво;
	СтрокаКомплектующая.ВнешнийКлюч 				= Ключ;
	
	Возврат Истина;
	
КонецФункции//ДобавитьКомплектующую	

&НаСервере
Функция СформироватьРасчетныйЛистНаСервере()
	
	ДлинаСталлажа = 0;
	КолвоУровнейВПролете = 0;
	
	Для Каждого РезультатРасчета Из РезультатыРасчета Цикл
		Если РезультатРасчета.Параметр = "ДлинаСтеллажа" Тогда
			ДлинаСталлажа = РезультатРасчета.Значение;
		ИначеЕсли РезультатРасчета.Параметр = "КолвоУровнейВПролете" Тогда
			КолвоУровнейВПролете = РезультатРасчета.Значение;
		КонецЕсли;	
	КонецЦикла;
	
	Макет = Обработки.РасчетСтеллажейПодЕвроподдоныНовая.ПолучитьМакет("РасчетныйЛист");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьСкидка = Макет.ПолучитьОбласть("Скидка");
	ОбластьСборка = Макет.ПолучитьОбласть("Сборка");
	ОбластьВсего = Макет.ПолучитьОбласть("Всего");
	
	ОбластьШапка2 = Макет.ПолучитьОбласть("Шапка2");
	ОбластьСтрока2 = Макет.ПолучитьОбласть("Строка2");
	ОбластьСтрока3 = Макет.ПолучитьОбласть("Строка3");
	
	ТабДок = Новый ТабличныйДокумент;
	
	ОбластьШапка.Параметры.ПредставлениеАвтора = СокрЛП(ПараметрыСеанса.ТекущийПользователь.Наименование);
	ОбластьШапка.Параметры.ТелефонАвтора = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПараметрыСеанса.ТекущийПользователь, Справочники.ВидыКонтактнойИнформации.ТелефонПользователя);
	ОбластьШапка.Параметры.ЭлПочтаАвтора = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ПараметрыСеанса.ТекущийПользователь, Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	ОбластьШапка.Параметры.ДатаРасчета = Формат(НаДату, "ДФ=; ДЛФ=DD");
	
	
	ОбластьШапка.Параметры.ПараметрыСтеллажа = "Высота стеллажа: " + РамаВысотаСтеллажа + " мм		Длина стеллажа: " + ДлинаСталлажа + " мм		Глубина стеллажа: " + РамаГлубинаСтеллажа + " мм";
	ОбластьШапка.Параметры.ПараметрыПролета = "Кол-во уровней в пролете: " + КолвоУровнейВПролете + " шт		Высота пролета: " + СекцииВысотаПролета + " мм		Превышение рамы: " + СекцииПревышениеРамы + " мм";
	
	ТабДок.Вывести(ОбластьШапка);
	ВесИтого = 0;
	Для каждого СтрокаТовары Из Объект.Товары Цикл
		ОбластьСтрока.Параметры.Заполнить(СтрокаТовары);
		ВесИтого = ВесИтого + (СтрокаТовары.Количество * СтрокаТовары.Вес);
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ОбластьИтого.Параметры.ВесИтого = ВесИтого;
	ОбластьИтого.Параметры.СуммаИтого = Объект.Товары.Итог("Сумма");
	ТабДок.Вывести(ОбластьИтого);
	
	ТабДок.Вывести(ОбластьШапка2);
	
	Если СекцииКоличествоПролетов2 = 0 Тогда
		
		КолвоПоддоновВСекции =Цел(БалкаДлина1/900)*СекцииКоличествоПолок + ?(БудутСтавитьПоддоныНаПол,Цел(БалкаДлина1/900),0);
		ОбластьСтрока2.Параметры.ДлинаСекции = БалкаДлина1;
		ОбластьСтрока2.Параметры.КолвоСекций = СекцииКоличествоПролетов1;
		ОбластьСтрока2.Параметры.КолвоПоддоновВСекции = КолвоПоддоновВСекции;
		ОбластьСтрока2.Параметры.КолвоПоддоновВСтелаже = КолвоПоддоновВСекции * СекцииКоличествоПролетов1;
		ОбластьСтрока2.Параметры.ЦенаПоддономеста = ?(ОбластьСтрока2.Параметры.КолвоПоддоновВСтелаже = 0, 0, Объект.Товары.Итог("Сумма") / ОбластьСтрока2.Параметры.КолвоПоддоновВСтелаже);
		ТабДок.Вывести(ОбластьСтрока2); 
		
	Иначе	
		КолвоПоддоновВСекции1 = Цел(БалкаДлина1/900)*СекцииКоличествоПолок + ?(БудутСтавитьПоддоныНаПол, Цел(БалкаДлина1/900),0);
		ОбластьСтрока3.Параметры.ДлинаСекции1 = БалкаДлина1;
		ОбластьСтрока3.Параметры.КолвоСекций1 = СекцииКоличествоПролетов1;
		ОбластьСтрока3.Параметры.КолвоПоддоновВСекции1 = КолвоПоддоновВСекции1;
		
		КолвоПоддоновВСекции2 = Цел(БалкаДлина2/900)*СекцииКоличествоПолок + ?(БудутСтавитьПоддоныНаПол, Цел(БалкаДлина2/900), 0);
		ОбластьСтрока3.Параметры.ДлинаСекции2 = БалкаДлина2;
		ОбластьСтрока3.Параметры.КолвоСекций2 = СекцииКоличествоПролетов2;
		ОбластьСтрока3.Параметры.КолвоПоддоновВСекции2 = КолвоПоддоновВСекции2;
		
		ОбластьСтрока3.Параметры.КолвоПоддоновВСтелаже = (КолвоПоддоновВСекции1 * СекцииКоличествоПролетов1) + (КолвоПоддоновВСекции2 * СекцииКоличествоПролетов2);
		
		ОбластьСтрока3.Параметры.ЦенаПоддономеста = ?(ОбластьСтрока3.Параметры.КолвоПоддоновВСтелаже = 0, 0, Объект.Товары.Итог("Сумма") / ОбластьСтрока3.Параметры.КолвоПоддоновВСтелаже);
		ТабДок.Вывести(ОбластьСтрока3); 
		
	КонецЕсли;
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция СформироватьНагрузкиНаСервере()
	
	Макет = Обработки.РасчетСтеллажейПодЕвроподдоныНовая.ПолучитьМакет("Нагрузки");
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Вывести(Макет.ПолучитьОбласть("Основная"));
	Возврат ТабДок;
	
КонецФункции//СформироватьНагрузкиНаСервере	

&НаСервере
Функция СформироватьПрайсЛистНаСервере()
	
	ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Цена продажи");
	
	СписокНоменклатуры = Новый СписокЗначений;
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Балка СЕТП (120.1.5)",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Балка СЕТП (120.2.0)",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Балка СЕТП (120.2.5)",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Зацеп СЕТП (120)",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Зацеп СЕТБ (120)",Истина));
	
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Балка СЕТП (150.2.0)",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Балка СЕТП (150.2.5)",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Балка СЕТП (150.3.0)",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Зацеп СЕТП (150)",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Зацеп СЕТБ (150)",Истина));
	
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Балка СЕТП (180.2.5)",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Балка СЕТП (180.3.0)",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Зацеп СЕТП (180)",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Зацеп СЕТБ (180)",Истина));
	
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Фиксатор СЕТ",Истина));
	
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Винт М8х55",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Втулка 20",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Шайба спец.овал.6вэ.73.334.01",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Болт М8х35",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Втулка М8",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Гайка М8",Истина));
	
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Раскос СЕТО (100.1.5)",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Подпятник СЕТП, СЕТО 80х90",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Стойка СЕТО (70.1.5)",Истина));
	
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Стойка СЕТО (70.2.0)",Истина));
	
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Подпятник СЕТП, СЕТО 140х150",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Стойка СЕТО (100.1.5)",Истина));
	
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Стойка СЕТО (100.2.0)",Истина));
	
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Подпятник СЕТП, СЕТО 155х155",Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Стойка СЕТО (130.1.5)",Истина));
	
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Стойка СЕТО (130.2.0)",Истина));
	
	ЗапросЦены = Новый Запрос;
	ЗапросЦены.Текст =
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Наименование КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаРасчета,
	|			ВидЦены = &ВидЦены
	|				И Номенклатура В (&СписокНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних";
	ЗапросЦены.УстановитьПараметр("ДатаРасчета"	, КонецДня(НаДату));
	ЗапросЦены.УстановитьПараметр("ВидЦены"		, ВидЦены);
	ЗапросЦены.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	ТЗ_Цены = ЗапросЦены.Выполнить().Выгрузить();
	
	Для Каждого СтрокаСписка Из СписокНоменклатуры Цикл
		Стр = ТЗ_Цены.Найти(СтрокаСписка.Значение, "Номенклатура");
		Если Стр = Неопределено Тогда
			Стр = ТЗ_Цены.Добавить();
			Стр.Номенклатура = СтрокаСписка.Значение;
			Стр.Цена = 0;
		КонецЕсли;
	КонецЦикла;	
	
	Макет = Обработки.РасчетСтеллажейПодЕвроподдоныНовая.ПолучитьМакет("Прайс");
	ОбластьШапкаБалки = Макет.ПолучитьОбласть("ШапкаБалки");
	ОбластьШапкаБалки.Параметры.Дата=Формат(ТекущаяДата(), "ДФ=d.MM.yyyy");
	ОбластьШапкаТаблицыБалки = Макет.ПолучитьОбласть("ШапкаТаблицыБалки");
	ОбластьСтрокаТаблицыБалки = Макет.ПолучитьОбласть("СтрокаТаблицыБалки");
	ОбластьПодвалБалки = Макет.ПолучитьОбласть("ПодвалБалки");
	
	ТЗ_Балки = Новый ТаблицаЗначений;
	ТЗ_Балки.Колонки.Добавить("Представление");
	ТЗ_Балки.Колонки.Добавить("гр_1800");
	ТЗ_Балки.Колонки.Добавить("гр_2200");
	ТЗ_Балки.Колонки.Добавить("гр_2700");
	ТЗ_Балки.Колонки.Добавить("гр_3300");
	ТЗ_Балки.Колонки.Добавить("гр_3600");
	ТЗ_Балки.Колонки.Добавить("гр_4000");
	
	ТЗ_Балки.Колонки.Добавить("ц_1800");
	ТЗ_Балки.Колонки.Добавить("ц_2200");
	ТЗ_Балки.Колонки.Добавить("ц_2700");
	ТЗ_Балки.Колонки.Добавить("ц_3300");
	ТЗ_Балки.Колонки.Добавить("ц_3600");
	ТЗ_Балки.Колонки.Добавить("ц_4000");
	
	СЗ_Представления = Новый СписокЗначений;
	
	СЗ_Представления.Добавить("120х60х1.5 (120.1.5.272)","120;1.5");			
	СЗ_Представления.Добавить("120х60х2 (120.2.0.272)","120;2.0");			
	СЗ_Представления.Добавить("120х60х2.5 (120.2.5.272)","120;2.5");			
	СЗ_Представления.Добавить("150х60х2 (150.2.0.299)","150;2.0");			
	СЗ_Представления.Добавить("150х60х2.5 (150.2.5.299)","150;2.5");			
	СЗ_Представления.Добавить("150х60х3 (150.3.0.299)","150;3.0");			
	СЗ_Представления.Добавить("180х70х2.5 (180.2.5.366)","180;2.5");			
	СЗ_Представления.Добавить("180х70х3  (180.3.0.366)","180;3.0");			
	
	НаимБалки = "";
	ЦенаБалки = 0;
	НаимЗацепа = "";
	ЦенаЗацепа = 0;
	НаимФиксатора = "Фиксатор СЕТ";
	СтрокаЦены = ТЗ_Цены.Найти(НаимФиксатора, "Номенклатура");
	ЦенаФиксатора = СтрокаЦены.Цена;
	
	Для каждого ЭлементПредставления Из СЗ_Представления Цикл
		
		ВысотаПрофиля = Лев(ЭлементПредставления.Представление, 3);
		ТолщинаМеталла = Прав(ЭлементПредставления.Представление, 3);
		
		Если НаимБалки <> "Балка СЕТП (" + ВысотаПрофиля + "." + ТолщинаМеталла + ")" Тогда
			СтрокаЦены = ТЗ_Цены.Найти("Балка СЕТП (" + ВысотаПрофиля + "." + ТолщинаМеталла + ")", "Номенклатура");
			ЦенаБалки = СтрокаЦены.Цена;	
		КонецЕсли;
		
		Если НаимЗацепа <> "Зацеп СЕТП (" + ВысотаПрофиля + ")" Тогда
			СтрокаЦены = ТЗ_Цены.Найти("Зацеп СЕТП (" + ВысотаПрофиля + ")", "Номенклатура");
			ЦенаЗацепа = СтрокаЦены.Цена;	
		КонецЕсли;
		
		СтрокаБалки = ТЗ_Балки.Добавить();
		СтрокаБалки.Представление = ЭлементПредставления.Значение;
		
		СтрокаБалки.гр_1800 = ПолучитьГрузоподъемностьБалкиНаСервере(1800, ВысотаПрофиля, ТолщинаМеталла);
		СтрокаБалки.гр_2200 = ПолучитьГрузоподъемностьБалкиНаСервере(2200, ВысотаПрофиля, ТолщинаМеталла);
		СтрокаБалки.гр_2700 = ПолучитьГрузоподъемностьБалкиНаСервере(2700, ВысотаПрофиля, ТолщинаМеталла);
		СтрокаБалки.гр_3300 = ПолучитьГрузоподъемностьБалкиНаСервере(3300, ВысотаПрофиля, ТолщинаМеталла);
		СтрокаБалки.гр_3600 = ПолучитьГрузоподъемностьБалкиНаСервере(3600, ВысотаПрофиля, ТолщинаМеталла);
		СтрокаБалки.гр_4000 = ПолучитьГрузоподъемностьБалкиНаСервере(4000, ВысотаПрофиля, ТолщинаМеталла);
		
		ДопЦена = ЦенаЗацепа + ЦенаФиксатора*2;
		
		СтрокаБалки.ц_1800 = Окр(ЦенаБалки*1.8 + ДопЦена);
		СтрокаБалки.ц_2200 = Окр(ЦенаБалки*2.2 + ДопЦена);
		СтрокаБалки.ц_2700 = Окр(ЦенаБалки*2.7 + ДопЦена);
		СтрокаБалки.ц_3300 = Окр(ЦенаБалки*3.3 + ДопЦена);
		СтрокаБалки.ц_3600 = Окр(ЦенаБалки*3.6 + ДопЦена);
		СтрокаБалки.ц_4000 = Окр(ЦенаБалки*4 + ДопЦена);
		
		НаимБалки = "Балка СЕТП (" + ВысотаПрофиля + "." + ТолщинаМеталла + ")";
		НаимЗацепа = "Зацеп СЕТП (" + ВысотаПрофиля + ")";
	КонецЦикла;	
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Вывести(ОбластьШапкаБалки);
	
	ВысотаШапки = ТабДок.ВысотаТаблицы;
	
	ОбластьШапкаТаблицыБалки.Параметры.НаименованиеТаблицы = "Таблица максимальных равномерно-распределенных нагрузок на пару балок";
	ОбластьШапкаТаблицыБалки.Параметры.НаименованиеПараметраБалки = "ГРУЗОПОДЪЕМНОСТЬ ПАРЫ БАЛОК, КГ";
	ТабДок.Вывести(ОбластьШапкаТаблицыБалки);
	
	Для каждого СтрокаБалки Из ТЗ_Балки Цикл
		ОбластьСтрокаТаблицыБалки.Параметры.Балка = СтрокаБалки.Представление;
		ОбластьСтрокаТаблицыБалки.Параметры.Зн_1800 = СтрокаБалки.гр_1800;
		ОбластьСтрокаТаблицыБалки.Параметры.Зн_2200 = СтрокаБалки.гр_2200;	
		ОбластьСтрокаТаблицыБалки.Параметры.Зн_2700 = СтрокаБалки.гр_2700;	
		ОбластьСтрокаТаблицыБалки.Параметры.Зн_3300 = СтрокаБалки.гр_3300;	
		ОбластьСтрокаТаблицыБалки.Параметры.Зн_3600 = СтрокаБалки.гр_3600;	
		ОбластьСтрокаТаблицыБалки.Параметры.Зн_4000 = СтрокаБалки.гр_4000;	
		ТабДок.Вывести(ОбластьСтрокаТаблицыБалки);
	КонецЦикла;	
	
	ТабДок.Область(ВысотаШапки + 4,2,ТабДок.ВысотаТаблицы,2).Объединить();
	
	ВысотаШапки = ТабДок.ВысотаТаблицы;
	
	ОбластьШапкаТаблицыБалки.Параметры.НаименованиеТаблицы = "Таблица цен балок, окрашенных полимерным покрытием оранжевого цвета";
	ОбластьШапкаТаблицыБалки.Параметры.НаименованиеПараметраБалки = "ЦЕНА, руб. (за 1 штуку)";
	ТабДок.Вывести(ОбластьШапкаТаблицыБалки);
	
	Для каждого СтрокаБалки Из ТЗ_Балки Цикл
		ОбластьСтрокаТаблицыБалки.Параметры.Балка = СтрокаБалки.Представление;
		ОбластьСтрокаТаблицыБалки.Параметры.Зн_1800 = СтрокаБалки.ц_1800;
		ОбластьСтрокаТаблицыБалки.Параметры.Зн_2200 = СтрокаБалки.ц_2200;	
		ОбластьСтрокаТаблицыБалки.Параметры.Зн_2700 = СтрокаБалки.ц_2700;	
		ОбластьСтрокаТаблицыБалки.Параметры.Зн_3300 = СтрокаБалки.ц_3300;	
		ОбластьСтрокаТаблицыБалки.Параметры.Зн_3600 = СтрокаБалки.ц_3600;	
		ОбластьСтрокаТаблицыБалки.Параметры.Зн_4000 = СтрокаБалки.ц_4000;	
		ТабДок.Вывести(ОбластьСтрокаТаблицыБалки);
	КонецЦикла;	
	
	ТабДок.Область(ВысотаШапки + 4,2,ТабДок.ВысотаТаблицы,2).Объединить();
	
	ТабДок.Вывести(ОбластьПодвалБалки);
	
	
	ОбластьРамы = Макет.ПолучитьОбласть("Рамы");
	ОбластьРамы.Параметры.Дата=Формат(ТекущаяДата(), "ДФ=d.MM.yyyy");

	СтрокаЦены = ТЗ_Цены.Найти("Винт М8х55", "Номенклатура");
	ЦенаВинт = СтрокаЦены.Цена;
	
	СтрокаЦены = ТЗ_Цены.Найти("Втулка 20", "Номенклатура");
	ЦенаВтулка20 = СтрокаЦены.Цена;
	
	СтрокаЦены = ТЗ_Цены.Найти("Шайба спец.овал.6вэ.73.334.01", "Номенклатура");
	ЦенаШайба = СтрокаЦены.Цена;
	
	СтрокаЦены = ТЗ_Цены.Найти("Болт М8х35", "Номенклатура");
	ЦенаБолт = СтрокаЦены.Цена;
	
	СтрокаЦены = ТЗ_Цены.Найти("Втулка М8", "Номенклатура");
	ЦенаВтулка8 = СтрокаЦены.Цена;
	
	СтрокаЦены = ТЗ_Цены.Найти("Гайка М8", "Номенклатура");
	ЦенаГайка = СтрокаЦены.Цена;
	
	СтрокаЦены = ТЗ_Цены.Найти("Раскос СЕТО (100.1.5)", "Номенклатура");
	ЦенаРаскос = СтрокаЦены.Цена;
	
	СтрокаЦены = ТЗ_Цены.Найти("Подпятник СЕТП, СЕТО 80х90", "Номенклатура");
	ЦенаПодпятник = СтрокаЦены.Цена;
	
	СтрокаЦены = ТЗ_Цены.Найти("Стойка СЕТО (70.1.5)", "Номенклатура");
	ЦенаР = СтрокаЦены.Цена;
	
	ДопЦена = ЦенаВтулка20*4 + ЦенаПодпятник*2 + ЦенаБолт*4;
	ДопЦена1 = ЦенаВтулка20*2 + ЦенаПодпятник*2 + ЦенаБолт*4;
	
	ОбщЦенаКрепежа = ЦенаВинт*8 + ЦенаШайба*24 + ЦенаГайка*12 + ДопЦена;
	ОбщЦенаРаскосов = 6.992*ЦенаРаскос;
	ОбластьРамы.Параметры.р1 = Окр(ЦенаР*6 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*9 + ЦенаШайба*26 + ЦенаГайка*13 + ДопЦена;
	ОбщЦенаРаскосов = 8.212*ЦенаРаскос;	
	ОбластьРамы.Параметры.р2 = Окр(ЦенаР*7 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);

	ОбщЦенаКрепежа = ЦенаВинт*10 + ЦенаШайба*28 + ЦенаГайка*14 + ДопЦена;
	ОбщЦенаРаскосов = 9.432*ЦенаРаскос;		
	ОбластьРамы.Параметры.р3 = Окр(ЦенаР*8 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*11 + ЦенаШайба*30 + ЦенаГайка*15 + ДопЦена;
	ОбщЦенаРаскосов = 10.652*ЦенаРаскос;	
	ОбластьРамы.Параметры.р4 = Окр(ЦенаР*9 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*11 + ЦенаШайба*30 + ЦенаГайка*15 + ДопЦена1;
	ОбщЦенаРаскосов = 11.872*ЦенаРаскос;	
	ОбластьРамы.Параметры.р5 = Окр(ЦенаР*10 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*12 + ЦенаШайба*32 + ЦенаГайка*16 + ДопЦена;
	ОбщЦенаРаскосов = 11.872*ЦенаРаскос;	
	ОбластьРамы.Параметры.р6 = Окр(ЦенаР*11 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*13 + ЦенаШайба*34 + ЦенаГайка*17 + ДопЦена;
	ОбщЦенаРаскосов = 13.092*ЦенаРаскос;	
	ОбластьРамы.Параметры.р7 = Окр(ЦенаР*12 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*14 + ЦенаШайба*36 + ЦенаГайка*18 + ДопЦена;
	ОбщЦенаРаскосов = 14.312*ЦенаРаскос;	
	ОбластьРамы.Параметры.р8 = Окр(ЦенаР*13 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*15 + ЦенаШайба*38 + ЦенаГайка*19 + ДопЦена;
	ОбщЦенаРаскосов = 15.532*ЦенаРаскос;
	ОбластьРамы.Параметры.р9 = Окр(ЦенаР*14 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*16 + ЦенаШайба*40 + ЦенаГайка*20 + ДопЦена;
	ОбщЦенаРаскосов = 16.752*ЦенаРаскос;
	ОбластьРамы.Параметры.р10 = Окр(ЦенаР*15 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*16 + ЦенаШайба*40 + ЦенаГайка*20 + ДопЦена1;
	ОбщЦенаРаскосов = 17.972*ЦенаРаскос;
	ОбластьРамы.Параметры.р11 = Окр(ЦенаР*16 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*17 + ЦенаШайба*42 + ЦенаГайка*21 + ДопЦена;
	ОбщЦенаРаскосов = 17.972*ЦенаРаскос;
	ОбластьРамы.Параметры.р12 = Окр(ЦенаР*17 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*18 + ЦенаШайба*44 + ЦенаГайка*22 + ДопЦена;
	ОбщЦенаРаскосов = 19.192*ЦенаРаскос;
	ОбластьРамы.Параметры.р13 = Окр(ЦенаР*18 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*19 + ЦенаШайба*46 + ЦенаГайка*23 + ДопЦена;
	ОбщЦенаРаскосов = 20.412*ЦенаРаскос;
	ОбластьРамы.Параметры.р14 = Окр(ЦенаР*19 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*20 + ЦенаШайба*48 + ЦенаГайка*24 + ДопЦена;
	ОбщЦенаРаскосов = 21.632*ЦенаРаскос;
	ОбластьРамы.Параметры.р15 = Окр(ЦенаР*20 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*21 + ЦенаШайба*50 + ЦенаГайка*25 + ДопЦена1;
	ОбщЦенаРаскосов = 24.072*ЦенаРаскос;
	ОбластьРамы.Параметры.р16 = Окр(ЦенаР*22 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*23 + ЦенаШайба*54 + ЦенаГайка*27 + ДопЦена;
	ОбщЦенаРаскосов = 25.292*ЦенаРаскос;
	ОбластьРамы.Параметры.р17 = Окр(ЦенаР*24 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);

	СтрокаЦены = ТЗ_Цены.Найти("Стойка СЕТО (70.2.0)", "Номенклатура");
	ЦенаР = СтрокаЦены.Цена;
	
	ДопЦена = ЦенаВтулка20*4 + ЦенаПодпятник*2 + ЦенаБолт*4;
	ДопЦена1 = ЦенаВтулка20*2 + ЦенаПодпятник*2 + ЦенаБолт*4;

	ОбщЦенаКрепежа = ЦенаВинт*8 + ДопЦена + ЦенаШайба*24 + ЦенаГайка*12;
	ОбщЦенаРаскосов = 6.992*ЦенаРаскос;
	ОбластьРамы.Параметры.р18 = Окр(ЦенаР*6 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*9 + ДопЦена + ЦенаШайба*26 + ЦенаГайка*13;
	ОбщЦенаРаскосов = 8.212*ЦенаРаскос;	
	ОбластьРамы.Параметры.р19 = Окр(ЦенаР*7 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*10 + ДопЦена + ЦенаШайба*28 + ЦенаГайка*14;
	ОбщЦенаРаскосов = 9.432*ЦенаРаскос;		
	ОбластьРамы.Параметры.р20 = Окр(ЦенаР*8 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*11 + ДопЦена + ЦенаШайба*30 + ЦенаГайка*15;
	ОбщЦенаРаскосов = 10.652*ЦенаРаскос;	
	ОбластьРамы.Параметры.р21 = Окр(ЦенаР*9 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*11 + ДопЦена1 + ЦенаШайба*30 + ЦенаГайка*15;
	ОбщЦенаРаскосов = 11.872*ЦенаРаскос;	
	ОбластьРамы.Параметры.р22 = Окр(ЦенаР*10 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*12 + ДопЦена + ЦенаШайба*32 + ЦенаГайка*16;
	ОбщЦенаРаскосов = 11.872*ЦенаРаскос;	
	ОбластьРамы.Параметры.р23 = Окр(ЦенаР*11 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*13 + ДопЦена + ЦенаШайба*34 + ЦенаГайка*17;
	ОбщЦенаРаскосов = 13.092*ЦенаРаскос;	
	ОбластьРамы.Параметры.р24 = Окр(ЦенаР*12 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*14 + ДопЦена + ЦенаШайба*36 + ЦенаГайка*18;
	ОбщЦенаРаскосов = 14.312*ЦенаРаскос;	
	ОбластьРамы.Параметры.р25 = Окр(ЦенаР*13 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*15 + ДопЦена + ЦенаШайба*38 + ЦенаГайка*19;
	ОбщЦенаРаскосов = 15.532*ЦенаРаскос;
	ОбластьРамы.Параметры.р26 = Окр(ЦенаР*14 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*16 + ДопЦена + ЦенаШайба*40 + ЦенаГайка*20;
	ОбщЦенаРаскосов = 16.752*ЦенаРаскос;
	ОбластьРамы.Параметры.р27 = Окр(ЦенаР*15 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*16 + ДопЦена1 + ЦенаШайба*40 + ЦенаГайка*20;
	ОбщЦенаРаскосов = 17.972*ЦенаРаскос;
	ОбластьРамы.Параметры.р28 = Окр(ЦенаР*16 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*17 + ДопЦена + ЦенаШайба*42 + ЦенаГайка*21;
	ОбщЦенаРаскосов = 17.972*ЦенаРаскос;
	ОбластьРамы.Параметры.р29 = Окр(ЦенаР*17 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*18 + ДопЦена + ЦенаШайба*44 + ЦенаГайка*22;
	ОбщЦенаРаскосов = 19.192*ЦенаРаскос;
	ОбластьРамы.Параметры.р30 = Окр(ЦенаР*18 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*19 + ДопЦена + ЦенаШайба*46 + ЦенаГайка*23;
	ОбщЦенаРаскосов = 20.412*ЦенаРаскос;
	ОбластьРамы.Параметры.р31 = Окр(ЦенаР*19 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*20 + ДопЦена + ЦенаШайба*48 + ЦенаГайка*24;
	ОбщЦенаРаскосов = 21.632*ЦенаРаскос;
	ОбластьРамы.Параметры.р32 = Окр(ЦенаР*20 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*21 + ДопЦена1 + ЦенаШайба*50 + ЦенаГайка*25;
	ОбщЦенаРаскосов = 24.072*ЦенаРаскос;
	ОбластьРамы.Параметры.р33 = Окр(ЦенаР*22 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*23 + ДопЦена + ЦенаШайба*54 + ЦенаГайка*27;
	ОбщЦенаРаскосов = 25.292*ЦенаРаскос;
	ОбластьРамы.Параметры.р34 = Окр(ЦенаР*24 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	СтрокаЦены = ТЗ_Цены.Найти("Подпятник СЕТП, СЕТО 140х150", "Номенклатура");
	ЦенаПодпятник = СтрокаЦены.Цена;
	
	СтрокаЦены = ТЗ_Цены.Найти("Стойка СЕТО (100.1.5)", "Номенклатура");
	ЦенаР = СтрокаЦены.Цена;
	
	ДопЦена = ЦенаВтулка20*4 + ЦенаПодпятник*2 + ЦенаБолт*4 + ЦенаВтулка8*4;
	ДопЦена1 = ЦенаВтулка20*2 + ЦенаПодпятник*2 + ЦенаБолт*4 + ЦенаВтулка8*4;
	
	ОбщЦенаКрепежа = ЦенаВинт*8 + ДопЦена + ЦенаШайба*24 + ЦенаГайка*12;
	ОбщЦенаРаскосов = 6.706*ЦенаРаскос;
	ОбластьРамы.Параметры.р35 = Окр(ЦенаР*6 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*9 + ДопЦена + ЦенаШайба*26 + ЦенаГайка*13;
	ОбщЦенаРаскосов = 7.881*ЦенаРаскос;	
	ОбластьРамы.Параметры.р36 = Окр(ЦенаР*7 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*10 + ДопЦена + ЦенаШайба*28 + ЦенаГайка*14;
	ОбщЦенаРаскосов = 9.056*ЦенаРаскос;		
	ОбластьРамы.Параметры.р37 = Окр(ЦенаР*8 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*11 + ДопЦена + ЦенаШайба*30 + ЦенаГайка*15;
	ОбщЦенаРаскосов = 10.231*ЦенаРаскос;	
	ОбластьРамы.Параметры.р38 = Окр(ЦенаР*9 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*11 + ДопЦена1 + ЦенаШайба*30 + ЦенаГайка*15;
	ОбщЦенаРаскосов = 11.406*ЦенаРаскос;	
	ОбластьРамы.Параметры.р39 = Окр(ЦенаР*10 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*12 + ДопЦена + ЦенаШайба*32 + ЦенаГайка*16;
	ОбщЦенаРаскосов = 11.406*ЦенаРаскос;	
	ОбластьРамы.Параметры.р40 = Окр(ЦенаР*11 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*13 + ДопЦена + ЦенаШайба*34 + ЦенаГайка*17;
	ОбщЦенаРаскосов = 12.581*ЦенаРаскос;	
	ОбластьРамы.Параметры.р41 = Окр(ЦенаР*12 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*14 + ДопЦена + ЦенаШайба*36 + ЦенаГайка*18;
	ОбщЦенаРаскосов = 13.756*ЦенаРаскос;	
	ОбластьРамы.Параметры.р42 = Окр(ЦенаР*13 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*15 + ДопЦена + ЦенаШайба*38 + ЦенаГайка*19;
	ОбщЦенаРаскосов = 14.931*ЦенаРаскос;
	ОбластьРамы.Параметры.р43 = Окр(ЦенаР*14 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*16 + ДопЦена + ЦенаШайба*40 + ЦенаГайка*20;
	ОбщЦенаРаскосов = 16.106*ЦенаРаскос;
	ОбластьРамы.Параметры.р44 = Окр(ЦенаР*15 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*16 + ДопЦена1 + ЦенаШайба*40 + ЦенаГайка*20;
	ОбщЦенаРаскосов = 17.281*ЦенаРаскос;
	ОбластьРамы.Параметры.р45 = Окр(ЦенаР*16 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*17 + ДопЦена + ЦенаШайба*42 + ЦенаГайка*21;
	ОбщЦенаРаскосов = 17.281*ЦенаРаскос;
	ОбластьРамы.Параметры.р46 = Окр(ЦенаР*17 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*18 + ДопЦена + ЦенаШайба*44 + ЦенаГайка*22;
	ОбщЦенаРаскосов = 18.456*ЦенаРаскос;
	ОбластьРамы.Параметры.р47 = Окр(ЦенаР*18 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*19 + ДопЦена + ЦенаШайба*46 + ЦенаГайка*23;
	ОбщЦенаРаскосов = 19.631*ЦенаРаскос;
	ОбластьРамы.Параметры.р48 = Окр(ЦенаР*19 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*20 + ДопЦена + ЦенаШайба*48 + ЦенаГайка*24;
	ОбщЦенаРаскосов = 20.806*ЦенаРаскос;
	ОбластьРамы.Параметры.р49 = Окр(ЦенаР*20 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*21 + ДопЦена1 + ЦенаШайба*50 + ЦенаГайка*25;
	ОбщЦенаРаскосов = 23.156*ЦенаРаскос;
	ОбластьРамы.Параметры.р50 = Окр(ЦенаР*22 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*23 + ДопЦена + ЦенаШайба*54 + ЦенаГайка*27;
	ОбщЦенаРаскосов = 24.331*ЦенаРаскос;
	ОбластьРамы.Параметры.р51 = Окр(ЦенаР*24 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
    СтрокаЦены = ТЗ_Цены.Найти("Стойка СЕТО (100.2.0)", "Номенклатура");
	ЦенаР = СтрокаЦены.Цена;
	
	ДопЦена = ЦенаВтулка20*4 + ЦенаПодпятник*2 + ЦенаБолт*4 + ЦенаВтулка8*4;
	ДопЦена1 = ЦенаВтулка20*2 + ЦенаПодпятник*2 + ЦенаБолт*4 + ЦенаВтулка8*4;
	
	ОбщЦенаКрепежа = ЦенаВинт*8 + ДопЦена + ЦенаШайба*24 + ЦенаГайка*12;
	ОбщЦенаРаскосов = 6.706*ЦенаРаскос;
	ОбластьРамы.Параметры.р52 = Окр(ЦенаР*6 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*9 + ДопЦена + ЦенаШайба*26 + ЦенаГайка*13;
	ОбщЦенаРаскосов = 7.881*ЦенаРаскос;	
	ОбластьРамы.Параметры.р53 = Окр(ЦенаР*7 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*10 + ДопЦена + ЦенаШайба*28 + ЦенаГайка*14;
	ОбщЦенаРаскосов = 9.056*ЦенаРаскос;		
	ОбластьРамы.Параметры.р54 = Окр(ЦенаР*8 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*11 + ДопЦена + ЦенаШайба*30 + ЦенаГайка*15;
	ОбщЦенаРаскосов = 10.231*ЦенаРаскос;	
	ОбластьРамы.Параметры.р55 = Окр(ЦенаР*9 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*11 + ДопЦена1 + ЦенаШайба*30 + ЦенаГайка*15;
	ОбщЦенаРаскосов = 11.406*ЦенаРаскос;	
	ОбластьРамы.Параметры.р56 = Окр(ЦенаР*10 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*12 + ДопЦена + ЦенаШайба*32 + ЦенаГайка*16;
	ОбщЦенаРаскосов = 11.406*ЦенаРаскос;	
	ОбластьРамы.Параметры.р57 = Окр(ЦенаР*11 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*13 + ДопЦена + ЦенаШайба*34 + ЦенаГайка*17;
	ОбщЦенаРаскосов = 12.581*ЦенаРаскос;	
	ОбластьРамы.Параметры.р58 = Окр(ЦенаР*12 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*14 + ДопЦена + ЦенаШайба*36 + ЦенаГайка*18;
	ОбщЦенаРаскосов = 13.756*ЦенаРаскос;	
	ОбластьРамы.Параметры.р59 = Окр(ЦенаР*13 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*15 + ДопЦена + ЦенаШайба*38 + ЦенаГайка*19;
	ОбщЦенаРаскосов = 14.931*ЦенаРаскос;
	ОбластьРамы.Параметры.р60 = Окр(ЦенаР*14 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*16 + ДопЦена + ЦенаШайба*40 + ЦенаГайка*20;
	ОбщЦенаРаскосов = 16.106*ЦенаРаскос;
	ОбластьРамы.Параметры.р61 = Окр(ЦенаР*15 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*16 + ДопЦена1 + ЦенаШайба*40 + ЦенаГайка*20;
	ОбщЦенаРаскосов = 17.281*ЦенаРаскос;
	ОбластьРамы.Параметры.р62 = Окр(ЦенаР*16 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*17 + ДопЦена + ЦенаШайба*42 + ЦенаГайка*21;
	ОбщЦенаРаскосов = 17.281*ЦенаРаскос;
	ОбластьРамы.Параметры.р63 = Окр(ЦенаР*17 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*18 + ДопЦена + ЦенаШайба*44 + ЦенаГайка*22;
	ОбщЦенаРаскосов = 18.456*ЦенаРаскос;
	ОбластьРамы.Параметры.р64 = Окр(ЦенаР*18 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*19 + ДопЦена + ЦенаШайба*46 + ЦенаГайка*23;
	ОбщЦенаРаскосов = 19.631*ЦенаРаскос;
	ОбластьРамы.Параметры.р65 = Окр(ЦенаР*19 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*20 + ДопЦена + ЦенаШайба*48 + ЦенаГайка*24;
	ОбщЦенаРаскосов = 20.806*ЦенаРаскос;
	ОбластьРамы.Параметры.р66 = Окр(ЦенаР*20 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*21 + ДопЦена1 + ЦенаШайба*50 + ЦенаГайка*25;
	ОбщЦенаРаскосов = 23.156*ЦенаРаскос;
	ОбластьРамы.Параметры.р67 = Окр(ЦенаР*22 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ОбщЦенаКрепежа = ЦенаВинт*23 + ДопЦена + ЦенаШайба*54 + ЦенаГайка*27;
	ОбщЦенаРаскосов = 24.331*ЦенаРаскос;
	ОбластьРамы.Параметры.р68 = Окр(ЦенаР*24 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);

	СтрокаЦены = ТЗ_Цены.Найти("Подпятник СЕТП, СЕТО 155х155", "Номенклатура");
	ЦенаПодпятник = СтрокаЦены.Цена;
	
	СтрокаЦены = ТЗ_Цены.Найти("Стойка СЕТО (130.1.5)", "Номенклатура");
	ЦенаР = СтрокаЦены.Цена;
	
	ДопЦена = ЦенаВтулка20*4 + ЦенаПодпятник*2 + ЦенаБолт*4 + ЦенаВтулка8*4;
	ДопЦена1 = ЦенаВтулка20*2 + ЦенаПодпятник*2 + ЦенаБолт*4 + ЦенаВтулка8*4;

	ОбщЦенаКрепежа = ЦенаВинт*8 + ДопЦена + ЦенаШайба*24 + ЦенаГайка*12;
	ОбщЦенаРаскосов = 6.472*ЦенаРаскос;
	ОбластьРамы.Параметры.р69 = Окр(ЦенаР*6 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*9 + ДопЦена + ЦенаШайба*26 + ЦенаГайка*13;
	ОбщЦенаРаскосов = 7.61*ЦенаРаскос;	
	ОбластьРамы.Параметры.р70 = Окр(ЦенаР*7 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*10 + ДопЦена + ЦенаШайба*28 + ЦенаГайка*14;
	ОбщЦенаРаскосов = 8.748*ЦенаРаскос;		
	ОбластьРамы.Параметры.р71 = Окр(ЦенаР*8 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*11 + ДопЦена + ЦенаШайба*30 + ЦенаГайка*15;
	ОбщЦенаРаскосов = 9.886*ЦенаРаскос;	
	ОбластьРамы.Параметры.р72 = Окр(ЦенаР*9 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*11 + ДопЦена1 + ЦенаШайба*30 + ЦенаГайка*15;
	ОбщЦенаРаскосов = 11.024*ЦенаРаскос;	
	ОбластьРамы.Параметры.р73 = Окр(ЦенаР*10 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*12 + ДопЦена + ЦенаШайба*32 + ЦенаГайка*16;
	ОбщЦенаРаскосов = 11.024*ЦенаРаскос;	
	ОбластьРамы.Параметры.р74 = Окр(ЦенаР*11 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*13 + ДопЦена + ЦенаШайба*34 + ЦенаГайка*17;
	ОбщЦенаРаскосов = 12.162*ЦенаРаскос;	
	ОбластьРамы.Параметры.р75 = Окр(ЦенаР*12 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*14 + ДопЦена + ЦенаШайба*36 + ЦенаГайка*18;
	ОбщЦенаРаскосов = 13.3*ЦенаРаскос;	
	ОбластьРамы.Параметры.р76 = Окр(ЦенаР*13 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*15 + ДопЦена + ЦенаШайба*38 + ЦенаГайка*19;
	ОбщЦенаРаскосов = 14.438*ЦенаРаскос;
	ОбластьРамы.Параметры.р77 = Окр(ЦенаР*14 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*16 + ДопЦена + ЦенаШайба*40 + ЦенаГайка*20;
	ОбщЦенаРаскосов = 15.576*ЦенаРаскос;
	ОбластьРамы.Параметры.р78 = Окр(ЦенаР*15 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*16 + ДопЦена1 + ЦенаШайба*40 + ЦенаГайка*20;
	ОбщЦенаРаскосов = 16.714*ЦенаРаскос;
	ОбластьРамы.Параметры.р79 = Окр(ЦенаР*16 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*17 + ДопЦена + ЦенаШайба*42 + ЦенаГайка*21;
	ОбщЦенаРаскосов = 16.714*ЦенаРаскос;
	ОбластьРамы.Параметры.р80 = Окр(ЦенаР*17 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*18 + ДопЦена + ЦенаШайба*44 + ЦенаГайка*22;
	ОбщЦенаРаскосов = 17.852*ЦенаРаскос;
	ОбластьРамы.Параметры.р81 = Окр(ЦенаР*18 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*19 + ДопЦена + ЦенаШайба*46 + ЦенаГайка*23;
	ОбщЦенаРаскосов = 18.99*ЦенаРаскос;
	ОбластьРамы.Параметры.р82 = Окр(ЦенаР*19 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*20 + ДопЦена + ЦенаШайба*48 + ЦенаГайка*24;
	ОбщЦенаРаскосов = 20.128*ЦенаРаскос;
	ОбластьРамы.Параметры.р83 = Окр(ЦенаР*20 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*21 + ДопЦена1 + ЦенаШайба*50 + ЦенаГайка*25;
	ОбщЦенаРаскосов = 22.404*ЦенаРаскос;
	ОбластьРамы.Параметры.р84 = Окр(ЦенаР*22 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*23 + ДопЦена + ЦенаШайба*54 + ЦенаГайка*27;
	ОбщЦенаРаскосов = 23.542*ЦенаРаскос;
	ОбластьРамы.Параметры.р85 = Окр(ЦенаР*24 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);

	СтрокаЦены = ТЗ_Цены.Найти("Стойка СЕТО (130.2.0)", "Номенклатура");
	ЦенаР = СтрокаЦены.Цена;
	
	ДопЦена = ЦенаВтулка20*4 + ЦенаПодпятник*2 + ЦенаБолт*4 + ЦенаВтулка8*4;
	ДопЦена1 = ЦенаВтулка20*2 + ЦенаПодпятник*2 + ЦенаБолт*4 + ЦенаВтулка8*4;

	ОбщЦенаКрепежа = ЦенаВинт*8 + ДопЦена + ЦенаШайба*24 + ЦенаГайка*12;
	ОбщЦенаРаскосов = 6.472*ЦенаРаскос;
	ОбластьРамы.Параметры.р86 = Окр(ЦенаР*6 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*9 + ДопЦена + ЦенаШайба*26 + ЦенаГайка*13;
	ОбщЦенаРаскосов = 7.61*ЦенаРаскос;	
	ОбластьРамы.Параметры.р87 = Окр(ЦенаР*7 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*10 + ДопЦена + ЦенаШайба*28 + ЦенаГайка*14;
	ОбщЦенаРаскосов = 8.748*ЦенаРаскос;		
	ОбластьРамы.Параметры.р88 = Окр(ЦенаР*8 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*11 + ДопЦена + ЦенаШайба*30 + ЦенаГайка*15;
	ОбщЦенаРаскосов = 9.886*ЦенаРаскос;	
	ОбластьРамы.Параметры.р89 = Окр(ЦенаР*9 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*11 + ДопЦена1 + ЦенаШайба*30 + ЦенаГайка*15;
	ОбщЦенаРаскосов = 11.024*ЦенаРаскос;	
	ОбластьРамы.Параметры.р90 = Окр(ЦенаР*10 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*12 + ДопЦена + ЦенаШайба*32 + ЦенаГайка*16;
	ОбщЦенаРаскосов = 11.024*ЦенаРаскос;	
	ОбластьРамы.Параметры.р91 = Окр(ЦенаР*11 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*13 + ДопЦена + ЦенаШайба*34 + ЦенаГайка*17;
	ОбщЦенаРаскосов = 12.162*ЦенаРаскос;	
	ОбластьРамы.Параметры.р92 = Окр(ЦенаР*12 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*14 + ДопЦена + ЦенаШайба*36 + ЦенаГайка*18;
	ОбщЦенаРаскосов = 13.3*ЦенаРаскос;	
	ОбластьРамы.Параметры.р93 = Окр(ЦенаР*13 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*15 + ДопЦена + ЦенаШайба*38 + ЦенаГайка*19;
	ОбщЦенаРаскосов = 14.438*ЦенаРаскос;
	ОбластьРамы.Параметры.р94 = Окр(ЦенаР*14 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*16 + ДопЦена + ЦенаШайба*40 + ЦенаГайка*20;
	ОбщЦенаРаскосов = 15.576*ЦенаРаскос;
	ОбластьРамы.Параметры.р95 = Окр(ЦенаР*15 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*16 + ДопЦена1 + ЦенаШайба*40 + ЦенаГайка*20;
	ОбщЦенаРаскосов = 16.714*ЦенаРаскос;
	ОбластьРамы.Параметры.р96 = Окр(ЦенаР*16 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*17 + ДопЦена + ЦенаШайба*42 + ЦенаГайка*21;
	ОбщЦенаРаскосов = 16.714*ЦенаРаскос;
	ОбластьРамы.Параметры.р97 = Окр(ЦенаР*17 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*18 + ДопЦена + ЦенаШайба*44 + ЦенаГайка*22;
	ОбщЦенаРаскосов = 17.852*ЦенаРаскос;
	ОбластьРамы.Параметры.р98 = Окр(ЦенаР*18 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*19 + ДопЦена + ЦенаШайба*46 + ЦенаГайка*23;
	ОбщЦенаРаскосов = 18.99*ЦенаРаскос;
	ОбластьРамы.Параметры.р99 = Окр(ЦенаР*19 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*20 + ДопЦена + ЦенаШайба*48 + ЦенаГайка*24;
	ОбщЦенаРаскосов = 20.128*ЦенаРаскос;
	ОбластьРамы.Параметры.р100 = Окр(ЦенаР*20 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*21 + ДопЦена1 + ЦенаШайба*50 + ЦенаГайка*25;
	ОбщЦенаРаскосов = 22.404*ЦенаРаскос;
	ОбластьРамы.Параметры.р101 = Окр(ЦенаР*22 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	ОбщЦенаКрепежа = ЦенаВинт*23 + ДопЦена + ЦенаШайба*54 + ЦенаГайка*27;
	ОбщЦенаРаскосов = 23.542*ЦенаРаскос;
	ОбластьРамы.Параметры.р102 = Окр(ЦенаР*24 + ОбщЦенаКрепежа + ОбщЦенаРаскосов);
	
	ТабДок.Вывести(ОбластьРамы);
	
	Возврат ТабДок;
	
КонецФункции //СформироватьПрайЛистНаСервере	

&НаСервере
Функция СформироватьЦеныБалокНаСервере()
	
	ДлБалки = Новый Массив(26);
	
	ДлБалки[0]=1500;
	Для К=1 по 25 Цикл
		ДлБалки[К]=ДлБалки[К-1]+100; 	
	КонецЦикла; 
	
	СЗ_ПараметрыБалок = Новый СписокЗначений;
	СЗ_ПараметрыБалок.Добавить("90.1.5","(90)");
	СЗ_ПараметрыБалок.Добавить("90.2.0","(90)");
	СЗ_ПараметрыБалок.Добавить("120.1.5","(120)");
	СЗ_ПараметрыБалок.Добавить("120.2.0","(120)");
	СЗ_ПараметрыБалок.Добавить("120.2.5","(120)");
	СЗ_ПараметрыБалок.Добавить("150.2.0","(150)");
	СЗ_ПараметрыБалок.Добавить("150.2.5","(150)");
	СЗ_ПараметрыБалок.Добавить("150.3.0","(150)");
	СЗ_ПараметрыБалок.Добавить("180.2.5","(180)");
	СЗ_ПараметрыБалок.Добавить("180.3.0","(180)");
	
	СписокНоменклатуры = Новый СписокЗначений;
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Фиксатор СЕТ", Истина));
	//Асист-Про. В дальнейшем вызывает ошибку так как цены будут получаться только по ограниченному списку а формируется и по СЕТП И ПО СЕТБ
	//Если БалкаТипОкраски1 = "Полимеризация" тогда
		СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Зацеп СЕТП (90)", Истина));
		СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Зацеп СЕТП (120)", Истина));
		СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Зацеп СЕТП (150)", Истина));
		СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Зацеп СЕТП (180)", Истина));
	//Иначе
		СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Зацеп СЕТБ (90)", Истина));
		СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Зацеп СЕТБ (120)", Истина));
		СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Зацеп СЕТБ (150)", Истина));
		СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Зацеп СЕТБ (180)", Истина));
	//Конецесли;
	
	СписокБалок = Новый СписокЗначений;
	Для каждого ЭлементСписка Из СЗ_ПараметрыБалок Цикл
		СпрБалка = Справочники.Номенклатура.НайтиПоНаименованию("Балка СЕТБ (" + ЭлементСписка.Значение + ")",Истина);
		СписокБалок.Добавить(СпрБалка);
		СписокНоменклатуры.Добавить(СпрБалка);
		
		СпрБалка = Справочники.Номенклатура.НайтиПоНаименованию("Балка СЕТП (" + ЭлементСписка.Значение + ")",Истина);
		СписокБалок.Добавить(СпрБалка);
		СписокНоменклатуры.Добавить(СпрБалка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Наименование КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаЦен,
	|			ВидЦены = &ВидЦены
	|				И Номенклатура В (&СписокНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних";
	Запрос.УстановитьПараметр("ДатаЦен"	, КонецДня(НаДату));
	Запрос.УстановитьПараметр("ВидЦены"	, ВидЦены);
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	ТЗ_Цены = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаСписка Из СписокНоменклатуры Цикл
		Стр = ТЗ_Цены.Найти(СтрокаСписка.Значение, "Номенклатура");
		Если Стр = Неопределено Тогда
			Стр = ТЗ_Цены.Добавить();
			Стр.Номенклатура = СтрокаСписка.Значение;
			Стр.Цена = 0;
		КонецЕсли;
	КонецЦикла;	
	
	СтрокаЦены = ТЗ_Цены.Найти("Фиксатор СЕТ", "Номенклатура");
	ЦенаФиксатора = СтрокаЦены.Цена;
	
	Макет = Обработки.РасчетСтеллажейПодЕвроподдоныНовая.ПолучитьМакет("ЦеныБалок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицыПрофиль = Макет.ПолучитьОбласть("ШапкаТаблицы|Профиль");
	ОбластьШапкаТаблицыЦена = Макет.ПолучитьОбласть("ШапкаТаблицы|Цена");
	ОбластьСтрокаПрофиль = Макет.ПолучитьОбласть("Строка|Профиль");
	ОбластьСтрокаЦена = Макет.ПолучитьОбласть("Строка|Цена");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьШапкаТаблицыПрофиль.Параметры.Покрытие = "Без покрытия";
	ТабДок.Вывести(ОбластьШапкаТаблицыПрофиль);
	
	Для К = 0 по 25 Цикл
		ОбластьШапкаТаблицыЦена.Параметры.ДлинаБалки = ДлБалки[К];
		ТабДок.Присоединить(ОбластьШапкаТаблицыЦена);
	КонецЦикла;
		
	Для каждого ЭлементСписка Из СЗ_ПараметрыБалок Цикл
		
		ОбластьСтрокаПрофиль.Параметры.Профиль = ЭлементСписка.Значение;
		ТабДок.Вывести(ОбластьСтрокаПрофиль);
		
		НаимБалки = "Балка СЕТБ (" + ЭлементСписка.Значение + ")";
		СтрокаЦены = ТЗ_Цены.Найти(НаимБалки, "Номенклатура");
		ЦенаБалки = СтрокаЦены.Цена;
		
		НаимЗацепа = "Зацеп СЕТБ " + ЭлементСписка.Представление;
		СтрокаЦены = ТЗ_Цены.Найти(НаимЗацепа,"Номенклатура");
		ЦенаЗацепа = СтрокаЦены.Цена;
		
		Для К = 0 по 25 Цикл
			Длина = ДлБалки[К]; 	
			Цена = Окр((ЦенаБалки*Длина / 1000) + ЦенаЗацепа + ЦенаФиксатора*2, 0);
			
			ОбластьСтрокаЦена.Параметры.Цена = Цена;
			ТабДок.Присоединить(ОбластьСтрокаЦена);
		КонецЦикла;
	КонецЦикла;
	
	ОбластьШапкаТаблицыПрофиль.Параметры.Покрытие = "Полимеризация";
	ТабДок.Вывести(ОбластьШапкаТаблицыПрофиль);
	
	Для К = 0 по 25 Цикл
		ОбластьШапкаТаблицыЦена.Параметры.ДлинаБалки = ДлБалки[К];
		ТабДок.Присоединить(ОбластьШапкаТаблицыЦена);
	КонецЦикла;
	
	Для каждого ЭлементСписка Из СЗ_ПараметрыБалок Цикл
		ОбластьСтрокаПрофиль.Параметры.Профиль = ЭлементСписка.Значение;
		ТабДок.Вывести(ОбластьСтрокаПрофиль);
		
		НаимБалки = "Балка СЕТП (" + ЭлементСписка.Значение + ")";
		СтрокаЦены = ТЗ_Цены.Найти(НаимБалки, "Номенклатура");
		ЦенаБалки = СтрокаЦены.Цена;
		
		НаимЗацепа = "Зацеп СЕТП " + ЭлементСписка.Представление;
		СтрокаЦены = ТЗ_Цены.Найти(НаимЗацепа,"Номенклатура");
		ЦенаЗацепа = СтрокаЦены.Цена;
		
		Для К = 0 по 25 Цикл
			Длина = Число(ДлБалки[К]); 	
			Цена = Окр((ЦенаБалки*Длина / 1000) + ЦенаЗацепа + ЦенаФиксатора*2, 0);
			
			ОбластьСтрокаЦена.Параметры.Цена = Цена;
			ТабДок.Присоединить(ОбластьСтрокаЦена);
		КонецЦикла;
	КонецЦикла;

	Возврат ТабДок;
	
КонецФункции//СформироватьЦеныБалокНаСервере

&НаСервере
Функция СформироватьЦеныРамНаСервере()
	
	ВРамы = Новый Массив(60); 
	
	Если РамаНачальнаяВысота = 0 Тогда
		ВРамы[0] = 2000; 
	иначе
		ВРамы[0] = РамаНачальнаяВысота;
	КонецЕсли;
	
	Для К = 1 по 59 Цикл
		ВРамы[К] = ВРамы[К-1]+100; 	
	КонецЦикла;
	
	ТипыПокрасок = Новый СписокЗначений;
	ТипыПокрасок.Добавить("Б","Без покрытия");
	ТипыПокрасок.Добавить("О","Оцинковка");
	ТипыПокрасок.Добавить("П","Полимеризация");
	
	ПрофилиСтоек = Новый СписокЗначений;
	ПрофилиСтоек.Добавить("70");
	ПрофилиСтоек.Добавить("100");
	ПрофилиСтоек.Добавить("130");
	
	ТолщиныМеталла = Новый СписокЗначений;
	ТолщиныМеталла.Добавить("1.5");
	ТолщиныМеталла.Добавить("2.0");
	
	ВариантыИсполнения = Новый СписокЗначений;
	ВариантыИсполнения.Добавить("Вариант 1");
	ВариантыИсполнения.Добавить("Вариант 2");
	
	СписокНоменклатуры = Новый СписокЗначений;
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Винт М8х55", Истина)); 
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Втулка 20", Истина)); 	
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Шайба спец.овал.6вэ.73.334.01", Истина)); 	
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Болт М8х35", Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Втулка М8", Истина));
	СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Гайка М8", Истина));
	
	Для каждого ЭлементТипПокраски Из ТипыПокрасок Цикл
		ОкраскаСтр = ЭлементТипПокраски.Значение;
		СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Раскос СЕТ" + ОкраскаСтр + " (100.1.5)", Истина));
		Для каждого ЭлементПрофильСтойки Из ПрофилиСтоек Цикл
			ПрофильСтойки = ЭлементПрофильСтойки.Значение;
			РазмерыСтр = "";
			Если ПрофильСтойки = "70" Тогда
				РазмерыСтр = "80х90";
			ИначеЕсли ПрофильСтойки = "100" Тогда
				РазмерыСтр = "140х150";
			Иначе//Если ПрофильСтойки = "130" Тогда
				РазмерыСтр = "155х155";
			КонецЕсли;
			
			Если ОкраскаСтр = "Б" Тогда
				ОкраскаСтрП = "СЕТБ";
			ИначеЕсли ОкраскаСтр="П" Тогда
				ОкраскаСтрП = "СЕТП";
			Иначе
				ОкраскаСтрП = "СЕТО";
			КонецЕсли;
	
			СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Подпятник " + ОкраскаСтрП + " " + РазмерыСтр, Истина));
			
			Для каждого ЭлементТолщинаМеталла Из ТолщиныМеталла Цикл
				СписокНоменклатуры.Добавить(Справочники.Номенклатура.НайтиПоНаименованию("Стойка СЕТ" + ОкраскаСтр + " (" + ПрофильСтойки + "." + ЭлементТолщинаМеталла.Значение + ")", Истина));	
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;	
	
	ЗапросЦены = Новый Запрос;
	ЗапросЦены.Текст =
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Наименование КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаРасчета,
	|			ВидЦены = &ВидЦены
	|				И Номенклатура В (&СписокНоменклатуры)) КАК ЦеныНоменклатурыСрезПоследних";
	ЗапросЦены.УстановитьПараметр("ДатаРасчета", КонецДня(НаДату));
	ЗапросЦены.УстановитьПараметр("ВидЦены", ВидЦены);
	ЗапросЦены.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	ТЗ_Цены = ЗапросЦены.Выполнить().Выгрузить();
	
	Для Каждого СтрокаСписка Из СписокНоменклатуры Цикл
		Стр = ТЗ_Цены.Найти(СтрокаСписка.Значение, "Номенклатура");
		Если Стр = Неопределено Тогда
			Стр = ТЗ_Цены.Добавить();
			Стр.Номенклатура = СтрокаСписка.Значение;
			Стр.Цена = 0;
		КонецЕсли;
	КонецЦикла;	
	
	СтрокаЦены = ТЗ_Цены.Найти("Винт М8х55", "Номенклатура");
	ЦенаВинтовМ8х55 = СтрокаЦены.Цена;
	
	СтрокаЦены = ТЗ_Цены.Найти("Втулка 20", "Номенклатура");
	ЦенаВтулок20 = СтрокаЦены.Цена;
	
	СтрокаЦены = ТЗ_Цены.Найти("Болт М8х35", "Номенклатура");
	ЦенаБолтовМ8х35 = СтрокаЦены.Цена;
	
	СтрокаЦены = ТЗ_Цены.Найти("Втулка М8", "Номенклатура");
	ЦенаВтулокМ8 = СтрокаЦены.Цена;
	
	СтрокаЦены = ТЗ_Цены.Найти("Шайба спец.овал.6вэ.73.334.01", "Номенклатура");
	ЦенаШайбМ8 = СтрокаЦены.Цена;
	
	СтрокаЦены = ТЗ_Цены.Найти("Гайка М8", "Номенклатура");
	ЦенаГаекМ8 = СтрокаЦены.Цена;
	
	Макет = Обработки.РасчетСтеллажейПодЕвроподдоныНовая.ПолучитьМакет("ЦеныРам");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаРам = Макет.ПолучитьОбласть("ШапкаРам");
	ОбластьСтрокаСтрока1 = Макет.ПолучитьОбласть("Строка|Колонка1");
	ОбластьСтрокаСтрока2 = Макет.ПолучитьОбласть("Строка|Колонка2");
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Вывести(ОбластьШапка);
	
	Для каждого ЭлементВИ Из ВариантыИсполнения Цикл
		Для каждого ЭлементПС из ПрофилиСтоек Цикл
			Для каждого ЭлементТМ из ТолщиныМеталла Цикл
				Для каждого ЭлементТП из ТипыПокрасок Цикл	
					
					
					ВариантИсполнения = ЭлементВИ.Значение;
					
					ОкраскаСтр = ЭлементТП.Значение;
					
					ПрофильСтойки = ЭлементПС.Значение;
					
					РазмерыСтр = "";
					Если ПрофильСтойки = "70" Тогда
						РазмерыСтр = "80х90";
					ИначеЕсли ПрофильСтойки = "100" Тогда
						РазмерыСтр = "140х150";
					Иначе//Если ПрофильСтойки = "130" Тогда
						РазмерыСтр = "155х155";
					КонецЕсли;
					
					Если ОкраскаСтр = "Б" Тогда
						ОкраскаСтрП = "СЕТБ";
					ИначеЕсли ОкраскаСтр = "П" Тогда
						ОкраскаСтрП = "СЕТП";
					Иначе
						ОкраскаСтрП = "СЕТО";
					КонецЕсли;
					
					СтрокаЦены = ТЗ_Цены.Найти("Подпятник " + ОкраскаСтрП + " " + РазмерыСтр, "Номенклатура");
					ЦенаПодпятников = СтрокаЦены.Цена;
					СуммаПодпятников = ЦенаПодпятников*2;
					
					// Катанные элементы рамы
					// Для стойки 70мм
					Если ПрофильСтойки = "70" Тогда
						k1 = 2*42;
					// Для стойки 100мм	
					ИначеЕсли ПрофильСтойки = "100" Тогда
						k1 = 2*68.5;
					// Для стойки 130мм	
					Иначе//Если ПрофильСтойки = "130" Тогда
						k1 = 2*86;
					КонецЕсли;
					
					МежОсРасст = РамаГлубинаСтеллажа - k1;
					ДлинаПрямогоРаскоса = МежОсРасст + 2*20;
					
					ДлинаКосогоРаскоса = Окр(Sqrt((МежОсРасст*МежОсРасст) + (600*600)) + 2*20);
					
					ОбластьШапкаРам.Параметры.ПараметрыРамы = "Ширина: " + РамаГлубинаСтеллажа + "; Исполнение: " + ВариантИсполнения + "; Профиль: " + ПрофильСтойки + "; Толщина металла: " 
															+ ЭлементТМ.Значение + "; Покраска: " + ЭлементТП.Представление;
					ОбластьШапкаРам.Параметры.ДлинаПрямогоРаскоса = ДлинаПрямогоРаскоса;
					ОбластьШапкаРам.Параметры.ДлинаКосогоРаскоса = ДлинаКосогоРаскоса;
                    ТабДок.Вывести(ОбластьШапкаРам);
					
					ТабДок.Вывести(ОбластьСтрокаСтрока1);
					
					НомСтроки = 0;
					
					Для каждого ВысотаСтеллажа из ВРамы Цикл
						НомСтроки = НомСтроки + 1;
						СтруктураПараметров = Новый Структура;
						//ASP. Строка исправлена для отвязки от выбранных параметров в форме 
						НаименованиеСтойки = "Стойка СЕТ" + ОкраскаСтр + " (" + ПрофильСтойки + "." + ЭлементТМ + ")";
					
						СтрокаЦены = ТЗ_Цены.Найти(НаименованиеСтойки, "Номенклатура");
						ЦенаСтойки = СтрокаЦены.Цена;
						ДлинаСтоек = (ВысотаСтеллажа*2)/1000;
						
						СуммаСтойки = Окр(ДлинаСтоек*ЦенаСтойки, 2);
						СтруктураПараметров.Вставить("СуммаСтойки", СуммаСтойки);
					
						КолвоПрямыхРаскосов = 2;
						Если ВариантИсполнения = "Вариант 1" Тогда
							КолвоКосыхРаскосов = Цел((ВысотаСтеллажа - 200)/600);
							Если (ВысотаСтеллажа-200) > КолвоКосыхРаскосов*600 Тогда 
								КолвоКрепежа = КолвоКосыхРаскосов + 1 + КолвоПрямыхРаскосов + 1;
							Иначе 
								КолвоКрепежа = КолвоКосыхРаскосов + 1 + КолвоПрямыхРаскосов;
							КонецЕсли;
						Иначе
							Если (ВысотаСтеллажа >= 2000) и (ВысотаСтеллажа <= 2500)  Тогда
								КолвоПрямыхРаскосов = КолвоПрямыхРаскосов + 1;
							ИначеЕсли  (ВысотаСтеллажа > 2500) и (ВысотаСтеллажа <= 4300)  Тогда 
								КолвоПрямыхРаскосов = КолвоПрямыхРаскосов + 2;
							ИначеЕсли  (ВысотаСтеллажа > 4300) и (ВысотаСтеллажа <= 6100)  Тогда 
								КолвоПрямыхРаскосов = КолвоПрямыхРаскосов+3;  
							ИначеЕсли  ВысотаСтеллажа > 6100  Тогда 
								КолвоПрямыхРаскосов=КолвоПрямыхРаскосов + 4 + Цел((ВысотаСтеллажа-6100)/1800);
							КонецЕсли;
							//------------------------------------------------------------------------------------------------------------------------------------------------------------
							Если (ВысотаСтеллажа - 144 - 56) > КолвоКосыхРаскосов*600 Тогда 
								КолвоКрепежа = КолвоКосыхРаскосов + 1 + КолвоПрямыхРаскосов + 1;
							Иначе 
								КолвоКрепежа = КолвоКосыхРаскосов + 1 + КолвоПрямыхРаскосов;
							КонецЕсли;
							
							//--------------------------------------------------------------------------------
							Если (ВысотаСтеллажа-144-56)-Цел((ВысотаСтеллажа-144-56)/600)*600=500 Тогда
								КолвоПрямыхРаскосов=КолвоПрямыхРаскосов+1;
								КолвоКрепежа = КолвоКрепежа + 1;
							КонецЕсли;
							
						КонецЕсли;
						
						СтрокаЦены = ТЗ_Цены.Найти("Раскос СЕТ" + ОкраскаСтр + " (100.1.5)", "Номенклатура");
						ЦенаРаскоса = СтрокаЦены.Цена;
						
						СтруктураПараметров.Вставить("КолвоКрепежа", КолвоКрепежа);
						СтруктураПараметров.Вставить("КолвоПрямыхРаскосов", КолвоПрямыхРаскосов);
						СтруктураПараметров.Вставить("КолвоКосыхРаскосов", КолвоКосыхРаскосов);
						
						СуммаПрямыхРаскосов = Окр(ЦенаРаскоса*КолвоПрямыхРаскосов*ДлинаПрямогоРаскоса/1000, 2);
						СуммаКосыхРаскосов = Окр(ЦенаРаскоса*КолвоКосыхРаскосов*ДлинаКосогоРаскоса/1000, 2);
						СтруктураПараметров.Вставить("СуммаПрямыхРаскосов", СуммаПрямыхРаскосов);
						СтруктураПараметров.Вставить("СуммаКосыхРаскосов", СуммаКосыхРаскосов);
						
						//	Некатаные элементы рам (КРЕПЕЖ)
						k2 = (ВысотаСтеллажа - 200)/600 = Цел((ВысотаСтеллажа - 200)/600);
						//  1. Определяем кол-во элементов Винт М8х55
						Если ВариантИсполнения = "Вариант 1" Тогда
							КолвоВинтовМ8х55 = КолвоКосыхРаскосов + 3 + ?(k2,0,1);	
						Иначе
							КолвоВинтовМ8х55 = КолвоКосыхРаскосов + 1 + ?(k2,0,1);	
						КонецЕсли;
						
						//  2. Определяем кол-во элементов Втулка 20
						КолвоВтулок20 = 2 + ?(k2,0,2);
						
						//  4. Определяем кол-во элементов Болт М8х35
						КолвоБолтовМ8х35 = 4;
						
						//  5. Определяем кол-во элементов Втулка М8
						//Если ПрофильСтойки = "70" Тогда
						//	КолвоВтулокМ8 = 0;
						//Иначе
							КолвоВтулокМ8 = 4;
						//КонецЕсли;
						
						//  6. Определяем кол-во элементов Шайба М8
						КолвоШайбМ8 = КолвоВинтовМ8х55*2 + КолвоБолтовМ8х35*2;
						
						//  7. Определяем кол-во элементов Гайка М8
						КолвоГаекМ8 = КолвоВинтовМ8х55 + КолвоБолтовМ8х35;
						
						СуммаКрепежа = КолвоБолтовМ8х35*ЦенаБолтовМ8х35 + КолвоВинтовМ8х55*ЦенаВинтовМ8х55 + КолвоШайбМ8*ЦенаШайбМ8 + КолвоГаекМ8*ЦенаГаекМ8 + КолвоВтулокМ8*ЦенаВтулокМ8;
						СуммаВтулок = КолвоВтулок20*ЦенаВтулок20;
						СуммаРамы = СуммаСтойки + СуммаПрямыхРаскосов + СуммаКосыхРаскосов + СуммаВтулок + СуммаКрепежа + СуммаПодпятников;
						
						СтруктураПараметров.Вставить("СуммаРамы"		, СуммаРамы);
						СтруктураПараметров.Вставить("КолвоВтулок"		, КолвоВтулок20);
						СтруктураПараметров.Вставить("СуммаВтулок"		, СуммаВтулок);
						СтруктураПараметров.Вставить("КолвоПодпятников"	, 2);
						СтруктураПараметров.Вставить("СуммаПодпятников"	, СуммаПодпятников);
						СтруктураПараметров.Вставить("СуммаКрепежа"		, СуммаКрепежа);
						СтруктураПараметров.Вставить("ВысотаСтеллажа"	, ВысотаСтеллажа);
						ОбластьСтрокаСтрока2.Параметры.Заполнить(СтруктураПараметров);
						ТабДок.Присоединить(ОбластьСтрокаСтрока2);
						
						Если НомСтроки = 30 Тогда
							ТабДок.Вывести(ОбластьСтрокаСтрока1);
						КонецЕсли;	
					КонецЦикла;
				КонецЦикла;		
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;	
	
	Возврат ТабДок;
	
КонецФункции//СформироватьЦенаРамНаСервере()	

&НаСервере
Функция ЗаписьСтойкиВКомплектации(НЗ)
	
	Для каждого стр из НЗ цикл
		Если Найти(ВРег(стр.Комплектующая.Наименование), "СТОЙКА") > 0 тогда
			возврат стр;
		Конецесли;
	Конеццикла;
	
КонецФункции

&НаСервере
Функция ПоместитьТоварыВХранилище()
	
	Товары = Объект.Товары.Выгрузить();
	
	АдресТоваровВХранилище = ПоместитьВоВременноеХранилище(Товары, УникальныйИдентификатор);
	
	Возврат АдресТоваровВХранилище;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ (НА КЛИЕНТЕ)

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СЗ_ТолщиныБалки = Новый СписокЗначений;
	СЗ_ТолщиныБалки.Добавить("1.5");
	СЗ_ТолщиныБалки.Добавить("2.0");
	
	Строка90 = СоответствиеВысотыПрофиляБалки_и_ТолщиныМеталла.Добавить();
	Строка90.ВысотаПрофиляБалки = "90";
	Строка90.ТолщиныБалки = СЗ_ТолщиныБалки;
	
	СЗ_ТолщиныБалки = Новый СписокЗначений;
	СЗ_ТолщиныБалки.Добавить("1.5");
	СЗ_ТолщиныБалки.Добавить("2.0");
//	СЗ_ТолщиныБалки.Добавить("2.5");
	
	Строка120 = СоответствиеВысотыПрофиляБалки_и_ТолщиныМеталла.Добавить();
	Строка120.ВысотаПрофиляБалки = "120";
	Строка120.ТолщиныБалки = СЗ_ТолщиныБалки;
	
	СЗ_ТолщиныБалки = Новый СписокЗначений;
	СЗ_ТолщиныБалки.Добавить("2.0");
	СЗ_ТолщиныБалки.Добавить("2.5");
	СЗ_ТолщиныБалки.Добавить("3.0");
	
	Строка150 = СоответствиеВысотыПрофиляБалки_и_ТолщиныМеталла.Добавить();
	Строка150.ВысотаПрофиляБалки = "150";
	Строка150.ТолщиныБалки = СЗ_ТолщиныБалки;
	
	СЗ_ТолщиныБалки = Новый СписокЗначений;
//	СЗ_ТолщиныБалки.Добавить("2.0");
	СЗ_ТолщиныБалки.Добавить("2.5");
	СЗ_ТолщиныБалки.Добавить("3.0");
	
	Строка180 = СоответствиеВысотыПрофиляБалки_и_ТолщиныМеталла.Добавить();
	Строка180.ВысотаПрофиляБалки = "180";
	Строка180.ТолщиныБалки = СЗ_ТолщиныБалки;
	
	ВидЦены = Справочники.ВидыЦен.НайтиПоНаименованию("Цена продажи");
	РамаВысотаСтеллажа = 1500;
	РамаГлубинаСтеллажа = 1100;
	РамаПрофильСтойки = "100";
	РамаТолщинаМеталла = "1.5";
	РамаТипОкраски = "Оцинковка";
	РамаВариантИсполнения = "Вариант 1";
	
	БалкаВысотаПрофиля1 = "90";
	Элементы.БалкаТолщинаМеталла1.СписокВыбора.ЗагрузитьЗначения(СоответствиеВысотыПрофиляБалки_и_ТолщиныМеталла.НайтиСтроки(Новый Структура("ВысотаПрофиляБалки", "90"))[0].ТолщиныБалки.ВыгрузитьЗначения());
	БалкаТолщинаМеталла1 = "1.5";
	
	БалкаДлина1 = 2700;
	БалкаТипОкраски1 = "Полимеризация";
	
	ВидНастила = "Без настила";
	
	СекцииКоличествоПолок = 1;
	СекцииКоличествоПролетов1 = 1;
	
	РасчитатьГрузоподъемностьБалокНаСервере();
	
	РамаГрузоподъемность = ПолучитьГрузоподъемностьРамыНаСервере();
	
	БудутСтавитьПоддоныНаПол = Истина;
	НаДату = ТекущаяДата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если ПеренестиВДокумент Тогда	
		АдресТоваровВХранилище = ПоместитьТоварыВХранилище();
		Структура = Новый Структура("АдресТоваровВХранилище", АдресТоваровВХранилище);
		ПеренестиВДокумент = Истина;
		ОповеститьОВыборе(Структура);	
	КонецЕсли;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	Попытка
		Элементы.Комплектующие.ОтборСтрок = Новый ФиксированнаяСтруктура("ВнешнийКлюч", Элементы.Товары.ТекущиеДанные.Ключ);
	исключение
		Элементы.Комплектующие.ОтборСтрок = Неопределено;
	Конецпопытки;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ "ПАРАМЕТРЫ БАЛОК"

&НаКлиенте
Процедура БалкаВысотаПрофиля1ПриИзменении(Элемент)
	
	Если ПустаяСтрока(БалкаВысотаПрофиля1) Тогда
		БалкаТолщинаМеталла1 = "";
		Элементы.БалкаТолщинаМеталла1.СписокВыбора.Очистить();
		Возврат;
	КонецЕсли;
	
	Элементы.БалкаТолщинаМеталла1.СписокВыбора.ЗагрузитьЗначения(СоответствиеВысотыПрофиляБалки_и_ТолщиныМеталла.НайтиСтроки(Новый Структура("ВысотаПрофиляБалки", БалкаВысотаПрофиля1))[0].ТолщиныБалки.ВыгрузитьЗначения());
	Если Элементы.БалкаТолщинаМеталла1.СписокВыбора.НайтиПоЗначению(БалкаТолщинаМеталла1) = Неопределено Тогда
		БалкаТолщинаМеталла1 = Элементы.БалкаТолщинаМеталла1.СписокВыбора[0].Значение;
	КонецЕсли;
	
	РасчитатьГрузоподъемностьБалокНаСервере();
	
	РамаГрузоподъемность = ПолучитьГрузоподъемностьРамыНаСервере();
	
	// Устанавливаем видимость переключателя в зависимости от высоты профиля
	Элементы.ФлагПолетная.Видимость = (БалкаВысотаПрофиля1 = "90");
	
КонецПроцедуры

&НаКлиенте
Процедура БалкаВысотаПрофиля2ПриИзменении(Элемент)
	
	Если ПустаяСтрока(БалкаВысотаПрофиля2) Тогда
		БалкаТолщинаМеталла2 = "";
		Элементы.БалкаТолщинаМеталла2.СписокВыбора.Очистить();
		Возврат;
	КонецЕсли;
	
	Элементы.БалкаТолщинаМеталла2.СписокВыбора.ЗагрузитьЗначения(СоответствиеВысотыПрофиляБалки_и_ТолщиныМеталла.НайтиСтроки(Новый Структура("ВысотаПрофиляБалки", БалкаВысотаПрофиля2))[0].ТолщиныБалки.ВыгрузитьЗначения());
	Если Элементы.БалкаТолщинаМеталла2.СписокВыбора.НайтиПоЗначению(БалкаТолщинаМеталла2) = Неопределено Тогда
		БалкаТолщинаМеталла2 = Элементы.БалкаТолщинаМеталла2.СписокВыбора[0].Значение;
	КонецЕсли;
	
	РасчитатьГрузоподъемностьБалокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура БалкаТолщинаМеталла1ПриИзменении(Элемент)
	РасчитатьГрузоподъемностьБалокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура БалкаТолщинаМеталла2ПриИзменении(Элемент)
	РасчитатьГрузоподъемностьБалокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура БалкаДлина1ПриИзменении(Элемент)
	РасчитатьГрузоподъемностьБалокНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура БалкаДлина2ПриИзменении(Элемент)
	РасчитатьГрузоподъемностьБалокНаСервере();
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ "ПАРАМЕТРЫ СЕКЦИЙ"

&НаКлиенте
Процедура СекцииКоличествоПолокПриИзменении(Элемент)
	РамаГрузоподъемность = ПолучитьГрузоподъемностьРамыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура БудутСтавитьПоддоныНаПолПриИзменении(Элемент)
	РамаГрузоподъемность = ПолучитьГрузоподъемностьРамыНаСервере();
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ "ПАРАМЕТРЫ РАМЫ"

&НаКлиенте
Процедура РамаВысотаСтеллажаПриИзменении(Элемент)
	
	СЗ = Новый СписокЗначений;
	СЗ.Добавить("Без покрытия");
	СЗ.Добавить("Оцинковка");
	//Асист про KS
	//Если РамаВысотаСтеллажа <= 9500 Тогда
		СЗ.Добавить("Полимеризация");
	//КонецЕсли;
	//Асист про KS
	Если Элементы.РамаТипОкраски.СписокВыбора.Количество() <> СЗ.Количество() Тогда
		Элементы.РамаТипОкраски.СписокВыбора.ЗагрузитьЗначения(СЗ.ВыгрузитьЗначения());
		Если СЗ.НайтиПоЗначению(РамаТипОкраски) = Неопределено Тогда
			РамаТипОкраски = СЗ[0].Значение;
		КонецЕсли;	
	КонецЕсли;
	
	РамаГрузоподъемность = ПолучитьГрузоподъемностьРамыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РамаПрофильСтойкиПриИзменении(Элемент)
	РамаГрузоподъемность = ПолучитьГрузоподъемностьРамыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РамаТолщинаМеталлаПриИзменении(Элемент)
	РамаГрузоподъемность = ПолучитьГрузоподъемностьРамыНаСервере();
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура ПодобратьНоменклатуру(Команда)
	ПодобратьНоменклатуруНаСервере();
	ЭтаФорма.ТекущийЭлемент = Элементы.ГруппаРезультатыРасчета;	
КонецПроцедуры//ПодобратьНоменклатуру

&НаКлиенте
Процедура РамаГлубинаСтеллажаПриИзменении(Элемент)
	
	СЗ = Новый СписокЗначений;
	СЗ.Добавить("Без настила");
	Если РамаГлубинаСтеллажа <= 800 Тогда
		СЗ.Добавить("Фанера");
	КонецЕсли;	
	СЗ.Добавить("Металл");
	СЗ.Добавить("Сетка");
	
	Если Элементы.ВидНастила.СписокВыбора.Количество() <> СЗ.Количество() Тогда
		Элементы.ВидНастила.СписокВыбора.ЗагрузитьЗначения(СЗ.ВыгрузитьЗначения());
		Если СЗ.НайтиПоЗначению(ВидНастила) = Неопределено Тогда
			ВидНастила = СЗ[0].Значение;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры//РамаГлубинаСтеллажаПриИзменении

&НаКлиенте
Процедура ПечатьРасчетногоЛиста(Команда)
	
	ТабДок = СформироватьРасчетныйЛистНаСервере();
	
	ТабДок.Показать();
	
КонецПроцедуры//ПечатьРасчетногоЛиста

&НаКлиенте
Процедура ПечатьНагрузок(Команда)
	ТабДок = СформироватьНагрузкиНаСервере();
	
	ТабДок.Показать();
КонецПроцедуры //ПечатьНагрузок

&НаКлиенте
Процедура ПечатьПрайсЛиста(Команда)
	ТабДок = СформироватьПрайсЛистНаСервере();
	ТабДок.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЦенБалок(Команда)
	ТабДок = СформироватьЦеныБалокНаСервере();
	ТабДок.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЦенРам(Команда)
	
	ТабДок = СформироватьЦеныРамНаСервере();
	ТабДок.Показать();
	//СписокТабличныхДокументов = Новый СписокЗначений;
	//СписокТабличныхДокументов.Добавить(ТабДок, "Цены_на_рамы");
	//// Получим ключ уникальности открываемой формы
	//КлючУникальности = Строка(Новый УникальныйИдентификатор);
	//
	//ПараметрыОткрытия = Новый Структура("ИмяМенеджераПечати,ИменаМакетов,ПараметрКоманды,ПараметрыПечати,ИсточникДанных");
	//ПараметрыОткрытия.ИмяМенеджераПечати = "ПакетноеФормированиеДокументов";
	//ПараметрыОткрытия.ИменаМакетов		 = "ЦеныНаРамы";
	//ПараметрыОткрытия.ПараметрКоманды	 = СписокТабличныхДокументов;
	//ПараметрыОткрытия.ПараметрыПечати	 = Неопределено;
	//ПараметрыОткрытия.ИсточникДанных	 = Истина;
	//// Откроем форму печати документов
	//ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия, ЭтаФорма, КлючУникальности);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.ОК);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНовуюНоменклатуру(Команда)
	ПараметрыФормы = Новый Структура();
	Для каждого СтрокаТЧ из Объект.Товары цикл
		Если ЕстьНеобходимостьКомплектоватьНоменклатуру(СтрокаТЧ.Номенклатура, СтрокаТЧ.Ключ) тогда
			
			УИ = Новый УникальныйИдентификатор;
			//
			ПараметрыФормы.Вставить("НоменклатураСЕТ", СтрокаТЧ.Номенклатура);
			ПараметрыФормы.Вставить("НаименованиеНоменклатурыСЕТ", СтрокаТЧ.Наименование);
			//
			СтрокиКомплектующих = АдресСтрокКомплектующих(СтрокаТЧ.Ключ, УИ);
			ПараметрыФормы.Вставить("АдресСтрокКомплектующих", СтрокиКомплектующих);
			//
			//Ассист-Про. Добавил передачу веса
			ПараметрыФормы.Вставить("Вес", СтрокаТЧ.Вес);

			ОткрытьФорму("Обработка.РасчетСтеллажейПодЕвроподдоныНовая.Форма.СборкаНовойНоменклатуры", ПараметрыФормы, ЭтаФорма, УИ);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы.Вставить("НаименованиеСборки", "");
КонецПроцедуры

// Функция для расчета цен стоек и раскосов
&НаСервере
Функция ЦенаКомплектующего(Наименование)
	
	Если Найти(Наименование, "Стойка") = 0 
		И Найти(Наименование, "Раскос") = 0 тогда 
		возврат 0;
	Конецесли;
	
	//
	
	БазовоеНаименование = Альтерлого.БазовоеНаименованиеНоменклатуры(Наименование);
	//
	БазовоеНаименование = СокрЛП(БазовоеНаименование);
	БазоваяНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию(БазовоеНаименование);
	Если БазоваяНоменклатура.Пустая() тогда
		ВызватьИсключение "Не найдена номенклатура "+БазовоеНаименование;
	КонецЕсли;
	//
	Длина = Альтерлого.ДлинаСтойкиРаскоса(Наименование)/1000;
	//
	БазоваяЦена = БазоваяЦена(БазоваяНоменклатура);
	Цена = БазоваяЦена*Длина;
	
	возврат Цена;
	
КонецФункции

&НаСервере
Функция БазоваяЦена(БазоваяНоменклатура)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаЦен,
	|			ВидЦены = &ВидЦены
	|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних");
	Запрос.УстановитьПараметр("ДатаЦен", КонецДня(НаДату));
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Номенклатура", БазоваяНоменклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		БазоваяЦена = Выборка.Цена;		
		возврат БазоваяЦена;
	Иначе
		возврат 0;
	КонецЕсли;
КонецФункции

////////////////////////////////////

&НаСервере
Функция КоэффициентыНаценки()
	
	Структура = Новый Структура("Балка1, Балка2", 1, 1);
	
	Для п = 1 по 2 цикл
		Если ЭтаФорма["БалкаДлина"+строка(п)] > Константы.ДлинаБалкиБезДопНаценки.Получить() тогда
			Если Лев(ЭтаФорма["БалкаТипОкраски"+п], 1) = "Б" тогда
				Структура["Балка"+строка(п)] = 1;
			Иначе
				Отбор = Новый Структура("ТолщинаМеталла, ВысотаПрофиля", ЭтаФорма["БалкаТолщинаМеталла"+строка(п)], ЭтаФорма["БалкаВысотаПрофиля"+строка(п)]);
				Рег = РегистрыСведений.КоэффициентыНаценкиКомплектующихРасчетаСтелажей.СрезПоследних(ТекущаяДата(), Отбор);
				Если Рег.Количество() > 0 тогда
					Структура["Балка"+строка(п)] = Рег[0].Коэффициент;
				Конецесли;
			КонецЕсли;
		КонецЕсли;
	Конеццикла;
	
	возврат Структура;
	
КонецФункции
	
&НаСервере
Функция ТипПокрытия(НаименованиеИзделия)
	
	Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НаименованиеИзделия, " ");
	Покрытие = "";
	Для каждого е из Массив цикл
		Если Найти(е, "ГТС")>0 
			ИЛИ Найти(е, "СЕТ")>0 тогда
			Покрытие = Лев(е, 4);
		КонецЕсли;
	Конеццикла;
	
	возврат Покрытие;
	
КонецФункции

&НаСервере
Функция ПрофильКомплектующего(Наименование)
	ПозицияПервойСкобки = Найти(Наименование, "(");
	ПозицияВторойСкобки = Найти(Наименование, ")");
	КоличествоСимволов = ПозицияВторойСкобки-ПозицияПервойСкобки-1;
	Текст = Сред(Наименование, ПозицияПервойСкобки+1, КоличествоСимволов);
	возврат Текст;
КонецФункции

&НаСервере
Функция ДлинаСтойки(НаименованиеРамы)
	Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(НаименованиеРамы, " ");
	СтрокаДлины = "";
	Для каждого е из Массив цикл
		Если Найти(е, "/") = 0 тогда продолжить конецесли;
		//
		Подмассив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(е, "/");
		СтрокаДлины = Подмассив[0];
	Конеццикла;
	возврат СтрокаДлины;
КонецФункции

&НаСервере
Функция РасчетныйВесСтойки(НаименованиеРамы)
	СтруктураСтоек = Новый Соответствие();
	СтруктураСтоек.Вставить("100.1.5", 0.0035207); 
	СтруктураСтоек.Вставить("100.2.0", 0.0046943); 
    СтруктураСтоек.Вставить("130.1.5", 0.0046982); 
    СтруктураСтоек.Вставить("130.2.0", 0.0062643); 
    СтруктураСтоек.Вставить("70.1.5", 0.0020959); 
    СтруктураСтоек.Вставить("70.2.0", 0.0027946);
	СтруктураСтоек.Вставить("85.1.5", 0.0029791);
    СтруктураСтоек.Вставить("85.2.0", 0.0039250);
	
	Профиль = ПрофильКомплектующего(НаименованиеРамы);
	Альтерлого.ОбработатьПрофиль(Профиль, Истина);
	
	Плотность = СтруктураСтоек[Профиль];
	
	Попытка
		Длина = Число(ДлинаСтойки(НаименованиеРамы));
	Исключение
		Длина = 0;
	КонецПопытки;
	
	Вес = Длина * Плотность;
	
	возврат Вес;
	
КонецФункции

&НаСервере
Функция НаименованиеСтойки(НаименованиеРамы)
	СтрокаПрофиля = ПрофильКомплектующего(НаименованиеРамы);
	АльтерЛОГО.ОбработатьПрофиль(СтрокаПрофиля, Истина);
	Текст = "Стойка "+ТипПокрытия(НаименованиеРамы)+" "+ДлинаСтойки(НаименованиеРамы)+" ("+СтрокаПрофиля+")";
	возврат Текст;
КонецФункции

&НаСервере
Функция СтруктураПараметровБалок()
	Структура = Новый Структура();
	Для п = 1 по 2 цикл
		ЗначениеСтруктуры = Формат(ЭтаФорма["БалкаДлина"+строка(п)], "ЧГ=0")+
											"/"+
											Формат(ЭтаФорма["БалкаГрузоподъемность"+строка(п)], "ЧГ=0");
		Если ЗначениеСтруктуры = "/" Тогда
			ЗначениеСтруктуры = "";
		КонецЕсли;
		Структура.Вставить("Балка"+строка(п), ЗначениеСтруктуры);
	Конеццикла;
	возврат Структура;									
КонецФункции

&НаСервере
Процедура РасчитатьГрузоподъемностьБалокНаСервере()
	Для п = 1 по 2 цикл
		Если НЕ ПрофильБалкиЗаполнен(п) тогда
			ЭтаФорма["БалкаГрузоподъемность"+строка(п)] = 0;
			продолжить;
		КонецЕсли;
		//
		ЭтаФорма["БалкаГрузоподъемность"+строка(п)] = ПолучитьГрузоподъемностьБалкиНаСервере(ЭтаФорма["БалкаДлина"+строка(п)], 
																		ЭтаФорма["БалкаВысотаПрофиля"+строка(п)], 
																		ЭтаФорма["БалкаТолщинаМеталла"+строка(п)],РамаТолщинаМеталла);
	Конеццикла;
КонецПроцедуры

&НаСервере
Функция ПрофильБалкиЗаполнен(индекс)
	Результат = ЗначениеЗаполнено(ЭтаФорма["БалкаВысотаПрофиля"+строка(индекс)])
				И ЗначениеЗаполнено(ЭтаФорма["БалкаТолщинаМеталла"+строка(индекс)])
				И ЗначениеЗаполнено(ЭтаФорма["БалкаДлина"+строка(индекс)]);
	возврат Результат;
КонецФункции

/////////////////// ФОРМИРОВАНИЕ НОВОЙ НОМЕНКЛАТУРЫ НА СТОРОНЕ СЕРВЕРА
&НаСервере
Функция ЕстьНеобходимостьКомплектоватьНоменклатуру(Номенклатура, Ключ)
	//ГТС проверка на наборы
	если лев(Номенклатура,4)="Рама" И НЕ ЗначениеЗаполнено(Справочники.Номенклатура.НайтиПоНаименованию(строка(Номенклатура) + " (набор)",истина)) 
	Тогда 
	Возврат Истина;				
	ИначеЕсли лев(Номенклатура,4)="Рама" И ЗначениеЗаполнено(Справочники.Номенклатура.НайтиПоНаименованию(строка(Номенклатура) + " (набор)",истина)) 
	тогда Возврат ложь;
	конецесли;
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) тогда
		возврат Истина;
	ИначеЕсли НЕ ЗначениеЗаполнено(АльтерЛОГО.КомплектацияНоменклатуры(Номенклатура)) тогда
		возврат Истина;
	Иначе
		МассивКомплектующих = Комплектующие.НайтиСтроки(Новый Структура("ВнешнийКлюч", Ключ));
		Для каждого СтрокаКомплектующих из МассивКомплектующих цикл
			Если НЕ ЗначениеЗаполнено(СтрокаКомплектующих.Номенклатура) тогда 
				возврат Истина;
			Конецесли;
		Конеццикла;
	КонецЕсли;
	//
	возврат ЛОЖЬ;
КонецФункции

&НаСервере
Функция АдресСтрокКомплектующих(Ключ, УИ)
	
	Массив = Комплектующие.НайтиСтроки(Новый Структура("ВнешнийКлюч", Ключ));
	Адрес = ПоместитьВоВременноеХранилище(Массив, УИ);
	возврат Адрес;
	
КонецФункции

&НаКлиенте
Процедура НастройкаНагрузок(Команда)
	ОткрытьФорму("Обработка.РасчетСтеллажейПодЕвроподдоныНовая.Форма.ФормаРедактированияМакетовНастроек",Новый Структура("ВидМакета","МакетРасчетаНагрузок"));

КонецПроцедуры

&НаКлиенте
Процедура НастройкаРасчетаPmax(Команда)
	ОткрытьФорму("Обработка.РасчетСтеллажейПодЕвроподдоныНовая.Форма.ФормаРедактированияМакетовНастроек",Новый Структура("ВидМакета","МакетРасчетаPmax"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРасчет(Команда)
	Объект.Товары.Очистить();
	Комплектующие.Очистить();
	РезультатыРасчета.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные=Элементы.Товары.ТекущиеДанные;
	если текущиеданные=неопределено тогда возврат
	иначе
	ТекущиеДанные.Сумма=ТекущиеДанные.Количество*ТекущиеДанные.Цена;
	конецесли
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекущиеДанные=Элементы.Товары.ТекущиеДанные;
	если текущиеданные=неопределено тогда возврат
	иначе
	ТекущиеДанные.Сумма=ТекущиеДанные.Количество*ТекущиеДанные.Цена;
	конецесли
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ТекущиеДанные=Элементы.Товары.ТекущиеДанные;
	если текущиеданные=неопределено тогда возврат
	иначе
	ТекущиеДанные.Цена=ТекущиеДанные.Сумма/ТекущиеДанные.Количество;
	конецесли
КонецПроцедуры
