&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	ТекстУсловияПоставщик = "";
	ТекстУсловияКлиент = "";
	ТекстУсловияСоглашение = ?(ЗначениеЗаполнено(Объект.Соглашение), " И Соглашение = &Соглашение", "");
	Если ЗначениеЗаполнено(Объект.ДокументРасчетов) Тогда
		ТекстУсловияКлиент = " И ЗаказКлиента = &ДокументРасчетов";
		ТекстУсловияПоставщик = " И ЗаказПоставщику = &ДокументРасчетов";
		Запрос.УстановитьПараметр("ДокументРасчетов", Объект.ДокументРасчетов);
	КонецЕсли;	
		
	Запрос.Текст = ТекстЗапроса();
	
	Запрос.УстановитьПараметр("Партнер", Объект.Партнер);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("НачДата", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("КонДата", КонецДня(Объект.ДатаОкончания));
	Запрос.УстановитьПараметр("Соглашение", Объект.Соглашение);
	
	ОбщийИтог = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОбщийИтог.Следующий();
	
	//
	Объект.ОстатокНаНачало = ОбщийИтог.ОстатокНаНачало;
	Объект.ОстатокНаКонец = ОбщийИтог.ОстатокНаКонец;
	Объект.ПоДаннымОрганизации.Очистить();
	
	Выборка = ОбщийИтог.Выбрать();
	
	НомерПП = 0;
	Префикс = Объект.Организация.Префикс;
	Пока Выборка.Следующий() Цикл
		
		НомерПП = НомерПП + 1;
		
		Если Выборка.Регистратор = Неопределено ИЛИ Выборка.Регистратор = null Тогда //Асист-Про - обработка нулл
			Продолжить;
		КонецЕсли;
		
		МетаданныеДокумента = Выборка.Регистратор.Метаданные();
		
		Попытка
			НомерДок = Выборка.Регистратор.НомерВходящегоДокумента;
		Исключение
			НомерДок = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Регистратор.Номер);
		КонецПопытки;
		
		Если ПустаяСтрока(НомерДок) Тогда
			НомерДок = "________";
		КонецЕсли;
		
		Попытка
			ДатаДок = Выборка.Регистратор.ДатаВходящегоДокумента;
		Исключение
			ДатаДок = Выборка.Регистратор.Дата;
		КонецПопытки;
		
		Если НЕ ЗначениеЗаполнено(ДатаДок) Тогда
			ДатаДок = "________";
		Иначе
			ДатаДок = Формат(ДатаДок, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(Объект.Соглашение) Тогда
		//	Если ТипЗнч(Выборка.Регистратор)=Тип("ДокументСсылка.ПоступлениеТоваровУслуг") или 
		//		ТипЗнч(Выборка.Регистратор)=Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда
		//		Если Выборка.Регистратор.Соглашение=Объект.Соглашение Тогда
		//			СтрокаТЧ = Объект.ПоДаннымОрганизации.Добавить();
		//			СтрокаТЧ.Дата = Выборка.Регистратор.Дата;
		//			СтрокаТЧ.Документ = Выборка.Регистратор;
		//			СтрокаТЧ.Представление = МетаданныеДокумента.Представление() + " № " + НомерДок + " от " + ДатаДок;
		//			СтрокаТЧ.Дебет = Выборка.Дебет;
		//			СтрокаТЧ.Кредит = Выборка.Кредит;
		//		КонецЕсли;
		//	ИначеЕсли ТипЗнч(Выборка.Регистратор)=Тип("ДокументСсылка.РеализацияТоваровУслуг") или 
		//		ТипЗнч(Выборка.Регистратор)=Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда
		//		СтрокаТЧ = Объект.ПоДаннымОрганизации.Добавить();
		//		СтрокаТЧ.Дата = Выборка.Регистратор.Дата;
		//		СтрокаТЧ.Документ = Выборка.Регистратор;
		//		СтрокаТЧ.Представление = МетаданныеДокумента.Представление() + " № " + НомерДок + " от " + ДатаДок;
		//		СтрокаТЧ.Дебет = Выборка.Дебет;
		//		СтрокаТЧ.Кредит = Выборка.Кредит;
		//	КонецЕсли;
		//Иначе
			СтрокаТЧ = Объект.ПоДаннымОрганизации.Добавить();
			СтрокаТЧ.Дата = Выборка.Регистратор.Дата;
			СтрокаТЧ.Документ = Выборка.Регистратор;
			СтрокаТЧ.Представление = МетаданныеДокумента.Представление() + " № " + НомерДок + " от " + ДатаДок;
			СтрокаТЧ.Дебет = Выборка.Дебет;
			СтрокаТЧ.Кредит = Выборка.Кредит;
			
		//КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры//ЗаполнитьНаСервере()	

&НаСервере
Функция ТекстЗапроса()
	
	Если НЕ ЗначениеЗаполнено(Объект.Соглашение) тогда
		
		Текст = 
		"ВЫБРАТЬ
		|	Вложение.Регистратор,
		|	Вложение.Период,
		|	СУММА(Вложение.ОстатокНаНачало) КАК ОстатокНаНачало,
		|	СУММА(Вложение.Дебет) КАК Дебет,
		|	СУММА(Вложение.Кредит) КАК Кредит,
		|	СУММА(Вложение.ОстатокНаКонец) КАК ОстатокНаКонец
		|ИЗ
		|	(ВЫБРАТЬ
		|		РасчетыСПоставщикамиОстаткиИОбороты.Регистратор КАК Регистратор,
		|		РасчетыСПоставщикамиОстаткиИОбороты.Период КАК Период,
		|		РасчетыСПоставщикамиОстаткиИОбороты.СуммаНачальныйОстаток КАК ОстатокНаНачало,
		|		РасчетыСПоставщикамиОстаткиИОбороты.СуммаРасход КАК Кредит,
		|		РасчетыСПоставщикамиОстаткиИОбороты.СуммаПриход КАК Дебет,
		|		РасчетыСПоставщикамиОстаткиИОбороты.СуммаКонечныйОстаток КАК ОстатокНаКонец
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками.ОстаткиИОбороты(
		|				&НачДата,
		|				&КонДата,
		|				Регистратор,
		|				,
		|				АналитикаУчетаПоПартнерам В
		|					(ВЫБРАТЬ
		|						АналитикаПоПартнерам.КлючАналитики
		|					ИЗ
		|						РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
		|					ГДЕ
		|						АналитикаПоПартнерам.Партнер = &Партнер
		|						И АналитикаПоПартнерам.Организация = &Организация)) КАК РасчетыСПоставщикамиОстаткиИОбороты
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		РасчетыСКлиентамиОстаткиИОбороты.Регистратор,
		|		РасчетыСКлиентамиОстаткиИОбороты.Период,
		|		РасчетыСКлиентамиОстаткиИОбороты.СуммаНачальныйОстаток,
		|		РасчетыСКлиентамиОстаткиИОбороты.СуммаРасход,
		|		РасчетыСКлиентамиОстаткиИОбороты.СуммаПриход,
		|		РасчетыСКлиентамиОстаткиИОбороты.СуммаКонечныйОстаток
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентами.ОстаткиИОбороты(
		|				&НачДата,
		|				&КонДата,
		|				Регистратор,
		|				,
		|				АналитикаУчетаПоПартнерам В
		|					(ВЫБРАТЬ
		|						АналитикаПоПартнерам.КлючАналитики
		|					ИЗ
		|						РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
		|					ГДЕ
		|						АналитикаПоПартнерам.Партнер = &Партнер
		|						И АналитикаПоПартнерам.Организация = &Организация)) КАК РасчетыСКлиентамиОстаткиИОбороты) КАК Вложение
		|
		|СГРУППИРОВАТЬ ПО
		|	Вложение.Период,
		|	Вложение.Регистратор
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вложение.Период
		|ИТОГИ
		|	СУММА(ОстатокНаНачало),
		|	СУММА(Дебет),
		|	СУММА(Кредит),
		|	СУММА(ОстатокНаКонец)
		|ПО
		|	ОБЩИЕ";
		
	Иначе
		Если ТипЗнч(Объект.Соглашение) = Тип("СправочникСсылка.СоглашенияСПоставщиками") тогда
			Текст =
			"ВЫБРАТЬ
			|	РасчетыСПоставщикамиОстаткиИОбороты.Регистратор КАК Регистратор,
			|	РасчетыСПоставщикамиОстаткиИОбороты.Период КАК Период,
			|	РасчетыСПоставщикамиОстаткиИОбороты.СуммаНачальныйОстаток КАК ОстатокНаНачало,
			|	РасчетыСПоставщикамиОстаткиИОбороты.СуммаРасход КАК Кредит,
			|	РасчетыСПоставщикамиОстаткиИОбороты.СуммаПриход КАК Дебет,
			|	РасчетыСПоставщикамиОстаткиИОбороты.СуммаКонечныйОстаток КАК ОстатокНаКонец
			|ИЗ
			|	РегистрНакопления.РасчетыСПоставщиками.ОстаткиИОбороты(
			|			&НачДата,
			|			&КонДата,
			|			Регистратор,
			|			,
			|			АналитикаУчетаПоПартнерам В
			|					(ВЫБРАТЬ
			|						АналитикаПоПартнерам.КлючАналитики
			|					ИЗ
			|						РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
			|					ГДЕ
			|						АналитикаПоПартнерам.Партнер = &Партнер
			|						И АналитикаПоПартнерам.Организация = &Организация)
			|				И Соглашение = &Соглашение) КАК РасчетыСПоставщикамиОстаткиИОбороты
			|ИТОГИ
			|	СУММА(ОстатокНаНачало),
			|	СУММА(Кредит),
			|	СУММА(Дебет),
			|	СУММА(ОстатокНаКонец)
			|ПО
			|	ОБЩИЕ";
		Иначе
			Текст = 
			"ВЫБРАТЬ
			|	РасчетыСКлиентамиОстаткиИОбороты.Соглашение КАК Соглашение,
			|	РасчетыСКлиентамиОстаткиИОбороты.Регистратор,
			|	РасчетыСКлиентамиОстаткиИОбороты.СуммаНачальныйОстаток КАК ОстатокНаНачало,
			|	РасчетыСКлиентамиОстаткиИОбороты.СуммаРасход КАК Кредит,
			|	РасчетыСКлиентамиОстаткиИОбороты.СуммаПриход КАК Дебет,
			|	РасчетыСКлиентамиОстаткиИОбороты.СуммаКонечныйОстаток КАК ОстатокНаКонец
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентами.ОстаткиИОбороты(
			|			&НачДата,
			|			&КонДата,
			|			Регистратор,
			|			,
			|			АналитикаУчетаПоПартнерам В
			|					(ВЫБРАТЬ
			|						АналитикаПоПартнерам.КлючАналитики
			|					ИЗ
			|						РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
			|					ГДЕ
			|						АналитикаПоПартнерам.Партнер = &Партнер
			|						И АналитикаПоПартнерам.Организация = &Организация)
			|				И Соглашение = &Соглашение) КАК РасчетыСКлиентамиОстаткиИОбороты
			|ИТОГИ
			|	СУММА(ОстатокНаНачало),
			|	СУММА(Кредит),
			|	СУММА(Дебет),
			|	СУММА(ОстатокНаКонец)
			|ПО
			|	ОБЩИЕ";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

&НаСервере
Функция ПолучитьРевизитОбъектаНаСервере(ИмяОбъектаФормы, ИмяРеквизита)
	
	Возврат Объект[ИмяОбъектаФормы][ИмяРеквизита];
	
КонецФункции//ПолучитьРевизитОбъектаНаСервере(ИмяОбъектаФормы, ИмяРеквизита)	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Объект.ПредставительОрганизацииДолжность = "Главный бухгалтер";
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАктСверки(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры// ЗаполнитьАктСверки

&НаКлиенте
Процедура ДокументРасчетовПриИзменении(Элемент)
	Объект.Организация = ПолучитьРевизитОбъектаНаСервере("ДокументРасчетов", "Организация");
	//Объект.ПредставительОрганизации = ПолучитьРевизитОбъектаНаСервере("Организация", "ТекущийГлавныйБухгалтер");
	ОтветственныеЛица = ПолучитьОтветственныеЛица();
	Объект.ПредставительОрганизации = ОтветственныеЛица.ГлавныйБухгалтер;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	//Объект.ПредставительОрганизации = ПолучитьРевизитОбъектаНаСервере("Организация", "ТекущийГлавныйБухгалтер");
	ОтветственныеЛица = ПолучитьОтветственныеЛица();
	Объект.ПредставительОрганизации = ОтветственныеЛица.ГлавныйБухгалтер;
КонецПроцедуры

//asp+++
&НаСервере
Функция ПолучитьОтветственныеЛица()
	Возврат ОтветственныеЛицаБП.ОтветственныеЛица(Объект.Организация, ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса()));
КонецФункции
//asp---

&НаКлиенте
Процедура СоглашениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//	
	Если НЕ ЗначениеЗаполнено(Объект.Партнер) тогда
		ПоказатьПредупреждение(Неопределено, "Не выбран партнер!");
		возврат;
	КонецЕсли;
	Выбор = Неопределено;

	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("СоглашениеВыборИзСпискаЗавершение", ЭтотОбъект), СписокВариантовСоглашений(), Элемент);
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеВыборИзСпискаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	// 
	
	Выбор = ВыбранныйЭлемент;
	Если Выбор = неопределено тогда возврат конецесли;
	
	Если Выбор.Значение = 0 тогда
		Форма = "Справочник.СоглашенияСКлиентами.ФормаВыбора";
	Иначе
		Форма = "Справочник.СоглашенияСПоставщиками.ФормаВыбора";
	КонецЕсли;
	ОткрытьФорму(Форма, Новый Структура("Партнер, ДатаДокумента", Объект.Партнер, Объект.Дата),,,,, Новый ОписаниеОповещения("ОткрытьФормуЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	//
	Выбор = Результат;
	Если НЕ ЗначениеЗаполнено(Выбор) тогда возврат конецесли;
	Объект.Соглашение = Выбор;

КонецПроцедуры

&НаКлиенте
Функция СписокВариантовСоглашений()
	
	Список = Новый СписокЗначений();
	Список.Добавить(0, "Соглашения с клиентами");
	Список.Добавить(1, "Соглашения с поставщиками");
	
	возврат Список;
	
КонецФункции
