////////////////////////////////////////////////////////////////////////////////
// Модуль "ВстречнаяКорректировкаНазначения", содержит процедуры и функции для 
// работы с механизмом встречной корректировки.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает параметры отбора встречной корректировки назначения
//
// Возвращаемое значение:
//  Структура - с ключами:
//   * Номенклатура             - СправочникСсылка.Номенклатура - 
//   * Характеристика           - СправочникСсылка.ХарактеристикиНоменклатуры - 
//   * Склад                    - СправочникСсылка.Склады - 
//   * ПоНазначению             - Число - 0 - без отбора,
//                                        1 - отбор на равенство,
//                                        2 - отбор на неравенство
//   * КоэффициентКорректировки - Число - 
//   * Остаток                  - Число - 
//
Функция ПараметрыТовараОтбораВстречнойКорректировкиНазначения() Экспорт
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура");
	ПараметрыОтбора.Вставить("Характеристика");
	ПараметрыОтбора.Вставить("Склад");
	ПараметрыОтбора.Вставить("ПоНазначению");
	ПараметрыОтбора.Вставить("КоэффициентКорректировки");
	ПараметрыОтбора.Вставить("Остаток");
	
	Возврат ПараметрыОтбора;
	
КонецФункции

//Возвращает данные для встречной корректировки назначения
//
// Параметры:
//  Параметры - Структура - с ключами:
//   * Номенклатура     - СправочникСсылка.Номенклатура - 
//   * Характеристика   - СправочникСсылка.ХарактеристикиНоменклатуры - 
//   * КлючНоменклатура - УникальныйИдентификатор - 
//   * КлючПартия       - УникальныйИдентификатор - 
//   * Количество       - Число - 
//
// Возвращаемое значение:
//  Структура - с ключами:
//   * ТоварыОтбор - см. ТоварыОтбораВстречнойКорректировкиНазначения
//
Функция ДанныеВстречнойКорректировкиНазначения(Параметры) Экспорт
	
	Данные =  Новый Структура;
	Данные.Вставить("ТоварыОтбор", ТоварыОтбораВстречнойКорректировкиНазначения(Параметры));
	
	Возврат Данные;
	
КонецФункции

//Возвращает данные товаров отбора встречной корректировки назначения
//
// Параметры:
//  Параметры - Структура - с ключами:
//   * Номенклатура     - СправочникСсылка.Номенклатура - 
//   * Характеристика   - СправочникСсылка.ХарактеристикиНоменклатуры - 
//   * КлючНоменклатура - УникальныйИдентификатор - 
//   * КлючПартия       - УникальныйИдентификатор - 
//   * Количество       - Число - 
//
// Возвращаемое значение:
//  Массив из см. ПараметрыТовараОтбораВстречнойКорректировкиНазначения
//
Функция ТоварыОтбораВстречнойКорректировкиНазначения(Параметры) Экспорт
	
	ДанныеТоваровОтбора = Новый Массив;
	
	ПараметрыОтбора = ПараметрыТовараОтбораВстречнойКорректировкиНазначения();
	ПараметрыОтбора.Номенклатура   = Параметры.Номенклатура;
	ПараметрыОтбора.Характеристика = Параметры.Характеристика;
	ПараметрыОтбора.ПоНазначению   = 2;
	ДанныеТоваровОтбора.Добавить(ПараметрыОтбора);
	
	Возврат ДанныеТоваровОтбора;
	
КонецФункции

#КонецОбласти