
&ИзменениеИКонтроль("ПередЗаписью")
Процедура асп_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект); 
	
	ИсправлениеДокументов.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
			
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ВидыЗапасов.Очистить();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РНПТ)
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ВыгружаемыкКолонки = "НомерСтроки, Номенклатура, НомерГТД, СтранаПроисхождения";
		
		#Удаление
		УчетПрослеживаемыхТоваровЛокализация.ЗаполнитьНомера(ЭтотОбъект, Товары.Выгрузить(, ВыгружаемыкКолонки));
		#КонецУдаления
		#Вставка
		УчетПрослеживаемыхТоваровЛокализация.ЗаполнитьНомера(ЭтотОбъект, Товары.Выгрузить(, "НомерСтроки,СтранаПроисхождения,НомерГТД,АналитикаУчетаНоменклатуры"), "Товары", "НомерГТД");
		#КонецВставки
	КонецЕсли;
	
КонецПроцедуры
