Функция НаправленияДеятельностиКэшированныеЗначения()
	
	КэшированныеЗначения = Новый Структура();
	КэшированныеЗначения.Вставить("ИспользоватьНаправленияДеятельности");
	КэшированныеЗначения.Вставить("ИспользоватьОбособленноеОбеспечениеЗаказов");
	КэшированныеЗначения.Вставить("НазначениеПоУмолчанию");
	Возврат КэшированныеЗначения;
	
КонецФункции

Процедура ASP_ПриЧтенииСозданииНаСервере(Форма) Экспорт    
	//ASP_Crow 11.03.2026 000029567 В расширени
	Форма.НаправленияДеятельностиКэшированныеЗначения = НаправленияДеятельностиКэшированныеЗначения();
	Кэш = Форма.НаправленияДеятельностиКэшированныеЗначения;
	Кэш.ИспользоватьОбособленноеОбеспечениеЗаказов = ПолучитьФункциональнуюОпцию("ИспользоватьОбособленноеОбеспечениеЗаказов");
	Кэш.ИспользоватьНаправленияДеятельности        = ПолучитьФункциональнуюОпцию("ИспользоватьУчетЗатратПоНаправлениямДеятельности");
	
	Если Форма.МетаданныеФормы.ЕстьНазначениеВТЧ И Форма.МетаданныеФормы.ВТЧНазначениеОтгрузки Тогда
		
		// Запись данных формы.
		Кэш.НазначениеПоУмолчанию = ТолкающееНазначение(Форма.Объект.НаправлениеДеятельности);
		
	ИначеЕсли Форма.МетаданныеФормы.ЭтоИсточникПотребности И Не ЗначениеЗаполнено(Форма.Объект.Ссылка) Тогда
		
		// Инициализируем назначение у нового документа
		МенеджерЗаказа = Документы[Форма.Объект.Ссылка.Метаданные().Имя];
		ШаблонНазначения = МенеджерЗаказа.ШаблонНазначения(Форма.Объект);
		
		// Если текущий вариант обособления не по заказу
		Если ШаблонНазначения.Заказ = Неопределено Тогда
			Форма.Объект.Назначение = Справочники.Назначения.НайтиПоШаблону(ШаблонНазначения);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

// Устанавливает видимость направления деятельности по порядку расчетов документа.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения - Форма, в которой было находится элемент группы финансового учета.
//	ЭтоЗаказ - Булево - Истина - Документ является заказом.
//	ПоЗаказу - Булево - Истина - Документ введен на основании заказа/заказов.
//
