// В табличном документе будем заменять слова в шапке на значения отбора
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; // отключаем стандартный вывод отчета - будем выводить программно
	Сообщить("Проверка");
	//Настройки = КомпоновщикНастроек.Настройки; 
	// если стоит настройка формирования отчета при открытии, то будет появляться ошибка, если некоторые параметры обязательные и не заполнены.
	
	// Поэтому устанавливаем параметры программно
	//ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ВидСредств");
	//   ПараметрСКД.Использование = Истина;
	//Если НЕ ЗначениеЗаполнено(ПараметрСКД.Значение) Тогда
	//	ПараметрСКД.Значение      = Перечисления.ВидыСредств.ЛимитыБюджетныхОбязательств;
	//КонецЕсли;
	
	//ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ФинансовыйГод");
	//   ПараметрСКД.Использование = Истина;
	//Если НЕ ЗначениеЗаполнено(ПараметрСКД.Значение) Тогда
	// ПараметрСКД.Значение = НачалоГода(ТекущаяДата());
	//КонецЕсли;
	
	// Переносим настройки из настроек в пользовательские настройки
	
	//ТаблицаОтборов = ПолучитьТаблицуОтборов();
	//Н = 0;
	//Для Каждого ЭлементОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
	// СтрокаТаблицы = ТаблицаОтборов.Получить(Н);
	// ЭлементПользовательскогоОтбора = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[СтрокаТаблицы.Индекс+3];  
	// 
	// ЭлементОтбора.Использование = ЭлементПользовательскогоОтбора.Использование;
	// ЭлементОтбора.ПравоеЗначение = ЭлементПользовательскогоОтбора.ПравоеЗначение;
	// Н = Н + 1;
	//КонецЦикла;
	// // Программно выводим отчет
	Отчет=РеквизитФормыВЗначение("Отчет");
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	СхемаКомпоновкиДанных = Отчет.ПолучитьМакет("СхемаКомпоновкиДанных");
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ДокументРезультат.Очистить();
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// эта таблица должна совпадать с порядком и названиями
	// элементов отбора отчета
	// Для Каждого Строка Из ТаблицаОтборов Цикл
	//  Если Строка.Индекс+3 <= КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Количество()-1 Тогда
	//   ЭлементОтбора = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[Строка.Индекс+3];
	//   //Сообщить(СокрЛП(ЭлементОтбора.ПравоеЗначение) + " индекс  = " + Н);
	//  
	//   Если ЭлементОтбора.Использование Тогда
	//	УстановитьНазвание = Истина;
	//   Иначе
	//	Установитьназвание = Ложь;
	//   КонецЕсли;
	//// В отчете нарисована собственная шапка. В ней необходимо установить значения параметров.
	
	//// Для этого в сформированном табличном документе делаем поиск текста и меняем его на значения параметров.   
	//   Область = ДокументРезультат.НайтиТекст("&" + Строка.Название);
	//   Если Область<>Неопределено Тогда
	//	Если УстановитьНазвание Тогда
	//	 Область.Текст = СокрЛП(ЭлементОтбора.ПравоеЗначение);
	//	 ЗаменитьНазваниеКода(ДокументРезультат, Строка.НазваниеКода, ЭлементОтбора.ПравоеЗначение.Код);
	//	Иначе
	//	 Область.Текст = "";
	//	 ЗаменитьНазваниеКода(ДокументРезультат, Строка.НазваниеКода, "");
	//	КонецЕсли;
	//   КонецЕсли;
	//  КонецЕсли;
	// КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПрограммно(Команда)
	СформироватьОтчетНаСервере(Результат);	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере(ТабДок)
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Схема = ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных1");
	Настройки = Схема.НастройкиПоУмолчанию;
	ТабДок.Очистить();
	КомпоновщикНастроекДанных = Новый КомпоновщикНастроекКомпоновкиДанных;
	НовыйДанныеРасшифровки    = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикНастроекДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
	КомпоновщикНастроекДанных.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	КомпоновщикНастроекДанных.ЗагрузитьПользовательскиеНастройки(Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
	//Пользовательские настройки
	Ин=0;
	ВыбранныеПоляПараметрыПользовательские = КомпоновщикНастроекДанных.ПользовательскиеНастройки.Элементы;
	ВыбранныеПоляПараметры = КомпоновщикНастроекДанных.Настройки.ПараметрыДанных.Элементы;
	Для Инд=4 По 7 Цикл
		Знак=Истина;
		ВыбранныеПоляПараметры[Инд].Значение     =Знак;
		ВыбранныеПоляПараметры[Инд].Использование=Знак;
	КонецЦикла;
	ВыбранныеПоля = КомпоновщикНастроекДанных.ПользовательскиеНастройки.Элементы;
	Для Каждого ЭлементВыбора Из ВыбранныеПоля Цикл
		Если ТипЗнч(ЭлементВыбора)=Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
		ИначеЕсли ТипЗнч(ЭлементВыбора)=Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЭлементыОтбор=КомпоновщикНастроекДанных.Настройки.Отбор.Элементы;
			Для Каждого ЭлементВыбораОтбор Из ЭлементыОтбор Цикл
				Если ЭлементВыбора.ИдентификаторПользовательскойНастройки=ЭлементВыбораОтбор.ИдентификаторПользовательскойНастройки Тогда 
					ВыбранныеПоляМакет=КомпоновщикНастроекДанных.Настройки.Структура[0].Выбор.Элементы;
					Для Каждого ЭлементВыбораМакет Из ВыбранныеПоляМакет Цикл
						Если Найти("Партнер,Контакт",ЭлементВыбораМакет.Поле)>0 Тогда 
							Продолжить; 
						КонецЕсли;
						Если  ЭлементВыбораМакет.Поле = ЭлементВыбораОтбор.ЛевоеЗначение Тогда
							Если Найти(ЭлементВыбораОтбор.ЛевоеЗначение,"Подразделение")=0 Тогда
								ЭлементВыбораМакет.Использование=ЭлементВыбора.Использование;
							КонецЕсли;
							//ЭлементВыбораМакет.Использование=Истина;
							Прервать;
						КонецЕсли;
						// Здесь устнавливаем параметры
						//====
						Если  ЭлементВыбораМакет.Поле="ДилерскийСегмент" Тогда
							ВыбранныеПоляПараметры[4].Значение=Истина;
							ВыбранныеПоляПараметры[4].Использование=Истина;
						ИначеЕсли  ЭлементВыбораМакет.Поле="МаркетинговыйСегмент" Тогда
							ВыбранныеПоляПараметры[5].Значение=Истина;
							ВыбранныеПоляПараметры[5].Использование=Истина;
						ИначеЕсли  ЭлементВыбораМакет.Поле="СегментПоЧастотеЗаказов" Тогда
							ВыбранныеПоляПараметры[6].Значение=Истина;
							ВыбранныеПоляПараметры[6].Использование=Истина;
						ИначеЕсли  ЭлементВыбораМакет.Поле="ОборотныйСегмент" Тогда
							ВыбранныеПоляПараметры[7].Значение=Истина;
							ВыбранныеПоляПараметры[7].Использование=Истина;
						КонецЕсли;	
						//Для Каждого ЭлементВыбораПараметры Из ВыбранныеПоляПараметры Цикл
						//	Если ТипЗнч(ЭлементВыбораПараметры)=Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
						//		ЭлементыПараметр=ЭлементВыбораПараметры.Параметр;
						//		Сообщить(ЭлементВыбораПараметры);
						//	КонецЕсли;
						//КонецЦикла;
						//====
						//Асист KS
						Если  Найти(ЭлементВыбораМакет.Поле,"Подразделение")>0 Тогда
							Для каждого Отбор из КомпоновщикНастроекДанных.Настройки.Отбор.Элементы Цикл
								Если Найти(Отбор.ЛевоеЗначение,"Подразделение")>0 Тогда
									ПодразделениеОтбор = ВыбранныеПоля.Найти(Отбор.ИдентификаторПользовательскойНастройки);
									Если Не ПодразделениеОтбор.Использование Тогда
										ПодразделениеОтбор.Использование = Истина;
										ПодразделениеОтбор.ПравоеЗначение = Справочники.СтруктураПредприятия.ПустаяСсылка();
										ЭлементВыбораМакет.Использование = Ложь;
									КонецЕсли;
									Прервать;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
						//Асист KS
						

					КонецЦикла;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Ин=Ин+1;
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(Схема, КомпоновщикНастроекДанных.ПолучитьНастройки(),НовыйДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет,,НовыйДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки); 
	
	Адрес = ПоместитьВоВременноеХранилище(НовыйДанныеРасшифровки,УникальныйИдентификатор);
	ДанныеРасшифровки = Адрес ; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	ВариантыОтчетов.ПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
КонецПроцедуры
