
&Вместо("ПродолжитьВыполнениеКомандыПослеПодтверждениеПроведения")
Процедура Расш1_ПродолжитьВыполнениеКомандыПослеПодтверждениеПроведения(Ответ, Контекст) Экспорт
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	//+++ {{ ASP 10.09.2020 000008403 }}
	ОтметитьЗаписьИзФормы = Ложь;
	Если ТипЗнч(Контекст.Форма) = Тип("УправляемаяФорма")
	 И Контекст.ЭтоФормаОбъекта
	 И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст, "Источник")
	 И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Контекст.Источник, "Ссылка") Тогда
		
		Если ТипЗнч(Контекст.Источник.Ссылка) = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
			ОтметитьЗаписьИзФормы = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОтметитьЗаписьИзФормы Тогда
		МассивНепроведенныхДокументов = Новый Массив;
		Для Каждого Непроведенный Из Контекст.НепроведенныеДокументы Цикл
			ДополнительныеСвойства = Новый Структура("ЗаписьИзФормы", "ФормаДокумента");
			НовЭлемент = Новый Структура("Ссылка, ДополнительныеСвойства", Непроведенный, ДополнительныеСвойства);
			МассивНепроведенныхДокументов.Добавить(НовЭлемент);
		КонецЦикла;
		
		ДанныеОНепроведенныхДокументах = ОбщегоНазначенияВызовСервера.ПровестиДокументы(МассивНепроведенныхДокументов);
	Иначе
	//--- {{ ASP 10.09.2020 000008403 }}
	ДанныеОНепроведенныхДокументах = ОбщегоНазначенияВызовСервера.ПровестиДокументы(Контекст.НепроведенныеДокументы);
	//+++ {{ ASP 10.09.2020 000008403 }}
	КонецЕсли;
	//--- {{ ASP 10.09.2020 000008403 }}
	ШаблонСообщения = НСтр("ru = 'Документ %1 не проведен: %2'");
	НепроведенныеДокументы = Новый Массив;
	Для Каждого ИнформацияОДокументе Из ДанныеОНепроведенныхДокументах Цикл
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонСообщения,
				Строка(ИнформацияОДокументе.Ссылка),
				ИнформацияОДокументе.ОписаниеОшибки),
				ИнформацияОДокументе.Ссылка);
		НепроведенныеДокументы.Добавить(ИнформацияОДокументе.Ссылка);
	КонецЦикла;
	Контекст.Вставить("НепроведенныеДокументы", НепроведенныеДокументы);
	
	Контекст.МассивСсылок = ОбщегоНазначенияКлиентСервер.РазностьМассивов(Контекст.МассивСсылок, НепроведенныеДокументы);
	
	// Оповещаем открытые формы о том, что были проведены документы.
	ТипыПроведенныхДокументов = Новый Соответствие;
	Для Каждого ПроведенныйДокумент Из Контекст.МассивСсылок Цикл
		ТипыПроведенныхДокументов.Вставить(ТипЗнч(ПроведенныйДокумент));
	КонецЦикла;
	Для Каждого Тип Из ТипыПроведенныхДокументов Цикл
		ОповеститьОбИзменении(Тип.Ключ);
	КонецЦикла;
	
	// Если команда была вызвана из формы, то зачитываем в форму актуальную (проведенную) копию из базы.
	Если ТипЗнч(Контекст.Форма) = Тип("УправляемаяФорма") Тогда
		Если Контекст.ЭтоФормаОбъекта Тогда
			Контекст.Форма.Прочитать();
		КонецЕсли;
		Контекст.Форма.ОбновитьОтображениеДанных();
		//+++ {{ ASP 10.09.2020 000008403 }}
		Если ОтметитьЗаписьИзФормы
		 И НепроведенныеДокументы.Найти(Контекст.Источник.Ссылка) = Неопределено Тогда
			ASP_Клиент.ПослеЗаписиИзФормы(Контекст.Форма, Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		КонецЕсли;
		//--- {{ ASP 10.09.2020 000008403 }}
	КонецЕсли;
	
	Если НепроведенныеДокументы.Количество() > 0 Тогда
		// Спрашиваем пользователя о необходимости продолжения создания на основании при наличии непроведенных документов.
		ТекстДиалога = НСтр("ru = 'Не удалось провести один или несколько документов.'");
		
		КнопкиДиалога = Новый СписокЗначений;
		Если Контекст.МассивСсылок.Количество() = 0 Тогда
			КнопкиДиалога.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'ОК'"));
		Иначе
			ТекстДиалога = ТекстДиалога + " " + НСтр("ru = 'Продолжить?'");
			КнопкиДиалога.Добавить(КодВозвратаДиалога.Пропустить, НСтр("ru = 'Продолжить'"));
			КнопкиДиалога.Добавить(КодВозвратаДиалога.Отмена);
		КонецЕсли;
		
		Обработчик = Новый ОписаниеОповещения("ПродолжитьВыполнениеКомандыПослеПодтверждениеПродолжения", ЭтотОбъект, Контекст);
		ПоказатьВопрос(Обработчик, ТекстДиалога, КнопкиДиалога);
		Возврат;
	КонецЕсли;
	
	ПродолжитьВыполнениеКоманды(Контекст);
КонецПроцедуры
