&НаСервере
Функция ПроверитьДокументОснование(Заявка)
	ДокументОснование=Заявка.ДокументОснование;
	Если ДокументОснование=Неопределено Или ТипЗнч(ДокументОснование)<>Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции//НайтиДокументРеализацииНаСервере

// Процедура - обработчик события "ОбработкаКоманды".
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
			
	//Если  Не ПроверитьДокументОснование(ПараметрКоманды) Тогда
	//	Сообщить("Документ основания не заполнен или имеет неверный тип");	
	//	Возврат;
	//КонецЕсли;
	ОбъектыПечати = Новый СписокЗначений();  
	ОбъектыПечати.Добавить(ПараметрКоманды);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
	"Документ.ЗаявкаНаТранспорт",
	"БланкЗаказа",
	ПараметрКоманды,
	Неопределено,
	Новый Структура
	);
		
КонецПроцедуры // ОбработкаКоманды()
