// @strict-types

#Область ПрограммныйИнтерфейс

#Область ЦеныТоваров

// Возвращает детальную информацию по типам цен, используемым учетными записями Ozon.
//
// Возвращаемое значение:
//   ТаблицаЗначений - таблица с описанием указанных типов цен учетной записи; содержит колонки:
//     * Идентификатор          - Строка - строковое обозначение типа цен.
//     * ИдентификаторДляФормул - Строка - шаблон для формирования идентификатора вида цен.
//     * Наименование           - Строка - наименование типа цен.
//     * ДляУчетнойЗаписи       - Булево - признак отношения типа цен к учетной записи или к интеграции в целом.
//     * ОбязательноеЗаполнение - Булево - признак обязательного заполнения в формах.
//     * Значение               - СправочникСсылка.ВидыЦен - пустая ссылка вида цен.
//     * ИмяПараметраСИ         - Строка - имя параметра Вид цены в запросе к сервису интеграции
//
Функция ТипыЦенLamoda() Экспорт

	ТипыЦен = ИнтеграцияСМаркетплейсамиСИ.НовыйТаблицаТипыЦен();

	НоваяСтрока = ТипыЦен.Добавить();
	НоваяСтрока.Идентификатор = ИнтеграцияСМаркетплейсамиКлиентСервер.ИмяВидЦеныДоСкидок();
	НоваяСтрока.ИдентификаторДляФормул = "";
	НоваяСтрока.Наименование = НСтр("ru = 'Цена до скидок'");
	НоваяСтрока.ДляУчетнойЗаписи = Истина;
	НоваяСтрока.ОбязательноеЗаполнение = Истина;
	НоваяСтрока.ИмяПараметраСИ = "price";
	
	НоваяСтрока = ТипыЦен.Добавить();
	НоваяСтрока.Идентификатор = ИнтеграцияСМаркетплейсамиКлиентСервер.ИмяВидЦеныСоСкидкойПродавца();
	НоваяСтрока.ИдентификаторДляФормул = "";
	НоваяСтрока.Наименование = НСтр("ru = 'Цена с учетом скидки продавца'");
	НоваяСтрока.ДляУчетнойЗаписи = Истина;
	НоваяСтрока.ОбязательноеЗаполнение = Истина;
	НоваяСтрока.ИмяПараметраСИ = "priceDiscounted";

	Возврат ТипыЦен;

КонецФункции

#КонецОбласти

#КонецОбласти