
&НаСервере
Процедура асп_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	МассивКолонок = новый массив;
	МассивКолонок.Добавить(Новый РеквизитФормы("НоменклатураКлиента", Новый ОписаниеТипов("СправочникСсылка.НоменклатураКонтрагентов"), "ДеревоЦен")); 
	МассивКолонок.Добавить(Новый РеквизитФормы("Клиент", Новый ОписаниеТипов("СправочникСсылка.Партнеры"))); 
	ИзменитьРеквизиты(МассивКолонок);
	//НовыйЭлемент = ЭтаФорма.Элементы.Вставить("НоменклатураКлиента", Тип("ПолеФормы"), , );
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.Заголовок = "Номенклатура клиента";
	//НовыйЭлемент.ПутьКДанным = "ДеревоЦен.НоменклатураКлиента";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Вставить("Клиент", Тип("ПолеФормы"),, Элементы.СтраницыКоманднойПанели);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Клиент";
	НовыйЭлемент.ПутьКДанным = "Клиент";
	ПВ = новый массив;
	ПВ.Добавить(новый ПараметрВыбора("Отбор.Клиент", Истина));
	НовыйЭлемент.ПараметрыВыбора = новый ФиксированныйМассив(ПВ);
КонецПроцедуры
