
&НаКлиенте
Процедура Создать(Команда)
	// Проверка заполнения
	Если НЕ ПроверитьЗаполнение() Тогда
		Предупреждение("Заполните необходимые реквизиты!!!");
		Возврат;
	ИначеЕсли ПустаяСтрока(ЕМайл) И ПустаяСтрока(Телефон) Тогда
		Предупреждение("Заполните хотя бы одно поле контактной информации партнера (телефон или e-mail)");
		Возврат;
	КонецЕсли;	
	
	// Проверка подобных реквизитов
	Если ЕстьПодобноеНаименование ИЛИ ЕстьПодобныйEmail ИЛИ ЕстьПодобныйТелефон Тогда
		Ответ = Вопрос("Обнаружены партнеры с подобными реквизитами (наименование, e-mail или телефон). Продолжить создание партнера?", РежимДиалогаВопрос.ДаНетОтмена);
		Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	// При создании контактного лица проверяем по физ. лицу
	Если СоздатьКонтактноеЛицо Тогда
		Если ИспользованиеФизЛица = 0
			И НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
			Предупреждение("Для создания контактного лица требуется указать физ.лицо");
			Возврат;
		ИначеЕсли ИспользованиеФизЛица = 1 
			И ПустаяСтрока(Фамилия+Имя+Отчество) Тогда
			Предупреждение("Для создания контактного лица укажите ФИО физ.лица");
			Возврат;
		КонецЕсли;
		//
		Если ПустаяСтрока(ЕмайлКонтактногоЛица) 
			И ПустаяСтрока(ТелефонКонтактногоЛица)
			И ПустаяСтрока(МобильныйТелефон) Тогда
			Предупреждение("Заполните хотя бы одно поле контактной информации контактного лица");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
		
	// Создание партнера
	Партнер = СозданиеПартнера();
	
	Структура = Новый Структура("Партнер, КаналПервичногоИнтереса, ИсточникПервичногоИнтереса", Партнер, КаналПервичногоИнтереса, ИсточникПервичногоИнтереса);
	ЭтаФорма.Закрыть(Структура);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("БизнесРегион", БизнесРегион);
	Параметры.Свойство("КаналПервичногоИнтереса", КаналПервичногоИнтереса);
	Параметры.Свойство("ИсточникПервичногоИнтереса", ИсточникПервичногоИнтереса);	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтактноеЛицоПриИзменении(Элемент)
	Если СоздатьКонтактноеЛицо Тогда
		Элементы.КонтактноеЛицо.Доступность = Истина;
	Иначе
		Элементы.КонтактноеЛицо.Доступность = Ложь;	
		Имя = Неопределено;
		Отчество = Неопределено;
		Фамилия = Неопределено;
		ЕмайлКонтактногоЛица = Неопределено;
		ТелефонКонтактногоЛица = Неопределено;
		МобильныйТелефон = Неопределено;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)		
	Результат = ОткрытьФормуМодально("ОбщаяФорма.ВводТелефона");
	Телефон = Результат.Представление;
КонецПроцедуры

&НаКлиенте
Процедура МобильныйТелефонНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Результат = ОткрытьФормуМодально("ОбщаяФорма.ВводТелефона");
	МобильныйТелефон = Результат.Представление;
КонецПроцедуры

&НаКлиенте
Процедура ТелефонКонтактногоЛицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Результат = ОткрытьФормуМодально("ОбщаяФорма.ВводТелефона");
	Телефон = Результат.Представление;
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеФизЛицаПриИзменении(Элемент)
	Элементы.ФизЛицо.Видимость = (ИспользованиеФизЛица = 0);
КонецПроцедуры

&НаСервере
Функция СозданиеПартнера()
	Нов = Справочники.Партнеры.СоздатьЭлемент();
	Нов.Родитель = ГруппаПартнеров;
	Нов.Наименование = Наименование;
	Нов.НаименованиеПолное = Наименование;
	Нов.БизнесРегион = БизнесРегион;
	Нов.ДатаРегистрации = ТекущаяДата();
	Нов.Клиент = Истина;
	Нов.ОсновнойМенеджер = ПараметрыСеанса.ТекущийПользователь;
	Нов.Комментарий = Комментарий;
	
	// Контактная информация
	Если НЕ ПустаяСтрока(ЕМайл) Тогда
		СтрокаТЧ = Нов.КонтактнаяИнформация.Добавить();
		СтрокаТЧ.Вид = Справочники.ВидыКонтактнойИнформации.EmailПартнера;
		СтрокаТЧ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		СтрокаТЧ.АдресЭП = ЕМайл;
		СтрокаТЧ.Представление = ЕМайл;
	КонецЕсли;
	Если НЕ ПустаяСтрока(Телефон) Тогда
		СтрокаТЧ = Нов.КонтактнаяИнформация.Добавить();
		СтрокаТЧ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
		СтрокаТЧ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
		СтрокаТЧ.НомерТелефона = Телефон;
		СтрокаТЧ.Представление = Телефон;
	КонецЕсли;
	
	Нов.Записать();
	
	// Контактное лицо
	Если СоздатьКонтактноеЛицо Тогда
		// Определимся с физ.лицом КЛ
		Если ИспользованиеФизЛица = 1 Тогда//Создаем физ.лицо
			НовФЛ = Справочники.ФизическиеЛица.СоздатьЭлемент();
			НовФЛ.Родитель = ГруппаФизЛиц;
			НовФЛ.Наименование = Фамилия + " " + Имя + " " + Отчество;
			НовФЛ.Записать();
			ФизЛицо = НовФЛ.Ссылка;
		КонецЕсли;
		
		НовКЛ = Справочники.КонтактныеЛицаПартнеров.СоздатьЭлемент();
		НовКЛ.Владелец = Нов.Ссылка;
		НовКЛ.ФизЛицо = ФизЛицо;
		НовКЛ.Наименование = ФизЛицо.Наименование;
		НовКЛ.ДатаРегистрацииСвязи = ТекущаяДата();
		НовКЛ.РолиКонтактногоЛица.Добавить().РольКонтактногоЛица = РольКонтактногоЛица;
		НовКЛ.Автор = ПараметрыСеанса.ТекущийПользователь;
		
		// Контактные данные контактного лица
		Если НЕ ПустаяСтрока(ЕмайлКонтактногоЛица) Тогда
			СтрокаТЧ = НовКЛ.КонтактнаяИнформация.Добавить();
			СтрокаТЧ.Вид = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
			СтрокаТЧ.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			СтрокаТЧ.АдресЭП = ЕмайлКонтактногоЛица;
			СтрокаТЧ.Представление = ЕмайлКонтактногоЛица;
		КонецЕсли;
		Если НЕ ПустаяСтрока(ТелефонКонтактногоЛица) Тогда
			СтрокаТЧ = НовКЛ.КонтактнаяИнформация.Добавить();
			СтрокаТЧ.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
			СтрокаТЧ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			СтрокаТЧ.НомерТелефона = ТелефонКонтактногоЛица;
			СтрокаТЧ.Представление = ТелефонКонтактногоЛица;
		КонецЕсли;
		Если НЕ ПустаяСтрока(МобильныйТелефон) Тогда
			СтрокаТЧ = НовКЛ.КонтактнаяИнформация.Добавить();
			СтрокаТЧ.Вид = Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица;
			СтрокаТЧ.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			СтрокаТЧ.НомерТелефона = МобильныйТелефон;
			СтрокаТЧ.Представление = МобильныйТелефон;
		КонецЕсли;
		
		НовКЛ.Записать();
	КонецЕсли;
	
	Возврат Нов.Ссылка;
	
КонецФункции	

&НаКлиенте
Процедура НаименованиеПолноеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Список = Новый СписокЗначений();
	Список.Добавить("ООО """+Наименование+"""");
	Список.Добавить("ОАО """+Наименование+"""");
	Список.Добавить("ЗАО """+Наименование+"""");
	Список.Добавить("ГУП """+Наименование+"""");
	
	Выбор = ВыбратьИзСписка(Список);
	Если Выбор = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	НаименованиеПолное = Выбор.Значение;
КонецПроцедуры

//// Проверка наличия партнеров с подобными характеристиками
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ПроверитьНаименованиеНаСервере();
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ЕМайлПриИзменении(Элемент)
	ПроверитьЕМайлНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТелефонПриИзменении(Элемент)
	ПроверитьТелефонНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаименованиеНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Партнеры.Ссылка) КАК КоличествоПодобныхПартнеров
	                      |ИЗ
	                      |	Справочник.Партнеры КАК Партнеры
	                      |ГДЕ
	                      |	Партнеры.Наименование ПОДОБНО &Наименование");
	Запрос.УстановитьПараметр("Наименование", "%"+Наименование+"%");
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Если Выборка.КоличествоПодобныхПартнеров > 0 Тогда
		ЕстьПодобноеНаименование = Истина;
	Иначе
		ЕстьПодобноеНаименование = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьЕМайлНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПартнерыКонтактнаяИнформация.Ссылка) КАК КоличествоПодобныхПартнеров
	                      |ИЗ
	                      |	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	                      |ГДЕ
	                      |	ПартнерыКонтактнаяИнформация.АдресЭП ПОДОБНО &АдресЭП");
	Запрос.УстановитьПараметр("АдресЭП", "%"+ЕМайл+"%");
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Если Выборка.КоличествоПодобныхПартнеров > 0 Тогда
		ЕстьПодобныйEmail = Истина;
	Иначе
		ЕстьПодобныйEmail = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьТелефонНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПартнерыКонтактнаяИнформация.Ссылка) КАК КоличествоПодобныхПартнеров
	                      |ИЗ
	                      |	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	                      |ГДЕ
	                      |	(ПартнерыКонтактнаяИнформация.НомерТелефона ПОДОБНО &Телефон
	                      |			ИЛИ ПартнерыКонтактнаяИнформация.НомерТелефонаБезКодов ПОДОБНО &Телефон)");
	Запрос.УстановитьПараметр("Телефон", "%"+Телефон+"%");
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Если Выборка.КоличествоПодобныхПартнеров > 0 Тогда
		ЕстьПодобныйТелефон = Истина;
	Иначе
		ЕстьПодобныйТелефон = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЮрЛицоПриИзменении(Элемент)
	Если ЮрЛицо=Истина Тогда
	СоздатьКонтактноеЛицо=Истина;
Если СоздатьКонтактноеЛицо Тогда
		Элементы.КонтактноеЛицо.Доступность = Истина;
	Иначе
		Элементы.КонтактноеЛицо.Доступность = Ложь;	
		Имя = Неопределено;
		Отчество = Неопределено;
		Фамилия = Неопределено;
		ЕмайлКонтактногоЛица = Неопределено;
		ТелефонКонтактногоЛица = Неопределено;
		МобильныйТелефон = Неопределено;
	КонецЕсли;	
	
	КонецЕсли;

КонецПроцедуры
