////////////////////////////////////////////////////////////////////////////////
// Клиент-серверные процедуры и функции, управляющие настройками системы.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Конструктор для описания результатов глоабльного поиска
//
// Возвращаемое значение:
//  Структура - результат глобального поиска:
//   * Значение - Неопределено, Произвольный - параметры передаваемые при выборе результат глобального поиска.
//   * Представление - Строка, ФорматированнаяСтрока - представление отображаемое пользователю.
//   * Картинка - Картинка - картинка результат поиска.
//   * ОписаниеДействия - Строка - описание действия при выборе результата глобального поиска.
Функция НовыйРезультатГлобальногоПоиска() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Значение", Неопределено);
	Результат.Вставить("Представление", "");
	Результат.Вставить("Картинка", Новый Картинка);
	Результат.Вставить("ОписаниеДействия", "");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти