
&НаКлиенте
Процедура ТолщинаМеталлаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	Список = Новый СписокЗначений();
	
	Если Запись.ВысотаПрофиля = "90" тогда 
		Список.Добавить("1.5");
		Список.Добавить("2.0");
	ИначеЕсли Запись.ВысотаПрофиля = "120" тогда 
		Список.Добавить("1.5");
		Список.Добавить("2.0");
		Список.Добавить("2.5");
	ИначеЕсли Запись.ВысотаПрофиля = "150" тогда 
		Список.Добавить("2.0");
		Список.Добавить("2.5");
		Список.Добавить("3.0");
	ИначеЕсли Запись.ВысотаПрофиля = "180" тогда 		
		Список.Добавить("2.5");
		Список.Добавить("3.0");
	Конецесли;
	
	Выбор = ВыбратьИзСписка(Список, Элемент);
	Если Выбор = неопределено тогда возврат конецесли;
	
	Запись.ТолщинаМеталла = Выбор.Значение;
	
КонецПроцедуры
