
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		// Заполнение шапки
		ЗаказКлиента = ДанныеЗаполнения.ЗаказКлиента;
		//Комментарий = ДанныеЗаполнения.Комментарий;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Менеджер = ДанныеЗаполнения.Менеджер;
		Партнер = ДанныеЗаполнения.Партнер;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Реализация = ДанныеЗаполнения.Ссылка;
		ТиповыеУсловия = Истина;
		Основание=ДанныеЗаполнения.Ссылка;      
		МЧ=2000;
		СрокГарантииМесяцев=12;      
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл 
			
				//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Номенклатура.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.Ссылка В ИЕРАРХИИ(&Техника)
				|	И НЕ Номенклатура.Ссылка В ИЕРАРХИИ (&Запчасти)
				|	И Номенклатура.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", ТекСтрокаТовары.Номенклатура);
			Запрос.УстановитьПараметр("Техника", Справочники.Номенклатура.НайтиПоКоду("0-000000002"));
			Запрос.УстановитьПараметр("Запчасти", Справочники.Номенклатура.НайтиПоКоду("0--00019517"));
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					НоваяСтрока = Товар.Добавить();
					НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
					НоваяСтрока.ДатаНачала = ДанныеЗаполнения.Дата;
					НоваяСтрока.ДатаКонец = ДобавитьМесяц(ДанныеЗаполнения.Дата,12);
					
					Если ТекСтрокаТовары.Количество>1 Тогда 
						Для Стр=2 По ТекСтрокаТовары.Количество Цикл  
						НоваяСтрока = Товар.Добавить();
						НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
						НоваяСтрока.ДатаНачала = ДанныеЗаполнения.Дата;
						НоваяСтрока.ДатаКонец = ДобавитьМесяц(ДанныеЗаполнения.Дата,12); 
						
						КонецЦикла;
					КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ГарантийныеТалоны
	Движения.ASP_ГарантийныеТалоны.Записывать = Истина;
	Для Каждого ТекСтрокаТовар Из Товар Цикл
		Движение = Движения.ASP_ГарантийныеТалоны.Добавить();
		Движение.Номенклатура = ТекСтрокаТовар.Номенклатура;
		Движение.ДатаНачала = ТекСтрокаТовар.ДатаНачала;
		Движение.ДатаКонец = ТекСтрокаТовар.ДатаКонец;
		Движение.СерийныйНомер = ТекСтрокаТовар.СерийныйНомер;
		Движение.Клиент = Партнер;
		Движение.ТиповыеУсловия=ТиповыеУсловия;
		Движение.Реализация=Реализация;      
		Движение.ПН=ТекСтрокаТовар.НомерСтроки;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
