//+++ASP_yulia_l_04/10/2021_ 000012681
&НаКлиенте
Процедура асп_СписокВыборЗначенияПосле(Элемент, Значение, СтандартнаяОбработка)
	//Массив = Новый Массив;
	//Массив.Добавить(Элемент.ТекущиеДанные.ОбеспечениеЗаказов_Потребность);
	//Массив.Добавить(Элемент.ТекущиеДанные.Назначение);
	Количество = 0;
	
	ИмяСобытия = "ОбработкаВыбораНазначения";
	Если ТипЗнч(Этаформа.Источник) = Тип("ДокументСсылка.ЗаказНаПеремещение") И (Элемент.ТекущиеДанные.Свойство("Получатель_Потребность") ИЛИ Элемент.ТекущиеДанные.Свойство("ВсеСклады_Потребность")) Тогда
		Если Элемент.ТекущиеДанные.Свойство("Получатель_Потребность") Тогда
			Количество = Элемент.ТекущиеДанные.Получатель_Потребность;
		ИначеЕсли Элемент.ТекущиеДанные.Свойство("ВсеСклады_Потребность") Тогда
			Количество = Элемент.ТекущиеДанные.ВсеСклады_Потребность;
		КонецЕсли;	
	ИначеЕсли 	ТипЗнч(Этаформа.Источник) = Тип("ДокументСсылка.ЗаказПоставщику") И Элемент.ТекущиеДанные.Свойство("ОбеспечениеЗаказов_Потребность") Тогда
		Количество = Элемент.ТекущиеДанные.ОбеспечениеЗаказов_Потребность;
	ИначеЕсли ТипЗнч(Этаформа.Источник) = Тип("ДокументСсылка.ЗаказПоставщику") И Элемент.ТекущиеДанные.Свойство("ОбеспечениеЗаказовПоВалюте_Потребность") Тогда
		Количество = Элемент.ТекущиеДанные.ОбеспечениеЗаказовПоВалюте_Потребность;
	КонецЕсли;
	Если НЕ Количество = 0 Тогда
		Оповестить(ИмяСобытия, Количество);
	КонецЕсли;	
		
КонецПроцедуры
//---ASP_yulia_l_04/10/2021_ 000012681

&НаСервере
&Вместо("УстановитьТекстИПараметрыЗапросаДинамическогоСписка")
Процедура асп_УстановитьТекстИПараметрыЗапросаДинамическогоСписка()
	
	ТекстыЗапросов = Новый Массив();
	
	// Формирование списка запросов - источников данных
	// В финальный текст включаются только те запросы, поля из которых используются
	// Для секции ВЫБОРКА досчитываются поля, присутствующие в других запросах.
	Для Каждого ОписаниеКолонок Из МакетФормыНазначений.ОписанияКолонок Цикл
		
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("Префикс", ОписаниеКолонок.Префикс);
		ПараметрыОтбора.Вставить("УстановитьОтбор", Истина);
		
		НайденныеКолонки = КолонкиСписка.НайтиСтроки(ПараметрыОтбора);
		
		// Имеет смысл исполнять запрос, если из него выбирается хотя бы одно поле
		
		ВключатьВИтоговыйЗапрос = Ложь;
		Если КолонкиСписка.Количество() > 0 И НайденныеКолонки.Количество() > 0 Тогда
			
			ВключатьВИтоговыйЗапрос = Справочники.Назначения.ПроверитьУсловиеИспользования(ОписаниеКолонок.Префикс,
				ОписаниеКолонок.УсловиеИспользования, ПараметрыДинамическогоСписка);
			
		КонецЕсли;
		
		Если ВключатьВИтоговыйЗапрос Тогда
			
			ТекстЗапросаПредшествующиеПоля = "";
			ТекстЗапросаПоследующиеПоля = "";
			
			НайденныеКолонки = КолонкиСписка.НайтиСтроки(Новый Структура("Префикс", ОписаниеКолонок.Префикс));
			
			МинимальныйИндексКолонки = Неопределено;
			МаксимальныйИндексКолонки = 0;
			Для Каждого Колонка Из НайденныеКолонки Цикл
				Индекс = КолонкиСписка.Индекс(Колонка);
				МинимальныйИндексКолонки  = ?(МинимальныйИндексКолонки = Неопределено, Индекс, Мин(МинимальныйИндексКолонки, Индекс));
				МаксимальныйИндексКолонки = Макс(МаксимальныйИндексКолонки, Индекс);
			КонецЦикла;
			
			// Подсчет полей, присутствущих в других запросах
			Для Индекс = 0 По МинимальныйИндексКолонки - 1 Цикл
				Колонка = КолонкиСписка[Индекс];
				ИмяКолонки = Колонка.Префикс + "_" + Колонка.ИмяКолонки;
				ТекстЗапросаПредшествующиеПоля = ТекстЗапросаПредшествующиеПоля
					+ Символы.ПС + "	0 КАК " + ИмяКолонки + ", ";
			КонецЦикла;
			Для Индекс = МаксимальныйИндексКолонки + 1 По КолонкиСписка.Количество() - 1 Цикл
				Колонка = КолонкиСписка[Индекс];
				ИмяКолонки = Колонка.Префикс + "_" + Колонка.ИмяКолонки;
				ТекстЗапросаПоследующиеПоля = ТекстЗапросаПоследующиеПоля
						+ "," + Символы.ПС + "	0 КАК " + ИмяКолонки;
			КонецЦикла;
		
			ТекстЗапроса = ОписаниеКолонок.ТекстЗапроса;
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПоляВыбораПредшествующие,", ТекстЗапросаПредшествующиеПоля);
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ",&ПоляВыбораПоследующие",    ТекстЗапросаПоследующиеПоля);
			
			ТекстыЗапросов.Добавить(ТекстЗапроса);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстыЗапросов) Тогда
		
		ТекстЗапросаШаблон = 
			"ВЫБРАТЬ
			|	ТаблицаВыборки.Назначение КАК Назначение,
			|	%1
			|ПОМЕСТИТЬ ВтОтобранныеНазначения
			|ИЗ
			|	(%2) КАК ТаблицаВыборки
			|
			|СГРУППИРОВАТЬ ПО
			|	ТаблицаВыборки.Назначение
			|
			|ИМЕЮЩИЕ
			|	%3
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Назначение
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Назначения.Ссылка КАК Назначение,
			|	%4
			|ИЗ
			|	Справочник.Назначения КАК Назначения
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОтобранныеНазначения КАК Отбор
			|		ПО Назначения.Ссылка = Отбор.Назначение
			|ГДЕ
			|	НЕ Назначения.ПометкаУдаления
			|	//&Условия";
		
		ПоляВыборкиИзВложенногоЗапроса = Новый Массив;
		ПоляВыборкиИзВременнойТаблицы = Новый Массив;
		ПоляУсловийИмеющие = Новый Массив;
		Для Каждого Колонка Из КолонкиСписка Цикл
			
			ИмяКолонки = Колонка.Префикс + "_" + Колонка.ИмяКолонки;
			
			Если Колонка.УстановитьОтбор Тогда
				ПоляВыборкиИзВложенногоЗапроса.Добавить("СУММА(ТаблицаВыборки." + ИмяКолонки + ") КАК " + ИмяКолонки);
				ПоляУсловийИмеющие.Добавить("СУММА(ТаблицаВыборки." + ИмяКолонки + ") <> 0 ");
			Иначе
				ПоляВыборкиИзВложенногоЗапроса.Добавить("0 КАК " + ИмяКолонки);
			КонецЕсли;
			ПоляВыборкиИзВременнойТаблицы.Добавить("Отбор." + ИмяКолонки + " КАК " + ИмяКолонки);
			
		КонецЦикла;
		
		ТекстЗапроса = СтрШаблон(ТекстЗапросаШаблон,
			СтрСоединить(ПоляВыборкиИзВложенногоЗапроса, "," + Символы.ПС + Символы.Таб),
			СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении()),
			СтрСоединить(ПоляУсловийИмеющие, Символы.ПС + Символы.Таб + "И "),
			СтрСоединить(ПоляВыборкиИзВременнойТаблицы, "," + Символы.ПС + Символы.Таб));
		
	Иначе
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	Назначения.Ссылка КАК Назначение
			|	//&ПоляВыборки
			|ИЗ
			|	Справочник.Назначения КАК Назначения
			|ГДЕ
			|	НЕ Назначения.ПометкаУдаления
			|	//&Условия";
		
		Если ЗначениеЗаполнено(КолонкиСписка) Тогда
			ПоляВыборки = Новый Массив;
			Для Каждого Колонка Из КолонкиСписка Цикл
				ПоляВыборки.Добавить("0 КАК " + Колонка.Префикс + "_" + Колонка.ИмяКолонки);
			КонецЦикла;
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//&ПоляВыборки", ", " +СтрСоединить(ПоляВыборки, "," + Символы.ПС + Символы.Таб));
		КонецЕсли;
		
	КонецЕсли;
	//ASP_Petrov +#000013195
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И Склад В (&ОбеспечениеЗаказовПоВалюте_Склад)","");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"0 КАК ОбеспечениеЗаказовПоВалюте_Склад,","");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И Склад В (&ОбеспечениеЗаказовПоВалюте_Склад)","");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Движения.Склад = &ОбеспечениеЗаказовПоВалюте_Склад", "");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Склад = &ОбеспечениеЗаказовПоВалюте_Склад", "");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И Сведения.Склад          = &ОбеспечениеЗаказовПоВалюте_Склад", "");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"Отбор.ОбеспечениеЗаказовПоВалюте_Склад КАК ОбеспечениеЗаказовПоВалюте_Склад,","");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"И Склад          = &ОбеспечениеЗаказовПоВалюте_Склад","");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"СУММА(ТаблицаВыборки.ОбеспечениеЗаказовПоВалюте_Потребность) <> 0 ","СУММА(ТаблицаВыборки.ОбеспечениеЗаказовПоВалюте_Потребность) > 0");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"СУММА(ТаблицаВыборки.Получатель_Потребность) <> 0 ","СУММА(ТаблицаВыборки.Получатель_Потребность) > 0"); 
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"	И СУММА(ТаблицаВыборки.ВсеСклады_Потребность) <> 0 " ,"	И СУММА(ТаблицаВыборки.ВсеСклады_Потребность) > 0 ");
	//ASP_petrov --
	УсловияНазначения = Новый Массив();
	Для Каждого Отбор Из ОтборыСписка Цикл
		Если Отбор.Пометка Тогда
			
			Если СтрНайти(Отбор.ПутьКДанным, "Объект.") <> 0
				Или СтрНайти(Отбор.ПутьКДанным, "&") <> 0 Тогда
				Условие = "Назначения." + Отбор.ИмяПоля + " = " + "&" + Отбор.ИмяПоля
			Иначе
				Условие = "Назначения." + Отбор.ИмяПоля + " = (" + Отбор.ПутьКДанным + ")";
			КонецЕсли;
			УсловияНазначения.Добавить(Условие);
			
		КонецЕсли;
	КонецЦикла;
	УсловияНазначения.Добавить("Назначения.ТипНазначения В (&ТипыНазначений)");
	Справочники.Назначения.ДобавитьУсловиеИсключенияПартнера(УсловияНазначения, "Назначения");
	Если ЗначениеЗаполнено(Источник) Тогда
		УсловияНазначения.Добавить("Назначения.Заказ <> &Источник");
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//&Условия",
		"И " + СтрСоединить(УсловияНазначения, Символы.ПС + Символы.Таб + "И "));
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	ЗаполнитьЗначенияСвойств(СвойстваСписка, Список);
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список, СвойстваСписка);
	
	Если ЗначениеЗаполнено(Источник) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Источник", Источник);
	КонецЕсли;
	
	// Установка значений параметров запроса.
	
	Для Каждого ОписаниеКолонок Из МакетФормыНазначений.ОписанияКолонок Цикл
		
		Для Каждого ПутьКДанным Из ОписаниеКолонок.ПутиКДанным Цикл
			ИмяПараметра = ОписаниеКолонок.Префикс + "_" + ПутьКДанным.Ключ;
			Значение = ПараметрыДинамическогоСписка[ИмяПараметра];
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, ИмяПараметра, Значение);
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ПолеОтбора Из ОтборыСписка Цикл
		
		Если ЗначениеЗаполнено(ПолеОтбора.ПутьКДанным)
			И (СтрНайти(ПолеОтбора.ПутьКДанным, "Объект.") <> 0
				Или СтрНайти(ПолеОтбора.ПутьКДанным, "&") <> 0) Тогда
			
			ПараметрыУсловияИспользования = Справочники.Назначения.ТекстИПараметрыЗапросаУсловияИспользования("", ПолеОтбора.ПутьКДанным);
			Для Каждого ПараметрЗапроса Из ПараметрыУсловияИспользования.ПараметрыЗапроса Цикл
				ЗначениеПараметра = ПараметрыДинамическогоСписка[ПараметрЗапроса];
				ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, ПараметрЗапроса, ЗначениеПараметра);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТипыНазначений",
		ПараметрыДинамическогоСписка.ТипыНазначений);

	//ПродолжитьВызов();
КонецПроцедуры

&НаСервере
&Вместо("СоздатьКолонкиСписка")
Процедура асп_СоздатьКолонкиСписка()
	
	Если не Параметры.ИмяОбъекта = "Документ.ЗаказНаПеремещение" тогда 
		Для ТекущийИндекс = 0 По КолонкиСписка.Количество() - 1 Цикл
			
			Колонка = КолонкиСписка[ТекущийИндекс];
			
			Если Колонка.РазрешеноИспользованиеКолонки Тогда
				
				ИмяКолонки = Колонка.Префикс + "_" + Колонка.ИмяКолонки;
				
				НоваяКолонкаСписка             = Элементы.Добавить("Список" + ИмяКолонки, Тип("ПолеФормы"), Элементы.Список);
				НоваяКолонкаСписка.Вид         = ВидПоляФормы.ПолеНадписи;
				НоваяКолонкаСписка.Заголовок   = "Потребность на складах";//Колонка.Представление;
				НоваяКолонкаСписка.Формат      = "ЧДЦ=3";
				НоваяКолонкаСписка.ПутьКДанным = "Список." + ИмяКолонки;
				
				НоваяКолонкаСписка.АвтоМаксимальнаяШирина = Ложь;
				НоваяКолонкаСписка.МаксимальнаяШирина     = 14;
				
				НоваяКолонкаСписка             = Элементы.Добавить("СписокСклад", Тип("ПолеФормы"), Элементы.Список);
				НоваяКолонкаСписка.Вид         = ВидПоляФормы.ПолеНадписи;
				НоваяКолонкаСписка.Заголовок   = "Склад";
				НоваяКолонкаСписка.ПутьКДанным = "Список.Назначение.Заказ.Склад";

				Если Колонка.ПользовательскаяВидимость Тогда
					
					НовыйФлаг             = Элементы.Добавить("Флаг" + ИмяКолонки, Тип("ПолеФормы"), Элементы.ГруппаУправлениеКолонками);
					НовыйФлаг.Вид         = ВидПоляФормы.ПолеФлажка;
					НовыйФлаг.Заголовок   = "Отобрать по складам";
					НовыйФлаг.ПутьКДанным = "КолонкиСписка[" + ТекущийИндекс + "].УстановитьОтбор";
					НовыйФлаг.УстановитьДействие("ПриИзменении", "Подключаемый_КолонкиСпискаПометкаПриИзменении");
					НовыйФлаг.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	Иначе 
		
		Для ТекущийИндекс = 0 По КолонкиСписка.Количество() - 1 Цикл
			
			Колонка = КолонкиСписка[ТекущийИндекс];
			
			Если Колонка.РазрешеноИспользованиеКолонки Тогда
				
				ИмяКолонки = Колонка.Префикс + "_" + Колонка.ИмяКолонки;
				
				НоваяКолонкаСписка             = Элементы.Добавить("Список" + ИмяКолонки, Тип("ПолеФормы"), Элементы.Список);
				НоваяКолонкаСписка.Вид         = ВидПоляФормы.ПолеНадписи;
				НоваяКолонкаСписка.Заголовок   = Колонка.Представление;
				НоваяКолонкаСписка.Формат      = "ЧДЦ=3";
				НоваяКолонкаСписка.ПутьКДанным = "Список." + ИмяКолонки;
				
				НоваяКолонкаСписка.АвтоМаксимальнаяШирина = Ложь;
				НоваяКолонкаСписка.МаксимальнаяШирина     = 14;
				
				Если Колонка.ПользовательскаяВидимость Тогда
					//Если Колонка.Представление = "Потребность на всех складах" тогда 
						НовыйФлаг             = Элементы.Добавить("Флаг" + ИмяКолонки, Тип("ПолеФормы"), Элементы.ГруппаУправлениеКолонками);
						НовыйФлаг.Вид         = ВидПоляФормы.ПолеФлажка;
						НовыйФлаг.Заголовок   = Колонка.Представление;
						НовыйФлаг.ПутьКДанным = "КолонкиСписка[" + ТекущийИндекс + "].УстановитьОтбор";
						НовыйФлаг.УстановитьДействие("ПриИзменении", "Подключаемый_КолонкиСпискаПометкаПриИзменении");
						НовыйФлаг.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Право;
			//		КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	//ПродолжитьВызов();
КонецПроцедуры
