
&После("ОбработкаПроведения")
Процедура асп_ОбработкаПроведения(Отказ, РежимПроведения)
	//ASP_Lebedev_000020332_17/08/2023 Принудительная регистрация в узле обмена.
	ДатаКонтроля = Константы.ДатаКонтроляВыгрузкиДокументовВБП.Получить();
	ОбъектМодифицирован = ASP_Добавленный.СравнитьВерсииОбъекта(ЭтотОбъект); //000026792
	Если НЕ Отказ и ЭтотОбъект.Проведен и ЭтотОбъект.Дата > ДатаКонтроля и ОбъектМодифицирован Тогда         
		узел = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятия30.НайтиПоКоду("002");
		ПланыОбмена.ЗарегистрироватьИзменения(узел, ЭтотОбъект);
	КонецЕсли;
	
	//++ASP_Crow 01.01.2024 000024647 судя по всему можно просто оставить в заказе клиента такое
	//ASP_ПроверитьИЗаполнитьПроцентОбеспечения();
	//--ASP_Crow 01.01.2024 000024647
КонецПроцедуры

Процедура ASP_ПроверитьИЗаполнитьПроцентОбеспечения()
	
 	Заказы = Товары.Выгрузить();
	Заказы.Свернуть("ASP_ЗаказКлиента");
	Заказы = Заказы.ВыгрузитьКолонку("ASP_ЗаказКлиента");
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиентаТовары.Ссылка КАК Заказ,
	               |	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок) КАК КоличествоВсего,
	               |	0 КАК КоличествоОбеспечено
	               |ПОМЕСТИТЬ Вт_ВсегоПоЗаказу
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка В(&Заказы)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказКлиентаТовары.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗаказКлиентаТовары.Ссылка,
	               |	0,
	               |	СУММА(ЗаказКлиентаТовары.КоличествоУпаковок)
	               |ИЗ
	               |	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	               |ГДЕ
	               |	ЗаказКлиентаТовары.Ссылка В(&Заказы)
	               |	И ЗаказКлиентаТовары.ВариантОбеспечения В(&СтатусОбеспечено)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказКлиентаТовары.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вт_ВсегоПоЗаказу.Заказ КАК Заказ,
	               |	СУММА(Вт_ВсегоПоЗаказу.КоличествоВсего) КАК КоличествоВсего,
	               |	СУММА(Вт_ВсегоПоЗаказу.КоличествоОбеспечено) КАК КоличествоОбеспечено
	               |ПОМЕСТИТЬ ВТ_ЗаказыГруппировка
	               |ИЗ
	               |	Вт_ВсегоПоЗаказу КАК Вт_ВсегоПоЗаказу
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Вт_ВсегоПоЗаказу.Заказ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ЗаказыГруппировка.Заказ КАК Заказ,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТ_ЗаказыГруппировка.КоличествоОбеспечено = 0
	               |					ИЛИ ВТ_ЗаказыГруппировка.КоличествоОбеспечено ЕСТЬ NULL
	               |				ТОГДА 0
	               |			ИНАЧЕ 100 * ВТ_ЗаказыГруппировка.КоличествоОбеспечено / ВТ_ЗаказыГруппировка.КоличествоВсего
	               |		КОНЕЦ) КАК ПроцентОбеспечения
	               |ИЗ
	               |	ВТ_ЗаказыГруппировка КАК ВТ_ЗаказыГруппировка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ЗаказыГруппировка.Заказ";
	Запрос.УстановитьПараметр("Заказы", Заказы);
	МассивВарОбеспечения = новый Массив;
	МассивВарОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.Отгрузить);
	МассивВарОбеспечения.Добавить(Перечисления.ВариантыОбеспечения.СоСклада);
	Запрос.УстановитьПараметр("СтатусОбеспечено", МассивВарОбеспечения);
	Рез = Запрос.Выполнить().Выгрузить();
	
	
	НаборЗаписей = Регистрысведений.ASP_СостояниеОбеспеченияЗаказов.СоздатьНаборЗаписей();
	МассивЗаказовКОповещению = новый Массив;
	Для каждого СтрРез из Рез Цикл
		НаборЗаписей.Отбор.Заказ.Установить(СтрРез.Заказ);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда //Может возникнуть ситуация, что старый заказ обеспечивается
			СтрокаЗаписи = НаборЗаписей.Добавить();
			СтрокаЗаписи.Заказ = СтрРез.Заказ;
			СтрокаЗАписи.ПроцентОбеспечения = СтрРез.ПроцентОбеспечения;
			Если СтрРез.ПроцентОбеспечения >= 100 Тогда
				Если НЕ ЗначениеЗаполнено(СтрокаЗаписи.ДатаПолногоОбеспечения) Тогда
					СтрокаЗаписи.ДатаПолногоОбеспечения = ТекущаяДата();
					МассивЗаказовКОповещению.Добавить(СтрРез.Заказ);
				КонецЕсли;
				СтрокаЗаписи.СтатусОбеспечения = Перечисления.ASP_СтатусыОбеспеченияЗаказа.Обеспечен;
			Иначе
				СтрокаЗаписи.СтатусОбеспечения = Перечисления.ASP_СтатусыОбеспеченияЗаказа.НеОбеспечен;
			КонецЕсли;	
		Иначе //В остальном запись всегда 1 и она перезаписывается
			СтрокаЗаписи = НаборЗаписей[0];
			СтрокаЗаписи.Заказ = СтрРез.Заказ;
			СтрокаЗАписи.ПроцентОбеспечения = СтрРез.ПроцентОбеспечения;
			Если СтрРез.ПроцентОбеспечения >= 100 Тогда
				Если НЕ ЗначениеЗаполнено(СтрокаЗаписи.ДатаПолногоОбеспечения) Тогда
					СтрокаЗаписи.ДатаПолногоОбеспечения = ТекущаяДата();
					МассивЗаказовКОповещению.Добавить(СтрРез.Заказ);
				КонецЕсли;
				СтрокаЗаписи.СтатусОбеспечения = Перечисления.ASP_СтатусыОбеспеченияЗаказа.Обеспечен;
			Иначе
				СтрокаЗаписи.СтатусОбеспечения = Перечисления.ASP_СтатусыОбеспеченияЗаказа.НеОбеспечен;
			КонецЕсли;	
		КонецЕсли;
		НаборЗаписей.Записать();
	КонецЦикла;

	Если МассивЗаказовКОповещению.Количество() <> 0 Тогда
		Для каждого Заказ из МассивЗаказовКОповещению Цикл
			ТекстНапоминания = Строка(Заказ) + " полностью обеспечен";
			НапоминанияПользователяСлужебный.ASP_ПодключитьПроизвольноеНапоминание(Заказ.Менеджер,ТекстНапоминания, ТекущаяДата(),,Заказ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры