
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	УстановитьОформление();
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаРасхода) и Объект.Ссылка.Пустая() Тогда
		Объект.ДатаРасхода=ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПровереноПлательщикомПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПровереноПлательщикомПриИзменении(Элемент)
	УстановитьОформление();
	ПровереноПлательщикомПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПровереноПолучателемПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПровереноПолучателемПриИзменении(Элемент)
	УстановитьОформление();
	ПровереноПолучателемПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПлательщикПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПлательщикПриИзменении(Элемент)
	УстановитьОформление();
	ПодразделениеПлательщикПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПолучательПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПолучательПриИзменении(Элемент)
	УстановитьОформление();
	ПодразделениеПолучательПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьОформление()
	Если Объект.ПровереноПлательщиком=Истина Тогда
		Элементы.ПодразделениеПлательщик.Доступность=Ложь;
		Элементы.ДатаРасхода.Доступность=Ложь;
		Элементы.Сумма.Доступность=Ложь;
	ИначеЕсли Объект.ПровереноПлательщиком = ложь Тогда
	Элементы.ПодразделениеПлательщик.Доступность=Истина;
	Иначе Элементы.ПодразделениеПлательщик.Доступность=Ложь;
	КонецЕсли;
	Если Объект.ПровереноПолучателем=Истина Тогда
		Элементы.ПодразделениеПолучатель.Доступность=Ложь;
		Элементы.ДатаРасхода.Доступность=Ложь;
		Элементы.Сумма.Доступность=Ложь;
	ИначеЕсли Объект.ПровереноПолучателем = ложь Тогда
	Элементы.ПодразделениеПолучатель.Доступность=Истина;
	Иначе Элементы.ПодразделениеПолучатель.Доступность=Ложь;
	КонецЕсли;
	ЕСЛИ ПараметрыСеанса.ТекущийПользователь.Подразделение=ПолучитьРеальноеПодразделение(Объект.ПодразделениеПлательщик) Тогда
	Элементы.ПровереноПлательщиком.Доступность=Истина;
	Иначе Элементы.ПровереноПлательщиком.Доступность=Ложь;
	КонецЕсли;
	Если ПараметрыСеанса.ТекущийПользователь.Подразделение=ПолучитьРеальноеПодразделение(Объект.ПодразделениеПолучатель) Тогда
		Элементы.ПровереноПолучателем.Доступность=Истина;
	Иначе Элементы.ПровереноПолучателем.Доступность=Ложь; 
	КонецЕсли;

	КонецПроцедуры

&НаСервере
Функция ПолучитьРеальноеПодразделение(ВнутреннийПлательщик)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ASP_ВнутренниеПлательщики.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.ASP_ВнутренниеПлательщики КАК ASP_ВнутренниеПлательщики
		|ГДЕ
		|	ASP_ВнутренниеПлательщики.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВнутреннийПлательщик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Подразделение;
	КонецЦикла;
	

КонецФункции

&НаСервере
Функция ПолучитьВнутреннегоПлательщика (Подразделение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ASP_ВнутренниеПлательщики.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ASP_ВнутренниеПлательщики КАК ASP_ВнутренниеПлательщики
		|ГДЕ
		|	ASP_ВнутренниеПлательщики.Подразделение = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	

КонецФункции

