
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустая() Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Родитель) Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Элемент не может быть создан вне группы.");
			Возврат;
		КонецЕсли;
		
		Объект.Используется = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	isnull(МАКСИМУМ(ASP_СтруктураКП.Порядок), 0) КАК Порядок
		|ИЗ
		|	Справочник.ASP_СтруктураКП КАК ASP_СтруктураКП
		|ГДЕ
		|	ASP_СтруктураКП.Родитель = &Родитель";
		
		Запрос.УстановитьПараметр("Родитель", Объект.Родитель);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Объект.Порядок = ВыборкаДетальныеЗаписи.Порядок+1;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры
