
//// ВПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ РЕГИСТРАЦИИ ДАННЫХ ДЛЯ ОБМЕНА
Процедура ВыполнитьСверкуИРегистрациюОбъектовДляОбмена() экспорт
	//
	СтрокаПодключения = "Srvr=""gts-server6"";Ref=""buh82"";Usr=""COMUsr"";Pwd=""123456""";
	
	//
	Коннектор = Новый COMОбъект("V83.COMConnector");
	Подключение = Коннектор.Connect(СтрокаПодключения);
	Узел = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятия30.НайтиПоКоду("002");
	
	
	
	//
	Поля = СписокПолейЗапроса("Номенклатура");
	Массив = СверкаСправочника("Справочник.Номенклатура", Поля, "Наименование",,Подключение);
	ЗарегистрироватьСсылки(Массив,Узел);
	//
	Поля = СписокПолейЗапроса("НомераГТД");
	Массив = СверкаСправочника("Справочник.НомераГТД", Поля, "Код",,Подключение);
	ЗарегистрироватьСсылки(Массив,Узел);
	
	//
	Поля = СписокПолейЗапроса("Контрагенты");
	Массив = СверкаСправочника("Справочник.Контрагенты", Поля, "Наименование",,Подключение);
	ЗарегистрироватьСсылки(Массив,Узел);
	
	//
	Поля = СписокПолейЗапроса("СчетНаОплату");
	Массив = СверкаСправочника("Документ.СчетНаОплатуПокупателю", Поля, "Номер", "Документ.ЗаказКлиента",Подключение);
	ЗарегистрироватьСсылки(Массив,Узел);
	
	//
	Поля = СписокПолейЗапроса("СтатьиЗатрат");
	Массив = СверкаСправочника("Справочник.СтатьиЗатрат", Поля, "Наименование", "ПланВидовХарактеристик.СтатьиРасходов",Подключение);
	ЗарегистрироватьСсылки(Массив,Узел);
	
	
	// Сверка наличия документов
	ВидСверки=0;
	Массив = СверкаДокументов(ВидСверки,Подключение);
	ЗарегистрироватьСсылки(Массив,Узел);
	
	
КонецПроцедуры

Функция СписокПолейЗапроса(Таблица)
	
	Поля = Новый Массив();
	Если Таблица = "Номенклатура" тогда
		Поля.Добавить("Наименование");
		Поля.Добавить("Код");
	ИначеЕсли Таблица = "НомераГТД" тогда
		Поля.Добавить("Код");		
	ИначеЕсли Таблица = "Контрагенты" тогда
		Поля.Добавить("Наименование");
		Поля.Добавить("ИНН");
	ИначеЕсли Таблица = "СчетНаОплату" тогда
		Поля.Добавить("Номер");
		Поля.Добавить("Дата");
	ИначеЕсли Таблица = "СтатьиЗатрат" тогда
		Поля.Добавить("Наименование");
	Конецесли;
	
	возврат Поля;
	
КонецФункции

Функция СверкаСправочника(Таблица, Поля, ПолеНеопределенности, ТаблицаУТ = неопределено,Коннектор)
	
	//
	ПоляСтр = "";
	Для каждого е из Поля цикл
		ПоляСтр = ПоляСтр + "Таб." + е + ?(е = "Дата", " КАК ДатаДок", "") + ?(Поля.Найти(е)+1 = Поля.Количество(), "", ",");
	Конеццикла;
	//
	УсловиеСвязи = "";
	Для каждого е из Поля цикл
		УсловиеСвязи = УсловиеСвязи + "ВТ_УТ."+?(е = "Дата", "ДатаДок", е)+" = ВТ_БП."+?(е = "Дата", "ДатаДок", е)+?(Поля.Найти(е)+1 = Поля.Количество(), "", " И ");
	Конеццикла;
	//
	
	Текст = 
	"ВЫБРАТЬ
	|	"+ПоляСтр+", Ссылка
	|ИЗ
	|	"+Таблица+" КАК Таб";
	Если Найти(Таблица, "Документ") тогда
		Текст = Текст + "
		|ГДЕ
		|	Таб.Дата > &ДатаНачалаПроверки";
	КонецЕсли;
	Запрос = Коннектор.NewObject("Запрос");
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("ДатаНачалаПроверки", КонецДня(Константы.ДатаКонтроляВыгрузкиДокументовВБП.Получить()));
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ДанныеБП = Новый ТаблицаЗначений();
	Для каждого е из Поля цикл
		Если е = "Наименование" тогда
			Квалификатор = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100));
		Иначеесли (е = "Код" или е = "Номер") и НЕ(Таблица = "Справочник.НомераГТД") тогда
			Квалификатор = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(11));
		Иначеесли е = "Код" и (Таблица = "Справочник.НомераГТД") тогда
			Квалификатор = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(30));
		Иначеесли е = "ИНН" тогда
			Квалификатор = Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(12));
		Иначеесли е = "Дата" тогда
			Квалификатор = Новый ОписаниеТипов("Дата");
		Иначе
			Квалификатор = неопределено;
		Конецесли;
		ДанныеБП.Колонки.Добавить(?(е = "Дата", "ДатаДок", е), Квалификатор);
	Конеццикла;
	
	Для каждого е из ТЗ цикл
		СтрокаТЗ = ДанныеБП.Добавить();
		Для каждого к из Поля цикл
			Имя = ?(к = "Дата", "ДатаДок", к);
			СтрокаТЗ[Имя] = е[Имя];
		Конеццикла;
	Конеццикла;
	//
	Если ЗначениеЗаполнено(ТаблицаУТ) тогда
		Текст = СтрЗаменить(Текст, Таблица, ТаблицаУТ);
	Конецесли;
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("ДатаНачалаПроверки", КонецДня(Константы.ДатаКонтроляВыгрузкиДокументовВБП.Получить()));
	ДанныеУТ = Запрос.Выполнить().Выгрузить();
	
	//
	ПоляСтр = "";
	Для каждого е из Поля цикл
		ПоляСтр = ПоляСтр + "Таб." + ?(е = "Дата", "ДатаДок", е) + ?(Поля.Найти(е)+1 = Поля.Количество(), "", ",");
	Конеццикла;
	
	//
	Текст = 
	"ВЫБРАТЬ
	|	"+ПоляСтр+"
	|ПОМЕСТИТЬ ВТ_БП
	|ИЗ
	|	&ДанныеБП КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	"+ПоляСтр+",
	|	Ссылка
	|ПОМЕСТИТЬ ВТ_УТ
	|ИЗ
	|	&ДанныеУТ КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Вложение.Ссылка,
	|	Вложение.Поле
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_УТ.Ссылка КАК Ссылка,
	|		ЕСТЬNULL(ВТ_БП."+ПолеНеопределенности+", НЕОПРЕДЕЛЕНО) КАК Поле
	|	ИЗ
	|		ВТ_УТ КАК ВТ_УТ
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БП КАК ВТ_БП
	|			ПО "+УсловиеСвязи+") КАК Вложение
	|ГДЕ
	|	Вложение.Поле = НЕОПРЕДЕЛЕНО";
	
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("ДанныеБП", ДанныеБП);
	Запрос.УстановитьПараметр("ДанныеУТ", ДанныеУТ);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Мас = ТЗ.ВыгрузитьКолонку("Ссылка");
	
	///
	возврат Мас;
	
КонецФункции

//
Функция ЗарегистрироватьСсылки(Массив,Узел)
	
	Для каждого е из Массив цикл
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, е);
	Конеццикла;
	
КонецФункции

// Функции сверки наличия документов
Функция СверкаДокументов(ТипСверки=0,Подключение) Экспорт
	
	//
	Список = Новый СписокЗначений();
	Список.Добавить("АвансовыйОтчет",							"Авансовый отчет");
	Список.Добавить("ОтчетКомиссионера",						"Отчет комиссионера о продажах");
	Список.Добавить("ПеремещениеТоваров", 						"Перемещение товаров");
	Список.Добавить("ПересортицаТоваров", 						"Пересортица товаров");
	Список.Добавить("ПоступлениеБезналичныхДенежныхСредств",	"Поступление безналичных ден.средств");
	Список.Добавить("ПоступлениеТоваровУслуг", 					"Поступление товаров и услуг");
	Список.Добавить("ПриходныйКассовыйОрдер",					"Приходный кассовый ордер");
	Список.Добавить("РасходныйКассовыйОрдер", 					"Расходный кассовый ордер");
	Список.Добавить("РеализацияТоваровУслуг", 					"Реализация товаров и услуг");
	Список.Добавить("СборкаТоваров",							"Сборка (разборка) товаров");
	Список.Добавить("СписаниеБезналичныхДенежныхСредств", 		"Списание безналичных ден.средств");
	Список.Добавить("СписаниеНедостачТоваров",					"Списание товаров");
	Список.Добавить("СчетФактураВыданный", 						"Счет-фактура выданный");
	Список.Добавить("СчетФактураВыданныйАванс",					"Счет-фактура выданный на аванс");
	Список.Добавить("СчетФактураПолученный",				    "Счет-фактура полученный");
	Список.Добавить("СчетФактураПолученныйАванс",				"Счет-фактура полученный на аванс");
	Список.Добавить("ВозвратТоваровОтКлиента"	,				"Возврат товаров от клиента");
	Список.Добавить("ВнутреннееПотреблениеТоваров",				"Внутреннее потребление товаров");
	Список.Добавить("СписаниеЗадолженности",					"Списание задолженности");
	Список.Добавить("ОперацияПоПлатежнойКарте", 				"Операция по платежной карте"); //ASP__A.Zhel 24.01.2019  Добавлям эквайринговые операции__ASP 			
	//Список.Добавить("ВзаимозачетЗадолженности",					"КорректировкаДолга");
	
	
	
	//
	СтруктураСверки = Новый Структура();
	Для каждого СтрокаСписка из Список цикл
		ИмяМетаданных = СтрокаСписка.Значение;
		Структура = СтруктураДокументовБП(ИмяМетаданных, Подключение);
		//
		ПолеПроверкиСовпаденияСклада=" ";
		ПолеНаименованиеСкладаБП=" ";
		ПолеНаименованиеСкладаУТ=" ";
		ПоляНаименованийСкладов=" ";
		Если ТипСверки = 0 тогда
			//ASP. Добавлена сверка по складам в документах	
			Если ИмяМетаданных = "СборкаТоваров" Или  ИмяМетаданных = "РеализацияТоваровУслуг" Или  ИмяМетаданных = "ПеремещениеТоваров" Тогда
				СтрокаУсловия = " Вложение.ДокументНеНайден Или Вложение.СкладНеСовпадает ";
				ПолеПроверкиСовпаденияСклада=", ВЫБОР КОГДА НайденныеСсылки.НаименованиеСкладаУТ<>НайденныеСсылки.НаименованиеСкладаБП ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ  КАК СкладНеСовпадает ";
				ПолеНаименованиеСкладаБП=", ТаблицаДанных.НаименованиеСклада КАК НаименованиеСклада "; 
				ПолеНаименованиеСкладаУТ=", Выб.НаименованиеСклада КАК НаименованиеСклада "; 
				ПоляНаименованийСкладов=", ДанныеУТ.НаименованиеСклада КАК НаименованиеСкладаУТ,  ДанныеБП.НаименованиеСклада КАК НаименованиеСкладаБП  "; 
				
			Иначе
				СтрокаУсловия = "Вложение.ДокументНеНайден";				
			КонецЕсли;
		Иначе
			СтрокаУсловия = "(Вложение.ПометкаУдаления<>Вложение.Ссылка.ПометкаУдаления "+?(ИмяМетаданных = "СчетФактураВыданный", "","ИЛИ
			|	Вложение.Проведен<>Вложение.Ссылка.Проведен")+")
			|И (НЕ Вложение.ДокументНеНайден)";
		Конецесли;
		//
		СтрокаПроверкиПоТабЧасти =  ?(ИмяМетаданных = "ПриобретениеТоваровУслуг" ИЛИ ИмяМетаданных = "РеализацияТоваровУслуг"
		ИЛИ ИмяМетаданных = "ПеремещениеТоваров" ИЛИ ИмяМетаданных = "СборкаТоваров",
		"			И ДанныеБП.Количество = ДанныеУТ.Количество									
		|			И ДанныеБП.КодНоменклатуры = ДанныеУТ.КодНоменклатуры", "");
		//
		Если ИмяМетаданных = "ПересортицаТоваров" тогда
			СтрокаСоединения = "		ПО ДанныеБП.Дата = ДанныеУТ.Дата И ДанныеБП.Сумма = ДанныеУТ.Сумма";
		Иначе
			СтрокаСоединения = "		ПО ДанныеБП.ПроизводныйНомер = ДанныеУТ.ПроизводныйНомер
			|			И ДанныеБП.Сумма = ДанныеУТ.Сумма
			|			И НАЧАЛОПЕРИОДА(ДанныеБП.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(ДанныеУТ.Дата, ДЕНЬ) "+СтрокаПроверкиПоТабЧасти;
		Конецесли;
		
		//
		Текст =
		"ВЫБРАТЬ
		|	ТаблицаДанных.Дата,
		|	ТаблицаДанных.Номер,
		|	ВЫРАЗИТЬ(ТаблицаДанных.ПроизводныйНомер КАК СТРОКА("+?(ИмяМетаданных = "СчетФактураПолученный", "30", "7") + ")) КАК ПроизводныйНомер,
		|	ТаблицаДанных.Проведен,
		|	ТаблицаДанных.ПометкаУдаления" + ?(ПустаяСтрока(СтрокаПроверкиПоТабЧасти), "", ",
		|	ТаблицаДанных.Количество КАК Количество, 
		|	ТаблицаДанных.КодНоменклатуры КАК КодНоменклатуры")+", 
		|	ТаблицаДанных.Сумма КАК Сумма "
		//ASP. Добавлена сверка по складам в документах		
		+ПолеНаименованиеСкладаБП+
		"ПОМЕСТИТЬ ДанныеБП
		|ИЗ
		|	&ТаблицаБП КАК ТаблицаДанных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Выб.Ссылка,
		|	Выб.ПроизводныйНомер,
		|	Выб.Дата" + ?(ПустаяСтрока(СтрокаПроверкиПоТабЧасти), "", ",
		|	Выб.Количество КАК Количество, 
		|	Выб.КодНоменклатуры КАК КодНоменклатуры")+", 
		|	Выб.Сумма КАК Сумма "
		//ASP. Добавлена сверка по складам в документах		
		+ ПолеНаименованиеСкладаУТ+ 
		" ПОМЕСТИТЬ ДанныеУТ
		|ИЗ
		|	&ТаблицаУТ КАК Выб
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеУТ.Ссылка,
		|	ДанныеБП.Проведен,
		|	ДанныеБП.ПометкаУдаления" 
		+?(ПустаяСтрока(СтрокаПроверкиПоТабЧасти), " "," ,	ДанныеУТ.КодНоменклатуры ")
		+ПоляНаименованийСкладов+
		" ПОМЕСТИТЬ НайденныеСсылки
		|ИЗ
		|	ДанныеБП КАК ДанныеБП
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДанныеУТ КАК ДанныеУТ
		|		"+СтрокаСоединения+"		
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Вложение.Ссылка,
		|	Вложение.ДокументНеНайден,
		|	Вложение.Проведен,
		| 	Вложение.ПометкаУдаления
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДанныеУТ.Ссылка КАК Ссылка,
		|		ВЫБОР
		|			КОГДА НайденныеСсылки.Ссылка ЕСТЬ NULL" + ?(ПустаяСтрока(СтрокаПроверкиПоТабЧасти), "", "
		|					ИЛИ НайденныеСсылки.КодНоменклатуры ЕСТЬ NULL")+"
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ КАК ДокументНеНайден,
		|		НайденныеСсылки.Проведен,
		|		НайденныеСсылки.ПометкаУдаления "
		//ASP. Добавлена сверка по складам в документах
		+ПолеПроверкиСовпаденияСклада+
		"	ИЗ
		|		ДанныеУТ КАК ДанныеУТ
		|			ЛЕВОЕ СОЕДИНЕНИЕ НайденныеСсылки КАК НайденныеСсылки
		|			ПО ДанныеУТ.Ссылка = НайденныеСсылки.Ссылка" + ?(ПустаяСтрока(СтрокаПроверкиПоТабЧасти), "", "
		|				И ДанныеУТ.КодНоменклатуры = НайденныеСсылки.КодНоменклатуры")+") КАК Вложение
		|ГДЕ
		|	"+СтрокаУсловия+"
		|СГРУППИРОВАТЬ ПО
		|	Вложение.Ссылка,
		|	Вложение.ДокументНеНайден,
		|	Вложение.Проведен,
		| 	Вложение.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО 
		|	Вложение.Ссылка.Дата
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос = Новый Запрос(Текст);
		Запрос.УстановитьПараметр("ТаблицаБП", Структура.ТаблицаБП);
		Запрос.УстановитьПараметр("ТаблицаУТ", Структура.ТаблицаУТ);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		СтруктураСверки.Вставить(ИмяМетаданных, ТЗ);
		//
	Конеццикла;
	
	//Единый массив не найденных объектов
	Массив = Новый Массив();
	Для каждого е из СтруктураСверки цикл
		Для каждого стр из е.Значение цикл
			Если стр.Ссылка.ПометкаУдаления И ТипСверки = 0 тогда продолжить конецесли;
			ASP_ЗаписатьВЖурналРегистрациюОбъекта(е.Ключ, стр.Ссылка); //+++ {{ ASP 07.02.2020 000006132 }}
			Массив.Добавить(стр.Ссылка);
		Конеццикла;
	Конеццикла;
	
	возврат Массив;
	
	
КонецФункции



Функция СтруктураДокументовБП(ИмяМетаданных, Коннектор)
	ДатаНачДляПроверки = КонецДня(Константы.ДатаКонтроляВыгрузкиДокументовВБП.Получить())+1;
	Если НЕ ЗначениеЗаполнено(ДатаНачДляПроверки) Тогда
		ДатаНачДляПроверки = НачалоМесяца(ТекущаяДата())
	КонецЕсли;
	ДатаКонДляПроверки = ТекущаяДата();
	
	
	
	ТабЧасть = "";
	ТабЧастьУТ = "";
	Если ИмяМетаданных = "ПересортицаТоваров" тогда
		ИмяМетаданныхБП = "СписаниеТоваров";
	ИначеЕсли ИмяМетаданных = "СписаниеНедостачТоваров" тогда
		ИмяМетаданныхБП = "СписаниеТоваров";
	ИначеЕсли ИмяМетаданных = "ПоступлениеБезналичныхДенежныхСредств" тогда
		ИмяМетаданныхБП = "ПоступлениеНаРасчетныйСчет";
	ИначеЕсли ИмяМетаданных = "СписаниеБезналичныхДенежныхСредств" тогда
		ИмяМетаданныхБП = "СписаниеСРасчетногоСчета";
	ИначеЕсли ИмяМетаданных = "СборкаТоваров" тогда
		ТабЧасть = "Комплектующие";
		ТабЧастьУТ = "Товары";
		ИмяМетаданныхБП = "КомплектацияНоменклатуры";	
	ИначеЕсли ИмяМетаданных = "СчетФактураВыданныйАванс" тогда
		ИмяМетаданныхБП = "СчетФактураВыданный";
	ИначеЕсли ИмяМетаданных = "СчетФактураПолученныйАванс" тогда
		ИмяМетаданныхБП = "СчетФактураПолученный";
	ИначеЕсли ИмяМетаданных = "РеализацияТоваровУслуг"
		ИЛИ ИмяМетаданных = "ПоступлениеТоваровУслуг"
		ИЛИ ИмяМетаданных = "ПеремещениеТоваров" тогда
		ТабЧасть = "Товары";
		ИмяМетаданныхБП = ИмяМетаданных;
		//+++ {{ ASP 07.02.2020 000006132 }}
		Если ИмяМетаданных = "ПоступлениеТоваровУслуг" Тогда
			ИмяМетаданныхБП = "ПриобретениеТоваровУслуг";
		КонецЕсли;
		//--- {{ ASP 07.02.2020 000006132 }}
	ИначеЕсли ИмяМетаданных = "ОтчетКомиссионера" тогда
		ИмяМетаданныхБП = "ОтчетКомиссионераОПродажах";
	ИначеЕсли ИмяМетаданных = "ВозвратТоваровОтКлиента" тогда
		ИмяМетаданныхБП = "ВозвратТоваровОтПокупателя";
	ИначеЕсли ИмяМетаданных = "ВнутреннееПотреблениеТоваров" тогда
		ИмяМетаданныхБП = "ТребованиеНакладная";
	ИначеЕсли ИмяМетаданных = "СписаниеЗадолженности" тогда
		ИмяМетаданныхБП = "КорректировкаДолга";
	//ASP__A.Zhel 24.01.2019 Добавлям эквайринговые операции	
	ИначеЕсли ИмяМетаданных = "ОперацияПоПлатежнойКарте" Тогда
		ИмяМетаданныхБП = "ОплатаПлатежнойКартой";
		//__ASP
	Иначе
		ИмяМетаданныхБП = ИмяМетаданных;
	КонецЕсли;
	
	Если ТабЧасть = "" тогда
		
		Если ИмяМетаданныхБП = "СчетФактураПолученный" тогда
			
			Если ИмяМетаданных = "СчетФактураПолученный" Тогда
				
				Текст = 
				"ВЫБРАТЬ
				|	Выб.Ссылка КАК Ссылка,
				|	НАЧАЛОПЕРИОДА(Выб.ДатаВходящегоДокумента, ДЕНЬ) КАК Дата,
				|	Выб.Номер,
				|	Выб.НомерВходящегоДокумента КАК ПроизводныйНомер,
				|	Выб.Проведен,
				|	Выб.ПометкаУдаления,
				|	0 КАК Сумма
				|ИЗ
				|	Документ.СчетФактураПолученный КАК Выб
				|ГДЕ
				//Асист-Про Начало Аграновский 2013-10-26
				|	Выб.ДатаВходящегоДокумента МЕЖДУ &ДатаНач И &ДатаКон
				//|	Выб.Дата МЕЖДУ &ДатаНач И &ДатаКон
				//Асист-Про Конец Аграновский 2013-10-26
				|
				|УПОРЯДОЧИТЬ ПО
				|	Дата
				|АВТОУПОРЯДОЧИВАНИЕ";
			Иначе
				
				Текст = 
				"ВЫБРАТЬ
				|	Выб.Ссылка КАК Ссылка,
				|	Выб.Дата КАК Дата,
				|	Выб.Номер,
				|	ПОДСТРОКА(Выб.Номер, 5, 7) КАК ПроизводныйНомер,
				|	Выб.Проведен,
				|	Выб.ПометкаУдаления,
				|	Выб.СуммаДокумента КАК Сумма
				|ИЗ
				|	Документ.СчетФактураПолученный КАК Выб
				|ГДЕ
				|	Выб.Дата МЕЖДУ &ДатаНач И &ДатаКон
				|
				|УПОРЯДОЧИТЬ ПО
				|	Дата
				|АВТОУПОРЯДОЧИВАНИЕ";
			КонецЕсли;
			
		ИначеЕсли ИмяМетаданныхБП = "СписаниеТоваров"
			ИЛИ ИмяМетаданныхБП = "ТребованиеНакладная"
			ИЛИ ИмяМетаданныхБП = "КорректировкаДолга"
			ИЛИ ИмяМетаданных = "СчетФактураВыданный" тогда
			
			Текст = 
			"ВЫБРАТЬ
			|	Выб.Ссылка,
			|	Выб.Дата КАК Дата,
			|	Выб.Номер,
			|	ПОДСТРОКА(Выб.Номер, 5, 7) КАК ПроизводныйНомер,
			|	Выб.Проведен,
			|	Выб.ПометкаУдаления,
			|	0 КАК Сумма
			|ИЗ
			|	Документ."+ИмяМетаданныхБП+" КАК Выб
			|ГДЕ
			|	Выб.Дата МЕЖДУ &ДатаНач И &ДатаКон	
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|АВТОУПОРЯДОЧИВАНИЕ";
				
		Иначе
			
			Текст = 
			"ВЫБРАТЬ
			|	Выб.Ссылка,
			|	Выб.Дата КАК Дата,
			|	Выб.Номер,
			|	ПОДСТРОКА(Выб.Номер, 5, 7) КАК ПроизводныйНомер,
			|	Выб.Проведен,
			|	Выб.ПометкаУдаления,
			|	Выб.СуммаДокумента КАК Сумма
			|ИЗ
			|	Документ."+ИмяМетаданныхБП+" КАК Выб
			|ГДЕ
			|	Выб.Дата МЕЖДУ &ДатаНач И &ДатаКон	
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|АВТОУПОРЯДОЧИВАНИЕ";
			
		КонецЕсли;
		
	ИначеЕсли ИмяМетаданныхБП = "ПриобретениеТоваровУслуг" тогда
		Текст = 
		"ВЫБРАТЬ
		|	Выб.Ссылка КАК Ссылка,
		|	Выб.Ссылка.Дата КАК Дата,
		|	Выб.Ссылка.Номер КАК Номер,
		|	ПОДСТРОКА(Выб.Ссылка.Номер, 5, 7) КАК ПроизводныйНомер,
		|	Выб.Ссылка.Проведен КАК Проведен,
		//|	Выб.Ссылка.ПредъявленСчетФактура КАК ПредъявленСчетФактура,
		//|	Выб.Ссылка.ДатаСчетаФактурыПолученного КАК ДатаСчетаФактурыПолученного,
		|	Выб.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
		|	Выб.Номенклатура.Код КАК КодНоменклатуры,
		|	СУММА(Выб.Количество) КАК Количество,
		|	СУММА(Выб.Сумма) КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТабЧасть.Ссылка КАК Ссылка,
		|		ТабЧасть.Номенклатура КАК Номенклатура,
		|		ТабЧасть.Количество КАК Количество,
		|		ТабЧасть.Сумма КАК Сумма
		|	ИЗ
		|		Документ.ПоступлениеТоваровУслуг.Товары КАК ТабЧасть //ПриобретениеТоваровУслуг.Товары КАК ТабЧасть //+++ {{ ASP 07.02.2020 000006132 }}
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабЧасть.Ссылка,
		|		ТабЧасть.Номенклатура,
		|		ТабЧасть.Количество,
		|		ТабЧасть.Сумма
		|	ИЗ
		|		Документ.ПоступлениеТоваровУслуг.Услуги КАК ТабЧасть) КАК Выб //ПриобретениеТоваровУслуг.Услуги КАК ТабЧасть) КАК Выб //+++ {{ ASP 07.02.2020 000006132 }}
		|ГДЕ
		|	Выб.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|
		|СГРУППИРОВАТЬ ПО
		|	Выб.Ссылка,
		|	Выб.Ссылка.Дата,
		|	Выб.Ссылка.Номер,
		|	Выб.Ссылка.Проведен,
		//|	Выб.Ссылка.ПредъявленСчетФактура,
		//|	Выб.Ссылка.ДатаСчетаФактурыПолученного,
		|	Выб.Ссылка.ПометкаУдаления,
		|	Выб.Номенклатура.Код
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|АВТОУПОРЯДОЧИВАНИЕ";
	ИначеЕсли ИмяМетаданныхБП = "РеализацияТоваровУслуг" тогда
		Текст = 
		"ВЫБРАТЬ
		|	Выб.Ссылка КАК Ссылка,
		|	Выб.Ссылка.Дата КАК Дата,
		|	Выб.Ссылка.Номер КАК Номер,
		|	ПОДСТРОКА(Выб.Ссылка.Номер, 5, 7) КАК ПроизводныйНомер,
		|	Выб.Ссылка.Проведен КАК Проведен,
		|	Выб.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
		|	Выб.Номенклатура.Код КАК КодНоменклатуры,
		|	СУММА(Выб.Количество) КАК Количество,
		|	СУММА(Выб.Сумма) КАК Сумма,
		//ASP. Добавлена сверка по складам в документах	
		|	Выб.Ссылка.Склад.Наименование Как НаименованиеСклада
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТабЧасть.Ссылка КАК Ссылка,
		|		ТабЧасть.Номенклатура КАК Номенклатура,
		|		ТабЧасть.Количество КАК Количество,
		|		ТабЧасть.Сумма КАК Сумма
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг.Товары КАК ТабЧасть
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТабЧасть.Ссылка,
		|		ТабЧасть.Номенклатура,
		|		ТабЧасть.Количество,
		|		ТабЧасть.Сумма
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг.Услуги КАК ТабЧасть) КАК Выб
		|ГДЕ
		|	Выб.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|
		|СГРУППИРОВАТЬ ПО
		|	Выб.Ссылка,
		|	Выб.Ссылка.Дата,
		|	Выб.Ссылка.Номер,
		|	Выб.Ссылка.Проведен,
		|	Выб.Ссылка.ПометкаУдаления,
		|	Выб.Номенклатура.Код
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|АВТОУПОРЯДОЧИВАНИЕ";
	ИначеЕсли ИмяМетаданныхБП = "ПеремещениеТоваров" ИЛИ ИмяМетаданныхБП = "КомплектацияНоменклатуры" тогда
		//ASP. Добавлена сверка по складам в документах
		Если ИмяМетаданныхБП = "ПеремещениеТоваров" Тогда
			ПолеНаименованиеСклада=" ,Выб.Ссылка.СкладОтправитель.Наименование+Выб.Ссылка.СкладПолучатель.Наименование КАК НаименованиеСклада ";		
		Иначе
			ПолеНаименованиеСклада=" ,Выб.Ссылка.Склад.Наименование КАК НаименованиеСклада ";
		КонецЕсли;
		
		Текст = 
		"ВЫБРАТЬ
		|	Выб.Ссылка КАК Ссылка,
		|	Выб.Ссылка.Дата КАК Дата,
		|	Выб.Ссылка.Номер,
		|	ПОДСТРОКА(Выб.Ссылка.Номер, 5, 7) КАК ПроизводныйНомер,
		|	Выб.Ссылка.Проведен,
		|	Выб.Ссылка.ПометкаУдаления,
		|	Выб.Номенклатура.Код КАК КодНоменклатуры,
		|	СУММА(Выб.Количество) КАК Количество,
		|	СУММА(0) КАК Сумма "
		//ASP. Добавлена сверка по складам в документах	
		+ПолеНаименованиеСклада+
		"ИЗ
		|	Документ."+ИмяМетаданныхБП+"."+ТабЧасть+" КАК Выб
		|ГДЕ
		|	Выб.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|СГРУППИРОВАТЬ ПО
		|	Выб.Ссылка,
		|	Выб.Ссылка.Дата,
		|	Выб.Ссылка.Номер,
		|	ПОДСТРОКА(Выб.Ссылка.Номер, 5, 7),
		|	Выб.Ссылка.Проведен,
		|	Выб.Ссылка.ПометкаУдаления,
		|	Выб.Номенклатура.Код
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|АВТОУПОРЯДОЧИВАНИЕ";
	Иначе
		Текст = 
		"ВЫБРАТЬ
		|	Выб.Ссылка КАК Ссылка,
		|	Выб.Ссылка.Дата КАК Дата,
		|	Выб.Ссылка.Номер,
		|	ПОДСТРОКА(Выб.Ссылка.Номер, 5, 7) КАК ПроизводныйНомер,
		|	Выб.Ссылка.Проведен,
		|	Выб.Ссылка.ПометкаУдаления,
		|	Выб.Номенклатура.Код КАК КодНоменклатуры,
		|	СУММА(Выб.Количество) КАК Количество,
		|	СУММА(Выб.Сумма) КАК Сумма
		|ИЗ
		|	Документ."+ИмяМетаданныхБП+"."+ТабЧасть+" КАК Выб
		|ГДЕ
		|	Выб.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|СГРУППИРОВАТЬ ПО
		|	Выб.Ссылка,
		|	Выб.Ссылка.Дата,
		|	Выб.Ссылка.Номер,
		|	ПОДСТРОКА(Выб.Ссылка.Номер, 5, 7),
		|	Выб.Ссылка.Проведен,
		|	Выб.Ссылка.ПометкаУдаления,
		|	Выб.Номенклатура.Код
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	
	Запрос = Коннектор.NewObject("Запрос");
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачДляПроверки);
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаКонДляПроверки));
	
	ВыборкаТЗ = Запрос.Выполнить().Выгрузить();
	//
	
	ПарамТЗ = Новый ТаблицаЗначений();
	ПарамТЗ.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	ПарамТЗ.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка"));
	Если ИмяМетаданных = "СчетФактураПолученный" тогда
		ПарамТЗ.Колонки.Добавить("ПроизводныйНомер", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(30)));
	Иначе
		ПарамТЗ.Колонки.Добавить("ПроизводныйНомер", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(7)));
	КонецЕсли;	
	ПарамТЗ.Колонки.Добавить("Проведен", Новый ОписаниеТипов("Булево"));
	ПарамТЗ.Колонки.Добавить("ПометкаУдаления", Новый ОписаниеТипов("Булево"));
	Если ИмяМетаданных = "ПриобретениеТоваровУслуг" тогда
		//ПарамТЗ.Колонки.Добавить("ПредъявленСчетФактура", Новый ОписаниеТипов("Булево"));
		//ПарамТЗ.Колонки.Добавить("ДатаВходящегоСчетаФактуры", Новый ОписаниеТипов("Дата")); 
	КонецЕсли;
	Если ТабЧасть<>"" тогда
		ПарамТЗ.Колонки.Добавить("КодНоменклатуры", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(11)));
		ПарамТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(15,3)));
	КонецЕсли;
	
	//ASP. Добавлена сверка по складам в документах	
	Если ИмяМетаданных = "СборкаТоваров" Или  ИмяМетаданных = "РеализацияТоваровУслуг" Или  ИмяМетаданных = "ПеремещениеТоваров" Тогда
		ПарамТЗ.Колонки.Добавить("НаименованиеСклада", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
	КонецЕсли;
	
	
	ПарамТЗ.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(15,2)));
	Для каждого стр из ВыборкаТЗ цикл
		ст = ПарамТЗ.Добавить();
		Для каждого е из ПарамТЗ.Колонки цикл
			ст[е.Имя] = стр[е.Имя];
		Конеццикла;
	Конеццикла;
	
	//
	ТабЧасть = ?(ТабЧастьУТ="", ТабЧасть, ТабЧастьУТ);
	Если ТабЧасть = "" тогда
		Если ИмяМетаданных = "СчетФактураПолученныйАванс" тогда
			
			Текст = 
			"ВЫБРАТЬ
			|	СчетФактураПолученныйАвансАвансы.Ссылка КАК Ссылка,
			|	ПОДСТРОКА(СчетФактураПолученныйАвансАвансы.Ссылка.Номер, 5, 1) + ""А"" + ПОДСТРОКА(СчетФактураПолученныйАвансАвансы.Ссылка.Номер, 7, 5) КАК ПроизводныйНомер,
			|	СчетФактураПолученныйАвансАвансы.Ссылка.Дата КАК Дата,
			|	СУММА(СчетФактураПолученныйАвансАвансы.Сумма) КАК Сумма
			|ИЗ
			|	Документ.СчетФактураПолученныйАванс.Авансы КАК СчетФактураПолученныйАвансАвансы
			|ГДЕ
			|	СчетФактураПолученныйАвансАвансы.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
			|
			|СГРУППИРОВАТЬ ПО
			|	СчетФактураПолученныйАвансАвансы.Ссылка,
			|	СчетФактураПолученныйАвансАвансы.Ссылка.Дата,
			|	ПОДСТРОКА(СчетФактураПолученныйАвансАвансы.Ссылка.Номер, 5, 1) + ""А"" + ПОДСТРОКА(СчетФактураПолученныйАвансАвансы.Ссылка.Номер, 7, 5)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|АВТОУПОРЯДОЧИВАНИЕ";
			
		ИначеЕсли ИмяМетаданных = "СчетФактураПолученный" тогда
			
			Текст = 
			"ВЫБРАТЬ
			|	СчетФактураПолученныйДокументыОснования.Ссылка,
			|	МАКСИМУМ(СчетФактураПолученныйДокументыОснования.ДокументОснование.Дата) КАК ДокументОснованиеДата
			|ПОМЕСТИТЬ Вр_Даты
			|ИЗ
			|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
			|
			|СГРУППИРОВАТЬ ПО
			|	СчетФактураПолученныйДокументыОснования.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Выб.Ссылка КАК Ссылка,
			|	Выб.Номер КАК ПроизводныйНомер,
			|	НАЧАЛОПЕРИОДА(ВЫБОР
			|			КОГДА Вр_Даты.ДокументОснованиеДата ЕСТЬ NULL 
			|				ТОГДА ВЫБОР
			|						КОГДА Выб.Дата >= Выб.ДатаИсправления
			|							ТОГДА Выб.Дата
			|						ИНАЧЕ Выб.ДатаИсправления
			|					КОНЕЦ
			|			ИНАЧЕ ВЫБОР
			|					КОГДА Выб.Дата >= Выб.ДатаИсправления
			|							И Выб.Дата > Вр_Даты.ДокументОснованиеДата
			|						ТОГДА Выб.Дата
			|					КОГДА Выб.ДатаИсправления >= Выб.Дата
			|							И Выб.ДатаИсправления > Вр_Даты.ДокументОснованиеДата
			|						ТОГДА Выб.ДатаИсправления
			|					ИНАЧЕ Выб.Дата 
			//Асист-Про Начало Аграновский 2013-10-26
			//|						ВЫБОР
			//|							КОГДА Вр_Даты.ДокументОснованиеДата = КОНЕЦПЕРИОДА(Вр_Даты.ДокументОснованиеДата, ДЕНЬ)
			//|								ТОГДА Вр_Даты.ДокументОснованиеДата
			//|							ИНАЧЕ ДОБАВИТЬКДАТЕ(Вр_Даты.ДокументОснованиеДата, СЕКУНДА, 1)
			//|						КОНЕЦ
			//Асист-Про Конец Аграновский 2013-10-26
			|				КОНЕЦ
			|		КОНЕЦ, ДЕНЬ) КАК Дата,
			|	0 КАК Сумма
			|ИЗ
			|	Документ.СчетФактураПолученный КАК Выб
			|		ЛЕВОЕ СОЕДИНЕНИЕ Вр_Даты КАК Вр_Даты
			|		ПО (Вр_Даты.Ссылка = Выб.Ссылка)
			|ГДЕ
			|	Выб.Дата МЕЖДУ &ДатаНач И &ДатаКон
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|АВТОУПОРЯДОЧИВАНИЕ";
			
		ИначеЕсли ИмяМетаданных = "СписаниеЗадолженности" тогда
			
			Текст = 
			"ВЫБРАТЬ
			|	Выб.Ссылка КАК Ссылка,
			|	ПОДСТРОКА(Выб.Номер, 5, 1) + ""С"" + ПОДСТРОКА(Выб.Номер, 7, 7) КАК ПроизводныйНомер,
			|	Выб.Дата КАК Дата,
			|	0 КАК Сумма
			|ИЗ
			|	Документ.СписаниеЗадолженности КАК Выб
			|ГДЕ
			|	Выб.Дата МЕЖДУ &ДатаНач И &ДатаКон
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|АВТОУПОРЯДОЧИВАНИЕ";
			
		ИначеЕсли ИмяМетаданных = "ПересортицаТоваров"
			ИЛИ ИмяМетаданных = "СписаниеНедостачТоваров"
			ИЛИ ИмяМетаданных = "СчетФактураВыданный"
			ИЛИ ИмяМетаданных = "ВнутреннееПотреблениеТоваров" тогда
			
			Текст = 
			"ВЫБРАТЬ
			|	Выб.Ссылка КАК Ссылка,
			|	ПОДСТРОКА(Выб.Номер, 5, 7) КАК ПроизводныйНомер,
			|	Выб.Дата КАК Дата,
			|	0 КАК Сумма	
			|ИЗ
			|	Документ."+ИмяМетаданных+" КАК Выб
			|ГДЕ
			|	Выб.Дата МЕЖДУ &ДатаНач И &ДатаКон
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|АВТОУПОРЯДОЧИВАНИЕ";
			
		ИначеЕсли ИмяМетаданных = "АвансовыйОтчет" тогда
			
			Текст = 
			"ВЫБРАТЬ
			|	Выб.Ссылка КАК Ссылка,
			|	ПОДСТРОКА(Выб.Номер, 5, 7) КАК ПроизводныйНомер,
			|	Выб.Дата КАК Дата,
			|	Выб.СуммаИзрасходовано КАК Сумма	
			|ИЗ
			|	Документ."+ИмяМетаданных+" КАК Выб
			|ГДЕ
			|	Выб.Дата МЕЖДУ &ДатаНач И &ДатаКон
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|АВТОУПОРЯДОЧИВАНИЕ";
			
		ИначеЕсли ИмяМетаданных = "СчетФактураВыданныйАванс" тогда
			
			Текст = 
			"ВЫБРАТЬ
			|	Выб.Ссылка КАК Ссылка,
			|	ПОДСТРОКА(Выб.Номер, 5, 7) КАК ПроизводныйНомер,
			|	Выб.Дата КАК Дата,
			|	Выб.Сумма КАК Сумма
			|ИЗ
			|	Документ."+ИмяМетаданных+" КАК Выб
			|ГДЕ
			|	Выб.Дата МЕЖДУ &ДатаНач И &ДатаКон
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|АВТОУПОРЯДОЧИВАНИЕ";
			
		Иначе
			
			Текст = 
			"ВЫБРАТЬ
			|	Выб.Ссылка КАК Ссылка,
			|	ПОДСТРОКА(Выб.Номер, 5, 7) КАК ПроизводныйНомер,"+?(ИмяМетаданных = "ПриобретениеТоваровУслуг", "", "")+"
			|	Выб.Дата КАК Дата,
			|	Выб.СуммаДокумента КАК Сумма
			|ИЗ
			|	Документ."+ИмяМетаданных+" КАК Выб
			|ГДЕ
			|	Выб.Дата МЕЖДУ &ДатаНач И &ДатаКон
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата
			|АВТОУПОРЯДОЧИВАНИЕ";
		КонецЕсли;
	ИначеЕсли ИмяМетаданныхБП = "ПеремещениеТоваров" ИЛИ ИмяМетаданныхБП = "КомплектацияНоменклатуры" тогда
		
		//ASP. Добавлена сверка по складам в документах
		Если ИмяМетаданныхБП = "ПеремещениеТоваров" Тогда
			ПолеНаименованиеСклада=" ,ВЫРАЗИТЬ(Выб.Ссылка.СкладОтправитель.Наименование+Выб.Ссылка.СкладПолучатель.Наименование КАК СТРОКА(100)) КАК НаименованиеСклада ";		
		Иначе
			ПолеНаименованиеСклада=" ,ВЫРАЗИТЬ(Выб.Ссылка.Склад.Наименование  КАК СТРОКА(100)) КАК НаименованиеСклада ";
		КонецЕсли;

		Текст = 
		"ВЫБРАТЬ
		|	Выб.Ссылка КАК Ссылка,
		|	ПОДСТРОКА(Выб.Ссылка.Номер, 5, 7) КАК ПроизводныйНомер,
		|	Выб.Ссылка.Дата КАК Дата,
		|	Выб.Номенклатура.Код КАК КодНоменклатуры,
		|	СУММА(ВЫБОР КОГДА Выб.Количество = 0 ТОГДА Выб.КоличествоУпаковок ИНАЧЕ Выб.Количество КОНЕЦ) КАК Количество,
		|	СУММА(0) КАК Сумма "
		//ASP. Добавлена сверка по складам в документах
		+ПолеНаименованиеСклада+
		"ИЗ
		|	Документ."+ИмяМетаданных+"."+ТабЧасть+" КАК Выб
		|ГДЕ
		|	Выб.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон И Выб.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|СГРУППИРОВАТЬ ПО
		|	Выб.Ссылка,
		|	ПОДСТРОКА(Выб.Ссылка.Номер, 5, 7),
		|	Выб.Ссылка.Дата,
		|	Выб.Номенклатура.Код
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|АВТОУПОРЯДОЧИВАНИЕ";
	Иначе
		
		//ASP. Добавлена сверка по складам в документах
		Если ИмяМетаданныхБП = "РеализацияТоваровУслуг" Тогда
			ПолеНаименованиеСклада=" ,ВЫРАЗИТЬ(Выб.Ссылка.Склад.Наименование  КАК СТРОКА(100)) Как НаименованиеСклада ";		
		Иначе
			ПолеНаименованиеСклада=" ";
		КонецЕсли;
		//ASP_Dante 07/10/19
		Если ИмяМетаданных = "ПоступлениеТоваровУслуг" Тогда 
			ИмяМетаданных = "ПриобретениеТоваровУслуг";
		КонецЕсли;
		//ASP_Dante 07/10/19
		//ASP. Добавлена сверка по складам в документах	
			
		Текст = 
		"ВЫБРАТЬ
		|	Выб.Ссылка КАК Ссылка,
		|	ПОДСТРОКА(Выб.Ссылка.Номер, 5, 7) КАК ПроизводныйНомер,"+?(ИмяМетаданных = "ПриобретениеТоваровУслуг", "", "")+"
		|	Выб.Ссылка.Дата КАК Дата,
		|	Выб.Номенклатура.Код КАК КодНоменклатуры,
		|	СУММА(ВЫБОР КОГДА Выб.Количество = 0 ТОГДА Выб.КоличествоУпаковок ИНАЧЕ Выб.Количество КОНЕЦ) КАК Количество,
		|	СУММА(Выб.Сумма) КАК Сумма "
		+ПолеНаименованиеСклада+
		"ИЗ
		|	Документ."+ИмяМетаданных+"."+ТабЧасть+" КАК Выб
		|ГДЕ
		|	Выб.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон" + ?(ИмяМетаданных = "ПриобретениеТоваровУслуг" ИЛИ ИмяМетаданных = "РеализацияТоваровУслуг", "", " И Выб.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)") + "
		|СГРУППИРОВАТЬ ПО
		|	Выб.Ссылка,
		|	ПОДСТРОКА(Выб.Ссылка.Номер, 5, 7),"+?(ИмяМетаданных = "ПриобретениеТоваровУслуг", "", "")+"
		|	Выб.Ссылка.Дата,
		|	Выб.Номенклатура.Код
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("ДатаНач", ДатаНачДляПроверки);
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ДатаКонДляПроверки));
	
	ТаблицаУТ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Тек Из ТаблицаУТ Цикл
		Если ТипЗнч(Тек.Ссылка) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") 
			ИЛИ ТипЗнч(Тек.Ссылка) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда
			
			Тек.Дата = ПолучитьДатуДокументаДС(Тек.Ссылка)
		КонецЕсли;
	КонецЦикла;
	
	//
	возврат Новый Структура("ВыборкаТЗ, ТаблицаБП, ТаблицаУТ", ВыборкаТЗ, ПарамТЗ, ТаблицаУТ);
	
КонецФункции


Функция ПолучитьДатуДокументаДС(Источник)
	Рез = Источник.Дата;
	
	Если Источник.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
		ИЛИ Источник.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию Тогда
		
		Возврат Рез;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник.ДатаПроведенияБанком) Тогда
		Рез=Источник.ДатаПроведенияБанком;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции


//// КОРРЕКТИРОВКИ МЕХАНИЗМОВ ПРОВЕДЕНИЯ
Процедура ИнициироватьПерезаполнениеВидовЗапасов(Объект) Экспорт
	
	//ASP_Dante 06/10/21 Задача 000012771
	Если Объект.ДополнительныеСвойства.Свойство("НеПерезаполнятьВидЗапасов") ИЛИ Объект.ВидыЗапасовУказаныВручную Тогда 
		Возврат;
	КонецЕсли;
	//ASP_Dante 06/10/21
	// Альтер ЛОГО+:	некоторая корректировка связана с необходимостью при перепроведении 
	// ВСЕГДА перезаполнять ВидыЗапасов. Замедляет работу но делает более надежным механизм 
	// движений по регистрам ТоварыОрганизаций в разрезе ГТД
	Объект.ДополнительныеСвойства.Вставить("ПерезаполнитьВидыЗапасов", Истина);
	Объект.ВидыЗапасов.Очистить();
	// +Альтер ЛОГО
	
КонецПроцедуры

//// КОРРЕКТИРОВКА ЦЕНЫ БАЛКИ С УЧЕТОМ ДЛИНЫ
Функция КоэффициентНаценкиНаНоменклатуруСБалкой(БалкаДлина, БалкаТолщинаМеталла, БалкаВысотаПрофиля) Экспорт
	
	Коэффициент = 1;
	Если БалкаДлина <= Константы.ДлинаБалкиБезДопНаценки.Получить() тогда возврат(1) конецесли;
	
	Отбор = Новый Структура("ТолщинаМеталла, ВысотаПрофиля", БалкаТолщинаМеталла, БалкаВысотаПрофиля);
	Рег = РегистрыСведений.КоэффициентыНаценкиКомплектующихРасчетаСтелажей.СрезПоследних(ТекущаяДата(), Отбор);
	
	Если Рег.Количество() > 0 тогда
		Коэффициент = Рег[0].Коэффициент;
	Конецесли;
	
	возврат Коэффициент;
	
КонецФункции

Функция СтруктураПрофиляНоменклатуры(Профиль, Наименование) Экспорт
	
	Если ПустаяСтрока(СокрЛП(строка(Профиль))) тогда 
		возврат неопределено;
	Конецесли;
	//
	СтрокаПрофиля = Сред(Профиль, 2, СтрДлина(Профиль)-2);
	//
	ПервыйРазделитель = Найти(СтрокаПрофиля, ".");
	ВысотаПрофиля = Сред(СтрокаПрофиля, 1, ПервыйРазделитель-1);
	//
	ДлинаБалки 		= ДлинаСтойкиРаскоса(Наименование);
	МассивПрофиля 	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаПрофиля, ".");
	ТолщинаМеталла 	= МассивПрофиля[1]+"."+МассивПрофиля[2];
	
	//
	возврат Новый Структура("ВысотаПрофиля, ТолщинаМеталла, ДлинаБалки", ВысотаПрофиля, ТолщинаМеталла, ДлинаБалки);
	
КонецФункции

Функция ЭтоПрофиль(е)
	Если Найти(е, "(")=0 ИЛИ Найти(е, ")")=0 тогда
		возврат Ложь;
	Конецесли;
	//	
	возврат СтрЧислоВхождений(е, ".") > 1;
КонецФункции

Функция ПрофильНоменклатуры(Наименование) Экспорт
	Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Наименование, " ");
	СтрокаПрофиля = "";
	ДлинаБалки = 0;
	Для каждого е из Массив цикл		
		Если ЭтоПрофиль(е) тогда
			возврат е;
		КонецЕсли;
	Конеццикла; 
КонецФункции

////////////////////////////////////////// РАБОТА С ЦЕНАМИ НА ИЗДЕЛИЯ С КОМПЛЕКТАЦИЯМИ ///////////////////////////////
Функция КомплектацияНоменклатуры(Номенклатура) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВариантыКомплектацииНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
	|ГДЕ
	|	ВариантыКомплектацииНоменклатуры.Основной
	|	И ВариантыКомплектацииНоменклатуры.Владелец = &Владелец
	|	И (НЕ ВариантыКомплектацииНоменклатуры.ПометкаУдаления)");
	Запрос.УстановитьПараметр("Владелец", Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		возврат Выборка.Ссылка;
	КонецЕсли;
КонецФункции

Функция ТаблицаЦенКомплекта(Дата, Комплектация, ВидЦены = неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ТабЧасть.Ссылка.Владелец КАК Номенклатура,
	|	ТабЧасть.Номенклатура КАК Комплектующее,
	|	ТабЧасть.Характеристика,
	|	ТабЧасть.Количество
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ТабЧасть
	|ГДЕ
	|	ТабЧасть.Ссылка = &Комплектация");
	Запрос.УстановитьПараметр("Комплектация", Комплектация);
	ТаблицаКомплекта = Запрос.Выполнить().Выгрузить();
	Для каждого СтрокаКомплекта из ТаблицаКомплекта цикл
		Наименование = СтрокаКомплекта.Комплектующее.Наименование;
		Если (Найти(Наименование, "Стойка") > 0
			ИЛИ Найти(Наименование, "Раскос") > 0) И НЕ Найти(Наименование, "Связь Рама-Стойка 1000 мм под 70") >0  тогда
			БазовоеНаименование = БазовоеНаименованиеНоменклатуры(Наименование);
			БазоваяНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию(БазовоеНаименование);
			Если Не ЗначениеЗаполнено(БазоваяНоменклатура) тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена базовая номенклатура (м.) для "+Наименование+". Цена на комплектующее не может быть расчитана");
				продолжить;
			Конецесли;
			//
			Длина = ДлинаСтойкиРаскоса(Наименование)/1000;
			СтрокаКомплекта.Комплектующее = БазоваяНоменклатура;
			СтрокаКомплекта.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			СтрокаКомплекта.Количество = Длина * СтрокаКомплекта.Количество;
		Конецесли;
	Конеццикла;
	//
	КоэффициентЦены = КоэффициентЦеныНоменклатурыСБалкой(Комплектация.Владелец);
	//
	Текст =
	"ВЫБРАТЬ
	|	ТаблицаКомплекта.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТаблицаКомплекта.Комплектующее КАК Справочник.Номенклатура) КАК Комплектующее,
	|	ТаблицаКомплекта.Характеристика,
	|	ТаблицаКомплекта.Количество
	|ПОМЕСТИТЬ ТаблицаКомплекта
	|ИЗ
	|	&ТаблицаКомплекта КАК ТаблицаКомплекта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаКомплекта.Количество * ЕСТЬNULL(Цены.Цена, 0) * ВЫБОР
	|		КОГДА ТаблицаКомплекта.Комплектующее.Наименование ПОДОБНО ""Балка%""
	|			ТОГДА &КоэффициентЦены
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Цена,
	|	Цены.Цена КАК ЦенаЗаЕдиницу,
	|	Цены.ВидЦены,
	|	ТаблицаКомплекта.Количество КАК Количество,
	|	ТаблицаКомплекта.Комплектующее,
	|	Цены.Упаковка КАК Упаковка,
	|	Цены.Валюта КАК Валюта
	|ИЗ
	|	ТаблицаКомплекта КАК ТаблицаКомплекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ДатаСреза,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							ВТ.Комплектующее
	|						ИЗ
	|							ТаблицаКомплекта КАК ВТ)
	|					И ВЫБОР
	|						КОГДА &ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ВидЦены = &ВидЦены
	|					КОНЕЦ) КАК Цены
	|		ПО ТаблицаКомплекта.Комплектующее = Цены.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ТаблицаКомплекта.Количество * ЕСТЬNULL(Цены.Цена, 0) * ВЫБОР
	|			КОГДА ТаблицаКомплекта.Комплектующее.Наименование ПОДОБНО ""Балка%""
	|				ТОГДА &КоэффициентЦены
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК Цена,
	|	Цены.ВидЦены,
	|	ТаблицаКомплекта.Характеристика,
	|	ТаблицаКомплекта.Номенклатура,
	|	МАКСИМУМ(Цены.Упаковка) КАК Упаковка,
	|	МАКСИМУМ(Цены.Валюта) КАК Валюта
	|ИЗ
	|	ТаблицаКомплекта КАК ТаблицаКомплекта
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ДатаСреза,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							ВТ.Комплектующее
	|						ИЗ
	|							ТаблицаКомплекта КАК ВТ)
	|					И ВЫБОР
	|						КОГДА &ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ВидЦены = &ВидЦены
	|					КОНЕЦ) КАК Цены
	|		ПО ТаблицаКомплекта.Комплектующее = Цены.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	Цены.ВидЦены,
	|	ТаблицаКомплекта.Характеристика,
	|	ТаблицаКомплекта.Номенклатура";
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("ДатаСреза", Дата);
	Запрос.УстановитьПараметр("ТаблицаКомплекта", ТаблицаКомплекта);
	Запрос.УстановитьПараметр("КоэффициентЦены", КоэффициентЦены);
	Запрос.УстановитьПараметр("ВидЦены", ?(ВидЦены = неопределено, Справочники.ВидыЦен.ПустаяСсылка(), ВидЦены));
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаРезультат = Результат[2].Выгрузить();
	
	возврат ТаблицаРезультат;
	
КонецФункции

Функция БазовоеНаименованиеНоменклатуры(Наименование) Экспорт
	Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Наименование, " ");
	БазовоеНаименование = "";
	Для каждого е из Массив цикл
		Если ПустаяСтрока(СокрЛП(е)) тогда продолжить конецесли;
		//
		Если Найти(е, "Стойка")>0
			ИЛИ Найти(е, "Раскос")>0
			ИЛИ Найти(е, "СЕТ")>0
			ИЛИ Найти(е, "ГТС")>0
			ИЛИ (Найти(е, "(")>0 И Найти(е, ")")>0) тогда
			//
			ОбработатьПрофиль(е);
			//
			Если Найти(Наименование, "Раскос")>0
				И Найти(е, "(")>0 И Найти(е, ")")>0 тогда
				е = "(100.1.5)";
			КонецЕсли;
			БазовоеНаименование = БазовоеНаименование + е + " ";
		КонецЕсли;
	Конеццикла;
	//
	БазовоеНаименование = СокрЛП(БазовоеНаименование);
	// Замена СЕТ на ГТС
	БазовоеНаименование = СтрЗаменить(БазовоеНаименование, "ГТС", "СЕТ");
	//
	возврат БазовоеНаименование
КонецФункции

Процедура ОбработатьПрофиль(е, БезСкобок = ложь) Экспорт
	// является ли данное слово профилем
	Если НЕ БезСкобок тогда
		Если Найти(е, ")")=0 или Найти(е, "(")=0 тогда возврат конецесли;
	КонецЕсли;
	
	// разложим внутрянку на части
	Если БезСкобок тогда
		Профиль = е;
	Иначе
		Профиль = Сред(е, 2, СтрДлина(е)-2);
	КонецЕсли;
	Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Профиль, ".");
	Если Массив.Количество() < 3 тогда возврат конецесли;
	Строчка = "";
	Для п = 0 по 2 цикл
		Строчка = Строчка + Массив[п] + ?(п = 2, "", ".");
	КонецЦикла;
	
	Если БезСкобок тогда
		е = Строчка;
	Иначе
		е = "("+Строчка+")";
	КонецЕсли;
	
КонецПроцедуры

Функция ДлинаСтойкиРаскоса(Наименование) Экспорт
	Массив = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Наименование, " ");
	СтрокаПараметра = Массив[2];
	Если Найти(СтрокаПараметра, "/")>0 тогда
		пм = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаПараметра, "/");
		Строкапараметра = пм[0];
	КонецЕсли;
	Попытка
		Длина = Число(СтрокаПараметра);
	Исключение
		Длина = 0;
	КонецПопытки;
	//	
	возврат Длина;
КонецФункции

Функция КоэффициентЦеныНоменклатурыСБалкой(Номенклатура) Экспорт
	КоэффициентЦены = 1;
	Наименование = Номенклатура.Наименование;
	Если Найти(ВРег(Наименование), "БАЛКА")>0 тогда
		Если НЕ (Найти(Наименование, "ГТСБ") > 0 ИЛИ Найти(Наименование, "СЕТБ") > 0) тогда
			Профиль = АльтерЛОГО.ПрофильНоменклатуры(Наименование);
			СтруктураПрофиля = АльтерЛого.СтруктураПрофиляНоменклатуры(Профиль, Номенклатура.Наименование);
			КоэффициентЦены = АльтерЛого.КоэффициентНаценкиНаНоменклатуруСБалкой(СтруктураПрофиля.ДлинаБалки, 
			СтруктураПрофиля.ТолщинаМеталла, 
			СтруктураПрофиля.ВысотаПрофиля);
		КонецЕсли;
	КонецЕсли;
	возврат КоэффициентЦены;																		
КонецФункции

Функция РасчитатьЦенуПоКомплекту(Номенклатура, Комплектация = неопределено) Экспорт
	Если Комплектация = неопределено тогда
		Комплектация = Альтерлого.КомплектацияНоменклатуры(Номенклатура);
	Конецесли;
	Наименование = Номенклатура.Наименование;
	//ГТС рассчитываем цену стойки
	Если Найти(Наименование, "Стойка СЕТ")>0  или Найти(Наименование, "Раскос СЕТ")>0 
		ИЛИ (Найти(Наименование, "Стеллаж металлический паллетный, ") > 0 )
		ИЛИ (Найти(Наименование, "Секция приставная стеллажа металлического паллетного, ") > 0 )
		ИЛИ (Найти(Наименование, "Две секции стеллажа металлического паллетного,") > 0 )
		Тогда 
		возврат истина;
	КонецЕсли;
		
		
	Если НЕ ЗначениеЗаполнено(Комплектация) тогда
		возврат ложь;
	Иначе
		Наименование = Номенклатура.Наименование;
		Если (
			(Найти(Наименование, "ГТС") > 0 ИЛИ  Найти(Наименование, "СЕТ") > 0)
			И Найти(ВРег(Наименование), "РЕАЛИЗАЦ") > 0
			)
			ИЛИ (
			Найти(Наименование, "ГТС") = 0 
			И Найти(Наименование, "СЕТ") = 0
			И Найти(Наименование, "Рама") = 0 
			И Найти(Наименование, "Балка") = 0 
			//ИЛИ 
			//(Найти(Наименование, "жесткости") > 0 И Найти(Наименование, "Балка") > 0)
			//ИЛИ (Найти(Наименование, "Ограничитель СЕТП") > 0 )
			ИЛИ
			(Найти(Наименование, "Настил") > 0 И Найти(Наименование, "СЕТ") > 0))
			ИЛИ (Найти(Наименование, "Отбойник СЕТП") > 0 И НЕ Найти(Наименование, "боковой") > 0 )
			ИЛИ (Найти(Наименование, "Связь СЕТО") > 0 )
			ИЛИ (Найти(Наименование, "Балка СЕТ") > 0 И Найти(Наименование, "(70.") > 0 )
			ИЛИ (Найти(Наименование, "Связь Рама-Стойка") > 0 )
			Тогда
			возврат ложь;
		Иначе
			возврат истина;
		КонецЕсли;
	КонецЕсли;
КонецФункции

Функция ЦенаСтойки(Дата, Номенклатура, ВидЦены = неопределено) Экспорт
		Наименование = Номенклатура.Наименование;
		Если Найти(Наименование, "Стойка") > 0
			ИЛИ Найти(Наименование, "Раскос") > 0 тогда
			БазовоеНаименование = БазовоеНаименованиеНоменклатуры(Наименование);
			БазоваяНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию(БазовоеНаименование);
			Если Не ЗначениеЗаполнено(БазоваяНоменклатура) тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена базовая номенклатура (м.) для "+Наименование+". Цена на комплектующее не может быть расчитана");
			Конецесли;
			//
			Длина = ДлинаСтойкиРаскоса(Наименование)/1000;
		Конецесли;
	
	//
	//КоэффициентЦены = КоэффициентЦеныНоменклатурыСБалкой(Комплектация.Владелец);
	//
	Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Цены.Цена, 0) КАК Цена,
	|	Цены.ВидЦены КАК ВидЦены,
	|	Цены.Упаковка КАК Упаковка,
	|	Цены.Валюта КАК Валюта
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ДатаСреза,
	|			Номенклатура = &Номенклатура
	|				И ВЫБОР
	|					КОГДА &ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ВидЦены = &ВидЦены
	|				КОНЕЦ) КАК Цены";
	Запрос = Новый Запрос(Текст);
	Запрос.УстановитьПараметр("ДатаСреза", Дата);
	Запрос.УстановитьПараметр("Номенклатура", БазоваяНоменклатура);
	Запрос.УстановитьПараметр("ВидЦены", ?(ВидЦены = неопределено, Справочники.ВидыЦен.ПустаяСсылка(), ВидЦены));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Для каждого СтрокаРезультата из РезультатЗапроса цикл
	Возврат ?(значениезаполнено(СтрокаРезультата.Цена),СтрокаРезультата.Цена*Длина,0);
	КонецЦикла;
	Возврат 0;
КонецФункции


Функция ЦенаНоменклатурыПоКомплекту(Номенклатура, Дата, ВидЦены,Цен=0,Коэф=1) Экспорт
	//Проверяем и возвращаем установленную цену если она есть, ГТС 06.11.2020
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&Дата,
		|			Номенклатура = &Номенклатура
		|				И Цена = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Цена>0 Тогда
			возврат окр(ВыборкаДетальныеЗаписи.Цена);
		КонецЕсли;
	КонецЦикла;
	
	//КонецВозвратаТекЦены
	//ГТС добавляем расчет стойки отдельно без комплектаций уже
	Если Найти(Номенклатура.Наименование, "Стойка СЕТ")>0 или Найти(Номенклатура.Наименование, "Раскос СЕТ")>0 Тогда 
		ЦенаСтойки = АльтерЛОГО.ЦенаСтойки(Дата, Номенклатура, ВидЦены);
		Если ЦенаСтойки > 0 тогда
//		возврат окр(ЦенаСтойки);
		возврат окр(ЦенаСтойки,0);
		Иначе 
		возврат 0;
		КонецЕсли;
	КонецЕсли;
	
	Комплектация = Альтерлого.КомплектацияНоменклатуры(Номенклатура);
	ТЗ = АльтерЛОГО.ТаблицаЦенКомплекта(Дата, Комплектация, ВидЦены);
	Если ТЗ.Количество() > 0 тогда
	ТЗ.Сортировать("Цена УБЫВ");
	возврат окр(ТЗ[0].Цена);
	КонецЕсли;
КонецФункции

&НаСервере
Функция КоэффициентНаценки(Номенклатура)
	Коэффициент = 1;
	Если Найти(ВРег(Номенклатура.Наименование), "БАЛКА")>0 тогда
		Профиль = АльтерЛого.ПрофильНоменклатуры(Номенклатура.Наименование);
		Структура = АльтерЛого.СтруктураПрофиляНоменклатуры(Профиль, Номенклатура.Наименование);
		Коэффициент = АльтерЛого.КоэффициентНаценкиНаНоменклатуруСБалкой(Структура.ДлинаБалки, Структура.ТолщинаМеталла, Структура.ВысотаПрофиля);
	КонецЕсли;
	возврат Коэффициент;
КонецФункции


/////////////////////// ДОПОЛНИТЕЛЬНЫЙ КОНТРОЛЬ ОСТАТКОВ ///////////////////////////////////////////////////////////////////////////////////
Процедура ПриИзмененииДвиженийДокументовДопКонтрольОстатковПриЗаписи(Источник, Отказ) Экспорт
	Если Отказ тогда возврат конецесли;
	Если Источник.ОбменДанными.Загрузка тогда возврат конецесли;
	ПроведениеСерверУТ.ДополнительныйКонтрольОстатковНаСкладе(Источник, Отказ);
КонецПроцедуры

Процедура ПередЗаписьюДокументовСПоступлениемТоваровПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения тогда возврат конецесли;// под отмену проведения другой обработчик
	Если НЕ Источник.Проведен тогда возврат конецесли;// рассматриваем только действия над проведенными документами
	Если Источник.ОбменДанными.Загрузка тогда возврат конецесли;
	ПроведениеСерверУТ.КонтрольИзмененияСоставаДокументовОприходования(Источник, Отказ, Источник.ПометкаУдаления);	
КонецПроцедуры

Процедура ПередЗаписьюДокументовКонтрольДатыЗапретаИИзмененияДвиженийПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказКлиента") тогда возврат конецесли;
	// контроль даты запрета
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ДатыЗапретаИзменения.ДатаЗапрета
	|ИЗ
	|	РегистрСведений.ДатыЗапретаИзменения КАК ДатыЗапретаИзменения
	|ГДЕ
	|	ДатыЗапретаИзменения.Пользователь = ЗНАЧЕНИЕ(Перечисление.ВидыНазначенияДатЗапрета.ДляВсехПользователей)");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() тогда
		Если Источник.Дата <= Выборка.ДатаЗапрета тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ ранее даты запрета "+Формат(Выборка.ДатаЗапрета, "ДЛФ=D")+" не может быть записан!");
			Отказ = Истина;
		КонецЕсли;
	Конецесли;
	//
	СписокВидовДокументов = СписокВидовДокументовПрихода();
	Если СписокВидовДокументов.НайтиПоЗначению(Источник.Метаданные().Имя) <> неопределено тогда
		ПередЗаписьюДокументовСПоступлениемТоваровПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения);
	Конецесли;
КонецПроцедуры

Функция СписокВидовДокументовПрихода()
	Список = Новый СписокЗначений();
	Список.Добавить("ВводОстатков");
	Список.Добавить("ВозвратТоваровОтКлиента");
	Список.Добавить("ОприходованиеТоваров");
	Список.Добавить("ПеремещениеТоваров");
	Список.Добавить("ПересортицаТоваров");
	Список.Добавить("ПриобретениеТоваровУслуг");
	Список.Добавить("ПриходныйОрдерНаТовары");
	Список.Добавить("СборкаТоваров");///ОБРАБОТАТЬ!!!
	возврат Список;
КонецФункции



//////////////

//Альтер ЛОГО Устанавливаем последнюю по дате сделку для партнера
Функция УстановитьСделку(Клиент) Экспорт
	ЗапросСделки = Новый Запрос;
	ЗапросСделки.Текст = "ВЫБРАТЬ
	|	СделкиСКлиентами.Ссылка
	|ИЗ
	|	Справочник.СделкиСКлиентами КАК СделкиСКлиентами
	|ГДЕ
	|	СделкиСКлиентами.Партнер = &Партнер
	|
	|УПОРЯДОЧИТЬ ПО
	|	СделкиСКлиентами.ДатаНачала УБЫВ";
	ЗапросСделки.УстановитьПараметр("Партнер", Клиент);
	ВыборкаСделок = ЗапросСделки.Выполнить().Выбрать();
	
	Если ВыборкаСделок.Количество() = 0 Тогда
		Возврат Неопределено
	Иначе
		ВыборкаСделок.Следующий();
		Возврат ВыборкаСделок.Ссылка;
	КонецЕсли;
КонецФункции	

/////////////////////// ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ РАБОТЫ С КОМПЛЕКТАЦИЯМИ И СООТВЕТСТВИЯМИ СЕТ-ГТС
Функция СоответствиеНоменклатуры(Номенклатура) Экспорт
	
	Если Найти(Номенклатура.Наименование, "ГТС") > 0 тогда//находим соответствие СЕТ
		Отбор = Новый Структура("НоменклатураГТС", Номенклатура);
		Поле = "НоменклатураСЕТ";
	ИначеЕсли Найти(Номенклатура.Наименование, "СЕТ") > 0 тогда//находим соответствие ГТС
		Отбор = Новый Структура("НоменклатураСЕТ", Номенклатура);		
		Поле = "НоменклатураГТС";
	КонецЕсли;
	Рег = РегистрыСведений.СоответствиеНоменклатурыСЕТ_ГТС.Выбрать(Отбор);
	Если Рег.Следующий() тогда
		возврат Рег[Поле];
	КонецЕсли;
КонецФункции


//Асист-Про Начало Аграновский 2013-09-03
Процедура АСП_ИзменениеДатыПередЗаписьюДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	// Если Дата документа конец дня 23:59:59, то откатим её на 23:59:58, для корректного обмена с БУ
	// При загрузке могут не правильно упорядочиваться документы и счет-фактуры могут загружаться не проведенные.
	Если Не Отказ И Источник.Дата = КонецДня(Источник.Дата) Тогда
		Источник.Дата = Источник.Дата - 1;		
	КонецЕсли;	
КонецПроцедуры
//Асист-Про Конец Аграновский 2013-09-03

Функция  РолиДоступны(стрРоль) Экспорт
	Возврат Пользователи.РолиДоступны(стрРоль)
КонецФункции

&НаСервере
Функция ПрошелКонтрольУникальностиСправочникаПоРеквизиту(ИмяОбъекта, СтрРеквизитов, ЗначениеСсылка) Экспорт

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |    Спр.Ссылка
    |ИЗ
    |    Справочник." + ИмяОбъекта + " КАК Спр
    |ГДЕ
    |    Спр.Ссылка <> &парЗначениеСсылка
    |";     
    Нум = 0;
    Для Каждого Знч Из СтрРеквизитов Цикл
        ИмяПараметраВЗапросе = " = &Пар" + Строка(Нум);
        Запрос.Текст = Запрос.Текст + " И Спр." + Знч.Ключ + ИмяПараметраВЗапросе; 
        Запрос.УстановитьПараметр("Пар" + Строка(Нум),    Знч.Значение);
        Нум = Нум + 1;
    КонецЦикла;    
    Запрос.УстановитьПараметр("парЗначениеСсылка",         ЗначениеСсылка);        
    РезультатЗапроса = Запрос.Выполнить();

        Возврат РезультатЗапроса.Пустой(); 

КонецФункции


Функция СимволыПС() Экспорт
   Возврат Символы.ПС;
КонецФункции

//+++ {{ ASP 07.02.2020 000006132 }}
Процедура ASP_ЗаписатьВЖурналРегистрациюОбъекта(ИмяМетаданных, РегистрируемаяСсылка)
	
	//осталено на будущее на случай, если понадобится запись в ЖР при регистрации объектов другого типа
	Если ИмяМетаданных = "ПриобретениеТоваровУслуг" Тогда
		
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(РегистрируемаяСсылка)) Или Не ЗначениеЗаполнено(РегистрируемаяСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ОтборНастроек = Новый Структура("КлючОбъекта, КлючНастроек", "ОбменДанными.ОбменУправлениеТорговлейБухгалтерияПредприятия30", "ФлагДопРегистрации");
	ХранилищеНастроек = ХранилищеОбщихНастроек.Выбрать(ОтборНастроек);
	Если ХранилищеНастроек.Следующий() И ХранилищеНастроек.Настройки = Истина Тогда
		ЗаписьЖурналаРегистрации("Обмен данными.Дополнительная регистрация",
			УровеньЖурналаРегистрации.Информация,
			РегистрируемаяСсылка.Метаданные(),
			РегистрируемаяСсылка,
			"Выполнена регистрация ссылки к отправке в удаленную ИБ. Причина: Расхождения в данных по ссылке в этой ИБ и в удаленной.
			|Что проверялось: номер и дата объекта, номенклатура из ТЧ (по коду), суммы, количества.")
	КонецЕсли;
	
КонецПроцедуры

//--- {{ ASP 07.02.2020 000006132 }}

//+++ГТС 28.02.2021 - заполнение маркетинговых мероприятий по дополнительным сведениям в сделках, заказах, реализациях
Процедура ASP_ЗаполнениеМаркетинговыхМероприятий() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	СделкиСКлиентами.Ссылка КАК Ссылка,
		|	МАКСИМУМ(ИсточникиПервичногоИнтереса.КаналПервичногоИнтереса) КАК КаналПервичногоИнтереса,
		|	МАКСИМУМ(ИсточникиПервичногоИнтереса.ИсточникПервичногоИнтереса) КАК ИсточникПервичногоИнтереса,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ДополнительныеСведения.Свойство.Заголовок ПОДОБНО ""roistat_id""
		|				ТОГДА ДополнительныеСведения.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК roistat_id,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ДополнительныеСведения.Свойство.Заголовок ПОДОБНО ""site_source""
		|				ТОГДА ДополнительныеСведения.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК site_source
		|ПОМЕСТИТЬ Сделки
		|ИЗ
		|	Справочник.СделкиСКлиентами КАК СделкиСКлиентами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсточникиПервичногоИнтереса КАК ИсточникиПервичногоИнтереса
		|		ПО СделкиСКлиентами.Ссылка = ИсточникиПервичногоИнтереса.Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО СделкиСКлиентами.Ссылка = ДополнительныеСведения.Объект
		|ГДЕ
		|	СделкиСКлиентами.ДатаНачала > &ДатаНачала
		|	И НЕ ДополнительныеСведения.Свойство ЕСТЬ NULL
		|	И ИсточникиПервичногоИнтереса.КаналПервичногоИнтереса ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	СделкиСКлиентами.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сделки.Ссылка КАК Ссылка,
		|	Сделки.КаналПервичногоИнтереса КАК КаналПервичногоИнтереса,
		|	Сделки.ИсточникПервичногоИнтереса КАК ИсточникПервичногоИнтереса,
		|	Сделки.roistat_id КАК roistat_id,
		|	Сделки.site_source КАК site_source,
		|	СоответствиеМаркетинговыхМероприятий.МаркетинговоеМероприятие КАК МаркетинговоеМероприятие,
		|	СоответствиеМаркетинговыхМероприятий.КодСайта КАК КодСайта
		|ИЗ
		|	Сделки КАК Сделки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеМаркетинговыхМероприятий КАК СоответствиеМаркетинговыхМероприятий
		|		ПО Сделки.site_source = СоответствиеМаркетинговыхМероприятий.КодСайта";
	
	Запрос.УстановитьПараметр("ДатаНачала", ТекущаяДата()-60*60*24*4);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СайтНеНашли=Справочники.МаркетинговыеМероприятия.НайтиПоКоду("0--00000001");
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ИсточникПервичногоИнтереса <> ВыборкаДетальныеЗаписи.МаркетинговоеМероприятие ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ИсточникПервичногоИнтереса) 
		Тогда
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.МаркетинговоеМероприятие)
		    Тогда
			НаборЗаписей = РегистрыСведений.ИсточникиПервичногоИнтереса.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Сделка.Установить(ВыборкаДетальныеЗаписи.Ссылка);

			Запись = НаборЗаписей.Добавить();
			Запись.Партнер                    = ВыборкаДетальныеЗаписи.Ссылка.Партнер;
			Запись.Сделка                     = ВыборкаДетальныеЗаписи.Ссылка;
			Запись.ИсточникПервичногоИнтереса = ВыборкаДетальныеЗаписи.МаркетинговоеМероприятие;
			Запись.КаналПервичногоИнтереса    = ВыборкаДетальныеЗаписи.МаркетинговоеМероприятие.Владелец;
			 НаборЗаписей.Записать();

		 ИначеЕсли ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.roistat_id) или ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.site_source) Тогда
			 НаборЗаписей = РегистрыСведений.ИсточникиПервичногоИнтереса.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Сделка.Установить(ВыборкаДетальныеЗаписи.Ссылка);

			Запись = НаборЗаписей.Добавить();
			Запись.Партнер                    = ВыборкаДетальныеЗаписи.Ссылка.Партнер;
			Запись.Сделка                     = ВыборкаДетальныеЗаписи.Ссылка;
			Запись.ИсточникПервичногоИнтереса = СайтНеНашли;
			Запись.КаналПервичногоИнтереса    = СайтНеНашли.Владелец;
			НаборЗаписей.Записать();

		Иначе
		КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	  Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	ЗаказКлиента.Ссылка КАК Ссылка,
		|	МАКСИМУМ(ЗаказКлиента.КаналПервичногоИнтереса) КАК КаналПервичногоИнтереса,
		|	МАКСИМУМ(ЗаказКлиента.ИсточникПервичногоИнтереса) КАК ИсточникПервичногоИнтереса,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ДополнительныеСведения.Свойство.Заголовок ПОДОБНО ""roistat_id""
		|				ТОГДА ДополнительныеСведения.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК roistat_id,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ДополнительныеСведения.Свойство.Заголовок ПОДОБНО ""site_source""
		|				ТОГДА ДополнительныеСведения.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК site_source
		|ПОМЕСТИТЬ ЗаказКлиента
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|		ПО ЗаказКлиента.Ссылка = ДополнительныеСведения.Объект
		|ГДЕ
		|	ЗаказКлиента.Дата > &ДатаНачала
		|	И НЕ ДополнительныеСведения.Свойство ЕСТЬ NULL
		|	И ЗаказКлиента.КаналПервичногоИнтереса = ЗНАЧЕНИЕ(ПланВидовХарактеристик.КаналыРекламныхВоздействий.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиента.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказКлиента.Ссылка КАК Ссылка,
		|	ЗаказКлиента.КаналПервичногоИнтереса КАК КаналПервичногоИнтереса,
		|	ЗаказКлиента.ИсточникПервичногоИнтереса КАК ИсточникПервичногоИнтереса,
		|	ЗаказКлиента.roistat_id КАК roistat_id,
		|	ЗаказКлиента.site_source КАК site_source,
		|	СоответствиеМаркетинговыхМероприятий.МаркетинговоеМероприятие КАК МаркетинговоеМероприятие,
		|	СоответствиеМаркетинговыхМероприятий.КодСайта КАК КодСайта
		|ИЗ
		|	ЗаказКлиента КАК ЗаказКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеМаркетинговыхМероприятий КАК СоответствиеМаркетинговыхМероприятий
		|		ПО ЗаказКлиента.site_source = СоответствиеМаркетинговыхМероприятий.КодСайта";

	Запрос.УстановитьПараметр("ДатаНачала", ТекущаяДата()-60*60*24*4);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СайтНеНашли=Справочники.МаркетинговыеМероприятия.НайтиПоКоду("0--00000001");
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ИсточникПервичногоИнтереса <> ВыборкаДетальныеЗаписи.МаркетинговоеМероприятие ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ИсточникПервичногоИнтереса) 
		Тогда
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.МаркетинговоеМероприятие)
		    Тогда
			ОбъектСсылка=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ОбъектСсылка.ИсточникПервичногоИнтереса = ВыборкаДетальныеЗаписи.МаркетинговоеМероприятие;
			ОбъектСсылка.КаналПервичногоИнтереса    = ВыборкаДетальныеЗаписи.МаркетинговоеМероприятие.Владелец;
			ОбъектСсылка.Записать();
		ИначеЕсли ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.roistat_id) или ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.site_source) Тогда
			ОбъектСсылка=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ОбъектСсылка.ИсточникПервичногоИнтереса = СайтНеНашли;
			ОбъектСсылка.КаналПервичногоИнтереса    = СайтНеНашли.Владелец;
			ОбъектСсылка.Записать();
		Иначе
		КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;

		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.КаналПервичногоИнтереса КАК КаналПервичногоИнтереса,
		|	РеализацияТоваровУслуг.ИсточникПервичногоИнтереса КАК ИсточникПервичногоИнтереса,
		|	ЗаказКлиента1.КаналПервичногоИнтереса КАК КаналПервичногоИнтересаЗаказ,
		|	ЗаказКлиента1.ИсточникПервичногоИнтереса КАК ИсточникПервичногоИнтересаЗаказ,
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента1
		|		ПО РеализацияТоваровУслуг.ЗаказКлиента = ЗаказКлиента1.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата > &Дата
		|	И РеализацияТоваровУслуг.ИсточникПервичногоИнтереса <> ЗаказКлиента1.ИсточникПервичногоИнтереса";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата()-60*60*24*4);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.ИсточникПервичногоИнтереса <> ВыборкаДетальныеЗаписи.ИсточникПервичногоИнтересаЗаказ И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ИсточникПервичногоИнтересаЗаказ) 
		Тогда
			ОбъектСсылка=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ОбъектСсылка.ИсточникПервичногоИнтереса = ВыборкаДетальныеЗаписи.ИсточникПервичногоИнтересаЗаказ;
			ОбъектСсылка.КаналПервичногоИнтереса    = ВыборкаДетальныеЗаписи.КаналПервичногоИнтересаЗаказ;
			ОбъектСсылка.Записать();
		КонецЕсли;
	КонецЦикла;
	
		
КонецПроцедуры

//---ГТС 28.02.2021 - заполнение маркетинговых мероприятий по дополнительным сведениям в сделках, заказах, реализациях