 
#Область System

Функция DMServerInfo() Экспорт
	
	СтруктураДанных = Новый Структура;
	
	СтруктураДанных.Вставить("data", "Соединение с сервером установлено! ");  
	
	Возврат ПодготовитьОтветJSON(СтруктураДанных);

КонецФункции

Функция Ping() Экспорт
	
	СтруктураДанных = Новый Структура;
	
	СтруктураДанных.Вставить("is_success", Истина);  
	
	Возврат ПодготовитьОтветJSON(СтруктураДанных);

КонецФункции

Функция GetVersion(ВерсияПО) Экспорт
	
	СтруктураДанных = Новый Структура;
	
	Если Лев(ВерсияПО,1) = "3" тогда	
		СтруктураДанных.Вставить("data", "3.0");	
	Иначе	
		СтруктураДанных.Вставить("data", "2.9");  
	КонецЕсли; 
	
	Возврат ПодготовитьОтветJSON(СтруктураДанных);

КонецФункции

#КонецОбласти

#Область Devices

Функция IsNewData(SN, UserName) Экспорт
	
	ОбъектОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	МАКСИМУМ(ВложенныйЗапрос.new_templates) КАК new_templates,
	                    |	МАКСИМУМ(ВложенныйЗапрос.new_cells) КАК new_cells,
	                    |	МАКСИМУМ(ВложенныйЗапрос.new_docs) КАК new_docs,
	                    |	МАКСИМУМ(ВложенныйЗапрос.new_users) КАК new_users,
	                    |	МАКСИМУМ(ВложенныйЗапрос.new_arts) КАК new_arts,
	                    |	МАКСИМУМ(ВложенныйЗапрос.new_clients) КАК new_clients,
	                    |	МАКСИМУМ(ВложенныйЗапрос.new_units) КАК new_units,
	                    |	МАКСИМУМ(ВложенныйЗапрос.new_egais_arts) КАК new_egais_arts,
						|	МАКСИМУМ(ВложенныйЗапрос.new_warehouses) КАК new_warehouses,
						|	МАКСИМУМ(ВложенныйЗапрос.new_egais_marks) КАК new_egais_marks,
						|	МАКСИМУМ(ВложенныйЗапрос.new_steps) КАК new_steps,
						|	МАКСИМУМ(ВложенныйЗапрос.need_check_ftp) КАК need_check_ftp 
	                    |ИЗ
	                    |	(ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	                    |		ИСТИНА КАК new_templates,
	                    |		ЛОЖЬ КАК new_cells,
	                    |		ЛОЖЬ КАК new_docs,
	                    |		ЛОЖЬ КАК new_users,
	                    |		ЛОЖЬ КАК new_arts,
	                    |		ЛОЖЬ КАК new_clients,
	                    |		ЛОЖЬ КАК new_units,
	                    |		ЛОЖЬ КАК new_egais_arts,
	                    |		NULL КАК new_warehouses,
						|		ЛОЖЬ КАК new_egais_marks,
						|		ЛОЖЬ КАК new_steps,
						|		ЛОЖЬ КАК need_check_ftp
						|
	                    |	ИЗ
	                    |		Справочник.ДатаМобайл_ШаблоныДокументов.Изменения КАК ДатаМобайл_ШаблоныДокументовИзменения
	                    |	ГДЕ
	                    |		НЕ ДатаМобайл_ШаблоныДокументовИзменения.Ссылка.ПометкаУдаления
	                    |		И ДатаМобайл_ШаблоныДокументовИзменения.Узел = &Узел
	                    |	
						//|	ОБЪЕДИНИТЬ ВСЕ
						//|	
						//|	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
						//|		ЛОЖЬ,
						//|		ИСТИНА,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ
						//|	ИЗ
						//|		Справочник.СкладскиеЯчейки.Изменения КАК МестаХраненияИзменения
						//|	ГДЕ
						//|		НЕ МестаХраненияИзменения.Ссылка.ПометкаУдаления
						//|		И МестаХраненияИзменения.Узел = &Узел
	                    |	
	                    |	ОБЪЕДИНИТЬ ВСЕ
	                    |	
	                    |	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ИСТИНА,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
						|		ЛОЖЬ
	                    |	ИЗ
	                    |		Справочник.ДатаМобайл_ДокументыТСД.Изменения КАК ДатаМобайл_ДокументыТСДИзменения
	                    |	ГДЕ
	                    |		НЕ ДатаМобайл_ДокументыТСДИзменения.Ссылка.ПометкаУдаления
	                    |		И ДатаМобайл_ДокументыТСДИзменения.Узел = &Узел
	                    |	
						//|	ОБЪЕДИНИТЬ ВСЕ
						//|	
						//|	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ИСТИНА,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ
						//|	ИЗ
						//|		Справочник.Пользователи.Изменения КАК ПользователиИзменения
						//|	ГДЕ
						//|		НЕ ПользователиИзменения.Ссылка.ПометкаУдаления
						//|		И ПользователиИзменения.Узел = &Узел
	                    |	
	                    |	ОБЪЕДИНИТЬ ВСЕ
	                    |	
	                    |	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ИСТИНА,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
						|		ЛОЖЬ
	                    |	ИЗ
	                    |		Справочник.Номенклатура.Изменения КАК НоменклатураИзменения
	                    |	ГДЕ
	                    |		НЕ НоменклатураИзменения.Ссылка.ПометкаУдаления
	                    |		И НоменклатураИзменения.Узел = &Узел
	                    |	
	                    |	ОБЪЕДИНИТЬ ВСЕ
	                    |	
	                    |	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ИСТИНА,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
						|		ЛОЖЬ
	                    |	ИЗ
	                    |		Справочник.ХарактеристикиНоменклатуры.Изменения КАК ХарактеристикиНоменклатурыИзменения
	                    |	ГДЕ
	                    |		НЕ ХарактеристикиНоменклатурыИзменения.Ссылка.ПометкаУдаления
	                    |		И ХарактеристикиНоменклатурыИзменения.Узел = &Узел
	                    |	
	                    |	ОБЪЕДИНИТЬ ВСЕ
	                    |	
	                    |	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ИСТИНА,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
						|		ЛОЖЬ
	                    |	ИЗ
	                    |		РегистрСведений.ШтрихкодыНоменклатуры.Изменения КАК ШтрихкодыНоменклатурыИзменения
	                    |	ГДЕ
	                    |		ШтрихкодыНоменклатурыИзменения.Узел = &Узел
	                    |	
	                    |	ОБЪЕДИНИТЬ ВСЕ
	                    |	
	                    |	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ИСТИНА,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
						|		ЛОЖЬ
	                    |	ИЗ
	                    |		Справочник.ДатаМобайл_НовыеТовары.Изменения КАК ДатаМобайл_НовыеТоварыИзменения
	                    |	ГДЕ
	                    |		ДатаМобайл_НовыеТоварыИзменения.Узел = &Узел
	                    |	
	                    |	ОБЪЕДИНИТЬ ВСЕ
	                    |	
	                    |	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ИСТИНА,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
						|		ЛОЖЬ
	                    |	ИЗ
	                    |		РегистрСведений.ДатаМобайл_НовыеШтрихкоды.Изменения КАК ДатаМобайл_НовыеШтрихкодыИзменения
	                    |	ГДЕ
	                    |		ДатаМобайл_НовыеШтрихкодыИзменения.Узел = &Узел
	                    |	
	                    |	ОБЪЕДИНИТЬ ВСЕ
	                    |	
	                    |	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ИСТИНА,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
						|		ЛОЖЬ
	                    |	ИЗ
	                    |		Справочник.Партнеры.Изменения КАК ПартнерыИзменения
	                    |	ГДЕ
	                    |		НЕ ПартнерыИзменения.Ссылка.ПометкаУдаления
	                    |		И ПартнерыИзменения.Узел = &Узел
	                    |	
						//|	ОБЪЕДИНИТЬ ВСЕ
						//|	
						//|	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ИСТИНА,
						//|		ЛОЖЬ, 
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ
						//|	ИЗ
						//|		Справочник.УпаковкиЕдиницыИзмерения.Изменения КАК УпаковкиЕдиницыИзмерения
						//|	ГДЕ
						//|		НЕ УпаковкиЕдиницыИзмерения.Ссылка.ПометкаУдаления
						//|		И УпаковкиЕдиницыИзмерения.Узел = &Узел
	                    //|	
						//|	ОБЪЕДИНИТЬ ВСЕ
						//|	
						//|	ВЫБРАТЬ
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ИСТИНА,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ
						//|	ИЗ
						//|		Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.Изменения КАК КлассификаторАлкогольнойПродукцииЕГАИСИзменения
						//|	ГДЕ
						//|		КлассификаторАлкогольнойПродукцииЕГАИСИзменения.Узел = &Узел
						//|		И НЕ КлассификаторАлкогольнойПродукцииЕГАИСИзменения.Ссылка.ПометкаУдаления
	                    |	
	                    |	ОБЪЕДИНИТЬ ВСЕ
	                    |	
	                    |	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ИСТИНА,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
						|		ЛОЖЬ
	                    |	ИЗ
	                    |		Справочник.Склады.Изменения КАК СкладыИзменения
						|	ГДЕ
	                    |		НЕ СкладыИзменения.Ссылка.ПометкаУдаления
	                    |		И СкладыИзменения.Узел = &Узел
						//|	ОБЪЕДИНИТЬ ВСЕ
						//|	
						//|	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ИСТИНА
						//|	ИЗ
						//|		РегистрСведений.АкцизныеМаркиЕГАИС.Изменения КАК МаркиЕГАИСИзменения
						//|	ГДЕ
						//|		НЕ МаркиЕГАИСИзменения.АкцизнаяМарка.ПометкаУдаления
						//|		И МаркиЕГАИСИзменения.Узел = &Узел
						//|	
						//|	ОБЪЕДИНИТЬ ВСЕ
						//|	
						//|	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ЛОЖЬ,
						//|		ИСТИНА,
						//|		ЛОЖЬ
						//|	ИЗ
						//|		РегистрСведений.ДатаМобайл_СвязиДополнительныхФормИШаблонов.Изменения КАК СвязиДополнительныхФормИШаблонов
						//|	ГДЕ
						//|		СвязиДополнительныхФормИШаблонов.Узел = &Узел
	                    |	
	                    |	ОБЪЕДИНИТЬ ВСЕ
	                    |	
	                    |	ВЫБРАТЬ
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
	                    |		ЛОЖЬ,
						|		ДатаМобайл_СписокТСД.выгружатьТоварыНаFTP
	                    |	ИЗ
	                    |		ПланОбмена.ДатаМобайл_СписокТСД КАК ДатаМобайл_СписокТСД
	                    |	ГДЕ
	                    |		ДатаМобайл_СписокТСД.Ссылка = &Узел) КАК ВложенныйЗапрос");
	
	Запрос.УстановитьПараметр("Узел", УзелПО.Ссылка);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		//ЗаполнитьЗначенияСвойств(ОбъектОтвета,Рез);
		
		
		ОбъектОтвета.Вставить("is_need_clear_templates",  		 ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьШаблоны"));
		ОбъектОтвета.Вставить("is_need_load_templates",   		 ?(Рез.new_templates,Рез.new_templates, ОбъектОтвета.is_need_clear_templates));
		
		ОбъектОтвета.Вставить("is_need_clear_cells",     		 ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьЯчейки"));
		ОбъектОтвета.Вставить("is_need_load_cells",       		 ?(Рез.new_cells, Рез.new_cells, ОбъектОтвета.is_need_clear_cells));
		
		ОбъектОтвета.Вставить("is_need_clear_docs",       		 ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьДокументы"));
		ОбъектОтвета.Вставить("is_need_load_docs",         		 ?(Рез.new_docs,Рез.new_docs,ОбъектОтвета.is_need_clear_docs));
		
		ОбъектОтвета.Вставить("is_need_clear_users",      		 ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьПользователей"));
		ОбъектОтвета.Вставить("is_need_load_users",        		 ?(Рез.new_users,Рез.new_users,ОбъектОтвета.is_need_clear_users));
		
		ОбъектОтвета.Вставить("is_need_clear_arts",       	 	 ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьТовары"));
		ОбъектОтвета.Вставить("is_need_load_arts",         		 ?(Рез.new_arts,Рез.new_arts,ОбъектОтвета.is_need_clear_arts));
		
		ОбъектОтвета.Вставить("is_need_clear_clients",    		 ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьКлиентов"));
		ОбъектОтвета.Вставить("is_need_load_clients",      		 ?(Рез.new_clients,Рез.new_clients,ОбъектОтвета.is_need_clear_clients));
		
		ОбъектОтвета.Вставить("is_need_clear_units",      		 ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьЕдиницыИзмерения"));
		ОбъектОтвета.Вставить("is_need_load_units",        		 ?(Рез.new_units,Рез.new_units,ОбъектОтвета.is_need_clear_units));
		
		ОбъектОтвета.Вставить("is_need_clear_egais_arts",  		 ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьТоварыЕГАИС"));
		ОбъектОтвета.Вставить("is_need_load_egais_arts",    	 ?(Рез.new_egais_arts,Рез.new_egais_arts,ОбъектОтвета.is_need_clear_egais_arts));
		
		ОбъектОтвета.Вставить("is_need_clear_warehouses", 		 ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьСклады"));
		ОбъектОтвета.Вставить("is_need_load_warehouses",   		 ?(Рез.new_warehouses,Рез.new_warehouses,ОбъектОтвета.is_need_clear_warehouses));
		
		ОбъектОтвета.Вставить("is_need_clear_egais_marks", 		 ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьМаркиЕГАИС"));
		ОбъектОтвета.Вставить("is_need_load_egais_marks",   	 ?(Рез.new_egais_marks,Рез.new_egais_marks,ОбъектОтвета.is_need_clear_egais_marks));
		
		ОбъектОтвета.Вставить("is_need_clear_art_marks", 		 ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьКодыМаркировки"));
		ОбъектОтвета.Вставить("is_need_load_art_marks",   		 ОбъектОтвета.is_need_clear_art_marks);
		
		ОбъектОтвета.Вставить("is_need_clear_steps",             ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьДополнительныеФормы"));
		ОбъектОтвета.Вставить("is_need_load_steps",    	     	 ?(Рез.new_steps,Рез.new_steps,ОбъектОтвета.is_need_clear_steps));
		
		ОбъектОтвета.Вставить("is_need_clear_barcode_templates", ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьШаблоныШтрихкодов"));
		ОбъектОтвета.Вставить("is_need_load_barcode_templates",  ОбъектОтвета.is_need_clear_barcode_templates);
		
		ОбъектОтвета.Вставить("is_need_clear_sn_types", 		 ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьТипыСерий"));
		ОбъектОтвета.Вставить("is_need_load_sn_types",  		 ОбъектОтвета.is_need_clear_sn_types);

	КонецЕсли;
	
	ДатаМобайл_ОбщийМодуль.ЗаписьЗначенийУзлаОбменаТСД(УзелПО, "ДатаПоследнейЗагрузкиСправочников", ТекущаяДата());
	
	Возврат ПодготовитьОтветJSON(ОбъектОтвета);
КонецФункции

Функция Login(SN, UserName, name, AppVersion) Экспорт
		
	УзелПО = НайтиУзел(SN);
	
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, Username);
	КонецЕсли;	
	
	ДатаМобайл_ОбщийМодуль.ЗаписьЗначенийУзлаОбменаТСД(УзелПО, "ТекущийПользователь", UserName);
	ДатаМобайл_ОбщийМодуль.ЗаписьЗначенийУзлаОбменаТСД(УзелПО, "ДатаПоследнейАвторизацииПользователя", ТекущаяДата());
	
	НаименованиеТСД = СокрЛП(name);
	Узел = УзелПО.ПолучитьОбъект();
	Если НаименованиеТСД <> "" И СокрЛП(УзелПО.Наименование) = "" Тогда
		Узел.Наименование = НаименованиеТСД;	
	КонецЕсли;	
	
	ВерсияПО = СокрЛП(AppVersion);
	Если СокрЛП(УзелПО.ВерсияПО) <> ВерсияПО Тогда
		Узел.ВерсияПО = ВерсияПО;
	КонецЕсли;
	
	Попытка Узел.Записать(); Исключение КонецПопытки;	 
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("is_success", Истина);  
	СтруктураДанных.Вставить("device_name", УзелПО.Наименование);
	
	Возврат ПодготовитьОтветJSON(СтруктураДанных);
	
КонецФункции

Функция Logout(SN, UserName) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;	
	
	ДатаМобайл_ОбщийМодуль.ЗаписьЗначенийУзлаОбменаТСД(УзелПО, "ТекущийПользователь", ""); 
	
	СтруктураОтвета.Вставить("is_success", Истина);
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	
КонецФункции

#КонецОбласти

#Область Users

Функция GetUsers(SN, UserName) Экспорт

	ОбъектСписка = Новый Массив;	
	СтруктураОтвета = Новый Структура;

	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	
	Если ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьПользователей") Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьФлаговОбменаТСД(УзелПО,"ОчиститьПользователей", Ложь);	 
	КонецЕсли;
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	МАКСИМУМ(Логины.login) КАК login,
	                    |	Логины.name КАК name,
	                    |	МАКСИМУМ(Логины.pass) КАК pass,
	                    |	МАКСИМУМ(Логины.is_admin) КАК is_admin,
	                    |	МАКСИМУМ(Логины.is_can_edit_arts) КАК is_can_edit_arts
	                    |ИЗ
	                    |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                    |		ПОДСТРОКА(ДатаМобайл_СписокТСДПользователиТСД.Логин, 1, 50) КАК login,
	                    |		ПОДСТРОКА(ДатаМобайл_СписокТСДПользователиТСД.Пользователь.Наименование, 1, 100) КАК name,
	                    |		ПОДСТРОКА(ДатаМобайл_СписокТСДПользователиТСД.Пароль, 1, 10) КАК pass,
	                    |		ДатаМобайл_СписокТСДПользователиТСД.Админ КАК is_admin,
	                    |		ДатаМобайл_СписокТСДПользователиТСД.РазрешитьСозданиеТовара КАК is_can_edit_arts
	                    |	ИЗ
	                    |		ПланОбмена.ДатаМобайл_СписокТСД.ПользователиТСД КАК ДатаМобайл_СписокТСДПользователиТСД
	                    |	ГДЕ
	                    |		НЕ ДатаМобайл_СписокТСДПользователиТСД.Пользователь.ПометкаУдаления
	                    |		И (ДатаМобайл_СписокТСДПользователиТСД.Ссылка = &Узел)) КАК Логины
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	Логины.name");
	
	Запрос.УстановитьПараметр("Узел", УзелПО.Ссылка);
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() цикл
		ОбъектПользователь = ПолучитьСтруктуруОбъектаДляHttp("user");
		
		ОбъектПользователь.login            = Рез.login; 
		ОбъектПользователь.username 		= Рез.name; 
		ОбъектПользователь.password 		= Рез.pass;  
		ОбъектПользователь.is_admin 		= Рез.is_admin; 
		ОбъектПользователь.is_can_edit_arts = Рез.is_can_edit_arts;
		
		ОбъектСписка.Добавить(ОбъектПользователь);
	КонецЦикла;	
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

#КонецОбласти

#Область Arts

Функция OnArtScanSelect(SN,UserName,ШК,DocOutID,Ячейка,Params) Экспорт 
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;

	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));	
	Исключение			
		СтруктураОтвета.Вставить("Описание", "Не нашли документ. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;
	
	Модуль_ОбщегоНазначения = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначения");
		
	ЗначенияРеквизитовСсылкаНаДок = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДок, "ТСД, ДатаНачалаСбора, ДатаЗавершенияСбора, Шаблон, ИсходныйДокумент, Склад");

	ДокТСД 				   = ЗначенияРеквизитовСсылкаНаДок.ТСД;
	ДокДатаНачалаСбора 	   = ЗначенияРеквизитовСсылкаНаДок.ДатаНачалаСбора;
	ДокДатаЗавершенияСбора = ЗначенияРеквизитовСсылкаНаДок.ДатаЗавершенияСбора;
	Шаблон 				   = ЗначенияРеквизитовСсылкаНаДок.Шаблон;
	ИсходныйДокумент 	   = ЗначенияРеквизитовСсылкаНаДок.ИсходныйДокумент;
	Склад  				   = ЗначенияРеквизитовСсылкаНаДок.Склад;
	
	Если Шаблон = Неопределено Тогда		
		СтруктураОтвета.Вставить("Описание", "Не нашли запись документа. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокТСД) Тогда
		Если ДокТСД <> УзелПО Тогда			
			СтруктураОтвета.Вставить("Описание", "Чужой документ. ");			
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	КонецЕсли;
		
	Если ДокДатаЗавершенияСбора <> Дата(1, 1, 1) Тогда		
		СтруктураОтвета.Вставить("Описание", "Закрытый документ. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;			
	
	ЗначенияРеквизитовУзелПО = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УзелПО, "ТипЦен, ДобавлятьАртикулВНаименование, ПростойФорматВесовыхШтрихкодов");
	ТипЦен = ЗначенияРеквизитовУзелПО.ТипЦен;
	ВключатьАртикул = ЗначенияРеквизитовУзелПО.ДобавлятьАртикулВНаименование;
	ПростойФорматВесовыхШтрихкодов = ЗначенияРеквизитовУзелПО.ПростойФорматВесовыхШтрихкодов;

	Если СтрДлина(ШК) = 5 И НЕ ПростойФорматВесовыхШтрихкодов Тогда
		ВесовойШК = "2_" + ШК + "00000_";			
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	Если Шаблон.ЕГАИС  Тогда
		OnArtScan_Select_EGAIS(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок, Запрос, "Select");	
	Иначе
		Попытка
			лЕстьЯчейка = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Ячейка") <> Неопределено;
		Исключение
			лЕстьЯчейка = Ложь;
		КонецПопытки;

		Если Шаблон.ИспользованиеЯчеекПодбор = 0 ИЛИ Шаблон.ВыгрузкаЯчеекПодбор = 1 ИЛИ НЕ лЕстьЯчейка Тогда
			OnArtScan_Select_Insert_Casual(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок, Запрос, "Select");
			Запрос.УстановитьПараметр("Артикул", ?(УзелПО.ИспользоватьАртикулКакШтрихкодТовара, ШК, Неопределено));
		Иначе
			OnArtScan_Select_Insert_Cells(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок, Запрос, "Select", Ячейка)
		КонецЕсли;
	КонецЕсли;
			
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	Запрос.УстановитьПараметр("ИсходныйДокумент", ИсходныйДокумент);
	Запрос.УстановитьПараметр("ИсходноеЗадание", СсылкаНаДок);          	
	Запрос.УстановитьПараметр("ШтрихКод", ШК);
	Запрос.УстановитьПараметр("НесколькоДокументов", СсылкаНаДок.Шаблон.МножествоДокументовКакЗадание);
	Запрос.УстановитьПараметр("Документы", СсылкаНаДок.Задания.ВыгрузитьКолонку("Задание"));
	Запрос.УстановитьПараметр("ВесовойШтрихКод", ВесовойШК);
	Запрос.УстановитьПараметр("ВсеУпаковки", Шаблон.ВсеШтрихкодыТовара);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	СписокСкладов = УзелПО.Склады.ВыгрузитьКолонку("Склад");	
	Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
		СписокСкладов.Очистить();
		СписокСкладов.Добавить(СсылкаНаДок.Склад);			
	КонецЕсли;		
	Запрос.УстановитьПараметр("Склады", СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады" ,СписокСкладов.Количество() = 0);
	
	СписокПомещений = УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
		СписокПомещений.Очистить();
		СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
	КонецЕсли;	
	Запрос.УстановитьПараметр("Помещения", СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения", СписокПомещений.Количество() = 0);

	Запрос.УстановитьПараметр("ВключатьАртикул", ВключатьАртикул);
		
	Рез = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаДока Из Рез Цикл 
		
		Итог = (СтрокаДока.ВНаличии - СтрокаДока.ВРезерве - СтрокаДока.ВРезервеТСД);
		СтрокаДока.Коэффициент=?(СтрокаДока.Коэффициент=0,1,СтрокаДока.Коэффициент);
		СтрокаДока.НаименованиеУпаковки=?(ЗначениеЗаполнено(СтрокаДока.НаименованиеУпаковки),СтрокаДока.НаименованиеУпаковки,"шт.");
		
	   // Табачные изделия, штрихкод товара на все характеристики
		ЕстьХарактеристикиБезШтрихкодов = Ложь;
		ТипПродукции = ДатаМобайл_Маркировка.ПолучитьТипМаркированнойПродукции(СтрокаДока.Номенклатура);
		Если НЕ СтрокаДока.ЭтоНовыйТовар И УзелПО.ВыводитьВсеХарактеристикиПоШтрихкоду Тогда
			
				ЗапросВсехХарактеристик = Новый Запрос();				
				ЗапросВсехХарактеристик.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ХарактеристикиНоменклатуры.Ссылка,
				|	ХарактеристикиНоменклатуры.Наименование,
				|	ХарактеристикиНоменклатуры.Владелец
				|ИЗ
				|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
				|ГДЕ
				|	ХарактеристикиНоменклатуры.Владелец = &Владелец
				|	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления";
				
				Если СтрокаДока.Номенклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры Тогда
					ЗапросВсехХарактеристик.УстановитьПараметр("Владелец", СтрокаДока.Номенклатура.Ссылка);
				ИначеЕсли СтрокаДока.Номенклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры Тогда
					ЗапросВсехХарактеристик.УстановитьПараметр("Владелец", СтрокаДока.Номенклатура.ВидНоменклатуры);
				ИначеЕсли СтрокаДока.Номенклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры Тогда
					ЗапросВсехХарактеристик.УстановитьПараметр("Владелец", СтрокаДока.Номенклатура.ВладелецХарактеристик);
				Иначе
					ЗапросВсехХарактеристик.УстановитьПараметр("Владелец", Неопределено);
				КонецЕсли;
				ЗапросВсехХарактеристик.УстановитьПараметр("ИсходноеЗадание", СсылкаНаДок);
				ЗапросВсехХарактеристик.УстановитьПараметр("Номенклатура", СсылкаНаДок); 
				ЗапросВсехХарактеристик.УстановитьПараметр("Склады", СписокСкладов);
				ЗапросВсехХарактеристик.УстановитьПараметр("ВсеСклады", СписокСкладов.Количество() = 0);
				
				ВыборкаХарактеристик = ЗапросВсехХарактеристик.Выполнить().Выбрать();
				Пока ВыборкаХарактеристик.Следующий() Цикл	
					ЕстьХарактеристикиБезШтрихкодов = Истина;
					
					СтруктураТекущейСтроки = Новый Структура;
					
					ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","scan");
					ОбъектТовара.name = ЧистаяСтрока(СокрП(СтрокаДока.Номенклатура.Наименование) + " " + СокрП(ВыборкаХарактеристик.Наименование));			
					ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(ВыборкаХарактеристик.Ссылка);
					ОбъектТовара.price = СтрокаДока.Цена;
					Попытка	
						DMUseSN = ПолучитьПризнакУчетаСерий(СтрокаДока.Номенклатура.ВидНоменклатуры, Склад);
					Исключение
						DMUseSN = Ложь;
					Конецпопытки;
					СформироватьЗаголовкиJSONParamsТовара(УзелПО,ОбъектТовара,СтрокаДока.Номенклатура,ВыборкаХарактеристик.Ссылка,DMUseSN,Шаблон);
					СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
					
					ОбъектШтрихкода = ПолучитьСтруктуруОбъектаДляHttp("barcode","scan");
					Попытка ОбъектШтрихкода.unit_name = СтрокаДока.НаименованиеУпаковки; Исключение ОбъектШтрихкода.unit_name = "шт."; КонецПопытки;	
					Если УзелПО.НеИспользоватьПересчетУпаковок Тогда
						ОбъектШтрихкода.unit_coef = 1;
					Иначе	
						ОбъектШтрихкода.unit_coef = СтрокаДока.Коэффициент;
					КонецЕсли;
		            СтруктураТекущейСтроки.Вставить("barcode", ОбъектШтрихкода);
					
					ЭтоУслуга = Ложь;
					Попытка 
						Если СтрокаДока.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
							ЭтоУслуга = Истина;
						КонецЕсли;
					Исключение
					КонецПопытки;

					limit_qty = 0;
					Если УзелПО.НеОтображатьОстатки Тогда
						limit_qty = 0;
					ИначеЕсли ЭтоУслуга Тогда
						limit_qty = 999;	
					Иначе
						Если ЗначениеЗаполнено(Ячейка) Тогда
							ТекущаяЯчейкаСсылка = ДатаМобайл_ОбщийМодуль.ПолучитьЯчейкуПоКодуИлиШтрихкоду(Ячейка);
							limit_qty = ПолучитьОстаткиПоЯчейке(УзелПО, Неопределено, СтрокаДока.Номенклатура, ВыборкаХарактеристик.Ссылка, ТекущаяЯчейкаСсылка);
						Иначе
							limit_qty = ПолучитьОстаткиПоТовару(УзелПО, Неопределено, СтрокаДока.Номенклатура, ВыборкаХарактеристик.Ссылка);
						КонецЕсли; 	
					КонецЕсли;
					
	                СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
					
					Если СокрЛП(ЧистаяСтрока(ОбъектТовара.name)) = "" или СокрЛП(ЧистаяСтрока(ОбъектТовара.id)) = "" Тогда
						Продолжить;
					КонецЕсли;

					ОбъектСписка.Добавить(СтруктураТекущейСтроки);

				КонецЦикла;		
		КонецЕсли;
		
		// Остальные товары 
		Если НЕ ЕстьХарактеристикиБезШтрихкодов Тогда
			
		СтруктураТекущейСтроки = Новый Структура;
		
		ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","scan");	
		ОбъектТовара.name = ЧистаяСтрока(СокрП(СтрокаДока.НаименованиеТовара));
		ОбъектТовара.id = ?(СтрокаДока.ЭтоНовыйТовар, "8n-" + XMLСтрока(СтрокаДока.Номенклатура), "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(СтрокаДока.Характеристика));
		ОбъектТовара.price = СтрокаДока.Цена;			
		Попытка	
			DMUseSN = ПолучитьПризнакУчетаСерий(СтрокаДока.Номенклатура.ВидНоменклатуры, Склад);
		Исключение
			DMUseSN = Ложь;
		Конецпопытки;		
		СформироватьЗаголовкиJSONParamsТовара(УзелПО,ОбъектТовара,СтрокаДока.Номенклатура,СтрокаДока.Характеристика, DMUseSN,Шаблон);
		СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);


		ОбъектШтрихкода = ПолучитьСтруктуруОбъектаДляHttp("barcode","scan");
		Попытка ОбъектШтрихкода.unit_name = СтрокаДока.НаименованиеУпаковки; Исключение ОбъектШтрихкода.unit_name = "шт."; КонецПопытки;	
		Если УзелПО.НеИспользоватьПересчетУпаковок Тогда
			ОбъектШтрихкода.unit_coef = 1;
		Иначе	
			ОбъектШтрихкода.unit_coef = СтрокаДока.Коэффициент;
		КонецЕсли;
		СтруктураТекущейСтроки.Вставить("barcode", ОбъектШтрихкода);

		ЭтоУслуга = Ложь;
		Попытка 
			Если СтрокаДока.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				ЭтоУслуга = Истина;
	       	КонецЕсли;
		Исключение
		КонецПопытки;	
			
		Если УзелПО.НеОтображатьОстатки Тогда
			limit_qty = 0;
		ИначеЕсли ЭтоУслуга Тогда
			limit_qty = 999;
		Иначе	
			limit_qty = Итог;	
		КонецЕсли;

		СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
		
		Если СокрЛП(ЧистаяСтрока(ОбъектТовара.name)) = "" ИЛИ СокрЛП(ЧистаяСтрока(ОбъектТовара.id)) = "" Тогда
			Продолжить;
		КонецЕсли;
			
		ОбъектСписка.Добавить(СтруктураТекущейСтроки);
		КонецЕсли;
	КонецЦикла;

	
	//ЗАПИСЬ	
	Если НЕ Шаблон.ГрупповаяРабота Тогда
		//ОБЫЧНАЯ ЛОГИКА
		Если НЕ ЗначениеЗаполнено(ДокДатаНачалаСбора) ИЛИ НЕ ЗначениеЗаполнено(ДокТСД) Тогда
			
			Попытка
				Объект = СсылкаНаДок.ПолучитьОбъект();
				Объект.ДатаНачалаСбора = ТекущаяДата();
				Объект.ТСД = УзелПО;
				
				Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
				Объект.ОбменДанными.Получатели.Очистить();
				Объект.ОбменДанными.Получатели.Заполнить();
				Объект.ОбменДанными.Получатели.Удалить(УзелПО);
				Объект.Записать();
				
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	Иначе
		//ГРУППОВОЙ ДОКУМЕНТ
		
		ДатаСбораПоТСД = ДатаМобайл_ОбщийМодуль.ПолучитьДатуГрупповогоДокумента(SN, СсылкаНаДок, "ДатаНачалаСбора");	
		Если НЕ ЗначениеЗаполнено(ДатаСбораПоТСД) Тогда	
			ДатаМобайл_ОбщийМодуль.СоздатьНачальнуюЗаписьТСДГрупповыхДокументов(SN, СсылкаНаДок, UserName);		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДокДатаНачалаСбора) Тогда
			Попытка
				Объект = СсылкаНаДок.ПолучитьОбъект();
				Объект.ДатаНачалаСбора = ТекущаяДата();
				
				Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
				Объект.ОбменДанными.Получатели.Очистить();
				Объект.ОбменДанными.Получатели.Заполнить();
				Объект.ОбменДанными.Получатели.Удалить(УзелПО);
				Объект.Записать();
			Исключение
			КонецПопытки;	
		КонецЕсли;
	КонецЕсли;	
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

Функция OnArtScanInsert(SN,UserName,ШК, DocOutID,Ячейка,Params) Экспорт 
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;

	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));	
	Исключение	
		СтруктураОтвета.Вставить("Описание", "Не нашли запись документа. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;
	
	Модуль_ОбщегоНазначения = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначения");
	
	ЗначенияРеквизитовСсылкаНаДок = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДок, "ТСД, ДатаНачалаСбора, ДатаЗавершенияСбора, Шаблон, ИсходныйДокумент, Склад");
	
	ДокТСД = ЗначенияРеквизитовСсылкаНаДок.ТСД;
	ДокДатаНачалаСбора = ЗначенияРеквизитовСсылкаНаДок.ДатаНачалаСбора;
	ДокДатаЗавершенияСбора = ЗначенияРеквизитовСсылкаНаДок.ДатаЗавершенияСбора;
	Шаблон = ЗначенияРеквизитовСсылкаНаДок.Шаблон;
	ИсходныйДокумент = ЗначенияРеквизитовСсылкаНаДок.ИсходныйДокумент;
	Склад  = ЗначенияРеквизитовСсылкаНаДок.Склад;

	Если Шаблон = Неопределено Тогда		
		СтруктураОтвета.Вставить("Описание", "Не нашли запись документа. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;

	Если ЗначениеЗаполнено(ДокТСД) Тогда
		Если ДокТСД <> УзелПО Тогда		
			СтруктураОтвета.Вставить("Описание", "Чужой документ.");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	КонецЕсли;
		
	Попытка
		ДокДатаЗавершенияСбора = СсылкаНаДок.ДатаЗавершенияСбора;
	Исключение	
		ДокДатаЗавершенияСбора = Дата(1, 1, 1);
	КонецПопытки;
	
	Если ДокДатаЗавершенияСбора <> Дата(1, 1, 1) Тогда		
		СтруктураОтвета.Вставить("Описание", "Закрытый документ.");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;					
	
	ТипЦен = УзелПО.ТипЦен;
	ВключатьАртикул = УзелПО.ДобавлятьАртикулВНаименование;
	ВесовойШК = ШК;
	Если СтрДлина(ШК) = 5 И НЕ УзелПО.ПростойФорматВесовыхШтрихкодов Тогда	
		ВесовойШК = "2_" + ШК + "00000_";			
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	Попытка
		лЕстьЯчейка = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПриемка].Реквизиты.Найти("Ячейка") <> Неопределено;
	Исключение
		лЕстьЯчейка = Ложь;
	КонецПопытки;
	
	Если Шаблон.ИспользованиеЯчеекПриемка = 0 ИЛИ Шаблон.ВыгрузкаЯчеекПриемка = 1 ИЛИ НЕ лЕстьЯчейка Тогда
		OnArtScan_Select_Insert_Casual(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок, Запрос, "Insert");
		Запрос.УстановитьПараметр("Артикул", ?(УзелПО.ИспользоватьАртикулКакШтрихкодТовара, ШК, Неопределено));
	Иначе
		OnArtScan_Select_Insert_Cells(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок, Запрос, "Insert", Ячейка);
	КонецЕсли;
	

	
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	Запрос.УстановитьПараметр("ИсходныйДокумент", 	 ИсходныйДокумент);
	Запрос.УстановитьПараметр("ИсходноеЗадание", 	 СсылкаНаДок);
	Запрос.УстановитьПараметр("ШтрихКод", 			 ШК);
	Запрос.УстановитьПараметр("НесколькоДокументов", СсылкаНаДок.Шаблон.МножествоДокументовКакЗадание);
	Запрос.УстановитьПараметр("Документы", 			 СсылкаНаДок.Задания.ВыгрузитьКолонку("Задание"));
	Запрос.УстановитьПараметр("ВесовойШтрихКод", 	 ВесовойШК);
	Запрос.УстановитьПараметр("ВсеУпаковки", 		 Шаблон.ВсеШтрихкодыТовара);
	
	СписокСкладов = УзелПО.Склады.ВыгрузитьКолонку("Склад");		
	Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда		
		СписокСкладов.Очистить();
		СписокСкладов.Добавить(СсылкаНаДок.Склад);			
	КонецЕсли;
	Запрос.УстановитьПараметр("Склады",			     СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады",			 СписокСкладов.Количество() = 0);
	
	СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
		СписокПомещений.Очистить();
		СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
	КонецЕсли;	
	Запрос.УстановитьПараметр("Помещения",			 СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения", 		 СписокПомещений.Количество() = 0);
	
	Запрос.УстановитьПараметр("ВключатьАртикул",     ВключатьАртикул);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Рез = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаДока Из Рез Цикл 

		
		Итог = (СтрокаДока.ВНаличии - СтрокаДока.ВРезерве - СтрокаДока.ВРезервеТСД);
		СтрокаДока.Коэффициент=?(СтрокаДока.Коэффициент=0,1,СтрокаДока.Коэффициент);
		СтрокаДока.НаименованиеУпаковки=?(ЗначениеЗаполнено(СтрокаДока.НаименованиеУпаковки),СтрокаДока.НаименованиеУпаковки,"шт.");
		
	   // Табачные изделия, штрихкод товара на все характеристики
		ЕстьХарактеристикиБезШтрихкодов = Ложь;
		ТипПродукции = ДатаМобайл_Маркировка.ПолучитьТипМаркированнойПродукции(СтрокаДока.Номенклатура);
		Если НЕ СтрокаДока.ЭтоНовыйТовар И УзелПО.ВыводитьВсеХарактеристикиПоШтрихкоду Тогда
			
				ЗапросВсехХарактеристик = Новый Запрос();				
				ЗапросВсехХарактеристик.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ХарактеристикиНоменклатуры.Ссылка,
				|	ХарактеристикиНоменклатуры.Наименование,
				|	ХарактеристикиНоменклатуры.Владелец
				|ИЗ
				|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
				|ГДЕ
				|	ХарактеристикиНоменклатуры.Владелец = &Владелец
				|	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления";
				
				Если СтрокаДока.Номенклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры Тогда
					ЗапросВсехХарактеристик.УстановитьПараметр("Владелец", СтрокаДока.Номенклатура.Ссылка);
				ИначеЕсли СтрокаДока.Номенклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры Тогда
					ЗапросВсехХарактеристик.УстановитьПараметр("Владелец", СтрокаДока.Номенклатура.ВидНоменклатуры);
				ИначеЕсли СтрокаДока.Номенклатура.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры Тогда
					ЗапросВсехХарактеристик.УстановитьПараметр("Владелец", СтрокаДока.Номенклатура.ВладелецХарактеристик);
				Иначе
					ЗапросВсехХарактеристик.УстановитьПараметр("Владелец", Неопределено);
				КонецЕсли;
				ЗапросВсехХарактеристик.УстановитьПараметр("ИсходноеЗадание", СсылкаНаДок);
				ЗапросВсехХарактеристик.УстановитьПараметр("Номенклатура", СсылкаНаДок); 
				ЗапросВсехХарактеристик.УстановитьПараметр("Склады", СписокСкладов);
				ЗапросВсехХарактеристик.УстановитьПараметр("ВсеСклады", СписокСкладов.Количество() = 0);
				
				ВыборкаХарактеристик = ЗапросВсехХарактеристик.Выполнить().Выбрать();
				Пока ВыборкаХарактеристик.Следующий() Цикл	
					ЕстьХарактеристикиБезШтрихкодов = Истина;

					
					СтруктураТекущейСтроки = Новый Структура;
					
					ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","scan");
					ОбъектТовара.name = ЧистаяСтрока(СокрП(СтрокаДока.Номенклатура.Наименование) + " " + СокрП(ВыборкаХарактеристик.Наименование));			
					ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(ВыборкаХарактеристик.Ссылка);
					ОбъектТовара.price = СтрокаДока.Цена;
					Попытка	
						DMUseSN = ПолучитьПризнакУчетаСерий(СтрокаДока.Номенклатура.ВидНоменклатуры, Склад);
					Исключение
						DMUseSN = Ложь;
					Конецпопытки;	
					СформироватьЗаголовкиJSONParamsТовара(УзелПО,ОбъектТовара,СтрокаДока.Номенклатура,ВыборкаХарактеристик.Ссылка, DMUseSN,Шаблон);
					СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
					
					ОбъектШтрихкода = ПолучитьСтруктуруОбъектаДляHttp("barcode","scan");
					Попытка ОбъектШтрихкода.unit_name = СтрокаДока.НаименованиеУпаковки; Исключение ОбъектШтрихкода.unit_name = "шт."; КонецПопытки;	
					Если УзелПО.НеИспользоватьПересчетУпаковок Тогда
						ОбъектШтрихкода.unit_coef = 1;
					Иначе	
						ОбъектШтрихкода.unit_coef = СтрокаДока.Коэффициент;
					КонецЕсли;
					СтруктураТекущейСтроки.Вставить("barcode", ОбъектШтрихкода);

					ЭтоУслуга = Ложь;
					Попытка 
						Если СтрокаДока.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
							ЭтоУслуга = Истина;
						КонецЕсли;
					Исключение
					КонецПопытки;

					limit_qty = 0;
					Если УзелПО.НеОтображатьОстатки Тогда
						limit_qty = 0;
					ИначеЕсли ЭтоУслуга Тогда
						limit_qty = 999;	
					Иначе
						Если ЗначениеЗаполнено(Ячейка) Тогда
							ТекущаяЯчейкаСсылка = ДатаМобайл_ОбщийМодуль.ПолучитьЯчейкуПоКодуИлиШтрихкоду(Ячейка);
							limit_qty = ПолучитьОстаткиПоЯчейке(УзелПО, Неопределено, СтрокаДока.Номенклатура, ВыборкаХарактеристик.Ссылка, ТекущаяЯчейкаСсылка);
						Иначе
							limit_qty = ПолучитьОстаткиПоТовару(УзелПО, Неопределено, СтрокаДока.Номенклатура, ВыборкаХарактеристик.Ссылка);
						КонецЕсли; 	
					КонецЕсли;
					СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
					
					Если СокрЛП(ЧистаяСтрока(ОбъектТовара.name)) = "" или СокрЛП(ЧистаяСтрока(ОбъектТовара.id)) = "" Тогда
						Продолжить;
					КонецЕсли;

					ОбъектСписка.Добавить(СтруктураТекущейСтроки);
					
				КонецЦикла;		
		КонецЕсли;
		
		// Остальные товары 
		Если НЕ ЕстьХарактеристикиБезШтрихкодов Тогда

		СтруктураТекущейСтроки = Новый Структура;
					
		ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","scan");
		ОбъектТовара.name = ЧистаяСтрока(СокрП(СтрокаДока.НаименованиеТовара));	
		ОбъектТовара.id = ?(СтрокаДока.ЭтоНовыйТовар, "8n-" + XMLСтрока(СтрокаДока.Номенклатура), "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(СтрокаДока.Характеристика));
		ОбъектТовара.price = СтрокаДока.Цена;	
		Попытка	
			DMUseSN = ПолучитьПризнакУчетаСерий(СтрокаДока.Номенклатура.ВидНоменклатуры, Склад);
		Исключение
			DMUseSN = Ложь;
		Конецпопытки;	
		СформироватьЗаголовкиJSONParamsТовара(УзелПО,ОбъектТовара,СтрокаДока.Номенклатура,СтрокаДока.Характеристика, DMUseSN,Шаблон);
		СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);

		
		ОбъектШтрихкода = ПолучитьСтруктуруОбъектаДляHttp("barcode","scan");
		Попытка ОбъектШтрихкода.unit_name = СтрокаДока.НаименованиеУпаковки; Исключение ОбъектШтрихкода.unit_name = "шт."; КонецПопытки;	
		Если УзелПО.НеИспользоватьПересчетУпаковок Тогда
			ОбъектШтрихкода.unit_coef = 1;
		Иначе	
			ОбъектШтрихкода.unit_coef = СтрокаДока.Коэффициент;
		КонецЕсли;
		СтруктураТекущейСтроки.Вставить("barcode", ОбъектШтрихкода);
		
		ЭтоУслуга = Ложь;
		Попытка 
			Если СтрокаДока.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				ЭтоУслуга = Истина;
	       	КонецЕсли;
		Исключение
		КонецПопытки;	
		
		limit_qty = 0;
		Если УзелПО.НеОтображатьОстатки Тогда
			limit_qty = 0;
		ИначеЕсли ЭтоУслуга Тогда
			limit_qty = 999;
		Иначе	
			limit_qty = Итог;	
		КонецЕсли;
		
		СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
		

		Если СокрЛП(ЧистаяСтрока(ОбъектТовара.name)) = "" ИЛИ СокрЛП(ЧистаяСтрока(ОбъектТовара.id)) = "" Тогда
			Продолжить;
		КонецЕсли;			
		
		ОбъектСписка.Добавить(СтруктураТекущейСтроки);

		КонецЕсли;
	КонецЦикла;

	
	//ЗАПИСЬ	
	Если НЕ Шаблон.ГрупповаяРабота Тогда
		//ОБЫЧНАЯ ЛОГИКА
		Если Не ЗначениеЗаполнено(ДокДатаНачалаСбора) ИЛИ НЕ ЗначениеЗаполнено(ДокТСД) Тогда
			
			Попытка
				Объект = СсылкаНаДок.ПолучитьОбъект();
				Объект.ДатаНачалаСбора = ТекущаяДата();
				Объект.ТСД = УзелПО;
				
				Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
				Объект.ОбменДанными.Получатели.Очистить();
				Объект.ОбменДанными.Получатели.Заполнить();
				Объект.ОбменДанными.Получатели.Удалить(УзелПО);
				Объект.Записать();
				
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	Иначе
		//ГРУППОВОЙ ДОКУМЕНТ
		
		ДатаСбораПоТСД = ДатаМобайл_ОбщийМодуль.ПолучитьДатуГрупповогоДокумента(SN, СсылкаНаДок, "ДатаНачалаСбора");	
		Если Не ЗначениеЗаполнено(ДатаСбораПоТСД) Тогда	
			ДатаМобайл_ОбщийМодуль.СоздатьНачальнуюЗаписьТСДГрупповыхДокументов(SN, СсылкаНаДок, UserName);		
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДокДатаНачалаСбора) Тогда
			Попытка
				Объект = СсылкаНаДок.ПолучитьОбъект();
				Объект.ДатаНачалаСбора = ТекущаяДата();
				
				Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
				Объект.ОбменДанными.Получатели.Очистить();
				Объект.ОбменДанными.Получатели.Заполнить();
				Объект.ОбменДанными.Получатели.Удалить(УзелПО);
				Объект.Записать();
			Исключение
			КонецПопытки;	
		КонецЕсли;
	КонецЕсли;	

	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

Функция OnArtMarkScanSelect(Params, kiz) Экспорт

	Возврат OnArtMarkScan(Params, kiz, "Select");
	
КонецФункции

Функция OnArtMarkScanInsert(Params, kiz) Экспорт

	Возврат OnArtMarkScan(Params, kiz, "Insert");
	
КонецФункции

Функция GetDocArts(SN, UserName, DocOutID) Экспорт 
		
	Если ДатаМобайл_ОбщийМодуль.ЕстьКТ2000() Тогда
		Возврат GetDocArts_КТ2000(SN, UserName, DocOutID);
	КонецЕсли;
	
	ОбъектСписка = Новый Массив();		
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);	
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));                                                                                          
	Исключение	
		СтруктураОтвета.Вставить("Описание", "Не найден документ. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;
	
	Если СсылкаНаДок.ПолучитьОбъект() = Неопределено Тогда		
		СтруктураОтвета.Вставить("Описание", "Не найден документ. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;	
	
	Шаблон = СсылкаНаДок.Шаблон;
	
	Если Шаблон.ЕГАИС Тогда
		
		Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                    |	СоответствиеНоменклатурыЕГАИС.Номенклатура КАК Ссылка
		                    |ИЗ
		                    |	Документ.ТТНВходящаяЕГАИС.Товары КАК Документ1С
							|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
							| 		ПО СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция = Документ1С.АлкогольнаяПродукция 						
		                    |ГДЕ
		                    |	Документ1С.Ссылка = &Ссылка");
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".ТТНВходящаяЕГАИС.","." + Шаблон.ВидДокумента + ".");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Товары КАК ","." + Шаблон.ИмяТабличнойЧастиПодбор + " КАК ");
		
		Если ДатаМобайл_ОбщийМодуль.ЕстьАСТ() Тогда
			ДатаМобайл_ОбщийМодуль.астЗаменитьРегистрНоменклатурыЕГАИС(Запрос.Текст);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ1С.АлкогольнаяПродукция", "Документ1С.НоменклатураЕГАИС");
		КонецЕсли;

	Иначе
		
		Если Шаблон.ВидДокумента = "СборкаТоваров" Тогда
			Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
								|	Документ1С.Номенклатура КАК Ссылка,
								|	Документ1С.Характеристика КАК СсылкаХарактеристика
								|ИЗ
								|	Документ.СборкаТоваров.Товары КАК Документ1С
								|ГДЕ
								|	Документ1С.Ссылка = &Ссылка
								|
								|ОБЪЕДИНИТЬ ВСЕ
								|
								|ВЫБРАТЬ РАЗЛИЧНЫЕ
								|	Документ1С.Номенклатура,
								|	Документ1С.Характеристика
								|ИЗ
								|	Документ.СборкаТоваров.Товары КАК Документ1С
								|ГДЕ
								|	Документ1С.Ссылка = &Ссылка
								|
								|ОБЪЕДИНИТЬ ВСЕ
								|
								|ВЫБРАТЬ РАЗЛИЧНЫЕ
								|	Документ1С.Номенклатура,
								|	Документ1С.Характеристика
								|ИЗ
								|	Документ.СборкаТоваров КАК Документ1С
								|ГДЕ
								|	Документ1С.Ссылка = &Ссылка");
			
		Иначе
			
			Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
								|	Документ1С.Номенклатура КАК Ссылка,
								|	Документ1С.Характеристика КАК СсылкаХарактеристика
								|ИЗ
								|	Документ.ОтборРазмещениеТоваров.ТоварыОтбор КАК Документ1С					
								|ГДЕ
								|	Документ1С.Ссылка = &Ссылка
								|
								|ОБЪЕДИНИТЬ ВСЕ
								|
								|ВЫБРАТЬ РАЗЛИЧНЫЕ
								|	Документ1С.Номенклатура,
								|	Документ1С.Характеристика
								|ИЗ
								|	Документ.ОтборРазмещениеТоваров.ТоварыРазмещение КАК Документ1С
								|ГДЕ
								|	Документ1С.Ссылка = &Ссылка");
			
		КонецЕсли;
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,".ОтборРазмещениеТоваров.","." + Шаблон.ВидДокумента + ".");
		Если Шаблон.ИспользоватьПодбор Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ".ТоварыОтбор КАК ", "."+Шаблон.ИмяТабличнойЧастиПодбор + " КАК ");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,".ТоварыОтбор КАК ","."+Шаблон.ИмяТабличнойЧастиПриемка+" КАК ");
		КонецЕсли;	
		
		Если Шаблон.ВидДокумента = "УведомлениеОПриемкеМДЛП" ИЛИ Шаблон.ВидДокумента = "УведомлениеОПриемкеМДЛП" Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,".ТоварыРазмещение КАК ","."+"СоставТранспортныхУпаковок"+" КАК ");	
		КонецЕсли;
		
		Если Шаблон.ИспользоватьПриемку Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ".ТоварыРазмещение КАК ", "." + Шаблон.ИмяТабличнойЧастиПриемка + " КАК ");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, ".ТоварыРазмещение КАК ", "." + Шаблон.ИмяТабличнойЧастиПодбор + " КАК ");
		КонецЕсли;

		Если Шаблон.МножествоДокументовКакЗадание Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ1С.Ссылка = &Ссылка", "Документ1С.Ссылка В(&Документы)");
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДок.ИсходныйДокумент);	
	Запрос.УстановитьПараметр("Документы", СсылкаНаДок.Задания.ВыгрузитьКолонку("Задание"));	
	
	Если Шаблон.ЕГАИС Тогда
		МассивХарактеристик = Неопределено;
	Иначе
		МассивХарактеристик = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СсылкаХарактеристика");
	КонецЕсли;
		
	МассивКВыгрузке = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Если МассивКВыгрузке.Количество() > 0 Тогда
		ОбъектСписка = СобратьТовары(МассивКВыгрузке, УзелПО, МассивХарактеристик, Шаблон);
	КонецЕсли;	
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);

КонецФункции

Функция GetNewArts(SN, UserName) Экспорт
	
	ОбъектСписка = Новый Массив();

	УзелПО = НайтиУзел(SN); 
	
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Если ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО, "ОчиститьТовары") Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьФлаговОбменаТСД(УзелПО, "ОчиститьТовары", Ложь);	
		ОбъектСписка = СобратьТовары(ОбъектСписка, УзелПО); 
	Иначе
		Попытка	
			ПланыОбмена.ВыбратьИзменения(УзелПО, 1, Метаданные.Справочники.Номенклатура);
			ПланыОбмена.ВыбратьИзменения(УзелПО, 1, Метаданные.Справочники.ХарактеристикиНоменклатуры);
			ПланыОбмена.ВыбратьИзменения(УзелПО, 1, Метаданные.Справочники.УпаковкиЕдиницыИзмерения);
			ПланыОбмена.ВыбратьИзменения(УзелПО, 1, Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры);
			ПланыОбмена.ВыбратьИзменения(УзелПО, 1, Метаданные.Справочники.ДатаМобайл_НовыеТовары);
			ПланыОбмена.ВыбратьИзменения(УзелПО, 1, Метаданные.РегистрыСведений.ДатаМобайл_НовыеШтрихкоды);
		Исключение
		КонецПопытки;
			
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ИзменившиесяТовары.Ссылка
			|ИЗ
			|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		НоменклатураИзменения.Ссылка КАК Ссылка
			|	ИЗ
			|		Справочник.Номенклатура.Изменения КАК НоменклатураИзменения
			|	ГДЕ
			|		НоменклатураИзменения.Узел = &Узел
			|		И НЕ НоменклатураИзменения.НомерСообщения ЕСТЬ NULL 
			|		И НЕ ЕСТЬNULL(НоменклатураИзменения.Ссылка.ЭтоГруппа, ИСТИНА)
			|	
			|	ОБЪЕДИНИТЬ
			|	
			|	ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		Номенклатура.Ссылка
			|	ИЗ
			|		Справочник.ХарактеристикиНоменклатуры.Изменения КАК ХарактеристикиНоменклатурыИзменения
			|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			|			ПО (ВЫБОР
			|					КОГДА Номенклатура.ВидНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
			|						ТОГДА ХарактеристикиНоменклатурыИзменения.Ссылка.Владелец = Номенклатура.Ссылка
			|					КОГДА Номенклатура.ВидНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
			|						ТОГДА ХарактеристикиНоменклатурыИзменения.Ссылка.Владелец = Номенклатура.ВидНоменклатуры
			|					КОГДА Номенклатура.ВидНоменклатуры.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры)
			|						ТОГДА ХарактеристикиНоменклатурыИзменения.Ссылка.Владелец = Номенклатура.ВладелецХарактеристик	
			|					ИНАЧЕ ЛОЖЬ
			|				КОНЕЦ)
			|	ГДЕ
			|		ХарактеристикиНоменклатурыИзменения.Узел = &Узел
			|		И НЕ ХарактеристикиНоменклатурыИзменения.НомерСообщения ЕСТЬ NULL 
			|	
			|	ОБЪЕДИНИТЬ
			|	
			|	ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		Номенклатура.Ссылка
			|	ИЗ
			|		Справочник.УпаковкиЕдиницыИзмерения.Изменения КАК УпаковкиНоменклатурыИзменения
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			|			ПО (УпаковкиНоменклатурыИзменения.Ссылка.Владелец = Номенклатура.Ссылка
			|					ИЛИ УпаковкиНоменклатурыИзменения.Ссылка.Владелец = Номенклатура.ВидНоменклатуры)
			|	ГДЕ
			|		УпаковкиНоменклатурыИзменения.Узел = &Узел
			|		И НЕ УпаковкиНоменклатурыИзменения.НомерСообщения ЕСТЬ NULL 
			|	
			|	ОБЪЕДИНИТЬ
			|	
			|	ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		ШтрихкодыНоменклатуры.Номенклатура
			|	ИЗ
			|		РегистрСведений.ШтрихкодыНоменклатуры.Изменения КАК ШтрихкодыНоменклатурыИзменения
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
			|			ПО ШтрихкодыНоменклатурыИзменения.Штрихкод = ШтрихкодыНоменклатуры.Штрихкод
			|	ГДЕ
			|		ШтрихкодыНоменклатурыИзменения.Узел = &Узел
			|		И НЕ ШтрихкодыНоменклатурыИзменения.НомерСообщения ЕСТЬ NULL 
			|	
			|	ОБЪЕДИНИТЬ
			|	
			|	ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		ДатаМобайл_НовыеШтрихкоды.Номенклатура
			|	ИЗ
			|		РегистрСведений.ДатаМобайл_НовыеШтрихкоды.Изменения КАК ДатаМобайл_НовыеШтрихкодыИзменения
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДатаМобайл_НовыеШтрихкоды КАК ДатаМобайл_НовыеШтрихкоды
			|			ПО ДатаМобайл_НовыеШтрихкодыИзменения.ШтрихКод = ДатаМобайл_НовыеШтрихкоды.ШтрихКод
			|	ГДЕ
			|		ДатаМобайл_НовыеШтрихкодыИзменения.Узел = &Узел
			|		И НЕ ДатаМобайл_НовыеШтрихкодыИзменения.НомерСообщения ЕСТЬ NULL 
			|	
			|	ОБЪЕДИНИТЬ
			|	
			|	ВЫБРАТЬ РАЗЛИЧНЫЕ
			|		ДатаМобайл_НовыеТоварыИзменения.Ссылка
			|	ИЗ
			|		Справочник.ДатаМобайл_НовыеТовары.Изменения КАК ДатаМобайл_НовыеТоварыИзменения
			|	ГДЕ
			|		ДатаМобайл_НовыеТоварыИзменения.Узел = &Узел
			|		И НЕ ДатаМобайл_НовыеТоварыИзменения.НомерСообщения ЕСТЬ NULL ) КАК ИзменившиесяТовары
			|ГДЕ
			|	(НЕ ИзменившиесяТовары.Ссылка ССЫЛКА Справочник.Номенклатура
			|			ИЛИ ИзменившиесяТовары.Ссылка В ИЕРАРХИИ (&СписокТоваров)
			|			ИЛИ &ВсеТовары)");

			Запрос.УстановитьПараметр("Узел", УзелПО);
			Запрос.УстановитьПараметр("СписокТоваров", УзелПО.ДоступныеГруппыТоваров.ВыгрузитьКолонку("Номенклатура"));
			Запрос.УстановитьПараметр("ВсеТовары", УзелПО.ДоступныеГруппыТоваров.Количество() = 0);
			
			МассивКВыгрузке = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			
			
			Попытка	
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелПО, Метаданные.Справочники.Номенклатура);
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелПО, Метаданные.Справочники.ХарактеристикиНоменклатуры);
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелПО, Метаданные.Справочники.УпаковкиЕдиницыИзмерения);
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелПО, Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры);
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелПО, Метаданные.Справочники.ДатаМобайл_НовыеТовары);
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелПО, Метаданные.РегистрыСведений.ДатаМобайл_НовыеШтрихкоды);
			Исключение
			КонецПопытки;
			
			Если МассивКВыгрузке.Количество() > 0 Тогда
				ОбъектСписка = СобратьТовары(МассивКВыгрузке, УзелПО);
			КонецЕсли;

	КонецЕсли;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);

КонецФункции

Функция GetArtRest(SN, UserName, ArtID, Params) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);	
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	
	
	Если Лев(ArtID,3) = "8U-" Тогда
		
		Попытка
			Товар = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(ArtID, 4, 36));		
		Исключение
			
			СтруктураОтвета.Вставить("data", 0);
			Возврат ПодготовитьОтветJSON(СтруктураОтвета);
			
		КонецПопытки;	
		
		ИДХК = Сред(ArtID, 40, 36);
		
		Если ИДХК = "00000000-0000-0000-0000-000000000000" Тогда
			ХК = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Иначе	
			ХК = XMLЗначение(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"), ИДХК);		    
		КонецЕсли;
		
	ИначеЕсли Лев(ArtID,3) = "8n-" Тогда
		
		СтруктураОтвета.Вставить("data", 0);
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
		
	КонецЕсли;	
	
	ЭтоУслуга = Ложь;
	
	Попытка 
		Если Товар.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			ЭтоУслуга = Истина;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если УзелПО.НеОтображатьОстатки Тогда
		
		СтруктураОтвета.Вставить("data", 0);
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
		
	ИначеЕсли ЭтоУслуга Тогда
		
		СтруктураОтвета.Вставить("data", 999);
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
		
	Иначе	    
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	СУММА(РезервТСД.Количество) КАК РезервТСД,
		|	0 КАК Резерв,
		|	0 КАК Остаток
		|ПОМЕСТИТЬ РазныеДанные
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
		|		ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|		СУММА(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество) КАК Количество
		|	ИЗ
		|		Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
		|	ГДЕ
		|		ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
		|			И ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура = &Номенклатура
		|				И ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры = &ХК
		|					И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.Шаблон.РезервироватьТовар
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
		|		ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры) КАК РезервТСД
		|ГДЕ
		|	РезервТСД.Номенклатура = &Номенклатура
		|	И РезервТСД.ХарактеристикаНоменклатуры = &ХК
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	СУММА(ТоварыВРезервеНаСкладахОстатки.КОтгрузкеОстаток),
		|	СУММА(ТоварыВРезервеНаСкладахОстатки.ВНаличииОстаток)
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			Номенклатура = &Номенклатура
		|				И (&ВсеСклады
		|					ИЛИ Склад В (&Склады))
		|				И 1=1) КАК ТоварыВРезервеНаСкладахОстатки
		|ГДЕ
		|	ТоварыВРезервеНаСкладахОстатки.Номенклатура = &Номенклатура
		|	И ТоварыВРезервеНаСкладахОстатки.Характеристика = &ХК
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(РазныеДанные.РезервТСД, 0)) КАК РезервТСД,
		|	СУММА(ЕСТЬNULL(РазныеДанные.Резерв, 0)) КАК Резерв,
		|	СУММА(ЕСТЬNULL(РазныеДанные.Остаток, 0)) КАК Остаток
		|ИЗ
		|	РазныеДанные КАК РазныеДанные");
		
		Запрос.УстановитьПараметр("Номенклатура", Товар);
		Запрос.УстановитьПараметр("ХК", ХК);
		
		СписокСкладов = УзелПО.Склады.ВыгрузитьКолонку("Склад");
		Запрос.УстановитьПараметр("Склады", СписокСкладов);
		Запрос.УстановитьПараметр("ВсеСклады", СписокСкладов.Количество() = 0);
		
		СписокПомещений = УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
		Запрос.УстановитьПараметр("Помещения", СписокПомещений);
		Запрос.УстановитьПараметр("ВсеПомещения", СписокПомещений.Количество() = 0);
		
		Если УзелПО.УчитыватьОстаткиПоРегиструСвободныеОстатки Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТоварыНаСкладах", "СвободныеОстатки");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "КОтгрузкеОстаток", "ВРезервеСоСкладаОстаток");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1=1", "(&ВсеПомещения ИЛИ Помещение В (&Помещения))");
		КонецЕсли;
		
		Рез = Запрос.Выполнить().Выгрузить();
		
		Итог = Рез.Итог("Остаток") - Рез.Итог("Резерв") - Рез.Итог("РезервТСД");
		
		СтруктураОтвета.Вставить("data", Итог);
		
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
		
	КонецЕсли; 
КонецФункции

Функция GetSNTypes(СтруктураHttpПараметров) Экспорт 
				
	SN = СтруктураHttpПараметров.device_id;
	UserName = СтруктураHttpПараметров.username;

	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Если ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьТипыСерий") Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьФлаговОбменаТСД(УзелПО,"ОчиститьТипыСерий", Ложь);	 
	КонецЕсли;

	СтруктураОтвета = Новый Структура;
	
	// По умолчанию добавим три типа серийных номеров		
	МассивСтрок = Новый Массив;
	
	// 1. Серийный номер
	
		СтруктураЗапроса = Новый Структура;
		СтруктураЗапроса.Вставить("id", "10");
		СтруктураЗапроса.Вставить("name", "Серийный номер");
		СтруктураЗапроса.Вставить("ai", "10"); // Для разбора GS1
		СтруктураЗапроса.Вставить("data_type", 2);
							
		МассивСтрок.Добавить(СтруктураЗапроса);
	
	// 2. Дата производства
	
		СтруктураЗапроса = Новый Структура;
		СтруктураЗапроса.Вставить("id", "11");
		СтруктураЗапроса.Вставить("name", "Дата производства");
		СтруктураЗапроса.Вставить("ai", "11"); // Для разбора GS1
		СтруктураЗапроса.Вставить("data_type", 1);
		СтруктураЗапроса.Вставить("mask", "dd.mm.yy");
					
		МассивСтрок.Добавить(СтруктураЗапроса);

	// 3. Дата окончания срока годности
	
	    СтруктураЗапроса = Новый Структура;
		СтруктураЗапроса.Вставить("id", "17");
		СтруктураЗапроса.Вставить("name", "Дата срока годности");
		СтруктураЗапроса.Вставить("ai", "17"); // Для разбора GS1
		СтруктураЗапроса.Вставить("data_type", 1);
		СтруктураЗапроса.Вставить("mask", "dd.mm.yy");
					
		МассивСтрок.Добавить(СтруктураЗапроса);
	

		СтруктураОтвета.Вставить("sn_types", МассивСтрок);
		
	Возврат ПодготовитьОтветJSON(МассивСтрок);	

КонецФункции

Функция GetSNList(SN, UserName, art_id, cell_barcode, doc_id) Экспорт 
	                      
	СтруктураОтвета = Новый Структура;
		
	DocOutID = doc_id;
	ArtID 	 = art_id;
	Cell 	 = cell_barcode;

	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));	
	Исключение			
		СтруктураОтвета.Вставить("Описание", "Не нашли документ.");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;
	
	Шаблон = СсылкаНаДок.Шаблон;
	РассчитатьГоденДо = ?(Шаблон = Неопределено, Истина, Шаблон.СерииРассчитыватьГоденДо);
	
	ТекущаяЯчейка = ДатаМобайл_ОбщийМодуль.ПолучитьЯчейкуПоКодуИлиШтрихкоду(Cell);
	
	Если Лев(ArtID,3) = "8U-" Тогда
		лТовар = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(ArtID, 4, 36));
		ИДХК = Сред(ArtID, 40, 36);
		Если ИДХК <> "00000000-0000-0000-0000-000000000000" Тогда
			лХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДХК));
		Иначе
			лХарактеристикаНоменклатуры = XMLЗначение(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"), ИДХК);
		КонецЕсли;
	Иначе   	
		СтруктураОтвета.Вставить("Описание", "Не найдена номенклатура. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(лТовар) Тогда		
		СтруктураОтвета.Вставить("Описание", "Не найдена номенклатура. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);	
	КонецЕсли;
		
	МассивСерий = ПолучитьМассивСерий(УзелПО,СсылкаНаДок,лТовар,лХарактеристикаНоменклатуры,ТекущаяЯчейка,Шаблон);
	
	СтрокаJSON = "";
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.JavaScript;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);
	
	Запись = Новый ЗаписьJSON;
	Запись.ПроверятьСтруктуру = Истина;
	Запись.УстановитьСтроку(ПараметрыJSON);
	
	МассивЗначенийСерий = Новый Массив;
	Для Каждого лСерия Из МассивСерий Цикл		
		
		МассивТекущейСерии = Новый Массив;
		
		Если ЗначениеЗаполнено(лТовар.ВидНоменклатуры.ВладелецСерий) Тогда
			ТекущийВладелецСерий = лТовар.ВидНоменклатуры.ВладелецСерий;
		Иначе
			ТекущийВладелецСерий = лТовар.ВидНоменклатуры;
		КонецЕсли;						
		
		Попытка
			Если ТекущийВладелецСерий.ИспользоватьНомерСерии Тогда // (10)
				МассивТекущейСерии.Добавить(СокрЛП(лСерия.Номер));
			КонецЕсли;
		Исключение
		КонецПопытки;

		Попытка
			Если ТекущийВладелецСерий.ИспользоватьДатуПроизводстваСерии Тогда  //(11)
				МассивТекущейСерии.Добавить(Формат(лСерия.ДатаПроизводства, "ДФ=dd.MM.yy"));
			КонецЕсли; 	
		Исключение
		КонецПопытки;

		Попытка
			Если ТекущийВладелецСерий.ИспользоватьСрокГодностиСерии Тогда	//(17)
				Если РассчитатьГоденДо Тогда
					// не выгружаем тип серийного номера для даты срока годности
				Иначе
					МассивТекущейСерии.Добавить(Формат(лСерия.ГоденДо, "ДФ=dd.MM.yy"));
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;

		МассивЗначенийСерий.Добавить(МассивТекущейСерии);
	КонецЦикла;	
		

	Возврат ПодготовитьОтветJSON(МассивЗначенийСерий);

КонецФункции

Функция GetArtAttributesName(SN = Неопределено, UserName = Неопределено) Экспорт
	
	ОбъектАтрибутов = Новый Структура;
	СтруктураОтвета = Новый Структура;

	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;	
	
	Если УзелПО.ИмяАтрибута1 <> "" Тогда
		ОбъектАтрибутов.Вставить("attr_1", УзелПО.ИмяАтрибута1);
	Иначе
		ОбъектАтрибутов.Вставить("attr_1", "Атрибут 1");
	КонецЕсли;
	
	Если УзелПО.ИмяАтрибута2 <> "" Тогда
		ОбъектАтрибутов.Вставить("attr_2", УзелПО.ИмяАтрибута2);
	Иначе
		ОбъектАтрибутов.Вставить("attr_2", "Атрибут 2");
	КонецЕсли;

	Если УзелПО.ИмяАтрибута3 <> "" Тогда
		ОбъектАтрибутов.Вставить("attr_3", УзелПО.ИмяАтрибута3);
	Иначе
		ОбъектАтрибутов.Вставить("attr_3", "Атрибут 3");
	КонецЕсли;
	
	Если УзелПО.ИмяАтрибута4 <> "" Тогда
		ОбъектАтрибутов.Вставить("attr_4", УзелПО.ИмяАтрибута4);
	Иначе
		ОбъектАтрибутов.Вставить("attr_4", "Атрибут 4");
	КонецЕсли;

	Если УзелПО.ИмяАтрибута5 <> "" Тогда
		ОбъектАтрибутов.Вставить("attr_5", УзелПО.ИмяАтрибута5);
	Иначе
		ОбъектАтрибутов.Вставить("attr_5", "Атрибут 5");
	КонецЕсли;

	Если УзелПО.ИмяАтрибута6 <> "" Тогда
		ОбъектАтрибутов.Вставить("attr_6", УзелПО.ИмяАтрибута6);
	Иначе
		ОбъектАтрибутов.Вставить("attr_6", "Атрибут 6");
	КонецЕсли;

	Если УзелПО.ИмяАтрибута7 <> "" Тогда
		ОбъектАтрибутов.Вставить("attr_7", УзелПО.ИмяАтрибута7);
	Иначе
		ОбъектАтрибутов.Вставить("attr_7", "Атрибут 7");
	КонецЕсли;

	Если УзелПО.ИмяАтрибута8 <> "" Тогда
		ОбъектАтрибутов.Вставить("attr_8", УзелПО.ИмяАтрибута8);
	Иначе
		ОбъектАтрибутов.Вставить("attr_8", "Атрибут 8");
	КонецЕсли;

	Если УзелПО.ИмяАтрибута9 <> "" Тогда
		ОбъектАтрибутов.Вставить("attr_9", УзелПО.ИмяАтрибута9);
	Иначе
		ОбъектАтрибутов.Вставить("attr_9", "Атрибут 9");
	КонецЕсли;

	Если УзелПО.ИмяАтрибута10 <> "" Тогда
		ОбъектАтрибутов.Вставить("attr_10", УзелПО.ИмяАтрибута10);
	Иначе
		ОбъектАтрибутов.Вставить("attr_10", "Атрибут 10");
	КонецЕсли;

	СтруктураОтвета.Вставить("attrs_names", ОбъектАтрибутов);
	
	Возврат ПодготовитьОтветJSON(ОбъектАтрибутов); 
	
КонецФункции

Функция GetArtMarks(SN, UserName) Экспорт 
	
	ОбъектСписка = Новый Массив;	
	СтруктураОтвета = Новый Структура;
	
	Если НЕ ДатаМобайл_ОбщийМодуль.ЕстьМаркировка() и НЕ ДатаМобайл_ОбщийМодуль.ЕстьМДЛП() Тогда		
		Возврат ПодготовитьОтветJSON(ОбъектСписка);
	КонецЕсли;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Если ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьКодыМаркировки") Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьФлаговОбменаТСД(УзелПО,"ОчиститьКодыМаркировки", Ложь);	 
	КонецЕсли;
	
	ЗапросМарок = Новый Запрос ("ВЫБРАТЬ
	                       |	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка,
	                       |	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
						   |	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
						   |	ВЫБОР
						   |		КОГДА ШтрихкодыУпаковокТоваров.Количество = 0 
						   |		ТОГДА
						   |			ВЫБОР
						   |				КОГДА ЕСТЬNULL(ШтрихкодыУпаковокТоваров.Упаковка.Числитель,0) = 0
						   |				ТОГДА 1
						   |				ИНАЧЕ ШтрихкодыУпаковокТоваров.Упаковка.Числитель
						   |			КОНЕЦ
						   |		ИНАЧЕ ШтрихкодыУпаковокТоваров.Количество 
						   |	КОНЕЦ КАК Коэффициент,
						   |	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
						   |	ШтрихкодыУпаковокТоваров.Номенклатура.ПометкаУдаления КАК ПометкаУдаления
						   |ПОМЕСТИТЬ КодыМаркировки
	                       |ИЗ
	                       |	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
						   |ГДЕ
						   |	ШтрихкодыУпаковокТоваров.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
						   |	И ШтрихкодыУпаковокТоваров.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция)
						   |	И ШтрихкодыУпаковокТоваров.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция)
						   |	И (ШтрихкодыУпаковокТоваров.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПустаяСсылка) ИЛИ ШтрихкодыУпаковокТоваров.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПустаяСсылка))
						   |	И НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления
						   |	И ШтрихкодыУпаковокТоваров.ТипШтрихкода <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.PDF417) 
						   |	И ((ШтрихкодыУпаковокТоваров.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
						   |		И ШтрихкодыУпаковокТоваров.ТипШтрихкода <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.DataMatrix))
						   |			ИЛИ (ШтрихкодыУпаковокТоваров.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
						   |				И ШтрихкодыУпаковокТоваров.ТипШтрихкода = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.GS1_DataMatrix)))
	                       |;
						   |
						   |ВЫБРАТЬ
	                       |	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка,
	                       |	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
						   |	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
						   |	ВЫБОР
						   |		КОГДА ШтрихкодыУпаковокТоваров.Количество = 0 
						   |		ТОГДА
						   |			ВЫБОР
						   |				КОГДА ЕСТЬNULL(ШтрихкодыУпаковокТоваров.Упаковка.Числитель,0) = 0
						   |				ТОГДА 1
						   |				ИНАЧЕ ШтрихкодыУпаковокТоваров.Упаковка.Числитель
						   |			КОНЕЦ
						   |		ИНАЧЕ ШтрихкодыУпаковокТоваров.Количество 
						   |	КОНЕЦ КАК Коэффициент,
						   |	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
						   |	ШтрихкодыУпаковокТоваров.Номенклатура.ПометкаУдаления КАК ПометкаУдаления
						   |ПОМЕСТИТЬ ПачкиСигарет
	                       |ИЗ
	                       |	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
						   |ГДЕ
						   |	ШтрихкодыУпаковокТоваров.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
						   |	И ШтрихкодыУпаковокТоваров.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция)
						   |	И ШтрихкодыУпаковокТоваров.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция)
						   |	И (ШтрихкодыУпаковокТоваров.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПустаяСсылка) ИЛИ ШтрихкодыУпаковокТоваров.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПустаяСсылка))						   						
						   |	И НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления						   
						   |	И ШтрихкодыУпаковокТоваров.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
						   |	И ШтрихкодыУпаковокТоваров.ТипШтрихкода = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.DataMatrix)
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	КодыМаркировки.Номенклатура КАК Номенклатура,
						   |	КодыМаркировки.Характеристика КАК Характеристика,
						   |	КодыМаркировки.Коэффициент КАК Коэффициент,
	                       |	КодыМаркировки.ПометкаУдаления КАК ПометкаУдаления,
	                       |	КодыМаркировки.ЗначениеШтрихкода КАК Марка,
	                       |	ЕСТЬNULL(ДанныеУпаковкиУровень1.Ссылка.ЗначениеШтрихкода, """") КАК Короб,
	                       |	ЕСТЬNULL(ДанныеУпаковкиУровень2.Ссылка.ЗначениеШтрихкода, """") КАК Палета
	                       |ИЗ
	                       |	КодыМаркировки КАК КодыМаркировки
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ДанныеУпаковкиУровень1
	                       |		ПО (ДанныеУпаковкиУровень1.Штрихкод = КодыМаркировки.Ссылка)
	                       |			И (ДанныеУпаковкиУровень1.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
	                       |				ИЛИ ДанныеУпаковкиУровень1.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка))
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ДанныеУпаковкиУровень2
	                       |		ПО (ДанныеУпаковкиУровень2.Штрихкод = ДанныеУпаковкиУровень1.Ссылка)
	                       |			И (ДанныеУпаковкиУровень2.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
						   |				ИЛИ ДанныеУпаковкиУровень2.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка))
						   |
						   //пачки сигарет, которые не вошли в блоки
						   |ОБЪЕДИНИТЬ
						   |
						   |ВЫБРАТЬ
	                       |	ПачкиСигарет.Номенклатура КАК Номенклатура,
						   |	ПачкиСигарет.Характеристика КАК Характеристика,
						   |	ПачкиСигарет.Коэффициент КАК Коэффициент,
	                       |	ПачкиСигарет.ПометкаУдаления КАК ПометкаУдаления,
	                       |	ПачкиСигарет.ЗначениеШтрихкода КАК Марка,
	                       |	ЕСТЬNULL(ДанныеУпаковкиУровень1.Ссылка.ЗначениеШтрихкода, """") КАК Короб,
	                       |	ЕСТЬNULL(ДанныеУпаковкиУровень2.Ссылка.ЗначениеШтрихкода, """") КАК Палета
	                       |ИЗ
	                       |	ПачкиСигарет КАК ПачкиСигарет
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ДанныеУпаковкиУровень1
	                       |		ПО (ДанныеУпаковкиУровень1.Штрихкод = ПачкиСигарет.Ссылка)
	                       |			И (ДанныеУпаковкиУровень1.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
	                       |				ИЛИ ДанныеУпаковкиУровень1.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка))
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ДанныеУпаковкиУровень2
	                       |		ПО (ДанныеУпаковкиУровень2.Штрихкод = ДанныеУпаковкиУровень1.Ссылка)
	                       |			И (ДанныеУпаковкиУровень2.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
						   |				ИЛИ ДанныеУпаковкиУровень2.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка))
						   |ГДЕ
						   |	ЕСТЬNULL(ДанныеУпаковкиУровень1.Ссылка.ТипШтрихкода,"""") <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.GS1_DataMatrix)
						   |;
						   |////////////////////////////////////////////////////////////////////////////////
						   |УНИЧТОЖИТЬ КодыМаркировки
						   |;
						   |////////////////////////////////////////////////////////////////////////////////
						   |УНИЧТОЖИТЬ ПачкиСигарет");

	ВыборкаМарок = ЗапросМарок.Выполнить().Выбрать();
	
	Пока ВыборкаМарок.Следующий() Цикл
		
		ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art_mark"); 

		ОбъектТовара.art_id = "8U-" + XMLСтрока(ВыборкаМарок.Номенклатура) + XMLСтрока(ВыборкаМарок.Характеристика);// ID номенклатуры марки 		
		
		ТипПродукции = ДатаМобайл_Маркировка.ПолучитьТипМаркированнойПродукции(ВыборкаМарок.Номенклатура);
		ЧистаяМарка = ДатаМобайл_Маркировка.УбратьСкобкиТеговМарка(Строка(ВыборкаМарок.Марка), ТипПродукции);
		
		ОбъектТовара.mark = ЧистаяМарка; // марка
		ОбъектТовара.box =  ДатаМобайл_Маркировка.УбратьСкобкиТеговУпаковка(Строка(ВыборкаМарок.Короб));  // короб 
		ОбъектТовара.pallet =  ДатаМобайл_Маркировка.УбратьСкобкиТеговУпаковка(Строка(ВыборкаМарок.Палета)); // палета
		ОбъектТовара.coef =  ВыборкаМарок.Коэффициент;  // коэффициент
		 
		ОбъектСписка.Добавить(ОбъектТовара);

	КонецЦикла;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);

КонецФункции

Функция GenerateNewBC(SN, UserName, ArtID, UnitID, P1, P2, BarcodeQuant = 1) Экспорт 
	
	ОбъектШтрихкода = ПолучитьСтруктуруОбъектаДляHttp("barcode","unit_value");
	
	СтруктураОтвета =  Новый Структура;
	 УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		NewTSD(SN, UserName); 
	КонецЕсли;
	
	СХарактеристикой = Ложь;	
	Если Лев(ArtID, 3)= "8U-" Тогда
		Если УзелПО.ЗаписьВРегистр Тогда
			лТовар = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(ArtID, 4, 36)); 			
			ИДХК = Сред(ArtID, 40, 36);
			Если ИДХК <> "00000000-0000-0000-0000-000000000000" Тогда
				лХарактеристикаНоменклатуры = XMLЗначение(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"), ИДХК);   
				СХарактеристикой = Истина;
			КонецЕсли;	
		Иначе 		
			СтруктураОтвета.Вставить("Описание", "Не разрешена запись штрихкодов сразу в регистр в настройках ТСД в АРМ 1С.");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	Иначе 	
		СтруктураОтвета.Вставить("Описание", "Генерация возможна только на товары из справочника 1С, новые товары необходимо сначала записать в 1С.");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;	
	
	Если UnitID = "шт" Тогда
		ЕдиницаИзмерения = лТовар.ЕдиницаИзмерения;
	Иначе
		Попытка
			ЕдиницаИзмерения = XMLЗначение(Тип("СправочникСсылка.УпаковкиЕдиницыИзмерения"), UnitID);	
		Исключение
			ЕдиницаИзмерения = лТовар.ЕдиницаИзмерения;
		КонецПопытки;	
	КонецЕсли;
	
	Если лТовар.ИспользоватьУпаковки Тогда
		
		ЗапросУпаковок = Новый Запрос;
		ЗапросУпаковок.УстановитьПараметр("Номенклатура", лТовар);
		ЗапросУпаковок.УстановитьПараметр("НаборыУпаковокНоменклатура", лТовар.НаборУпаковок);
		ЗапросУпаковок.УстановитьПараметр("НаборыУпаковокВидНоменклатуры", лТовар.ВидНоменклатуры.НаборУпаковок);
		//ЗапросУпаковок.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаИзмерения);
		ЗапросУпаковок.УстановитьПараметр("Коэффициент", BarcodeQuant);	
		ЗапросУпаковок.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	УпаковкиНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
		|ГДЕ
		|	УпаковкиНоменклатуры.Владелец = &Номенклатура
		|	И УпаковкиНоменклатуры.Числитель = &Коэффициент
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ
		|	УпаковкиНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
		|ГДЕ
		|	УпаковкиНоменклатуры.Владелец = &НаборыУпаковокНоменклатура
		|	И УпаковкиНоменклатуры.Числитель = &Коэффициент
		|ОБЪЕДИНИТЬ
		|ВЫБРАТЬ
		|	УпаковкиНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
		|ГДЕ
		|	УпаковкиНоменклатуры.Владелец = &НаборыУпаковокВидНоменклатуры
		|	И УпаковкиНоменклатуры.Числитель = &Коэффициент";
		
		ВыборкаУпаковок = ЗапросУпаковок.Выполнить().Выбрать();                            
		лУпак = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
		
		Пока ВыборкаУпаковок.Следующий() Цикл
			лУпак = ВыборкаУпаковок.ССылка;
			Прервать;
		КонецЦикла;
		
		Если  лУпак.Пустая() Тогда
			СтруктураОтвета.Вставить("Описание", "Не найдена упаковка. ");	
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;
		
	Иначе
		лУпак = лТовар.ЕдиницаИзмерения;
	КонецЕсли;						   
						   
	ЗаписьШК = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	ЗаписьШК.Номенклатура = лТовар;
	ЗаписьШК.Упаковка = лУпак;
	ЗаписьШК.Штрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьШтрихкодEAN13();	
	Если СХарактеристикой Тогда
		ЗаписьШК.Характеристика = лХарактеристикаНоменклатуры; 
	КонецЕсли;
	
	Попытка	
		ЗаписьШК.Записать(Истина);
		ОбъектШтрихкода.value = ЧистаяСтрока(ЗаписьШК.Штрихкод);
		ОбъектШтрихкода.unit_name = ЧистаяСтрока(лУпак.Наименование);
		Попытка
			КФ = Строка(Формат(лУпак.Числитель, "ЧН=0; ЧГ=0"));
		Исключение
			КФ = 1;
		КонецпопыткИ;
		КФ = СтрЗаменить(КФ, ",",".");
		ОбъектШтрихкода.unit_coef=ЧистаяСтрока(КФ);	
	Исключение		
		СтруктураОтвета.Вставить("Описание", "Ошибка записи штрихкода " + ОписаниеОшибки() );		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецПопытки;
	
	Возврат ПодготовитьОтветJSON(ОбъектШтрихкода);

КонецФункции

Функция GetArtOnBC(SN, UserName, Barcode) Экспорт 
				
	ОбъектСписка = Новый Массив();

	УзелПО = НайтиУзел(SN);	
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
		
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                    |	РегистрШтрихкодов.Номенклатура КАК Ссылка,
						|	РегистрШтрихкодов.Характеристика КАК СсылкаХарактеристика
	                    |ИЗ
	                    |	РегистрСведений.ШтрихкодыНоменклатуры КАК РегистрШтрихкодов
	                    |ГДЕ
	                    |	РегистрШтрихкодов.Штрихкод = &ШК");
						
	Запрос.УстановитьПараметр("ШК", Barcode);
	
	МассивТоваров = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	МассивХарактеристик = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СсылкаХарактеристика");
		
	Если МассивТоваров.Количество() > 0 Тогда
		ОбъектСписка = СобратьТовары(МассивТоваров, УзелПО, МассивХарактеристик);
	КонецЕсли;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

Функция UpdateArt(SN, UserName, Art, EgaisArt="") Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;		
	
	ArtID = Art.id;
	Если Лев(ArtID, 3) = "8U-" Тогда
		Если Не РазрешеноРедактированиеТовара(УзелПО,UserName) Тогда		
			СтруктураОтвета.Вставить("Описание", "Пользователю в настройках прав в АРМ 1С не разрешено редактирование существующих товаров.");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
		КонецЕсли;
		
		ИДХК = Сред(ArtID, 40, 36);
		Если ИДХК <> "00000000-0000-0000-0000-000000000000" Тогда		
			СтруктураОтвета.Вставить("Описание", "Нельзя изменять наименование товара с характеристикой. ");			
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);			
		КонецЕсли;
		
		Попытка
			лТоварСсылка = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(ArtID, 4));
			лТовар = лТоварСсылка.ПолучитьОбъект();
			лТовар.Наименование = Лев(Art.name, Метаданные.Справочники.Номенклатура.ДлинаНаименования);
			лТовар.Записать();
		Исключение			
			СтруктураОтвета.Вставить("Описание", "Не удалось обновить товар. " + ОписаниеОшибки());			
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);			
		КонецПопытки;
		
		ТекстОшибки = "";
		НоменклатураСсылка = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(ArtID, 4, 36));		
		Если СсылкаСуществует(НоменклатураСсылка) Тогда
			
			НоменклатураОбъект = НоменклатураСсылка.ПолучитьОбъект();
			Атрибуты = ПолучитьАтрибуты(УзелПО);
			Для сч = 1 По 10 Цикл
				
				ИмяАтрибута = Атрибуты["ИмяАтрибута" + сч];
				
				//ДопСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(СтрЗаменить(ИмяАтрибута, "ДР_", ""));
				//Значение=НоменклатураСсылка.ДополнительныеРеквизиты.Найти(ДопСвойство);
				
				НовоеЗначениеРеквизитаСтрокой = СокрЛП(Art.attributes["attr_" + сч]); 
				Если ИмяАтрибута = "!!! Ячейки !!!" или ИмяАтрибута = "!!! Характеристики !!!" или ЛЕВ(ИмяАтрибута, 3) = "ДР_" Тогда
					Продолжить;
				
				ИначеЕсли ИмяАтрибута <> "" И ЧистаяСтрока(Строка(НоменклатураОбъект[ИмяАтрибута])) <> НовоеЗначениеРеквизитаСтрокой Тогда
					
					Если НовоеЗначениеРеквизитаСтрокой = "" Тогда
						НоменклатураОбъект[ИмяАтрибута] = "";
					Иначе
						УстановитьЗначениеИЗСтроки(НоменклатураОбъект, ИмяАтрибута, НовоеЗначениеРеквизитаСтрокой, ТекстОшибки);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Попытка
				НоменклатураОбъект.Записать();
			Исключение
				ТекстОшибки = ТекстОшибки + "Не удалось записать номенклатуру. " + ОписаниеОшибки() + Символы.ПС;
			КонецПопытки; 
			
		Иначе
			ТекстОшибки = ТекстОшибки + "Не удалось найти товар по УИД." + Символы.ПС;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда		
			СтруктураОтвета.Вставить("Описание", ТекстОшибки);		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);			
		КонецЕсли;	
		
		Возврат ПодготовитьОтветJSON(Art);

	ИначеЕсли Лев(ArtID,3) = "8n-" Тогда
		лТоварСсылка = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_НовыеТовары"), Сред(ArtID, 4));
		лТовар = лТоварСсылка.ПолучитьОбъект();
	Иначе	
		лТовар = Справочники.ДатаМобайл_НовыеТовары.СоздатьЭлемент();
	КонецЕсли;	
	
	лТовар.Пользователь = UserName;
	
	
	
	Если ЗначениеЗаполнено(EgaisArt) тогда	
		лТовар.Наименование = ЛЕВ(EgaisArt.name, Метаданные.Справочники.ДатаМобайл_НовыеТовары.ДлинаНаименования);
		AlcoArtID = EgaisArt.id;
		Попытка лТовар.ИдентификаторАлкоголя = AlcoArtID; Исключение КонецПопытки;	
	Иначе
		лТовар.Наименование = Лев(Art.name,Метаданные.Справочники.ДатаМобайл_НовыеТовары.ДлинаНаименования);
	КонецЕсли;	

	Попытка
		лТовар.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		лТовар.ОбменДанными.Получатели.Заполнить();
		лТовар.ОбменДанными.Получатели.Удалить(УзелПО);
		лТовар.Записать();
	Исключение	
		СтруктураОтвета.Вставить("Описание", "Не удалось обновить товар. " + ОписаниеОшибки());		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецПопытки;
	
	Art.id = "8n-" + XMLСтрока(лТовар.Ссылка);
	
	Возврат ПодготовитьОтветJSON(Art);
	
КонецФункции

Функция CreateEgaisArt(SN, UserName, Art, EgaisArt) Экспорт 
	
	СтруктураОтвета = Новый Структура;

	УзелПО=НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;

	ArtID = Art.id;
	AlcoArtID = EgaisArt.id;
	
	Если Лев(ArtID, 3) = "8U-" Тогда
		Возврат ПодготовитьОтветJSON(Art);
	ИначеЕсли Лев(ArtID, 3) = "8n-" Тогда
		лТоварСсылка = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_НовыеТовары"), Сред(ArtID, 4));
		лТовар = лТоварСсылка.ПолучитьОбъект();
	Иначе	
		лТовар=Справочники.ДатаМобайл_НовыеТовары.СоздатьЭлемент();
	КонецЕсли;	
	
	лТовар.Пользователь = UserName;
	лТовар.Наименование = ЛЕВ(EgaisArt.name, Метаданные.Справочники.Номенклатура.ДлинаНаименования);
	лТовар.ИдентификаторАлкоголя = AlcoArtID;
	
	Попытка
		лТовар.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		лТовар.ОбменДанными.Получатели.Заполнить();
		лТовар.ОбменДанными.Получатели.Удалить(УзелПО);
		лТовар.Записать();
	Исключение		
		СтруктураОтвета.Вставить("Описание", "Не удалось создать товар. " + ОписаниеОшибки());		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	Конецпопытки;
	
	Art.id = "8n-" + XMLСтрока(лТовар.Ссылка);
		
	Возврат ПодготовитьОтветJSON(Art);
	
КонецФункции

Функция DeleteArt(SN, UserName, ArtID) Экспорт
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;

	Если Лев(ArtID, 3) = "8U-" Тогда		
		СтруктураОтвета.Вставить("Описание", "Нельзя удалять существующие товары. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	ИначеЕсли Лев(ArtID, 3) = "8n-" Тогда
		лТоварСсылка = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_НовыеТовары"), Сред(ArtID, 4));
		лТовар = лТоварСсылка.ПолучитьОбъект();
	Иначе	
		СтруктураОтвета.Вставить("is_success", Истина);	
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	КонецЕсли;	
	
	Попытка
		лТовар.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		лТовар.ОбменДанными.Получатели.Заполнить();
		лТовар.ОбменДанными.Получатели.Удалить(УзелПО);
		лТовар.Удалить();
	Исключение		
		СтруктураОтвета.Вставить("Описание", "Не удалось удалить товар. " + ОписаниеОшибки());		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	Конецпопытки;	
	
	СтруктураОтвета.Вставить("is_success", Истина);
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	
КонецФункции

Функция UpdateBarcode(SN, UserName, ArtID, Barcode) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		NewTSD(SN, UserName);  
	КонецЕсли;	

	СХарактеристикой = Ложь;
	ЭтоНовыйТовар = Ложь;
	Если Лев(ArtID, 3)= "8U-" Тогда
		
		лТовар = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(ArtID, 4, 36));
		ИДХК = Сред(ArtID, 40, 36);
		
		Если ИДХК <> "00000000-0000-0000-0000-000000000000" Тогда
			лХарактеристикаНоменклатуры = XMLЗначение(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"), ИДХК);
			СХарактеристикой = Истина;
		Иначе
			лХарактеристикаНоменклатуры =Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		КонецЕсли;
		
	ИначеЕсли Лев(ArtID, 3)= "8n-" Тогда
		лТовар = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_НовыеТовары"), Сред(ArtID, 4));
		ЭтоНовыйТовар = Истина;
		лХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	Иначе
		Возврат ПодготовитьОтветJSON(Barcode); 
	КонецЕсли;	
	
	ШК = Barcode.Получить("value");
	Коэффициент = Barcode.Получить("unit_coef");
	
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                    |	ШтрихкодыНоменклатуры.Штрихкод,
						|	ШтрихкодыНоменклатуры.Номенклатура,
						|	ШтрихкодыНоменклатуры.Упаковка,
						|	ШтрихкодыНоменклатуры.Характеристика
	                    |ИЗ
	                    |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                    |ГДЕ
	                    |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод");
	Запрос.УстановитьПараметр("ШтрихКод",ШК);

	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда // уже есть в списке шк
		Если Рез.Номенклатура = лТовар и Рез.Характеристика = лХарактеристикаНоменклатуры Тогда  
			Если ЗначениеЗаполнено(Рез.Упаковка) тогда
				Попытка
					ТекущийКоэффициент = ?(Рез.Упаковка.Числитель=0,1,Рез.Упаковка.Числитель)/?(Рез.Упаковка.Знаменатель=0,1,Рез.Упаковка.Знаменатель);
				Исключение
				КонецПопытки;	
			Иначе
				ТекущийКоэффициент = 1;
			КонецЕсли;	

			Если Коэффициент <> ТекущийКоэффициент тогда
				СтруктураОтвета.Вставить("Описание", "Не удалось обновить штрихкод. В 1С он принадлежит упаковке с коэффициентом : " + ТекущийКоэффициент + ", а введен коэффициент " + Коэффициент + ". Изменение коэффициентов упаковок из ТСД невозможно. ");
				Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
			КонецЕсли;
			
			Возврат ПодготовитьОтветJSON(Barcode); 
		Иначе		
			СтруктураОтвета.Вставить("Описание", "Не удалось добавить штрихкод. В 1С он принадлежит другому товару: " + Рез.Номенклатура + " " + Рез.Характеристика);		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	КонецЕсли;	
	
	
	Если УзелПО.ЗаписьВРегистр И НЕ ЭтоНовыйТовар Тогда
		Если лТовар.ИспользоватьУпаковки Тогда
			
			ЗапросУпаковок = Новый Запрос;
			ЗапросУпаковок.УстановитьПараметр("Номенклатура", лТовар);
			ЗапросУпаковок.УстановитьПараметр("НаборыУпаковокНоменклатура", лТовар.НаборУпаковок);
			ЗапросУпаковок.УстановитьПараметр("НаборыУпаковокВидНоменклатуры", лТовар.ВидНоменклатуры.НаборУпаковок);
			ЗапросУпаковок.УстановитьПараметр("Коэффициент", Коэффициент);	
			ЗапросУпаковок.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	УпаковкиНоменклатуры.Ссылка
			|ИЗ
			|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
			|ГДЕ
			|	УпаковкиНоменклатуры.Владелец = &Номенклатура
			|	И УпаковкиНоменклатуры.Числитель = &Коэффициент
			|ОБЪЕДИНИТЬ
			|ВЫБРАТЬ
			|	УпаковкиНоменклатуры.Ссылка
			|ИЗ
			|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
			|ГДЕ
			|	УпаковкиНоменклатуры.Владелец = &НаборыУпаковокНоменклатура
			|	И УпаковкиНоменклатуры.Числитель = &Коэффициент
			|ОБЪЕДИНИТЬ
			|ВЫБРАТЬ
			|	УпаковкиНоменклатуры.Ссылка
			|ИЗ
			|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиНоменклатуры
			|ГДЕ
			|	УпаковкиНоменклатуры.Владелец = &НаборыУпаковокВидНоменклатуры
			|	И УпаковкиНоменклатуры.Числитель = &Коэффициент";
			
			ВыборкаУпаковок = ЗапросУпаковок.Выполнить().Выбрать();                            
			лУпак = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
			
			Пока ВыборкаУпаковок.Следующий() Цикл
				лУпак = ВыборкаУпаковок.ССылка;
				Прервать;
			КонецЦикла;
			
			Если  лУпак.Пустая() и Коэффициент<>1 Тогда			
				СтруктураОтвета.Вставить("Описание", "Не удалось добавить штрихкод. В 1С для товара не найдена упаковка с коэффициентом " + Коэффициент);		
				Возврат ПодготовитьОтветJSON(,СтруктураОтвета);			
			КонецЕсли;			
			
		Иначе
			лУпак = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
		КонецЕсли;						   
		
		ЗаписьШК = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
		ЗаписьШК.Номенклатура = лТовар;
		
		Если СокрЛП(лУпак.код) = "" Тогда
			ЗаписьШК.Упаковка = лУпак;
		КонецЕсли;
		
		
		ЗаписьШК.Штрихкод = ШК;	
		
		Если СХарактеристикой Тогда
			ЗаписьШК.Характеристика = лХарактеристикаНоменклатуры; 
		КонецЕсли;
		
		Попытка	
			ЗаписьШК.Записать(Истина);	
		Исключение
			СтруктураОтвета.Вставить("Описание", "Не удалось добавить штрихкод. " + ОписаниеОшибки());		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецПопытки;
	
	Иначе
		лНЗ = РегистрыСведений.ДатаМобайл_НовыеШтрихкоды.СоздатьНаборЗаписей();
		лНЗ.Отбор.ШтрихКод.Установить(ШК);
		лНЗ.Прочитать();
		лНЗ.Очистить();
		лШК = лНЗ.Добавить();
		
		лШК.Номенклатура   = лТовар;
		лШК.Характеристика = лХарактеристикаНоменклатуры;
		лШК.ШтрихКод       = ШК;
		лШК.Пользователь   = UserName;
		лШК.Наименование   = Barcode.Получить("unit_name");
		лШК.Коэффициент    = Barcode.Получить("unit_coef");
		Попытка
			лНЗ.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
			лНЗ.ОбменДанными.Получатели.Заполнить();
			лНЗ.ОбменДанными.Получатели.Удалить(УзелПО);
			лНЗ.Записать(Истина);
		Исключение		
			СтруктураОтвета.Вставить("Описание", "Не удалось добавить штрихкод. " + ОписаниеОшибки());	
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
		Конецпопытки;	
	КонецЕсли;
		
	Возврат ПодготовитьОтветJSON(Barcode); 
	
КонецФункции

Функция DeleteBarcode(SN, UserName, ArtID, Barcode) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Если Лев(ArtID,3) = "8U-" Тогда
		Если НЕ РазрешеноРедактированиеТовара(УзелПО,UserName) Тогда		
			СтруктураОтвета.Вставить("Описание", "Пользователю в настройках прав в АРМ 1С не разрешено редактирование существующих товаров. ");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;
		
		Если Не УзелПО.ЗаписьВРегистр Тогда		
			СтруктураОтвета.Вставить("Описание", "Не разрешена запись штрихкодов сразу в регистр в настройках ТСД в АРМ 1С. ");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);	
		КонецЕсли;

		лТовар = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(ArtID, 4, 36));
		ИДХК = Сред(ArtID, 40, 36);
		
		Если ИДХК <> "00000000-0000-0000-0000-000000000000" Тогда
			лХарактеристикаНоменклатуры = XMLЗначение(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"), ИДХК);
		Иначе
			лХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(); 
		КонецЕсли;
		
	ИначеЕсли Лев(ArtID, 3) = "8n-" Тогда
		лТовар = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_НовыеТовары"), Сред(ArtID, 4));
		лХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(); 
	Иначе			
		СтруктураОтвета.Вставить("Описание", "Не найдена номенклатура. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;
	
	ШК = Barcode;
	
	Если УзелПО.ЗаписьВРегистр Тогда
		лНЗ = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();	
	Иначе
		лНЗ = РегистрыСведений.ДатаМобайл_НовыеШтрихкоды.СоздатьНаборЗаписей();		
	КонецЕсли;

	лНЗ.Отбор.ШтрихКод.Установить(ШК);
	лНЗ.Прочитать();
	лНЗ.Очистить();
	
	Попытка
		лНЗ.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		лНЗ.ОбменДанными.Получатели.Заполнить();
		лНЗ.ОбменДанными.Получатели.Удалить(УзелПО);
		лНЗ.Записать(Истина);
	Исключение		
		СтруктураОтвета.Вставить("Описание", "Не удалось удалить штрихкод. " + ОписаниеОшибки());	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	Конецпопытки;
	
	СтруктураОтвета.Вставить("is_success", Истина);
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	
КонецФункции

#КонецОбласти

#Область Packs

Функция OnNewPack(SN, UserName, DocID) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО=Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
		
	попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocID, 5));	
	Исключение			
		СтруктураОтвета.Вставить("Описание", "Не нашли документ.  ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;	
	Шаблон=СсылкаНаДок.Шаблон;

			
	Если Шаблон.ИспользоватьМаркировку Тогда
		
		Если УзелПО.ПрефиксКомпанииGS1 = 0 Тогда		
			СтруктураОтвета.Вставить("Описание", "В настройках терминала не задан параметр: ПрефиксКомпанииGS1. ");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;
		
		СледующийНомерSSCC = ДатаМобайл_Маркировка.ПолучитьСледующийНомерSSCC(УзелПО.ЦифраРасширения, УзелПО.ПрефиксКомпанииGS1);
		
		ДатаМобайл_Маркировка.СоздатьСправочникСсылкаУпаковка(СледующийНомерSSCC);
		
		Если Лев(СледующийНомерSSCC, 4) = "(00)" Тогда
			СледующийНомерSSCC = "[00]" + Сред(СледующийНомерSSCC, 5);
		КонецЕсли;
		СтруктураОтвета.Вставить("data", СледующийНомерSSCC);
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);

	Иначе
		ДокументУпаковочногоЛиста=Документы.ДатаМобайл_УпаковочныйЛист.СоздатьДокумент();
		ДокументУпаковочногоЛиста.Дата = ТекущаяДата();
		ДокументУпаковочногоЛиста.Основание = СсылкаНаДок.ИсходныйДокумент;
		ДокументУпаковочногоЛиста.Ответственный = Справочники.Пользователи.НайтиПоНаименованию(UserName,Ложь);
		ДокументУпаковочногоЛиста.ТСД = УзелПО;
		ДокументУпаковочногоЛиста.Записать();
		
		Попытка
			Если Шаблон.ИспользоватьТиповыеУпаковочныеЛисты Тогда
				ДокументУпаковочногоЛистаТиповой = Документы.УпаковочныйЛист.СоздатьДокумент();	
				ДокументУпаковочногоЛистаТиповой.Дата = ТекущаяДата();
				ДокументУпаковочногоЛистаТиповой.Вид = Перечисления.ВидыУпаковочныхЛистов.Исходящий;
				ДокументУпаковочногоЛистаТиповой.Код = ДокументУпаковочногоЛиста.Номер;
				ДокументУпаковочногоЛистаТиповой.Упаковал = ДокументУпаковочногоЛиста.Ответственный;
				ДокументУпаковочногоЛистаТиповой.СкладУпаковки = СсылкаНаДок.ИсходныйДокумент.Склад;
				
				Если СсылкаНаДок.Шаблон.ВидДокумента = "РасходныйОрдерНаТовары" тогда 
					
					Модуль_ОбщегоНазначения = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначения");
					Модуль_ПрефиксацияОбъектовКлиентСервер = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ПрефиксацияОбъектовКлиентСервер");
					РеквизитыОрдера = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДок.ИсходныйДокумент, "Получатель, Номер");
					Основание = НСтр("ru = '%Получатель% / Ордер %Номер%'");
					Основание = СтрЗаменить(Основание,"%Получатель%",РеквизитыОрдера.Получатель);
					Основание = СтрЗаменить(Основание,"%Номер%",Модуль_ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РеквизитыОрдера.Номер));	
					ДокументУпаковочногоЛистаТиповой.Основание =  Основание;
				Иначе
					Если ЗначениеЗаполнено(СсылкаНаДок.ИсходныйДокумент) тогда
						ДокументУпаковочногоЛистаТиповой.Основание =  СсылкаНаДок.ИсходныйДокумент;
					КонецЕсли;	
				КонецЕсли;
				
				ДокументУпаковочногоЛистаТиповой.Записать();	
				
				ДокументУпаковочногоЛиста.ТиповойУпаковочныйЛист = ДокументУпаковочногоЛистаТиповой.Ссылка;
				ДокументУпаковочногоЛиста.Записать();
			КонецЕсли;	
		Исключение
		КонецПопытки;
		
		Рез = "UPL" + ДокументУпаковочногоЛиста.Номер; 
		
		СтруктураОтвета.Вставить("data", Рез);
		
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);		
	КонецЕсли;
	
КонецФункции

Функция OnPalletScan(SN, UserName, Barcode, DocOutID, Cell, gs1) Экспорт 
	
	ОбъектСписка = Новый Массив; 
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;	
	
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));	
	Исключение		
		СтруктураОтвета.Вставить("Описание", "Не нашли документ.");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;
	
	Если СсылкаНаДок.ПолучитьОбъект()=неопределено Тогда		
		СтруктураОтвета.Вставить("Описание", "Не нашли документ.");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;	
	
	Если Не СсылкаНаДок.ТСД.Пустая() Тогда
		Если СсылкаНаДок.ТСД <> УзелПО Тогда			
			СтруктураОтвета.Вставить("Описание", "Чужой документ.");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	КонецЕсли;	
	
	Если СсылкаНаДок.ДатаЗавершенияСбора<>Дата(1,1,1) Тогда	
		СтруктураОтвета.Вставить("Описание", "Закрытый документ.");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);	
	КонецЕсли;	
	
	Шаблон = СсылкаНаДок.Шаблон;	
	
	Если Шаблон.ИспользоватьМаркировку Тогда		
		Если ДатаМобайл_ОбщийМодуль.ЕстьМДЛП() Тогда
			ЭтоДокументМДЛП = ДатаМобайл_МДЛП.ЭтоДокументМДЛП(Шаблон.ВидДокумента);
		Иначе
			ЭтоДокументМДЛП = Ложь;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(GS1) Тогда
			ПолучитьСодержимоеУпаковки_Маркировка(УзелПО,СсылкаНаДок,ОбъектСписка,GS1,ЭтоДокументМДЛП);
		Иначе	
			ПолучитьСодержимоеУпаковки_Маркировка(УзелПО,СсылкаНаДок,ОбъектСписка,Barcode,ЭтоДокументМДЛП);
		КонецЕсли;		
	КонецЕсли;
	
	Если ОбъектСписка.Количество() = 0 Тогда
		ПолучитьСодержимоеУпаковки_НашУпаковочныйЛист(УзелПО,СсылкаНаДок,ОбъектСписка,Barcode);
	КонецЕсли;
	
	Если ОбъектСписка.Количество() = 0 Тогда
		ПолучитьСодержимоеУпаковки_ТиповойУпаковочныйЛист(УзелПО,СсылкаНаДок,ОбъектСписка,Barcode)
	КонецЕсли;
	
	//Попробуем получить результат маркировки в обычных документах
	Если ОбъектСписка.Количество() = 0 и НЕ Шаблон.ИспользоватьМаркировку Тогда
		Если ДатаМобайл_ОбщийМодуль.ЕстьМаркировка() Тогда		 
			Если ДатаМобайл_ОбщийМодуль.ЕстьМДЛП() Тогда
				ЭтоДокументМДЛП = ДатаМобайл_МДЛП.ЭтоДокументМДЛП(Шаблон.ВидДокумента);
			Иначе
				ЭтоДокументМДЛП = Ложь;
			КонецЕсли;	
			
			ПолучитьСодержимоеУпаковки_Маркировка(УзелПО,СсылкаНаДок,ОбъектСписка,Barcode,ЭтоДокументМДЛП,Истина);

		КонецЕсли;	 
	КонецЕсли;

	
	Возврат  ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

#КонецОбласти

#Область Cells

Функция GetCellContent(SN, UserName, CellBC) Экспорт
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;	
	
	ТипЦен = УзелПО.ТипЦен;
	ВключатьАртикул = УзелПО.ДобавлятьАртикулВНаименование;
	
	ТекущаяЯчейка = ДатаМобайл_ОбщийМодуль.ПолучитьЯчейкуПоКодуИлиШтрихкоду(CellBC);
	
	Если ТекущаяЯчейка.Наименование = "" тогда	
		СтруктураОтвета.Вставить("Описание", "Ячейка по штрихкоду " + CellBC + " не найдена в базе. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Упаковка,
	|	ТоварыВЯчейкахОстатки.Серия,
	|	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток)- СУММА(ТоварыВЯчейкахОстатки.КОтборуОстаток) КАК Количество
	|ПОМЕСТИТЬ ДоступныеТовары
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки КАК ТоварыВЯчейкахОстатки
	|ГДЕ
	|	ТоварыВЯчейкахОстатки.Ячейка = &Ячейка
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Характеристика,
	|	ТоварыВЯчейкахОстатки.Упаковка,
	|	ТоварыВЯчейкахОстатки.Серия
	|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
	//|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.КОтгрузкеОстаток, 0)) КАК ВРезерве,
	//|	ДоступныеТовары.Номенклатура КАК Номенклатура,
	//|	ДоступныеТовары.Характеристика КАК Характеристика,
	//|	ДоступныеТовары.Упаковка КАК Упаковка
	//|ПОМЕСТИТЬ ТоварыСОстатками1С
	//|ИЗ
	//|	ДоступныеТовары КАК ДоступныеТовары
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	//|				,
	//|				(&ВсеСклады
	//|					ИЛИ Склад В (&Склады))
	//|				И (&ВсеПомещения
	//|					ИЛИ Помещение В (&Помещения))) КАК СвободныеОстаткиОстатки
	//|		ПО ДоступныеТовары.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
	//|			И ДоступныеТовары.Характеристика = СвободныеОстаткиОстатки.Характеристика
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ДоступныеТовары.Характеристика,
	//|	ДоступныеТовары.Номенклатура,
	//|	ДоступныеТовары.Упаковка
	//|;
	//|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеТовары.Номенклатура КАК Номенклатура,
	|	ДоступныеТовары.Характеристика КАК Характеристика,
	|	ДоступныеТовары.Упаковка КАК Упаковка,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК ЧИСЛО(19, 2))) КАК Цена
	|ПОМЕСТИТЬ ТоварыСЦенами
	|ИЗ
	|	ДоступныеТовары КАК ДоступныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ВидЦены = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ДоступныеТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ДоступныеТовары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоступныеТовары.Номенклатура,
	|	ДоступныеТовары.Характеристика,
	|	ДоступныеТовары.Упаковка
	|;
	|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|	Ячейки.Номенклатура КАК Номенклатура,
	//|	МАКСИМУМ(ЕСТЬNULL(Ячейки.Ячейка.Наименование, """")) КАК АдресХранения
	//|ПОМЕСТИТЬ СписокЯчеек
	//|ИЗ
	//|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК Ячейки
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Ячейки.Номенклатура
	//|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеТовары.Номенклатура КАК Номенклатура,
	|	ДоступныеТовары.Характеристика КАК Характеристика,
	|    ДоступныеТовары.Серия КАК Серия,
	|	ДоступныеТовары.Упаковка КАК Упаковка,
	|    ДоступныеТовары.Количество КАК Количество,
	//|	0 КАК ВЗадании,
	//|	ТоварыСОстатками1С.ВНаличии КАК ВНаличии,
	//|	ТоварыСОстатками1С.ВРезерве КАК ВРезерве,
	|	ЕСТЬNULL(ТоварыСЦенами.Цена, 0) КАК Цена,
	//|	ЕСТЬNULL(СписокЯчеек.АдресХранения, """") КАК АдресХранения,
	|	ЕСТЬNULL(ДоступныеТовары.Упаковка.Наименование, ДоступныеТовары.Номенклатура.ЕдиницаИзмерения.Наименование) КАК НаименованиеУпаковки,
	|	ЕСТЬNULL(ДоступныеТовары.Упаковка.Числитель, 1) КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА &ВключатьАртикул
	|				И ТИПЗНАЧЕНИЯ(ДоступныеТовары.Номенклатура) = ТИП(Справочник.Номенклатура)
	|			ТОГДА ВЫБОР
	|					КОГДА ДоступныеТовары.Номенклатура.Артикул = """"
	|						ТОГДА """"
	|					ИНАЧЕ ДоступныеТовары.Номенклатура.Артикул + "" ""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ + ДоступныеТовары.Номенклатура.Наименование + "" "" + ЕСТЬNULL(ДоступныеТовары.Характеристика.Наименование, """") КАК НаименованиеТовара,
	|	ЛОЖЬ КАК ЭтоНовыйТовар
	|ИЗ
	|	ДоступныеТовары КАК ДоступныеТовары
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСОстатками1С КАК ТоварыСОстатками1С
	//|		ПО ДоступныеТовары.Номенклатура = ТоварыСОстатками1С.Номенклатура
	//|			И ДоступныеТовары.Характеристика = ТоварыСОстатками1С.Характеристика
	//|			И ДоступныеТовары.Упаковка = ТоварыСОстатками1С.Упаковка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСЦенами КАК ТоварыСЦенами
	|		ПО ДоступныеТовары.Номенклатура = ТоварыСЦенами.Номенклатура
	|			И ДоступныеТовары.Характеристика = ТоварыСЦенами.Характеристика
	|			И ДоступныеТовары.Упаковка = ТоварыСЦенами.Упаковка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ СписокЯчеек КАК СписокЯчеек
	//|		ПО ДоступныеТовары.Номенклатура = СписокЯчеек.Номенклатура
	|";
	
	СкорректироватьЗапросПоЦенообразованию25(Запрос.Текст, "GetCellContent");
	
	Запрос.УстановитьПараметр("Ячейка", ТекущаяЯчейка);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);         	
	Запрос.УстановитьПараметр("ВсеУпаковки", Истина);
	
	СписокСкладов = УзелПО.Склады.ВыгрузитьКолонку("Склад");
	Запрос.УстановитьПараметр("Склады", СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады", СписокСкладов.Количество() = 0);
	
	СписокПомещений = УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	Запрос.УстановитьПараметр("Помещения", СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения", СписокПомещений.Количество() = 0);
	
	Запрос.УстановитьПараметр("ВключатьАртикул", ВключатьАртикул);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Рез = Запрос.Выполнить().Выгрузить(); 
	
	Для Каждого СтрокаДока ИЗ Рез Цикл 
		
		СтрокаДока.Коэффициент = ?(СтрокаДока.Коэффициент = 0, 1, СтрокаДока.Коэффициент);
		Итог = СтрокаДока.Количество*СтрокаДока.Коэффициент;
			
		СтруктураТекущейСтроки = Новый Структура;
		
		ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","scan");
		ОбъектТовара.name = ЧистаяСтрока(СокрП(СтрокаДока.НаименованиеТовара));
		ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(СтрокаДока.Характеристика);
		ОбъектТовара.price = СтрокаДока.Цена;
		Попытка 
			DMUseSN = ПолучитьПризнакУчетаСерий(СтрокаДока.Номенклатура.ВидНоменклатуры, Справочники.Склады.ПустаяСсылка());
		Исключение
			DMUseSN = Ложь;
		КонецПопытки;	
		СформироватьЗаголовкиJSONParamsТовара(УзелПО,ОбъектТовара,СтрокаДока.Номенклатура,СтрокаДока.Характеристика, DMUseSN);
		СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
			
		// Штрихкод
		ТекущийШтрихкод = ПолучитьШтрихкодУпаковки(СтрокаДока.Номенклатура, СтрокаДока.Характеристика, СтрокаДока.Упаковка); 
		Если ЗначениеЗаполнено(ТекущийШтрихкод) тогда
			ОбъектШтрихкода = ПолучитьСтруктуруОбъектаДляHttp("barcode","unit_value");			
			ОбъектШтрихкода.value = ЧистаяСтрока(ТекущийШтрихкод);			
			Попытка ОбъектШтрихкода.unit_name = СтрокаДока.НаименованиеУпаковки; Исключение ОбъектШтрихкода.unit_name = "шт."; КонецПопытки;	
			Если УзелПО.НеИспользоватьПересчетУпаковок Тогда
				ОбъектШтрихкода.unit_coef = 1;
			Иначе	
				ОбъектШтрихкода.unit_coef = СтрокаДока.Коэффициент;
			КонецЕсли;
			СтруктураТекущейСтроки.Вставить("barcode", ОбъектШтрихкода);
		КонецЕсли;	
		
		Попытка
			Если ЗначениеЗаполнено(СтрокаДока.Серия) Тогда
				Шаблон = Новый Структура();
				СтруктураТекущейСтроки.Вставить("СерииРассчитыватьГоденДо", Истина);
				
				sn = ПолучитьЗначениеСерии(Шаблон, СтрокаДока.Номенклатура, СтрокаДока.Серия);
				СтруктураТекущейСтроки.Вставить("sn", sn);
			КонецЕсли;
		Исключение
		КонецПопытки;
							
		limit_qty = 0;
		Если УзелПО.НеОтображатьОстатки тогда
			limit_qty = 0;
		Иначе
			limit_qty=Итог;
		КонецЕсли;
	
		// Количество в базовых
		qty = СтрокаДока.Количество*СтрокаДока.Коэффициент; 
		
		СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
		СтруктураТекущейСтроки.Вставить("qty", qty);
		
		ОбъектСписка.Добавить(СтруктураТекущейСтроки); 
		
	КонецЦикла;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

Функция GetArtCellsSelect(SN, UserName, DocID, ArtID, art_sn) Экспорт 
			
	ОбъектСписка = Новый Массив;	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);	
	Если УзелПО = Неопределено Тогда		
		УзелПО = NewTSD(SN, UserName);		
	КонецЕсли;
	
	Если ArtID = "" Тогда 
		Возврат ПодготовитьОтветJSON(ОбъектСписка);
	КонецЕсли;
			
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocID, 5));	
		ТекущийСклад = СсылкаНаДок.Склад;
		ТекущееПомещение = СсылкаНаДок.Помещение;
	Исключение		
		СтруктураОтвета.Вставить("Описание", "Не нашли документ. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;
	
	Модуль_ОбщегоНазначения = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначения");
	ЗначенияРеквизитовСсылкаНаДок = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДок,"ТСД,ДатаНачалаСбора,ДатаЗавершенияСбора,Шаблон,ИсходныйДокумент,Склад,Помещение");
	ДокТСД = ЗначенияРеквизитовСсылкаНаДок.ТСД;
	ДокДатаНачалаСбора = ЗначенияРеквизитовСсылкаНаДок.ДатаНачалаСбора;
	ДокДатаЗавершенияСбора = ЗначенияРеквизитовСсылкаНаДок.ДатаЗавершенияСбора;
	Шаблон = ЗначенияРеквизитовСсылкаНаДок.Шаблон;
	ИсходныйДокумент = ЗначенияРеквизитовСсылкаНаДок.ИсходныйДокумент;
	ТекущийСклад  = ЗначенияРеквизитовСсылкаНаДок.Склад;
	ТекущееПомещение = ЗначенияРеквизитовСсылкаНаДок.Помещение;

	
	Если Шаблон = Неопределено Тогда	
		СтруктураОтвета.Вставить("Описание", "Не нашли запись документа. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;

	Если Лев(ArtID, 3) = "8U-" Тогда
		лТовар = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(ArtID, 4, 36));
		ИДХК = Сред(ArtID, 40, 36);
		Если ИДХК <> "00000000-0000-0000-0000-000000000000" Тогда
			лХарактеристикаНоменклатуры = XMLЗначение(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"), ИДХК);
		Иначе
			лХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		КонецЕсли;
	Иначе   
		Возврат ПодготовитьОтветJSON(ОбъектСписка);
	КонецЕсли;
	
	
	Если Шаблон.ИспользованиеСерийниковПодбор>0 Тогда
		
		snValues = art_sn;
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("ДокументТСД", СсылкаНаДок);
		СтруктураСтроки.Вставить("ИмяТаблицы", "Select");	
		СтруктураСтроки.Вставить("СерийныйНомер",snValues);
		СтруктураСтроки.Вставить("Номенклатура", лТовар);
		СтруктураСтроки.Вставить("КМСсылка", Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
		СтруктураСтроки.Вставить("KM_DecodedMrc", "");
		СтруктураСтроки.Вставить("СерияСсылка", Справочники.СерииНоменклатуры.ПустаяСсылка());
		
		Попытка ОпределитьСериюВСтрокеДокумента(Шаблон,СтруктураСтроки,Ложь); Исключение КонецПопытки;
		
		лСерия = СтруктураСтроки.СерияСсылка;
		ВсеСерии = Ложь;
	Иначе	
		лСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
		ВсеСерии = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("лТовар", лТовар);  
	
	СписокСкладов = УзелПО.Склады.ВыгрузитьКолонку("Склад");
	Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
		СписокСкладов.Очистить();
		СписокСкладов.Добавить(СсылкаНаДок.Склад);			
	КонецЕсли;	
	Запрос.УстановитьПараметр("Склады",СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество() = 0);
	
	СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
		СписокПомещений.Очистить();
		СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
	КонецЕсли;	
	Запрос.УстановитьПараметр("Помещения",СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество() = 0);
	
	Если Шаблон.ЯчейкиСправочноеРазмещениеПодбор Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	ТоварыВЯчейках.Ячейка КАК Ссылка
		|ИЗ
		|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК ТоварыВЯчейках
		|ГДЕ
		|	ТоварыВЯчейках.Номенклатура = &лТовар
		|   И (&ВсеПомещения ИЛИ ТоварыВЯчейках.Помещение В (&Помещения)) 
		|   И (&ВсеСклады ИЛИ ТоварыВЯчейках.Склад В (&Склады))
		|"; 
		
	Иначе		
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТоварыВЯчейкахОстатки.Ячейка.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки КАК ТоварыВЯчейкахОстатки
		|ГДЕ
		|	ТоварыВЯчейкахОстатки.Номенклатура = &лТовар
		|	И ТоварыВЯчейкахОстатки.Характеристика = &лХарактеристикаНоменклатуры
		|	И (&ВсеСерии ИЛИ ТоварыВЯчейкахОстатки.Серия = &лСерия)
		|	И ТоварыВЯчейкахОстатки.Ячейка.ТипСкладскойЯчейки = &Хранение
		|   И (&ВсеПомещения ИЛИ ТоварыВЯчейкахОстатки.Ячейка.Помещение В (&Помещения)) 
		|   И (&ВсеСклады ИЛИ ТоварыВЯчейкахОстатки.Ячейка.Владелец В (&Склады))";
		
		Запрос.УстановитьПараметр("лХарактеристикаНоменклатуры", лХарактеристикаНоменклатуры);
		Запрос.УстановитьПараметр("ВсеСерии", ВсеСерии);
		Запрос.УстановитьПараметр("лСерия", лСерия);
		Запрос.УстановитьПараметр("Хранение", Перечисления.ТипыСкладскихЯчеек.Хранение);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;	
	Рез = Запрос.Выполнить().Выбрать(); 
	
	Пока Рез.Следующий() Цикл
		
		СтруктураТекущейСтроки = Новый Структура;

		ОбъектЯчейки = ПолучитьСтруктуруОбъектаДляHttp("cell");			

		ОбъектЯчейки.name = ?(УзелПО.ВыгружатьВНаименованиеЯчейки  =0, ЧистаяСтрока(Рез.Ссылка.Наименование), Рез.Ссылка.Код);
		Модуль_ШтрихкодированиеПечатныхФорм = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ШтрихкодированиеПечатныхФорм");
		ОбъектЯчейки.barcode = ?(УзелПО.ВыгружатьВКодЯчейки = 1, Строка(Рез.Ссылка.Код), Строка(Модуль_ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(Рез.Ссылка)));
		
		СтруктураТекущейСтроки.Вставить("cell", ОбъектЯчейки);

		СтруктураТекущейСтроки.Вставить("limit_qty", ПолучитьОстаткиПоЯчейке(УзелПО, ТекущийСклад, лТовар, лХарактеристикаНоменклатуры, Рез.Ссылка));
		СтруктураТекущейСтроки.Вставить("task_qty",  ПолучитьОстаткиПоЯчейке(УзелПО, ТекущийСклад, лТовар, лХарактеристикаНоменклатуры, Рез.Ссылка));
				
		ОбъектСписка.Добавить(СтруктураТекущейСтроки);
		
	КонецЦикла;	
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);

КонецФункции

Функция GetArtCellsInsert(SN, UserName, DocID, ArtID, art_sn) Экспорт 
			
	ОбъектСписка = Новый Массив;	
	СтруктураОтвета = Новый Структура;

	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;

	
	Если ArtID = "" Тогда 
		Возврат ПодготовитьОтветJSON(ОбъектСписка);
	КонецЕсли;
			
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocID, 5));	
		ТекущийСклад = СсылкаНаДок.Склад;
		ТекущееПомещение = СсылкаНаДок.Помещение;
	Исключение			
		СтруктураОтвета.Вставить("Описание", "Не нашли документ. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;
	
	Модуль_ОбщегоНазначения = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначения");
	ЗначенияРеквизитовСсылкаНаДок = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДок,"ТСД,ДатаНачалаСбора,ДатаЗавершенияСбора,Шаблон,ИсходныйДокумент,Склад,Помещение");
	ДокТСД = ЗначенияРеквизитовСсылкаНаДок.ТСД;
	ДокДатаНачалаСбора = ЗначенияРеквизитовСсылкаНаДок.ДатаНачалаСбора;
	ДокДатаЗавершенияСбора = ЗначенияРеквизитовСсылкаНаДок.ДатаЗавершенияСбора;
	Шаблон = ЗначенияРеквизитовСсылкаНаДок.Шаблон;
	ИсходныйДокумент = ЗначенияРеквизитовСсылкаНаДок.ИсходныйДокумент;
	ТекущийСклад  = ЗначенияРеквизитовСсылкаНаДок.Склад;
	ТекущееПомещение = ЗначенияРеквизитовСсылкаНаДок.Помещение;

	
	Если Шаблон = Неопределено Тогда
		СтруктураОтвета.Вставить("Описание", "Не нашли запись документа. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;

	Если Лев(ArtID, 3) = "8U-" Тогда
		лТовар = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(ArtID, 4, 36));
		ИДХК = Сред(ArtID, 40, 36);
		Если ИДХК <> "00000000-0000-0000-0000-000000000000" Тогда
			лХарактеристикаНоменклатуры = XMLЗначение(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"), ИДХК);
		Иначе
			лХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		КонецЕсли;
	Иначе   
		Возврат ПодготовитьОтветJSON(ОбъектСписка);
	КонецЕсли;
	
	
	Если Шаблон.ИспользованиеСерийниковПриемка>0 Тогда
		
		snValues = art_sn;
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("ДокументТСД", СсылкаНаДок);
		СтруктураСтроки.Вставить("ИмяТаблицы", "Insert");	
		СтруктураСтроки.Вставить("СерийныйНомер",snValues);
		СтруктураСтроки.Вставить("Номенклатура", лТовар);
		СтруктураСтроки.Вставить("КМСсылка", Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
		СтруктураСтроки.Вставить("KM_DecodedMrc", "");
		СтруктураСтроки.Вставить("СерияСсылка", Справочники.СерииНоменклатуры.ПустаяСсылка());
		
		Попытка ОпределитьСериюВСтрокеДокумента(Шаблон,СтруктураСтроки,Ложь); Исключение КонецПопытки;
		
		лСерия = СтруктураСтроки.СерияСсылка;
		ВсеСерии = Ложь;
	Иначе	
		лСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
		ВсеСерии = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("лТовар", лТовар);  
	
	СписокСкладов = УзелПО.Склады.ВыгрузитьКолонку("Склад");
	Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
		СписокСкладов.Очистить();
		СписокСкладов.Добавить(СсылкаНаДок.Склад);			
	КонецЕсли;	
	Запрос.УстановитьПараметр("Склады",СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество() = 0);
	
	СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
		СписокПомещений.Очистить();
		СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
	КонецЕсли;	
	Запрос.УстановитьПараметр("Помещения",СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество() = 0);
	
	Если Шаблон.ЯчейкиСправочноеРазмещениеПриемка Тогда
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	ТоварыВЯчейках.Ячейка КАК Ссылка
		|ИЗ
		|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК ТоварыВЯчейках
		|ГДЕ
		|	ТоварыВЯчейках.Номенклатура = &лТовар
		|   И (&ВсеПомещения ИЛИ ТоварыВЯчейках.Помещение В (&Помещения)) 
		|   И (&ВсеСклады ИЛИ ТоварыВЯчейках.Склад В (&Склады))
		|";
		
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТоварыВЯчейкахОстатки.Ячейка.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки КАК ТоварыВЯчейкахОстатки
		|ГДЕ
		|	ТоварыВЯчейкахОстатки.Номенклатура = &лТовар
		|	И ТоварыВЯчейкахОстатки.Характеристика = &лХарактеристикаНоменклатуры
		|	И (&ВсеСерии ИЛИ ТоварыВЯчейкахОстатки.Серия = &лСерия)
		|	И ТоварыВЯчейкахОстатки.Ячейка.ТипСкладскойЯчейки = &Хранение
		|   И (&ВсеПомещения ИЛИ ТоварыВЯчейкахОстатки.Ячейка.Помещение В (&Помещения)) 
		|   И (&ВсеСклады ИЛИ ТоварыВЯчейкахОстатки.Ячейка.Владелец В (&Склады))";
		
		Запрос.УстановитьПараметр("лХарактеристикаНоменклатуры", лХарактеристикаНоменклатуры);
		Запрос.УстановитьПараметр("ВсеСерии", ВсеСерии);
		Запрос.УстановитьПараметр("лСерия", лСерия);
		Запрос.УстановитьПараметр("Хранение", Перечисления.ТипыСкладскихЯчеек.Хранение);		
	КонецЕсли;
						
	Запрос.Текст = ТекстЗапроса;	
	Рез = Запрос.Выполнить().Выбрать();
	
	Пока Рез.Следующий() Цикл
		
		СтруктураТекущейСтроки = Новый Структура;
		
		ОбъектЯчейки = ПолучитьСтруктуруОбъектаДляHttp("cell");
		
		ОбъектЯчейки.name = ?(УзелПО.ВыгружатьВНаименованиеЯчейки  = 0, ЧистаяСтрока(Рез.Ссылка.Наименование), Рез.Ссылка.Код);
		Модуль_ШтрихкодированиеПечатныхФорм = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ШтрихкодированиеПечатныхФорм");
		ОбъектЯчейки.barcode = ?(УзелПО.ВыгружатьВКодЯчейки = 1, Строка(Рез.Ссылка.Код), Строка(Модуль_ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(Рез.Ссылка)));

		СтруктураТекущейСтроки.Вставить("cell", ОбъектЯчейки);

		СтруктураТекущейСтроки.Вставить("limit_qty", ПолучитьОстаткиПоЯчейке(УзелПО, ТекущийСклад, лТовар, лХарактеристикаНоменклатуры, Рез.Ссылка));
		СтруктураТекущейСтроки.Вставить("task_qty",  ПолучитьОстаткиПоЯчейке(УзелПО, ТекущийСклад, лТовар, лХарактеристикаНоменклатуры, Рез.Ссылка));
				
		ОбъектСписка.Добавить(СтруктураТекущейСтроки);
	КонецЦикла;	
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);

КонецФункции

Функция GetCells(SN, UserName) Экспорт
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
		
	Если ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО, "ОчиститьЯчейки") Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьФлаговОбменаТСД(УзелПО, "ОчиститьЯчейки", Ложь);	 
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                    |	МестаХраненияИзменения.Ссылка КАК ССылка,
	                    |	МестаХраненияИзменения.Ссылка.Код КАК Код,
	                    |	0 КАК Task,
	                    |	МестаХраненияИзменения.Ссылка.Наименование КАК Описание
	                    |ИЗ
	                    |	Справочник.СкладскиеЯчейки КАК МестаХраненияИзменения
	                    |ГДЕ
	                    |	НЕ МестаХраненияИзменения.Ссылка.ПометкаУдаления
	                    |	И НЕ МестаХраненияИзменения.Ссылка.ЭтоГруппа
						|	И (&ВсеСклады ИЛИ МестаХраненияИзменения.Владелец В (&Склады))
						|	И (&ВсеПомещения ИЛИ МестаХраненияИзменения.Помещение В (&Помещения))
						|	И (МестаХраненияИзменения.Владелец.ИспользоватьАдресноеХранение
						|	ИЛИ МестаХраненияИзменения.Помещение.ИспользоватьАдресноеХранение)");
	
	СписокСкладов = УзелПО.Склады.ВыгрузитьКолонку("Склад");
	Запрос.УстановитьПараметр("Склады", СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады", СписокСкладов.Количество() = 0);

	СписокПомещений = УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	Запрос.УстановитьПараметр("Помещения", СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения", СписокПомещений.Количество() = 0);
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		ОбъектЯчейки = ПолучитьСтруктуруОбъектаДляHttp("cell");

		ОбъектЯчейки.Name	  = ?(УзелПО.ВыгружатьВНаименованиеЯчейки = 0,ЧистаяСтрока(Рез.Описание), Рез.Код);
		Модуль_ШтрихкодированиеПечатныхФорм = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ШтрихкодированиеПечатныхФорм");	
		ОбъектЯчейки.Barcode = ?(УзелПО.ВыгружатьВКодЯчейки = 1,Строка(Рез.Код), Строка(Модуль_ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(Рез.Ссылка)));
		
		ОбъектСписка.Добавить(ОбъектЯчейки);
	КонецЦикла;	
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

Функция OnCellScanSelect(SN, UserName, DocOutID, CellBC, ArtID, Barcode) Экспорт
	
	СтруктураОтвета = Новый Структура;

	УзелПО = НайтиУзел(SN);	
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));	
	Исключение			
		СтруктураОтвета.Вставить("Описание", "Не нашли документ. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецПопытки;
	
	Шаблон = СсылкаНаДок.Шаблон;	
		
	ТекущаяЯчейка = ДатаМобайл_ОбщийМодуль.ПолучитьЯчейкуПоКодуИлиШтрихкоду(CellBC);
	
	// обработка справочного размещения по товару
	Если Шаблон.ЯчейкиСправочноеРазмещениеПодбор Тогда
		ТекстОписания = "";
		Рез = ЯчейкиСправочноеРазмещениеПоТоваруОбработать(УзелПО, CellBC, ArtID, Barcode, ТекущаяЯчейка, ТекстОписания);
		
		Если НЕ Рез Тогда
			СтруктураОтвета.Вставить("Описание", ТекстОписания);		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяЯчейка.Наименование) и НЕ ЗначениеЗаполнено(ТекущаяЯчейка.Код) Тогда		
		СтруктураОтвета.Вставить("Описание", "Ячейка по штрихкоду " + CellBC + " не найдена в базе. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецЕсли;
	
	
	СтруктураТекущейСтроки = Новый Структура;
	
	ОбъектЯчейки = ПолучитьСтруктуруОбъектаДляHttp("cell");	
	ОбъектЯчейки.name = ?(УзелПО.ВыгружатьВНаименованиеЯчейки = 0,ЧистаяСтрока(ТекущаяЯчейка.Наименование), ТекущаяЯчейка.Код);
	ОбъектЯчейки.barcode = CellBC;
	
	СтруктураТекущейСтроки.Вставить("cell", ОбъектЯчейки);
	
	СтруктураТекущейСтроки.Вставить("task_qty", 0);
	СтруктураТекущейСтроки.Вставить("limit_qty", 0);
	
	Попытка
		ТекущийСклад = СсылкаНаДок.ИсходныйДокумент.Склад;
		НашлиЗадание = Истина;
	Исключение	
		ТекущийСклад = Справочники.Склады.ПустаяСсылка();
		НашлиЗадание = Ложь;
	КонецПопытки;
	
	ЭтоВводЯчеекДоТовара = ?((СсылкаНаДок.Шаблон.ВыгрузкаЯчеекПодбор = 0), Истина, Ложь);

	
	Попытка
		Если ЭтоВводЯчеекДоТовара Тогда  //ПО ЯЧЕЙКЕ НЕ НУЖНА ИНФО ПО ЗАДАНИЮ И ОСТАТКАМ
			
			Возврат ПодготовитьОтветJSON(СтруктураТекущейСтроки);

		Иначе
			
				Если Лев(ArtID, 3) = "8U-" Тогда
					лТовар = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(ArtID, 4, 36));
					ИДХК = Сред(ArtID, 40, 36);
					Если ИДХК <> "00000000-0000-0000-0000-000000000000" Тогда
						лХарактеристикаНоменклатуры = XMLЗначение(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"), ИДХК);
					Иначе
						лХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
					КонецЕсли;	
				Иначе 
					
					Возврат ПодготовитьОтветJSON(СтруктураТекущейСтроки);
					
				КонецЕсли;

			//ОСТАТКИ	
			СтруктураТекущейСтроки.limit_qty = ПолучитьОстаткиПоЯчейке(УзелПО,ТекущийСклад,лТовар,лХарактеристикаНоменклатуры,ТекущаяЯчейка);
			
			Если НЕ НашлиЗадание Тогда  //ПО ЯЧЕЙКЕ НЕ НУЖНА ИНФО ПО ЗАДАНИЮ
				
				Возврат ПодготовитьОтветJSON(СтруктураТекущейСтроки);
	
			Иначе
		
				//ЗАДАНИЕ
				Попытка СтруктураТекущейСтроки.task_qty = ПолучитьЗаданиеПоЯчейке(УзелПО, СсылкаНаДок, лТовар, лХарактеристикаНоменклатуры, ТекущаяЯчейка,"Select"); Исключение КонецПопытки;		
			КонецЕсли;	
		КонецЕсли;	
		
	Исключение	
	КонецПопытки;	
	
	//ЗАПИСЬ	
	Если НЕ Шаблон.ГрупповаяРабота Тогда
		//ОБЫЧНАЯ ЛОГИКА
		Если НЕ ЗначениеЗаполнено(СсылкаНаДок.ДатаНачалаСбора) ИЛИ НЕ ЗначениеЗаполнено(СсылкаНаДок.ТСД) Тогда
			
			Попытка
				Объект = СсылкаНаДок.ПолучитьОбъект();
				Объект.ДатаНачалаСбора = ТекущаяДата();
				Объект.ТСД = УзелПО;
				
				Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
				Объект.ОбменДанными.Получатели.Очистить();
				Объект.ОбменДанными.Получатели.Заполнить();
				Объект.ОбменДанными.Получатели.Удалить(УзелПО);
				Объект.Записать();
				
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	Иначе
		//ГРУППОВОЙ ДОКУМЕНТ
		
		ДатаСбораПоТСД = ДатаМобайл_ОбщийМодуль.ПолучитьДатуГрупповогоДокумента(SN, СсылкаНаДок, "ДатаНачалаСбора");	
		Если НЕ ЗначениеЗаполнено(ДатаСбораПоТСД) Тогда	
			ДатаМобайл_ОбщийМодуль.СоздатьНачальнуюЗаписьТСДГрупповыхДокументов(SN, СсылкаНаДок, UserName);		
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СсылкаНаДок.ДатаНачалаСбора) Тогда
			Попытка
				Объект = СсылкаНаДок.ПолучитьОбъект();
				Объект.ДатаНачалаСбора = ТекущаяДата();
				
				Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
				Объект.ОбменДанными.Получатели.Очистить();
				Объект.ОбменДанными.Получатели.Заполнить();
				Объект.ОбменДанными.Получатели.Удалить(УзелПО);
				Объект.Записать();
			Исключение
			КонецПопытки;	
		КонецЕсли;
	КонецЕсли;	

	Возврат ПодготовитьОтветJSON(СтруктураТекущейСтроки);
		
КонецФункции

Функция OnCellScanInsert(SN, UserName, DocOutID, CellBC, ArtID, Barcode) Экспорт
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО=НайтиУзел(SN);
	Если УзелПО=Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));
	Исключение			
		СтруктураОтвета.Вставить("Описание", "Не нашли документ. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;
	Шаблон = СсылкаНаДок.Шаблон;
	
	ТекущаяЯчейка = ДатаМобайл_ОбщийМодуль.ПолучитьЯчейкуПоКодуИлиШтрихкоду(CellBC);
	
	// обработка справочного размещения по товару
	Если Шаблон.ЯчейкиСправочноеРазмещениеПриемка и СокрЛП(УзелПО.ШтрихкодОчисткиСправочногоРазмещенияЯчеек) = CellBC Тогда
		ТекстОписания = "";
		Рез = ЯчейкиСправочноеРазмещениеПоТоваруОбработать(УзелПО, CellBC, ArtID, Barcode, ТекущаяЯчейка, ТекстОписания);
		
		Если НЕ Рез Тогда
			СтруктураОтвета.Вставить("Описание", ТекстОписания);		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;		
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ТекущаяЯчейка.Наименование) и НЕ ЗначениеЗаполнено(ТекущаяЯчейка.Код) Тогда		
		СтруктураОтвета.Вставить("Описание", "Ячейка по штрихкоду " + CellBC + " не найдена в базе.");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецЕсли;
	
	
	СтруктураТекущейСтроки = Новый Структура;
	
	ОбъектЯчейки = ПолучитьСтруктуруОбъектаДляHttp("cell");	
	ОбъектЯчейки.name = ?(УзелПО.ВыгружатьВНаименованиеЯчейки = 0,ЧистаяСтрока(ТекущаяЯчейка.Наименование), ТекущаяЯчейка.Код);
	ОбъектЯчейки.barcode = CellBC;
	
	СтруктураТекущейСтроки.Вставить("cell", ОбъектЯчейки);
	
	СтруктураТекущейСтроки.Вставить("task_qty", 0);
	СтруктураТекущейСтроки.Вставить("limit_qty", 0);

	
	Попытка
		ТекущийСклад=СсылкаНаДок.ИсходныйДокумент.Склад;
		НашлиЗадание = Истина;
	Исключение
		ТекущийСклад=Справочники.Склады.ПустаяСсылка();
		НашлиЗадание = Ложь;
	КонецПопытки;
	
		ЭтоВводЯчеекДоТовара = ?((СсылкаНаДок.Шаблон.ВыгрузкаЯчеекПриемка = 0), Истина, Ложь);
		ЭтоРазмещениеПоПодбору = СсылкаНаДок.Шаблон.ПриемкаПоПодбору;

	
	Попытка
		Если ЭтоВводЯчеекДоТовара ИЛИ ЭтоРазмещениеПоПодбору Тогда  //ПО ЯЧЕЙКЕ НЕ НУЖНА ИНФО ПО ЗАДАНИЮ И ОСТАТКАМ
			Возврат ПодготовитьОтветJSON(СтруктураТекущейСтроки);
		Иначе
			
			
				Если Лев(ArtID,3)="8U-" Тогда
					лТовар = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(ArtID, 4, 36));
					ИДХК=Сред(ArtID,40,36);
					Если ИДХК<>"00000000-0000-0000-0000-000000000000" Тогда
						лХарактеристикаНоменклатуры = XMLЗначение(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"), ИДХК);     
					Иначе
						лХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
					КонецЕсли;	
				Иначе 
					Возврат ПодготовитьОтветJSON(СтруктураТекущейСтроки);
				КонецЕсли;

			
			//ОСТАТКИ	
			СтруктураТекущейСтроки.limit_qty =  ПолучитьОстаткиПоЯчейке(УзелПО,ТекущийСклад,лТовар,лХарактеристикаНоменклатуры,ТекущаяЯчейка);
			
			Если НЕ НашлиЗадание Тогда  //ПО ЯЧЕЙКЕ НЕ НУЖНА ИНФО ПО ЗАДАНИЮ
				
				Возврат ПодготовитьОтветJSON(СтруктураТекущейСтроки);	
				
			Иначе

				Попытка
					//ОСТАТКИ ПРИ РАЗМЕЩЕНИИ ИЗ ЗОНЫ ПРИЕМКИ
					ЯчейкаЗоныПриемки = СсылкаНаДок.ИсходныйДокумент.ЗонаПриемки;
	                Если СсылкаНаДок.ИсходныйДокумент.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Размещение И НЕ ЯчейкаЗоныПриемки.Пустая() Тогда
						СтруктураТекущейСтроки.limit_qty =  ПолучитьОстаткиПоЯчейке(УзелПО,ТекущийСклад,лТовар,лХарактеристикаНоменклатуры,ЯчейкаЗоныПриемки);
					КонецЕсли;
				Исключение
				КонецПопытки;
				
				//ЗАДАНИЕ
				Попытка СтруктураТекущейСтроки.task_qty = ПолучитьЗаданиеПоЯчейке(УзелПО,СсылкаНаДок,лТовар,лХарактеристикаНоменклатуры,ТекущаяЯчейка,"Insert"); Исключение КонецПопытки;
	
			КонецЕсли;	
		КонецЕсли;	
		
	Исключение	
	КонецПопытки;

	
	//ЗАПИСЬ	
	Если НЕ Шаблон.ГрупповаяРабота Тогда
		//ОБЫЧНАЯ ЛОГИКА
		Если Не ЗначениеЗаполнено(СсылкаНаДок.ДатаНачалаСбора) Или Не ЗначениеЗаполнено(СсылкаНаДок.ТСД) Тогда
			
			Попытка
				Объект=СсылкаНаДок.ПолучитьОбъект();
				Объект.ДатаНачалаСбора=ТекущаяДата();
				Объект.ТСД=УзелПО;
				
				Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
				Объект.ОбменДанными.Получатели.Очистить();
				Объект.ОбменДанными.Получатели.Заполнить();
				Объект.ОбменДанными.Получатели.Удалить(УзелПО);
				Объект.Записать();
				
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	Иначе
		//ГРУППОВОЙ ДОКУМЕНТ
		
		ДатаСбораПоТСД = ДатаМобайл_ОбщийМодуль.ПолучитьДатуГрупповогоДокумента(SN, СсылкаНаДок, "ДатаНачалаСбора");	
		Если Не ЗначениеЗаполнено(ДатаСбораПоТСД) Тогда	
			ДатаМобайл_ОбщийМодуль.СоздатьНачальнуюЗаписьТСДГрупповыхДокументов(SN, СсылкаНаДок, UserName);		
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СсылкаНаДок.ДатаНачалаСбора) Тогда
			Попытка
				Объект = СсылкаНаДок.ПолучитьОбъект();
				Объект.ДатаНачалаСбора=ТекущаяДата();
				
				Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
				Объект.ОбменДанными.Получатели.Очистить();
				Объект.ОбменДанными.Получатели.Заполнить();
				Объект.ОбменДанными.Получатели.Удалить(УзелПО);
				Объект.Записать();
			Исключение
			КонецПопытки;	
		КонецЕсли;
	КонецЕсли;	
	
	Возврат ПодготовитьОтветJSON(СтруктураТекущейСтроки);	
	
КонецФункции

#КонецОбласти

#Область Units

Функция GetUnits(SN, UserName) Экспорт 
	
	ОбъектСписка = Новый Массив;  
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Если ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО, "ОчиститьЕдиницыИзмерения") Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьФлаговОбменаТСД(УзелПО, "ОчиститьЕдиницыИзмерения", Ложь);	 
	КонецЕсли;
	
		                                                        
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ	
	|	УпаковкиЕдиницыИзмеренияИзменения.Ссылка КАК Ссылка,
	|	ВЫРАЗИТЬ(УпаковкиЕдиницыИзмеренияИзменения.Наименование КАК СТРОКА(10)) КАК Наименование,
	|	ВЫБОР КОГДА ВЫРАЗИТЬ(УпаковкиЕдиницыИзмеренияИзменения.Наименование КАК СТРОКА(2)) = ""шт"" ТОГДА 1
	|	ИНАЧЕ ВЫБОР КОГДА ВЫРАЗИТЬ(УпаковкиЕдиницыИзмеренияИзменения.Наименование КАК СТРОКА(10)) ПОДОБНО (""%шт%"") ТОГДА 2
	|	ИНАЧЕ 3 КОНЕЦ
	|	КОНЕЦ КАК Приоритет
	|ПОМЕСТИТЬ тЕдиницы
	|ИЗ
	|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмеренияИзменения
	|ГДЕ
	|	УпаковкиЕдиницыИзмеренияИзменения.Владелец = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.БазовыеЕдиницыИзмерения)
	//|	И УпаковкиЕдиницыИзмеренияИзменения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тЕдиницы.Ссылка,
	|	тЕдиницы.Наименование,
	|	тЕдиницы.Приоритет
	|ИЗ
	|	тЕдиницы КАК тЕдиницы
	|
	|СГРУППИРОВАТЬ ПО
	|	тЕдиницы.Ссылка,
	|	тЕдиницы.Наименование,
	|	тЕдиницы.Приоритет
	|УПОРЯДОЧИТЬ ПО
	|	тЕдиницы.Приоритет ВОЗР";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОбъектЕдиницыИзмерения = ПолучитьСтруктуруОбъектаДляHttp("unit");
		
		ОбъектЕдиницыИзмерения.id = XMLСтрока(Выборка.Ссылка);
		ОбъектЕдиницыИзмерения.name = ЧистаяСтрока(Выборка.Наименование);
		
		ОбъектСписка.Добавить(ОбъектЕдиницыИзмерения);

	КонецЦикла;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);

КонецФункции

#КонецОбласти

#Область Clients

Функция GetClients(SN, UserName) Экспорт

	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;

	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
		
	Если ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО, "ОчиститьКлиентов") Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьФлаговОбменаТСД(УзелПО, "ОчиститьКлиентов", Ложь);	 
	КонецЕсли;
	
	Если  УзелПО.ВыгружатьСкладыКакКонтрагентов <> 2 И УзелПО.ВыгружатьПодразделенияКакКонтрагентов <> 2 Тогда

	Попытка				
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ПартнерыИзменения.Наименование КАК Строка(100)) КАК Name,
		|	ПартнерыИзменения.Ссылка КАК Ссылка,
		|	МАКСИМУМ(ПартнерыИзменения.Ссылка.Код) КАК Barcode,
		|	МАКСИМУМ(ЕстьNULL(СправочникКонтрагенты.Ссылка,ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))) КАК СсылкаКонтрагент
		|ИЗ
		|	Справочник.Партнеры КАК ПартнерыИзменения
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СправочникКонтрагенты
		|	ПО ПартнерыИзменения.Ссылка = СправочникКонтрагенты.Партнер	
		|ГДЕ
		|	НЕ ПартнерыИзменения.Ссылка.ПометкаУдаления
		|СГРУППИРОВАТЬ ПО 
		|	ВЫРАЗИТЬ(ПартнерыИзменения.Наименование КАК Строка(100)),
		|	ПартнерыИзменения.Ссылка
		|УПОРЯДОЧИТЬ ПО
		|	ПартнерыИзменения.Наименование");
				
		
		Рез = Запрос.Выполнить().Выбрать();
		Пока Рез.Следующий() цикл
			ОбъектКлиента = ПолучитьСтруктуруОбъектаДляHttp("client");
			ОбъектКлиента.id = "8k-" + XMLСтрока(Рез.Ссылка);
			ОбъектКлиента.name = Рез.Name;
			Попытка ОбъектКлиента.barcode = Рез.СсылкаКонтрагент.ИНН; Исключение КонецПопытки;
			
			ОбъектСписка.Добавить(ОбъектКлиента);
		КонецЦикла;			
	Исключение
	КонецПопытки;
	
	Попытка
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ПартнерыИзменения.Наименование КАК Строка(100)) КАК Name,
		|	ПартнерыИзменения.Ссылка КАК Ссылка,
		|	"""" КАК Barcode
		|ИЗ
		|	Справочник.КлассификаторОрганизацийЕГАИС КАК ПартнерыИзменения
		|ГДЕ
		|	НЕ ПартнерыИзменения.Ссылка.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		|	ПартнерыИзменения.Наименование");
		
		Если ДатаМобайл_ОбщийМодуль.ЕстьАСТ() Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "КлассификаторОрганизацийЕГАИС", "астКонтрагентыЕГАИС");
			
		ИначеЕсли ДатаМобайл_ОбщийМодуль.ЕстьКТ2000() Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "КлассификаторОрганизацийЕГАИС", "алкКлассификаторОрганизацийЕГАИС");
		КонецЕсли;

		Рез = Запрос.Выполнить().Выбрать();
		Пока Рез.Следующий() Цикл
			ОбъектКлиента = ПолучитьСтруктуруОбъектаДляHttp("client");
			ОбъектКлиента.id = "8k-" + XMLСтрока(Рез.Ссылка);
			ОбъектКлиента.name = Рез.Name;
			
			ОбъектСписка.Добавить(ОбъектКлиента);
		КонецЦикла;
	Исключение
	КонецПопытки;
	
	КонецЕсли;

	Попытка
		Если  УзелПО.ВыгружатьСкладыКакКонтрагентов > 0 Тогда
			Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВЫРАЗИТЬ(Склады.Наименование КАК Строка(100)) КАК Name,
			|	Склады.Ссылка КАК Ссылка,
			|	"""" КАК Barcode
			|ИЗ
			|	Справочник.Склады КАК Склады
			|ГДЕ
			|	НЕ Склады.Ссылка.ПометкаУдаления
			|	И НЕ Склады.Ссылка.ЭтоГруппа
			|	И (&ВсеСклады ИЛИ Склады.Ссылка В (&Склады))
			|УПОРЯДОЧИТЬ ПО
			|	Склады.Наименование");
			
			СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
			Запрос.УстановитьПараметр("Склады",СписокСкладов);
			Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);

			Рез = Запрос.Выполнить().Выбрать();
			
			Пока Рез.Следующий() Цикл
			ОбъектКлиента = ПолучитьСтруктуруОбъектаДляHttp("client");
			ОбъектКлиента.id = "8k-" + XMLСтрока(Рез.Ссылка);
			ОбъектКлиента.name = Рез.Name;
			
			ОбъектСписка.Добавить(ОбъектКлиента);

			КонецЦикла;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Если УзелПО.ВыгружатьПодразделенияКакКонтрагентов > 0 тогда
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВЫРАЗИТЬ(Подразделения.Наименование КАК СТРОКА(100)) КАК Name,
			|	Подразделения.Ссылка КАК Ссылка,
			|	"""" КАК Barcode
			|ИЗ
			|	Справочник.СтруктураПредприятия КАК Подразделения
			|ГДЕ
			|	НЕ Подразделения.Ссылка.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	Подразделения.Наименование");
			
			Рез = Запрос.Выполнить().Выбрать();
			Пока Рез.Следующий() Цикл
				ОбъектКлиента = ПолучитьСтруктуруОбъектаДляHttp("client");
				ОбъектКлиента.id = "8k-" + XMLСтрока(Рез.Ссылка);
				ОбъектКлиента.name = Рез.Name;
			КонецЦикла;		
		КонецЕсли;
	Исключение КонецПопытки;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);

КонецФункции

#КонецОбласти

#Область Warehouses

Функция GetWarehouses(SN, UserName) Экспорт 
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;

	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;	
	
	Если ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО, "ОчиститьСклады") Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьФлаговОбменаТСД(УзелПО, "ОчиститьСклады", Ложь);	 
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	
		"ВЫБРАТЬ
		|	Склады.Ссылка КАК Ссылка,
		|	ВЫРАЗИТЬ(Склады.Наименование КАК Строка(100)) КАК Наименование
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
	    |	НЕ Склады.Ссылка.ПометкаУдаления
		|	И НЕ Склады.Ссылка.ЭтоГруппа
		|	И (&ВсеСклады ИЛИ Склады.Ссылка В (&Склады))
		|УПОРЯДОЧИТЬ ПО
		|	Склады.Наименование";
	
	СписокСкладов = УзелПО.Склады.ВыгрузитьКолонку("Склад");
	Запрос.УстановитьПараметр("Склады", СписокСкладов);
		
	Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество() = 0);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбъектСклада = ПолучитьСтруктуруОбъектаДляHttp("warehouse"); 
		
		ОбъектСклада.ID = XMLСтрока(Выборка.Ссылка);
		ОбъектСклада.Name = ЧистаяСтрока(Выборка.Наименование);
		
		ОбъектСписка.Добавить(ОбъектСклада);
		
	КонецЦикла;
		
	Возврат ПодготовитьОтветJSON(ОбъектСписка);

КонецФункции

#КонецОбласти

#Область Templates

Функция GetTemplates(SN,UserName, AppVersion) Экспорт 
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
						|	ДатаМобайл_ШаблоныДокументовИзменения.Ссылка КАК ШаблонСсылка
						|ИЗ
						|	Справочник.ДатаМобайл_ШаблоныДокументов.Изменения КАК ДатаМобайл_ШаблоныДокументовИзменения
						|ГДЕ
						|	(ДатаМобайл_ШаблоныДокументовИзменения.Ссылка В (&СписокШаблонов) ИЛИ &ВсеШаблоны)
						|	И (ДатаМобайл_ШаблоныДокументовИзменения.Узел = &Узел И НЕ ДатаМобайл_ШаблоныДокументовИзменения.НомерСообщения ЕСТЬ NULL)
						|	И НЕ ЕСТЬNULL(ДатаМобайл_ШаблоныДокументовИзменения.Ссылка.ПометкаУдаления,ИСТИНА)");
	
	Запрос.УстановитьПараметр("СписокШаблонов", УзелПО.Шаблоны.ВыгрузитьКолонку("Шаблон"));
	Запрос.УстановитьПараметр("ВсеШаблоны", УзелПО.Шаблоны.Количество()=0);

	Если ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьШаблоны") Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьФлаговОбменаТСД(УзелПО,"ОчиститьШаблоны", Ложь);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.ДатаМобайл_ШаблоныДокументов.Изменения","Справочник.ДатаМобайл_ШаблоныДокументов");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И (ДатаМобайл_ШаблоныДокументовИзменения.Узел = &Узел И НЕ ДатаМобайл_ШаблоныДокументовИзменения.НомерСообщения ЕСТЬ NULL)","");
		Рез = Запрос.Выполнить().Выбрать();
		Пока Рез.Следующий() цикл
			ОбъектШаблона = ПолучитьСтруктуруОбъектаДляHttp("template");
			ЗаполнитьОбъектШаблона(ОбъектШаблона, Рез.ШаблонСсылка, AppVersion);
			ОбъектСписка.Добавить(ОбъектШаблона);
		КонецЦикла;		
	Иначе 	
		ПланыОбмена.ВыбратьИзменения(УзелПО, 1, Метаданные.Справочники.ДатаМобайл_ШаблоныДокументов);
		Запрос.УстановитьПараметр("Узел", УзелПО);
		Рез = Запрос.Выполнить().Выбрать();
		Пока Рез.Следующий() цикл
			ОбъектШаблона = ПолучитьСтруктуруОбъектаДляHttp("template");
			ЗаполнитьОбъектШаблона(ОбъектШаблона,Рез.ШаблонСсылка, AppVersion);
			ОбъектСписка.Добавить(ОбъектШаблона);
		КонецЦикла;	
		Попытка ПланыОбмена.УдалитьРегистрациюИзменений(УзелПО, Метаданные.Справочники.ДатаМобайл_ШаблоныДокументов); Исключение КонецПопытки;	
	КонецЕсли;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

#КонецОбласти

#Область Barcode_Templates

Функция GetBarcodeTemplates(SN, username) Экспорт 
	
	МассивОбъектов = Новый Массив;	
	СтруктураОтвета = Новый Структура;

	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Если ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО, "ОчиститьШаблоныШтрихкодов") Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьФлаговОбменаТСД(УзелПО, "ОчиститьШаблоныШтрихкодов", Ложь);	 
	КонецЕсли;
	СтруктураЗапроса = Новый Структура;
	
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДатаМобайл_СписокТСДШаблоныШтрихкодов.Тип КАК Тип,
	|		ДатаМобайл_СписокТСДШаблоныШтрихкодов.ОбщаяДлина КАК ОбщаяДлина,
	|		ДатаМобайл_СписокТСДШаблоныШтрихкодов.ТипШтрихкода КАК ТипШтрихкода,
	|		ДатаМобайл_СписокТСДШаблоныШтрихкодов.Префикс КАК Префикс,
	|		ДатаМобайл_СписокТСДШаблоныШтрихкодов.НачальныйСимволШтрихкода КАК НачальныйСимволШтрихкода,
	|		ДатаМобайл_СписокТСДШаблоныШтрихкодов.КонечныйСимволШтрихкода КАК КонечныйСимволШтрихкода,
	|		ДатаМобайл_СписокТСДШаблоныШтрихкодов.НачальныйСимволКилограмм КАК НачальныйСимволКилограмм,
	|		ДатаМобайл_СписокТСДШаблоныШтрихкодов.КонечныйСимволКилограмм КАК КонечныйСимволКилограмм,
	|		ДатаМобайл_СписокТСДШаблоныШтрихкодов.НачальныйСимволГрамм КАК НачальныйСимволГрамм,
	|		ДатаМобайл_СписокТСДШаблоныШтрихкодов.КонечныйСимволГрамм КАК КонечныйСимволГрамм,
	|		ДатаМобайл_СписокТСДШаблоныШтрихкодов.НачальныйСимволСерийныйНомер КАК НачальныйСимволСерийныйНомер,
	|		ДатаМобайл_СписокТСДШаблоныШтрихкодов.КонечныйСимволСерийныйНомер КАК КонечныйСимволСерийныйНомер,
	|		ДатаМобайл_СписокТСДШаблоныШтрихкодов.НачальныйСимволКоличество КАК НачальныйСимволКоличество,
	|		ДатаМобайл_СписокТСДШаблоныШтрихкодов.КонечныйСимволКоличество КАК КонечныйСимволКоличество
	|	ИЗ
	|		ПланОбмена.ДатаМобайл_СписокТСД.ШаблоныШтрихкодов КАК ДатаМобайл_СписокТСДШаблоныШтрихкодов
	|	ГДЕ
	|		ДатаМобайл_СписокТСДШаблоныШтрихкодов.Ссылка = &Узел");
	
	Запрос.УстановитьПараметр("Узел", УзелПО.Ссылка);
	Рез = Запрос.Выполнить().Выбрать();
		
	МассивСтрок = Новый Массив;
	
	Пока Рез.Следующий() цикл
		
		ОбъектШаблонаШК = ПолучитьСтруктуруОбъектаДляHttp("barcode_template");
		
		ОбъектШаблонаШК.type_id = Рез.Тип;
		ОбъектШаблонаШК.length = Рез.ОбщаяДлина;
		ОбъектШаблонаШК.barcode_type_id = Рез.ТипШтрихкода;
		ОбъектШаблонаШК.prefix = Рез.Префикс;
		
		Если ЗначениеЗаполнено(Рез.НачальныйСимволШтрихкода) или ЗначениеЗаполнено(Рез.КонечныйСимволШтрихкода) тогда
			ОбъектШаблонаШК.Вставить("bc_segment",Новый Структура);
			
			ОбъектШаблонаШК.bc_segment.Вставить("start",Рез.НачальныйСимволШтрихкода);
			ОбъектШаблонаШК.bc_segment.Вставить("end",Рез.КонечныйСимволШтрихкода);
		КонецЕсли;
	
		Если ЗначениеЗаполнено(Рез.НачальныйСимволКилограмм) или ЗначениеЗаполнено(Рез.КонечныйСимволКилограмм) тогда
			ОбъектШаблонаШК.Вставить("kg_segment",Новый Структура);
			
			ОбъектШаблонаШК.kg_segment.Вставить("start",Рез.НачальныйСимволКилограмм);
			ОбъектШаблонаШК.kg_segment.Вставить("end",Рез.КонечныйСимволКилограмм);
		КонецЕсли;

	 	Если ЗначениеЗаполнено(Рез.НачальныйСимволГрамм) или ЗначениеЗаполнено(Рез.КонечныйСимволГрамм) тогда
			ОбъектШаблонаШК.Вставить("gm_segment",Новый Структура);
			
			ОбъектШаблонаШК.gm_segment.Вставить("start",Рез.НачальныйСимволГрамм);
			ОбъектШаблонаШК.gm_segment.Вставить("end",Рез.КонечныйСимволГрамм);
		КонецЕсли;

		Если ЗначениеЗаполнено(Рез.НачальныйСимволСерийныйНомер) или ЗначениеЗаполнено(Рез.КонечныйСимволСерийныйНомер) тогда
			ОбъектШаблонаШК.Вставить("sn_segment",Новый Структура);
			
			ОбъектШаблонаШК.sn_segment.Вставить("start",Рез.НачальныйСимволСерийныйНомер);
			ОбъектШаблонаШК.sn_segment.Вставить("end",Рез.КонечныйСимволСерийныйНомер);
		КонецЕсли;

		Если ЗначениеЗаполнено(Рез.НачальныйСимволКоличество) или ЗначениеЗаполнено(Рез.КонечныйСимволКоличество) тогда
			ОбъектШаблонаШК.Вставить("qty_segment",Новый Структура);
			
			ОбъектШаблонаШК.qty_segment.Вставить("start",Рез.НачальныйСимволКоличество);
			ОбъектШаблонаШК.qty_segment.Вставить("end",Рез.КонечныйСимволКоличество);
		КонецЕсли;
		
		МассивОбъектов.Добавить(ОбъектШаблонаШК);
		
	КонецЦикла;	
	
	Возврат ПодготовитьОтветJSON(МассивОбъектов);	
	
КонецФункции

#КонецОбласти

#Область Forms

Функция GetDocSteps(SN, UserName) Экспорт
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Если ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьДополнительныеФормы") Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьФлаговОбменаТСД(УзелПО,"ОчиститьДополнительныеФормы", Ложь);	 
	КонецЕсли;
	
	Попытка ПланыОбмена.УдалитьРегистрациюИзменений(УзелПО, Метаданные.РегистрыСведений.ДатаМобайл_СвязиДополнительныхФормИШаблонов); Исключение КонецПопытки;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.Порядок КАК DMSortNumber,
		|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.Шаблон.Код КАК DMTemplateId,
		|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.ДополнительнаяФорма.Ссылка КАК ДополнительнаяФорма,
		|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.ПроверятьЗаполнение КАК DMCheckFill,
		|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.РеквизитИзШапки КАК DMIsDocArg
		|ИЗ
		|	РегистрСведений.ДатаМобайл_СвязиДополнительныхФормИШаблонов КАК ДатаМобайл_СвязиДополнительныхФормИШаблонов
		|ГДЕ
		|	НЕ ДатаМобайл_СвязиДополнительныхФормИШаблонов.Шаблон.Ссылка ЕСТЬ NULL
		|	И НЕ ДатаМобайл_СвязиДополнительныхФормИШаблонов.ДополнительнаяФорма.Ссылка ЕСТЬ NULL
		|	И ДатаМобайл_СвязиДополнительныхФормИШаблонов.Шаблон.ИспользоватьДопФормы";
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		ОбъектСвязьДополнительнойФормыИШаблона = ПолучитьСтруктуруОбъектаДляHttp("doc_form");
		ОбъектСвязьДополнительнойФормыИШаблона.id = XMLСтрока(Выборка.ДополнительнаяФорма);		
	
		ОбъектСвязьДополнительнойФормыИШаблона.template_id = Выборка.DMTemplateId;
		ОбъектСвязьДополнительнойФормыИШаблона.is_required = Выборка.DMCheckFill;			
		ОбъектСвязьДополнительнойФормыИШаблона.form_type = Выборка.DMIsDocArg;
		
		ОбъектСписка.Добавить(ОбъектСвязьДополнительнойФормыИШаблона);		
	КонецЦикла;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

Функция GetSteps(SN, UserName) Экспорт
	
	ОбъектСписка = Новый Массив;

	УзелПО = НайтиУзел(SN);
	
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Если ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО, "ОчиститьДополнительныеФормы") Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьФлаговОбменаТСД(УзелПО, "ОчиститьДополнительныеФормы", Ложь);	 
	КонецЕсли;
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатаМобайл_ДополнительныеФормы.Ссылка,
		|	ДатаМобайл_ДополнительныеФормы.Наименование,
		|	ДатаМобайл_ДополнительныеФормы.ТипДанных,
		|	ДатаМобайл_ДополнительныеФормы.ИДСправочника
		|ИЗ
		|	Справочник.ДатаМобайл_ДополнительныеФормы КАК ДатаМобайл_ДополнительныеФормы
		|ГДЕ
		|	ДатаМобайл_ДополнительныеФормы.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбъектДополнительнаяФорма = ПолучитьСтруктуруОбъектаДляHttp("step");
		
		ОбъектДополнительнаяФорма.id = XMLСтрока(Выборка.Ссылка);
		ОбъектДополнительнаяФорма.name = ЧистаяСтрока(Выборка.Наименование);
		
		Если Выборка.ТипДанных = "Текст" Тогда
			ТекущийТип = 0;
		ИначеЕсли  Выборка.ТипДанных = "Число" Тогда
			ТекущийТип = 1;
		ИначеЕсли  Выборка.ТипДанных = "Дата" Тогда
			ТекущийТип = 2;
		Иначе
			ТекущийТип = 3;
		КонецЕсли;
		
		ОбъектДополнительнаяФорма.type = ТекущийТип;
		ОбъектДополнительнаяФорма.parent_id = ЧистаяСтрока(Выборка.ИДСправочника);
		ОбъектСписка.Добавить(ОбъектДополнительнаяФорма);
		
	КонецЦикла;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

Функция GetUserBooks(SN, UserName, DMStepId = Неопределено) Экспорт
	
	ОбъектСписка = Новый Массив;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Если ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО,"ОчиститьДополнительныеФормы") Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьФлаговОбменаТСД(УзелПО,"ОчиститьДополнительныеФормы", Ложь);	 
	КонецЕсли;
	
	ЗапросСправочника = Новый Запрос;
	ЗапросСправочника.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДатаМобайл_ДополнительныеФормы.Ссылка КАК ДопФорма,
		|	ДатаМобайл_ДополнительныеФормы.ТипДанных,
		|	ДатаМобайл_ДополнительныеФормы.ИДСправочника
		|ИЗ
		|	Справочник.ДатаМобайл_ДополнительныеФормы КАК ДатаМобайл_ДополнительныеФормы
		|ГДЕ
		|	ДатаМобайл_ДополнительныеФормы.ПометкаУдаления = ЛОЖЬ";
	
	Если НЕ DMStepId = Неопределено И ЗначениеЗаполнено(СокрЛП(DMStepId)) Тогда
		ЗапросСправочника.Текст = ЗапросСправочника.Текст +  "
		|	И ДатаМобайл_ДополнительныеФормы.ИДСправочника = &ИДСпр";
		
		ЗапросСправочника.УстановитьПараметр("ИДСпр", СокрЛП(DMStepId)); 
	КонецЕсли;
	
	РезультатЗапросаСправочника = ЗапросСправочника.Выполнить();
	
	ВыборкаСправочника = РезультатЗапросаСправочника.Выбрать();
	
	Пока ВыборкаСправочника.Следующий() Цикл
		Если НЕ (ВыборкаСправочника.ТипДанных = "Текст" ИЛИ ВыборкаСправочника.ТипДанных = "Число" ИЛИ ВыборкаСправочника.ТипДанных = "Дата") Тогда
			ТекущаяДопФорма= ВыборкаСправочника.ДопФорма;
			Попытка
				Если НЕ Метаданные.Справочники.Найти(ВыборкаСправочника.ТипДанных) = Неопределено Тогда
					Запрос = Новый Запрос;
					Запрос.Текст =
					"ВЫБРАТЬ
					|	Справочник.Ссылка,
					|	Справочник.Наименование
					|ИЗ
					|	Справочник." + СокрЛП(ВыборкаСправочника.ТипДанных) + " КАК Справочник
					|ГДЕ
					|	Справочник.ПометкаУдаления = ЛОЖЬ
					|	И 1=1";
					
					Если ТекущаяДопФорма.Ограничения.Количество() тогда
						Запрос.Текст = СтрЗаменить(Запрос.Текст,"1=1","Справочник.Ссылка В ИЕРАРХИИ (&МассивЭлементовДопФормы)");
						МассивЭлементовДопФормы = ТекущаяДопФорма.Ограничения.ВыгрузитьКолонку("Значения");
						Запрос.УстановитьПараметр("МассивЭлементовДопФормы",МассивЭлементовДопФормы);
					КонецЕсли; 
					
					РезультатЗапроса = Запрос.Выполнить();
					
					Выборка = РезультатЗапроса.Выбрать();
					
					Пока Выборка.Следующий() Цикл
						ОбъектЭлементСправочника = ПолучитьСтруктуруОбъектаДляHttp("form_content");
						ОбъектЭлементСправочника.id = XMLСтрока(Выборка.Ссылка);
						ОбъектЭлементСправочника.form_id = Строка(ВыборкаСправочника.ИДСправочника);
						ОбъектЭлементСправочника.name = ЧистаяСтрока(Выборка.Наименование);
						ОбъектСписка.Добавить(ОбъектЭлементСправочника);
					КонецЦикла;
					
				ИначеЕсли НЕ Метаданные.ПланыВидовХарактеристик.Найти(ВыборкаСправочника.ТипДанных) = Неопределено Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст =
					"ВЫБРАТЬ
					|	ПланВидовХарактеристик.Ссылка,
					|	ПланВидовХарактеристик.Наименование
					|ИЗ
					|	ПланВидовХарактеристик." + СокрЛП(ВыборкаСправочника.ТипДанных) + " КАК ПланВидовХарактеристик
					|ГДЕ
					|	ПланВидовХарактеристик.ПометкаУдаления = ЛОЖЬ
					|	И 1=1";
					
					Если ТекущаяДопФорма.Ограничения.Количество() тогда
						Запрос.Текст = СтрЗаменить(Запрос.Текст,"1=1","ПланВидовХарактеристик.Ссылка В (&МассивЭлементовДопФормы)");
						МассивЭлементовДопФормы = ТекущаяДопФорма.Ограничения.ВыгрузитьКолонку("Значения");
						Запрос.УстановитьПараметр("МассивЭлементовДопФормы",МассивЭлементовДопФормы);
					КонецЕсли; 
					
					РезультатЗапроса = Запрос.Выполнить();
					
					Выборка = РезультатЗапроса.Выбрать();
					
					Пока Выборка.Следующий() Цикл
						ОбъектЭлементСправочника = ПолучитьСтруктуруОбъектаДляHttp("form_content");
						ОбъектЭлементСправочника.id = XMLСтрока(Выборка.Ссылка);
						ОбъектЭлементСправочника.form_id = Строка(ВыборкаСправочника.ИДСправочника);
						ОбъектЭлементСправочника.name = ЧистаяСтрока(Выборка.Наименование);
						ОбъектСписка.Добавить(ОбъектЭлементСправочника);
					КонецЦикла;
	
				ИначеЕсли НЕ Метаданные.Перечисления.Найти(ВыборкаСправочника.ТипДанных) = Неопределено Тогда
					
					Если ТекущаяДопФорма.Ограничения.Количество() тогда
						МассивЭлементовДопФормы = ТекущаяДопФорма.Ограничения.ВыгрузитьКолонку("Значения");
					Иначе
						МассивЭлементовДопФормы = Неопределено;
					КонецЕсли; 

					Для Сч = 0 По Перечисления[ВыборкаСправочника.ТипДанных].Количество() - 1  Цикл
						
						Если МассивЭлементовДопФормы <> Неопределено тогда
							Если МассивЭлементовДопФормы.Найти(Перечисления[ВыборкаСправочника.ТипДанных][Сч]) = Неопределено тогда
								Продолжить;	
							КонецЕсли; 	
						КонецЕсли; 
						
						ОбъектЭлементСправочника = ПолучитьСтруктуруОбъектаДляHttp("form_content");
						ОбъектЭлементСправочника.id = Строка("" + ВыборкаСправочника.ТипДанных + "." + Сч);
						ОбъектЭлементСправочника.form_id = Строка(ВыборкаСправочника.ИДСправочника);
						ОбъектЭлементСправочника.name = ЧистаяСтрока(Строка(Перечисления[ВыборкаСправочника.ТипДанных][Сч]));
						ОбъектСписка.Добавить(ОбъектЭлементСправочника);
					КонецЦикла;
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

Функция OnWriteRowStepValues(SN, UserName, DMStepValueList) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
 
	Для каждого ДополнительнаяФорма из DMStepValueList Цикл   
		// Аргументы пакета: DMStepId  DMValue DMDocId DMArtId DMRowId
		Если НЕ ЗначениеЗаполнено(ДополнительнаяФорма.form_id) Тогда
			Продолжить;
		КонецЕсли;
		
		ДополнительнаяФормаСсылка = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДополнительныеФормы"), СокрЛП(ДополнительнаяФорма.form_id));
		Если ДополнительнаяФормаСсылка = Справочники.ДатаМобайл_ДополнительныеФормы.ПустаяСсылка() Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			РегЗначениеФормы = РегистрыСведений.ДатаМобайл_ЗначенияДополнительныхФорм.СоздатьМенеджерЗаписи();
			РегЗначениеФормы.Документ = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(ДополнительнаяФорма.doc_id,5));
		
			Если ЗначениеЗаполнено(СокрЛП(ДополнительнаяФорма.art_id)) Тогда
				РегЗначениеФормы.Номенклатура = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(ДополнительнаяФорма.art_id,4,36));
				
				ИДХК=Сред(ДополнительнаяФорма.art_id,40,36);
				Попытка
					Если ИДХК<>"00000000-0000-0000-0000-000000000000" Тогда
						РегЗначениеФормы.Характеристика = XMLЗначение(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"), ИДХК);
					КонецЕсли;	
				Исключение	
				КонецПопытки;
			КонецЕсли;
			Если ЗначениеЗаполнено(СокрЛП(ДополнительнаяФорма.row_id)) Тогда
			РегЗначениеФормы.ИдентификаторСтроки = Число(ДополнительнаяФорма.row_id);
			КонецЕсли;
			РегЗначениеФормы.ДополнительнаяФорма = ДополнительнаяФормаСсылка;
			РегЗначениеФормы.Значение = СокрЛП(ДополнительнаяФорма.value);	
			
			РегЗначениеФормы.Записать(Истина);
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	СтруктураОтвета.Вставить("is_success", Истина);
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	
КонецФункции

#КонецОбласти

#Область Docs

Функция GetDocRowsSelect(SN, UserName, DocOutID) Экспорт 
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;

	попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));
	Исключение			
		СтруктураОтвета.Вставить("Описание", "Не найден документ. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);	
	КонецПопытки;
	

	Если СсылкаНаДок.ПолучитьОбъект( )= Неопределено Тогда		
		СтруктураОтвета.Вставить("Описание", "Не найден документ. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;
	
	Модуль_ОбщегоНазначения = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначения");
	ЗначенияРеквизитовСсылкаНаДок = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДок, "ПометкаУдаления, Шаблон");
	
	ПометкаУдаления = ЗначенияРеквизитовСсылкаНаДок.ПометкаУдаления;
	Шаблон 			= ЗначенияРеквизитовСсылкаНаДок.Шаблон;
	
	Если ПометкаУдаления Тогда		
		СтруктураОтвета.Вставить("Описание", "Документ задания помечен на удаление. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецЕсли;
	
	Шаблон = СсылкаНаДок.Шаблон;
	Если НЕ Шаблон.ИспользоватьПодбор Тогда
		Возврат ПодготовитьОтветJSON(ОбъектСписка);
	КонецЕсли;
		
	Если Шаблон.ЕГАИС Тогда
		
		Если ДатаМобайл_ОбщийМодуль.ЕстьКТ2000() Тогда
			GetDocRowsSelectEGAIS_КТ2000(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок);
		Иначе
			GetDocRowsSelectEGAIS(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок);
		КонецЕсли;
		
	ИначеЕсли Шаблон.ВидДокумента = "ЗаказНаПеремещение" Тогда
		
		GetDocRowsSelectOrderToReplace(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок);
		
	ИначеЕсли Шаблон.ВидДокумента = "СборкаТоваров" Тогда
		
		GetDocRowsSborka_Select(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок);	
		
	ИначеЕсли Шаблон.ИспользоватьМаркировку
		И ПроверитьТребуетсяВыгрузкаМарок(СсылкаНаДок) Тогда
		
		GetDocRowsSelectMarking(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок);
		
	Иначе
		Попытка
			лЕстьЯчейка = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Ячейка") <> Неопределено;
		Исключение
			лЕстьЯчейка = Ложь;
		КонецПопытки;
	
		Если Шаблон.ИспользованиеЯчеекПодбор > 0 И лЕстьЯчейка Тогда
			GetDocRowsSelectCells(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок);	
		Иначе	
			СерииВОтдельнойТЧ = Ложь;
			Если Шаблон.УчитыватьСерийниковВЗаданииПодбор Тогда		
				Попытка
					Для Каждого ТЧ Из Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти Цикл
						Если ТЧ.Имя = "Серии" Тогда
							СерииВОтдельнойТЧ = Истина;
							Прервать;	
						КонецЕсли;
					КонецЦикла;
				Исключение
				КонецПопытки;
			КонецЕсли;

			Если СерииВОтдельнойТЧ И Шаблон.СерииВОтдельнойТЧ Тогда
			    GetDocRowsSelectSN(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок);
			Иначе
				GetDocRowsSelectCasual(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок);
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

Функция GetDocRowsInsert(SN, UserName, DocOutID) Экспорт
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;	
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;	
	
	попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));	 
	Исключение			
		СтруктураОтвета.Вставить("Описание", "Не найден документ.");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);	
	КонецПопытки;
	
	Если ссылканадок.ПолучитьОбъект() = Неопределено Тогда		
		СтруктураОтвета.Вставить("Описание", "Не найден документ.");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);	
	КонецЕсли;
	
	Если СсылкаНаДок.ПометкаУдаления Тогда			
		СтруктураОтвета.Вставить("Описание", "Документ задания помечен на удаление.");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);	
	КонецЕсли;
	
	Шаблон = СсылкаНаДок.Шаблон;
	Если НЕ Шаблон.ИспользоватьПриемку Тогда
		Возврат ПодготовитьОтветJSON(ОбъектСписка);
	КонецЕсли;	

	Попытка
		лЕстьЯчейка = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПриемка].Реквизиты.Найти("Ячейка") <> Неопределено;
	Исключение
		лЕстьЯчейка = Ложь;
	КонецПопытки;
	
	Если Шаблон.ВидДокумента = "СборкаТоваров" Тогда
		
		GetDocRowsSborka_Insert(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок);
		
	ИначеЕсли Шаблон.ИспользованиеЯчеекПриемка > 0 И лЕстьЯчейка Тогда

		Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                    |	ЗапросСЛимитами.Номенклатура,
		                    |	ЗапросСЛимитами.Характеристика,
							|	ЗапросСЛимитами.Серия,
		                    |	СУММА(ЗапросСЛимитами.Количество) КАК Количество,
		                    |	ЗапросСЛимитами.Ячейка КАК Ячейка,
		                    |	МИНИМУМ(ЗапросСЛимитами.НомерСтроки) КАК НомерСтроки
		                    |ИЗ
		                    |	(ВЫБРАТЬ
		                    |		ТаблицаТоваровВДокументе.Номенклатура КАК Номенклатура,
		                    |		ТаблицаТоваровВДокументе.Характеристика КАК Характеристика,
							|		&УсловиеСерия КАК Серия,
		                    |		СУММА(ТаблицаТоваровВДокументе.Количество) КАК Количество,
		                    |		ТаблицаТоваровВДокументе.Ячейка КАК Ячейка,
		                    |		МИНИМУМ(ТаблицаТоваровВДокументе.НомерСтроки) КАК НомерСтроки
		                    |	ИЗ
		                    |		Документ.ОтборРазмещениеТоваров.ТоварыОтбор КАК ТаблицаТоваровВДокументе
		                    |	ГДЕ
		                    |		ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент
		                    |	
		                    |	СГРУППИРОВАТЬ ПО
		                    |		ТаблицаТоваровВДокументе.Номенклатура,
		                    |		ТаблицаТоваровВДокументе.Характеристика,
							|		&УсловиеСерия,
		                    |		ТаблицаТоваровВДокументе.Ячейка) КАК ЗапросСЛимитами
		                    |
		                    |СГРУППИРОВАТЬ ПО
		                    |	ЗапросСЛимитами.Номенклатура,
							|	ЗапросСЛимитами.Серия,
		                    |	ЗапросСЛимитами.Характеристика,
		                    |	ЗапросСЛимитами.Ячейка
							|		
		                    |УПОРЯДОЧИТЬ ПО
		                    |	НомерСтроки");
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаДок);
		Запрос.УстановитьПараметр("ИсходныйДокумент", СсылкаНаДок.ИсходныйДокумент);
		Запрос.Текст=СтрЗаменить(Запрос.Текст, ".ОтборРазмещениеТоваров.", "." + Шаблон.ВидДокумента + ".");
		Запрос.Текст=СтрЗаменить(Запрос.Текст, ".ТоварыОтбор КАК ", "." + Шаблон.ИмяТабличнойЧастиПриемка + " КАК ");
		
		Попытка
			ЕстьСерии = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПриемка].Реквизиты.Найти("Серия") <> Неопределено;
		Исключение
			ЕстьСерии = Ложь;
		КонецПопытки;
		
		Если ЕстьСерии Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеСерия","ТаблицаТоваровВДокументе.Серия");
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеСерия","Значение(Справочник.СерииНоменклатуры.ПустаяСсылка)");
		КонецЕсли;

		Попытка
			ЕстьКоличествоУпаковок = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("КоличествоУпаковок") <> Неопределено;
		Исключение
			ЕстьКоличествоУпаковок = Ложь;
		КонецПопытки;

		Если ЕстьКоличествоУпаковок И УзелПО.НеИспользоватьПересчетУпаковок Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Количество", "ТаблицаТоваровВДокументе.КоличествоУпаковок");
		КонецЕсли;
		
		Рез = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаДока Из Рез Цикл

			СтруктураТекущейСтроки = Новый Структура;
			
			ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","id");
			ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(СтрокаДока.Характеристика);
			Попытка ОбъектТовара.parent_id = ?(XMLСтрока(СтрокаДока.Характеристика) = "00000000-0000-0000-0000-000000000000", "", "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + "00000000-0000-0000-0000-000000000000"); Исключение КонецПопытки;
			СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
				
			Если ЗначениеЗаполнено(СтрокаДока.Ячейка) тогда
				ОбъектЯчейки = ПолучитьСтруктуруОбъектаДляHttp("cell","barcode");			
				Модуль_ШтрихкодированиеПечатныхФорм = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ШтрихкодированиеПечатныхФорм");
				ОбъектЯчейки.barcode = ?(УзелПО.ВыгружатьВКодЯчейки=1,СтрокаДока.Ячейка.Код, Строка(Модуль_ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(СтрокаДока.Ячейка)));
				СтруктураТекущейСтроки.Вставить("cell", ОбъектЯчейки);
			КонецЕсли;
			
			Попытка
				Если ЗначениеЗаполнено(СтрокаДока.Серия) Тогда
					sn = ПолучитьЗначениеСерии(Шаблон, СтрокаДока.Номенклатура, СтрокаДока.Серия, Истина);
					СтруктураТекущейСтроки.Вставить("sn", sn);
				КонецЕсли;
			Исключение
			КонецПопытки;

			Попытка
				ДопускВесовогоТовара =  ПолучитьДопускВесовогоТовара(СтрокаДока.Номенклатура, СсылкаНаДок.Клиент);
			Исключение
				ДопускВесовогоТовара = Неопределено;
			КонецПопытки;
			
			Если ДопускВесовогоТовара<>Неопределено тогда
				СтруктураТекущейСтроки.Вставить("weight_task", ДопускВесовогоТовара);
			КонецЕсли;

			
			ЭтоУслуга = Ложь;
			Попытка 
				Если СтрокаДока.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
					ЭтоУслуга = Истина;
			   	КонецЕсли;
			Исключение
			КонецПопытки;

			limit_qty = 0;
			Если УзелПО.НеОтображатьОстатки Тогда
				limit_qty = 0;
			ИначеЕсли ЭтоУслуга Тогда
				limit_qty = 999;	
			Иначе
				Попытка 
					ТекущийСклад = СсылкаНаДок.Склад;
				Исключение
					ТекущийСклад = Справочники.Склады.ПустаяСсылка();
				КонецПопытки;

				limit_qty = ПолучитьОстаткиПоЯчейке(УзелПО, ТекущийСклад, СтрокаДока.Номенклатура, СтрокаДока.Характеристика, СтрокаДока.Ячейка);
			КонецЕсли;
			
			qty = СтрокаДока.Количество;
			
			СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
			СтруктураТекущейСтроки.Вставить("qty", qty);
			
			ОбъектСписка.Добавить(СтруктураТекущейСтроки);

		КонецЦикла;
	Иначе	
		Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                    |	ЗапросСЛимитами.Номенклатура,
		                    |	ЗапросСЛимитами.Характеристика,
							|	ЗапросСЛимитами.Серия,
		                    |	СУММА(ЗапросСЛимитами.Количество) КАК Количество,
							|	СУММА(ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток, 0)) КАК Лимит,
		                    |	МИНИМУМ(ЗапросСЛимитами.НомерСтроки) КАК НомерСтроки
		                    |ИЗ
		                    |	(ВЫБРАТЬ
		                    |		ТаблицаТоваровВДокументе.Номенклатура КАК Номенклатура,
		                    |		ТаблицаТоваровВДокументе.Характеристика КАК Характеристика,
							|		&УсловиеСерия КАК Серия,
		                    |		СУММА(ТаблицаТоваровВДокументе.Количество) КАК Количество,
		                    |		МИНИМУМ(ТаблицаТоваровВДокументе.НомерСтроки) КАК НомерСтроки
		                    |	ИЗ
		                    |		Документ.ПриходныйОрдерНаТовары.Товары КАК ТаблицаТоваровВДокументе
		                    |	ГДЕ
		                    |		ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент
		                    |	
		                    |	СГРУППИРОВАТЬ ПО
		                    |		ТаблицаТоваровВДокументе.Номенклатура,
		                    |		ТаблицаТоваровВДокументе.Характеристика,
							|		&УсловиеСерия) КАК ЗапросСЛимитами
							|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
		                    |				,
		                    |				(&ВсеСклады
		                    |					ИЛИ Склад В (&Склады))
							|				И (&ВсеПомещения
		                    |					ИЛИ Помещение В (&Помещения))) КАК ТоварыВЯчейкахОстатки
		                    |		ПО ЗапросСЛимитами.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
		                    |			И ЗапросСЛимитами.Характеристика = ТоварыВЯчейкахОстатки.Характеристика
		                    |
		                    |СГРУППИРОВАТЬ ПО
		                    |	ЗапросСЛимитами.Номенклатура,
		                    |	ЗапросСЛимитами.Характеристика,
							|	ЗапросСЛимитами.Серия
		                    |
		                    |УПОРЯДОЧИТЬ ПО
		                    |	НомерСтроки");
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаДок);
		Запрос.УстановитьПараметр("ИсходныйДокумент", СсылкаНаДок.ИсходныйДокумент);
		
		СписокСкладов = УзелПО.Склады.ВыгрузитьКолонку("Склад");
		Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
			СписокСкладов.Очистить();
			СписокСкладов.Добавить(СсылкаНаДок.Склад);			
		КонецЕсли;
		Запрос.УстановитьПараметр("Склады", СписокСкладов);
		Запрос.УстановитьПараметр("ВсеСклады", СписокСкладов.Количество() = 0);
		
		СписокПомещений = УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
		Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
			СписокПомещений.Очистить();
			СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
		КонецЕсли;
		Запрос.УстановитьПараметр("Помещения", СписокПомещений);
		Запрос.УстановитьПараметр("ВсеПомещения", СписокПомещений.Количество() = 0);

		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".ПриходныйОрдерНаТовары.", "." + Шаблон.ВидДокумента + ".");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Товары КАК ", "." + Шаблон.ИмяТабличнойЧастиПриемка + " КАК ");
		
		Попытка
			ЕстьСерии = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПриемка].Реквизиты.Найти("Серия") <> Неопределено;
		Исключение
			ЕстьСерии = Ложь;
		КонецПопытки;

		
		Если ЕстьСерии Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСерия","ТаблицаТоваровВДокументе.Серия");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеСерия","Значение(Справочник.СерииНоменклатуры.ПустаяСсылка)");
		КонецЕсли;

		Попытка
			ЕстьКоличествоУпаковок = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("КоличествоУпаковок") <> Неопределено;
		Исключение
			ЕстьКоличествоУпаковок = Ложь;
		КонецПопытки;

		Если ЕстьКоличествоУпаковок И УзелПО.НеИспользоватьПересчетУпаковок Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаТоваровВДокументе.Количество", "ТаблицаТоваровВДокументе.КоличествоУпаковок");
		КонецЕсли;

		Рез = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаДока Из Рез Цикл
			
			СтруктураТекущейСтроки = Новый Структура;
			
			ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","id");
			ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(СтрокаДока.Характеристика);
			Попытка ОбъектТовара.parent_id = ?(XMLСтрока(СтрокаДока.Характеристика) = "00000000-0000-0000-0000-000000000000", "", "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + "00000000-0000-0000-0000-000000000000"); Исключение КонецПопытки;
			СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
			
			Попытка
				Если ЗначениеЗаполнено(СтрокаДока.Серия) Тогда
					sn = ПолучитьЗначениеСерии(Шаблон, СтрокаДока.Номенклатура, СтрокаДока.Серия, Истина);
					СтруктураТекущейСтроки.Вставить("sn", sn);
				КонецЕсли;
			Исключение
			КонецПопытки;


			Попытка
				ДопускВесовогоТовара =  ПолучитьДопускВесовогоТовара(СтрокаДока.Номенклатура, СсылкаНаДок.Клиент);
			Исключение
				ДопускВесовогоТовара = Неопределено;
			КонецПопытки;
			
			Если ДопускВесовогоТовара<>Неопределено тогда
				СтруктураТекущейСтроки.Вставить("weight_task", ДопускВесовогоТовара);
			КонецЕсли;

		
			ЭтоУслуга = Ложь;
			Попытка 
				Если СтрокаДока.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
					ЭтоУслуга = Истина;
			   	КонецЕсли;
			Исключение
			КонецПопытки;

			limit_qty = 0;
			Если УзелПО.НеОтображатьОстатки Тогда
				limit_qty = 0;
			ИначеЕсли ЭтоУслуга Тогда
				limit_qty = 999;	
			Иначе	
				Попытка
					Итог = СтрокаДока.Лимит;
					limit_qty = Итог;
				Исключение
					limit_qty = 0;
				КонецПопытки;
			КонецЕсли;
			
			qty = СтрокаДока.Количество;
			
			СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
			СтруктураТекущейСтроки.Вставить("qty", qty);
			
			ОбъектСписка.Добавить(СтруктураТекущейСтроки);
		КонецЦикла;
	КонецЕсли;

	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

Функция OnDocScan(SN, UserName, Barcode, TemplateID, AppVersion) Экспорт
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);  
	КонецЕсли;	
		
	Попытка 
		ГУИД = ПолучитьГУИДПоШтрихкоду(Barcode);
		УникальныйИдентификатор = Новый УникальныйИдентификатор(ГУИД);
	Исключение 
		Возврат ПодготовитьОтветJSON(ОбъектСписка);
	КонецПопытки;

	НайденныйДокумет1С = Неопределено;

	Если НЕ ЗначениеЗаполнено(TemplateID) Тогда
		
		НайденныйВидДокумента1С = Неопределено;
		
		//Выберем доступные для ТСД шаблоны		
		СписокШаблонов=УзелПО.Шаблоны.ВыгрузитьКолонку("Шаблон");
		Если СписокШаблонов.Количество()>0 тогда		
		Иначе
			ВыборкаШаблонов = Справочники.ДатаМобайл_ШаблоныДокументов.Выбрать();
			Пока ВыборкаШаблонов.Следующий() цикл 
		    	СписокШаблонов.Добавить(ВыборкаШаблонов.Ссылка);
			КонецЦикла;	
		КонецЕсли;
		
		//Попробуем найти документ 1С по доступным шаблонам 		
		Для каждого ТекущийШаблон из СписокШаблонов цикл
			Если ТекущийШаблон.ПометкаУдаления тогда
				Продолжить;
			КонецЕсли;
	        Если НЕ ЗначениеЗаполнено(ТекущийШаблон.ВидДокумента) тогда
				Продолжить;
			КонецЕсли;

			Попытка
				СсылкаНаОбъектГуид = Документы[ТекущийШаблон.ВидДокумента].ПолучитьСсылку(УникальныйИдентификатор);	
				Если СсылкаНаОбъектГуид.ПолучитьОбъект() <> Неопределено Тогда
					НайденныйДокумет1С = СсылкаНаОбъектГуид;
					НайденныйВидДокумента1С = ТекущийШаблон.ВидДокумента;
					НайденныйШаблон = ТекущийШаблон;
					Прервать;
				КонецЕсли;		
			Исключение
				Продолжить;
			КонецПопытки;
		КонецЦикла;

		Если НайденныйВидДокумента1С = Неопределено тогда
			Возврат ПодготовитьОтветJSON(ОбъектСписка);
		КонецЕсли;
			
		//Проверим что шаблон с этим видом документа только один (иначе надо на ТСД было зайти в нужный шаблон)
		n=0;
		Для каждого ТекущийШаблон из СписокШаблонов цикл
			Если ТекущийШаблон.ПометкаУдаления Тогда
				Продолжить;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ТекущийШаблон.ВидДокумента) Тогда
				Продолжить;
			КонецЕсли;

			Если ТекущийШаблон.ВидДокумента = НайденныйВидДокумента1С Тогда
				n=n+1;
			КонецЕсли;
		КонецЦикла;
		
		Если n <> 1 Тогда
			Возврат ПодготовитьОтветJSON(ОбъектСписка);
		КонецЕсли;
		
	Иначе
		
		НайденныйШаблон = Справочники.ДатаМобайл_ШаблоныДокументов.НайтиПоКоду(TemplateID);
		Если НЕ ЗначениеЗаполнено(НайденныйШаблон.ВидДокумента) Тогда
			Возврат ПодготовитьОтветJSON(ОбъектСписка);
		КонецЕсли;

		Попытка
			СсылкаНаОбъектГуид = Документы[НайденныйШаблон.ВидДокумента].ПолучитьСсылку(УникальныйИдентификатор);	
		
			Если СсылкаНаОбъектГуид.ПолучитьОбъект() <> Неопределено Тогда
				НайденныйДокумет1С = СсылкаНаОбъектГуид;
			КонецЕсли;
		Исключение
			Возврат ПодготовитьОтветJSON(ОбъектСписка);
		КонецПопытки;			
			
	КонецЕсли;
	
	
	Если НайденныйДокумет1С = Неопределено Тогда
		Возврат ПодготовитьОтветJSON(ОбъектСписка);
	КонецЕсли;

	Если НайденныйШаблон = Неопределено Тогда
		Возврат ПодготовитьОтветJSON(ОбъектСписка);
	КонецЕсли;
	
	
		
	Попытка 
					
		//Попробуем найти текущий документ в АРМ
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДатаМобайл_ДокументыТСД.Ссылка
		|ИЗ
		|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
		|ГДЕ
		|	ДатаМобайл_ДокументыТСД.Шаблон = &Шаблон
		|	И ДатаМобайл_ДокументыТСД.ИсходныйДокумент = &НайденныйДокумет1С
		|	И НЕ ДатаМобайл_ДокументыТСД.ПометкаУдаления";
		
		ВидДокумента1С = НайденныйДокумет1С.Метаданные().Имя;
		Запрос.УстановитьПараметр("Шаблон",НайденныйШаблон);
		Запрос.УстановитьПараметр("НайденныйДокумет1С",НайденныйДокумет1С);
		Результат=Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			
			ДокументДМСсылка=Результат.Ссылка;					
			
		Иначе
			
			//Попробуем создать новый док							
			НовыйДок=Справочники.ДатаМобайл_ДокументыТСД.СоздатьЭлемент();
			НовыйДок.ИсходныйДокумент=НайденныйДокумет1С;
			НовыйДок.Шаблон=НайденныйШаблон;
			НовыйДок.ТСД=УзелПО;
			НовыйДок.Записать();
			
			ДокументДМСсылка =  НовыйДок.Ссылка;
			
		КонецЕсли;			
		
	Исключение 
		
		Возврат ПодготовитьОтветJSON(ОбъектСписка);
		
	КонецПопытки;	
	
	
		
	Запрос=Новый Запрос(
	//1) Запрос на DMIsMarkDoc = Ложь	
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Номер, """") КАК DMNumber,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК DMDate,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.ПометкаУдаления, ИСТИНА)
	|				ИЛИ ДатаМобайл_ДокументыТСДИзменения.Ссылка.ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|			    ИЛИ НЕ(&ВсеСклады
	|						ИЛИ 
	|						(ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|						ИЛИ ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) В (&Склады)
	|						ИЛИ ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.СкладПолучатель, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) В (&Склады)))
	|		    	ИЛИ НЕ(&ВсеПомещения	
	|						ИЛИ 
	|						(ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Помещение, ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)
	|						ИЛИ ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Помещение, ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)) В (&Помещения)))
	|				ИЛИ НЕ(&ВсеШаблоны
	|						ИЛИ ДатаМобайл_ДокументыТСДИзменения.Ссылка.Шаблон В (&Шаблон))
	//|				ИЛИ ВЫБОР
	//|					КОГДА НЕ(ДатаМобайл_ДокументыТСДИзменения.Ссылка.ТСД = &ТСД
	//|								ИЛИ ДатаМобайл_ДокументыТСДИзменения.Ссылка.ТСД = ЗНАЧЕНИЕ(планобмена.датамобайл_списоктсд.пустаяссылка))
	//|						ТОГДА ИСТИНА
	//|				КОНЕЦ
	|				ИЛИ ВЫБОР
	|					КОГДА ЕСТЬNULL(Количество(СписокТерминаловВсего.ТСД),0)=0 И НЕ (ДатаМобайл_ДокументыТСДИзменения.Ссылка.ТСД = &ТСД ИЛИ ДатаМобайл_ДокументыТСДИзменения.Ссылка.ТСД = ЗНАЧЕНИЕ(планобмена.датамобайл_списоктсд.пустаяссылка))
	|						ТОГДА ИСТИНА
	|					КОГДА ЕСТЬNULL(Количество(СписокТерминаловВсего.ТСД),0)<>0 И ЕСТЬNULL(Количество(СписокТерминаловКонкретный.ТСД),0)=0
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК DMisMarkDoc,
	|	ДатаМобайл_ДокументыТСДИзменения.Ссылка КАК ДокСсылка,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Номер, """") КАК DMBarcode,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Комментарий, """") КАК DMComment,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.ДатаЗавершенияСбора, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК DMisLoaded,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Клиент, ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)) КАК КлиентСсылка,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Склад.Наименование, """") КАК DMWarehouseName,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Склад.Ссылка, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК СкладСсылка,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.СкладПолучатель.Наименование, """") КАК DMWarehouseName2,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.СкладПолучатель.Ссылка, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК СкладПолучательСсылка,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Шаблон.Ссылка, ЗНАЧЕНИЕ(Справочник.ДатаМобайл_ШаблоныДокументов.ПустаяСсылка)) КАК ШаблонСсылка
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСДИзменения
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СписокТерминалов КАК СписокТерминаловВсего
	|		ПО ДатаМобайл_ДокументыТСДИзменения.Ссылка = СписокТерминаловВсего.Ссылка 
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СписокТерминалов КАК СписокТерминаловКонкретный
	|		ПО ДатаМобайл_ДокументыТСДИзменения.Ссылка = СписокТерминаловКонкретный.Ссылка
	|		И  (СписокТерминаловКонкретный.ТСД = &ТСД ИЛИ СписокТерминаловКонкретный.ТСД = ЗНАЧЕНИЕ(планобмена.датамобайл_списоктсд.пустаяссылка))
	|ГДЕ
	|	ДатаМобайл_ДокументыТСДИзменения.Ссылка = &НовыйДокумент 
	|
	|СГРУППИРОВАТЬ ПО 
	|  	ДатаМобайл_ДокументыТСДИзменения.Ссылка");
	

	
	СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
	ВсеСклады=?(СписокСкладов.Количество()=0,Истина,Ложь);
	
	СписокШаблонов=УзелПО.Шаблоны.ВыгрузитьКолонку("Шаблон");
	ВсеШаблоны=?(СписокШаблонов.Количество()=0,Истина,Ложь);
	
	СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	ВсеПомещения=?(СписокПомещений.Количество()=0,Истина,Ложь);

	Запрос.УстановитьПараметр("ТСД",УзелПО.Ссылка);
	Запрос.УстановитьПараметр("НовыйДокумент",ДокументДМСсылка);
	
	Запрос.УстановитьПараметр("Склады",СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады",ВсеСклады);
	
	Запрос.УстановитьПараметр("Помещения",СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения",ВсеПомещения);

	Запрос.УстановитьПараметр("Шаблон",СписокШаблонов);
	Запрос.УстановитьПараметр("ВсеШаблоны",ВсеШаблоны);
	
	
	Рез=Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() цикл
		
		ОбъектДока = ПолучитьСтруктуруОбъектаДляHttp("doc");
		ЗаполнитьЗначенияСвойств(ОбъектДока,Рез);
		ОбъектДока.id = "d82-" + XMLСтрока(Рез.ДокСсылка);						
		ОбъектДока.is_deleted = Рез.DMisMarkDoc;
		ОбъектДока.comment = ЧистаяСтрока(Рез.DMComment);
		ОбъектДока.barcode = ЧистаяСтрока(Рез.DMBarcode);
		ОбъектДока.date = ЧистаяСтрока(Рез.DMDate);
		ОбъектДока.number = ЧистаяСтрока(Рез.DMNumber);

		//Штрихкод от 1С	
		Попытка
			ОбъектДока.barcode =  ЧисловойКодПоСсылке(Рез.ДокСсылка.ИсходныйДокумент);
		Исключение
			ОбъектДока.barcode =  "";
		КонецПопытки;

		СсылкаДокумента = Рез.ДокСсылка;	
		Если СсылкаДокумента.СписокДокументов.Количество() > 0 Тогда
			IsParent = Истина;
		Иначе
			IsParent = Ложь;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СсылкаДокумента.РодительскийДокумент) Тогда
			ParentDocOutID = "d82-" + XMLСтрока(СсылкаДокумента.РодительскийДокумент);
		Иначе
			ParentDocOutID = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СсылкаДокумента.Организация) Тогда
			Попытка inn = СсылкаДокумента.Организация.ИНН; Исключение inn = ""; КонецПопытки;
		Иначе
			inn = "";
		КонецЕсли;
		
		ОбъектДока.parent_doc_id = ParentDocOutID;
		ОбъектДока.is_parent = IsParent;
		ОбъектДока.inn = inn;
		ОбъектДока.priority = СсылкаДокумента.Приоритет;

		
		ОбъектШаблона = ПолучитьСтруктуруОбъектаДляHttp("template");
		ЗаполнитьОбъектШаблона(ОбъектШаблона, Рез.ШаблонСсылка, AppVersion);
		ОбъектДока.Вставить("template", ОбъектШаблона);
			
		Если ЗначениеЗаполнено(Рез.КлиентСсылка) Тогда
			ОбъектКлиента = ПолучитьСтруктуруОбъектаДляHttp("client");
			ОбъектКлиента.id = "8k-" + XMLСтрока(Рез.КлиентСсылка);
			ОбъектКлиента.name = ЧистаяСтрока(Рез.КлиентСсылка.Наименование);
			Попытка ОбъектКлиента.barcode = Рез.КлиентСсылка.ИНН; Исключение КонецПопытки;
			ОбъектДока.Вставить("client", ОбъектКлиента);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Рез.СкладСсылка) Тогда			
			ОбъектСклада = ПолучитьСтруктуруОбъектаДляHttp("warehouse");
			ОбъектСклада.id = XMLСтрока(Рез.СкладСсылка);
			ОбъектСклада.name= Рез.DMWarehouseName;		
			ОбъектДока.Вставить("warehouse_1", ОбъектСклада);	
		КонецЕсли;
	
		Если ЗначениеЗаполнено(Рез.СкладПолучательСсылка) Тогда
			ОбъектСклада2 = ПолучитьСтруктуруОбъектаДляHttp("warehouse");
			ОбъектСклада2.id = XMLСтрока(Рез.СкладПолучательСсылка);
			ОбъектСклада2.name = Рез.DMWarehouseName2;
			ОбъектДока.Вставить("warehouse_2", ОбъектСклада2);
		КонецЕсли;
		
		Если Рез.ШаблонСсылка.ИспользоватьДопФормы Тогда
			//Дополнительные формы
			ОбъектСпискаДополнительныхФорм = Новый Массив;
			ЗапросДополнительныхФорм = Новый Запрос;
			ЗапросДополнительныхФорм.Текст = 
			"ВЫБРАТЬ
			|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.ДополнительнаяФорма.Ссылка КАК Ссылка,
			|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.Порядок КАК Порядок,
			|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.РеквизитИзШапки КАК РеквизитИзШапки,
			|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.ПроверятьЗаполнение
			|ИЗ
			|	РегистрСведений.ДатаМобайл_СвязиДополнительныхФормИШаблонов КАК ДатаМобайл_СвязиДополнительныхФормИШаблонов
			|ГДЕ
			|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.Шаблон = &Шаблон
			|	И ДатаМобайл_СвязиДополнительныхФормИШаблонов.ДополнительнаяФорма.ПометкаУдаления = ЛОЖЬ";
			
			ЗапросДополнительныхФорм.УстановитьПараметр("Шаблон", Рез.ШаблонСсылка);
			
			РезультатЗапросаДополнительныхФорм = ЗапросДополнительныхФорм.Выполнить();
			ВыборкаДополнительныхФорм = РезультатЗапросаДополнительныхФорм.Выбрать();
			Пока ВыборкаДополнительныхФорм.Следующий() Цикл
				Если НЕ ЗначениеЗаполнено(ВыборкаДополнительныхФорм.Ссылка) тогда 
					Продолжить;
				КонецЕсли;
				
				ОбъектДополнительныхФорм = ПолучитьСтруктуруОбъектаДляHttp("doc_form","doc");
				ОбъектДополнительныхФорм.id = XMLСтрока(ВыборкаДополнительныхФорм.Ссылка);
				ОбъектДополнительныхФорм.doc_id = "d82-" + XMLСтрока(Рез.ДокСсылка);
				ОбъектДополнительныхФорм.is_required = ВыборкаДополнительныхФорм.ПроверятьЗаполнение; 
				ОбъектДополнительныхФорм.form_type = ВыборкаДополнительныхФорм.РеквизитИзШапки;             
				ОбъектСпискаДополнительныхФорм.Добавить(ОбъектДополнительныхФорм);
				
			КонецЦикла;
			ОбъектДока.Вставить("forms", ОбъектСпискаДополнительныхФорм);
		КонецЕсли;
				
		ОбъектСписка.Добавить(ОбъектДока);
		
	КонецЦикла;	
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);

КонецФункции

Функция GetSelectedQtyGroupDocRows(SN, UserName, DocOutID, LastRequestDate) Экспорт
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;

	Если LastRequestDate = "0" Тогда 
		ДатаПоследнегоЗапроса = Дата(1, 1, 1);
	Иначе
		ДатаПоследнегоЗапроса = TimestampВДату(LastRequestDate);	
	КонецЕсли;
	
	ТекущаяДатаЗапроса = ТекущаяДата();	

	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;

	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));	
	Исключение	
		СтруктураОтвета.Вставить("Описание", "Не найден документ. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;	
	
	Если СсылкаНаДок.Шаблон.ГрупповойДокумент Тогда
		Если СсылкаНаДок.СписокДокументов.ВыгрузитьКолонку("ДокументТСД").Количество() = 0 И НЕ ЗначениеЗаполнено(СсылкаНаДок.РодительскийДокумент) Тогда		
			СтруктураОтвета.Вставить("Описание", "Настройка ""Групповой документ"" не поддерживает работу без задания! ");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ДатаМобайл_СтрокиГрупповыхДокументов.ДокументТСД,
				   |	ВЫБОР
	               |		КОГДА ДатаМобайл_СтрокиГрупповыхДокументов.ИмяТаблицы = ""Select""
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
				   |	КОНЕЦ КАК operation_type,
	               |	ДатаМобайл_СтрокиГрупповыхДокументов.Штрихкод КАК barcode,
	               |	ДатаМобайл_СтрокиГрупповыхДокументов.СерийныйНомер КАК sn,
	               |	ДатаМобайл_СтрокиГрупповыхДокументов.Ячейка КАК cell,
				   |	ДатаМобайл_СтрокиГрупповыхДокументов.НазваниеТовара КАК art_name,
				   |	ДатаМобайл_СтрокиГрупповыхДокументов.Номенклатура КАК Номенклатура,
				   |	ДатаМобайл_СтрокиГрупповыхДокументов.ХарактеристикаНоменклатуры КАК Характеристика,
	               |	ДатаМобайл_СтрокиГрупповыхДокументов.КодТовара КАК art_id,
	               |	ДатаМобайл_СтрокиГрупповыхДокументов.Короб КАК box_pack,
	               |	ДатаМобайл_СтрокиГрупповыхДокументов.УпаковочныйЛист КАК pack, 
	               |	СУММА(ДатаМобайл_СтрокиГрупповыхДокументов.Количество * 
	               |		ВЫБОР
	               |			КОГДА ЕСТЬNULL(ДатаМобайл_СтрокиГрупповыхДокументов.КоэффициентЕдиницы, 1) = 0
	               |				ТОГДА 1
	               |			ИНАЧЕ ЕСТЬNULL(ДатаМобайл_СтрокиГрупповыхДокументов.КоэффициентЕдиницы, 1)
	               |		КОНЕЦ) КАК quant
	               |ИЗ
	               |	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК ДатаМобайл_СтрокиГрупповыхДокументов
	               |ГДЕ
	               |	НЕ ДатаМобайл_СтрокиГрупповыхДокументов.ТСД = &ТСД
	               |	И ДатаМобайл_СтрокиГрупповыхДокументов.ДокументТСД = &ИндетификаторДокумента
				   |	И ДатаМобайл_СтрокиГрупповыхДокументов.ДатаЗаписи >= &ДатаНач
	               |	И ДатаМобайл_СтрокиГрупповыхДокументов.ДатаЗаписи < &ДатаКон
				   |	И НЕ ДатаМобайл_СтрокиГрупповыхДокументов.ДатаЗаписи = ДАТАВРЕМЯ(1,1,1,0,0,0)
	               |
	               |СГРУППИРОВАТЬ ПО
				   |	ДатаМобайл_СтрокиГрупповыхДокументов.ДокументТСД,
				   |	ВЫБОР
	               |		КОГДА ДатаМобайл_СтрокиГрупповыхДокументов.ИмяТаблицы = ""Select""
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
				   |	КОНЕЦ,
	               |	ДатаМобайл_СтрокиГрупповыхДокументов.Штрихкод,
	               |	ДатаМобайл_СтрокиГрупповыхДокументов.СерийныйНомер,
	               |	ДатаМобайл_СтрокиГрупповыхДокументов.Ячейка,
	               |	ДатаМобайл_СтрокиГрупповыхДокументов.КодТовара,
				   |	ДатаМобайл_СтрокиГрупповыхДокументов.НазваниеТовара,
				   |	ДатаМобайл_СтрокиГрупповыхДокументов.Номенклатура,
				    |	ДатаМобайл_СтрокиГрупповыхДокументов.ХарактеристикаНоменклатуры,
	               |	ДатаМобайл_СтрокиГрупповыхДокументов.Короб,
	               |	ДатаМобайл_СтрокиГрупповыхДокументов.УпаковочныйЛист";


	Запрос.УстановитьПараметр("ДатаНач", ДатаПоследнегоЗапроса);
	Запрос.УстановитьПараметр("ДатаКон", ТекущаяДатаЗапроса);
	Запрос.УстановитьПараметр("Тсд", УзелПО);
	
	Если СсылкаНаДок.Шаблон.ГрупповойДокумент Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ДатаМобайл_СтрокиГрупповыхДокументов.ДокументТСД = &ИндетификаторДокумента","ДатаМобайл_СтрокиГрупповыхДокументов.ДокументТСД В(&ДокументыТСД)");
		Запрос.УстановитьПараметр("ДокументыТСД", СсылкаНаДок.СписокДокументов.ВыгрузитьКолонку("ДокументТСД"));
	Иначе	
		Запрос.УстановитьПараметр("ИндетификаторДокумента", СсылкаНаДок);
	КонецЕсли;
	
	Рез = Запрос.Выполнить().Выбрать();	
	Пока Рез.Следующий() Цикл
		
		СтруктураТекущейСтроки = Новый Структура;
		
		ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","scan");
		ОбъектТовара.name = Рез.art_name;
		ОбъектТовара.id   = Рез.art_id;
		
		ТекущаяНоменклатура  = Рез.Номенклатура;
		ТекущаяХарактеристика  = Рез.Характеристика;
		ОбъектТовара.price = ПолучитьЦенуТовара(ТекущаяНоменклатура,ТекущаяХарактеристика,УзелПО.ТипЦен);			
		Попытка	
			DMUseSN = ПолучитьПризнакУчетаСерий(ТекущаяНоменклатура.ВидНоменклатуры, СсылкаНаДок.Склад);
		Исключение
			DMUseSN = Ложь;
		Конецпопытки;		
		СформироватьЗаголовкиJSONParamsТовара(УзелПО,ОбъектТовара,ТекущаяНоменклатура,ТекущаяХарактеристика, DMUseSN,СсылкаНаДок.Шаблон);
		
		СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
		
		СтруктураТекущейСтроки.Вставить("operation_type", Рез.operation_type);
		СтруктураТекущейСтроки.Вставить("created_at", Число(ДатуВTimestamp(ТекущаяДатаЗапроса)));
		
		Если ЗначениеЗаполнено(Рез.barcode) тогда
			ОбъектШтрихкода = ПолучитьСтруктуруОбъектаДляHttp("barcode","value"); 
			ОбъектШтрихкода.value = Рез.barcode;
			СтруктураТекущейСтроки.Вставить("barcode", ОбъектШтрихкода);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Рез.cell) тогда
			ОбъектЯчейки = ПолучитьСтруктуруОбъектаДляHttp("cell","barcode");
			ОбъектЯчейки.barcode  = Рез.cell;
			СтруктураТекущейСтроки.Вставить("cell", ОбъектЯчейки);
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Рез.sn) тогда
			СтруктураТекущейСтроки.Вставить("sn", Рез.sn);
		КонецЕсли;

		Если ЗначениеЗаполнено(Рез.box_pack) тогда
			СтруктураТекущейСтроки.Вставить("box_pack", Рез.box_pack);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Рез.pack) тогда
			СтруктураТекущейСтроки.Вставить("pack", Рез.pack);
		КонецЕсли;
		
		qty      = Рез.quant;
		СтруктураТекущейСтроки.Вставить("qty", qty);

		
		Если СсылкаНаДок.Шаблон.ГрупповойДокумент Тогда
			СтруктураТекущейСтроки.Вставить("child_doc_out_id","d82-" + XMLСтрока(Рез.ДокументТСД));			
		КонецЕсли;
		
		 ОбъектСписка.Добавить(СтруктураТекущейСтроки);
	КонецЦикла;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

Функция GetDocHeads(SN, UserName, DMDocsIDs, AppVersion) Экспорт 
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;	

	Если ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО, "ОчиститьДокументы") Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьФлаговОбменаТСД(УзелПО, "ОчиститьДокументы", Ложь);	 
	КонецЕсли;
	
	                                                                                                               
	СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
	ВсеСклады=?(СписокСкладов.Количество() = 0, Истина, Ложь);
	
	СписокШаблонов=УзелПО.Шаблоны.ВыгрузитьКолонку("Шаблон");
	ВсеШаблоны=?(СписокШаблонов.Количество() = 0, Истина, Ложь);
	
	СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	ВсеПомещения=?(СписокПомещений.Количество() = 0, Истина, Ложь);

	//Дополнительная верификация документов
	МассивДокументов = Новый Массив;
	Для Каждого DocOutID Из DMDocsIDs.docs_ids Цикл	
		Попытка
			СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));       
			МассивДокументов.Добавить(СсылкаНаДок);
		Исключение	
		КонецПопытки;
	КонецЦикла;	
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ДатаМобайл_ДокументыТСД.Ссылка,
	                    |	ЕСТЬNULL(КОЛИЧЕСТВО(СписокТерминаловВсего.ТСД), 0) > 0 КАК ЕстьОграничениеТСД,
	                    |	ЕСТЬNULL(КОЛИЧЕСТВО(СписокТерминаловКонкретный.ТСД), 0) > 0 КАК ЕстьЭтотТСД
	                    |ИЗ
	                    |	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СписокТерминалов КАК СписокТерминаловВсего
	                    |		ПО ДатаМобайл_ДокументыТСД.Ссылка = СписокТерминаловВсего.Ссылка
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СписокТерминалов КАК СписокТерминаловКонкретный
	                    |		ПО ДатаМобайл_ДокументыТСД.Ссылка = СписокТерминаловКонкретный.Ссылка
	                    |			И (СписокТерминаловКонкретный.ТСД = &ТСД
	                    |				ИЛИ СписокТерминаловКонкретный.ТСД = ЗНАЧЕНИЕ(ПланОбмена.ДатаМобайл_СписокТСД.ПустаяСсылка))
	                    |ГДЕ
	                    |	НЕ ДатаМобайл_ДокументыТСД.Ссылка В (&СписокДокументов)
	                    |	И НЕ(ЕСТЬNULL(ДатаМобайл_ДокументыТСД.Ссылка.ПометкаУдаления, ИСТИНА)
	                    |				ИЛИ ДатаМобайл_ДокументыТСД.Ссылка.ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	                    |				ИЛИ НЕ(&ВсеСклады
	                    |						ИЛИ (ЕСТЬNULL(ДатаМобайл_ДокументыТСД.Ссылка.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	                    |							ИЛИ ЕСТЬNULL(ДатаМобайл_ДокументыТСД.Ссылка.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) В (&Склады)
	                    |							ИЛИ ЕСТЬNULL(ДатаМобайл_ДокументыТСД.Ссылка.СкладПолучатель, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) В (&Склады)))
	                    |				ИЛИ НЕ(&ВсеПомещения
	                    |						ИЛИ (ЕСТЬNULL(ДатаМобайл_ДокументыТСД.Ссылка.Помещение, ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)
	                    |							ИЛИ ЕСТЬNULL(ДатаМобайл_ДокументыТСД.Ссылка.Помещение, ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)) В (&Помещения)))
	                    |				ИЛИ НЕ(&ВсеШаблоны
	                    |						ИЛИ ДатаМобайл_ДокументыТСД.Ссылка.Шаблон В (&Шаблон)))
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ДатаМобайл_ДокументыТСД.Ссылка
	                    |
	                    |ИМЕЮЩИЕ
	                    |	(ЕСТЬNULL(КОЛИЧЕСТВО(СписокТерминаловВсего.ТСД), 0) = 0
	                    |			И (ДатаМобайл_ДокументыТСД.Ссылка.ТСД = &ТСД
	                    |				ИЛИ ДатаМобайл_ДокументыТСД.Ссылка.ТСД = ЗНАЧЕНИЕ(ПланОбмена.ДатаМобайл_СписокТСД.ПустаяСсылка))
	                    |		ИЛИ ЕСТЬNULL(КОЛИЧЕСТВО(СписокТерминаловВсего.ТСД), 0) <> 0
	                    |			И ЕСТЬNULL(КОЛИЧЕСТВО(СписокТерминаловКонкретный.ТСД), 0) <> 0)
	                    |
	                    |ОБЪЕДИНИТЬ
	                    |
	                    |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                    |	ДатаМобайл_ДокументыТСД.Ссылка,
	                    |	ЕСТЬNULL(КОЛИЧЕСТВО(СписокТерминаловВсего.ТСД), 0) > 0,
	                    |	ЕСТЬNULL(КОЛИЧЕСТВО(СписокТерминаловКонкретный.ТСД), 0) > 0
	                    |ИЗ
	                    |	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СписокТерминалов КАК СписокТерминаловВсего
	                    |		ПО ДатаМобайл_ДокументыТСД.Ссылка = СписокТерминаловВсего.Ссылка
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СписокТерминалов КАК СписокТерминаловКонкретный
	                    |		ПО ДатаМобайл_ДокументыТСД.Ссылка = СписокТерминаловКонкретный.Ссылка
	                    |			И (СписокТерминаловКонкретный.ТСД = &ТСД
	                    |				ИЛИ СписокТерминаловКонкретный.ТСД = ЗНАЧЕНИЕ(ПланОбмена.ДатаМобайл_СписокТСД.ПустаяСсылка))
	                    |ГДЕ
	                    |	ДатаМобайл_ДокументыТСД.Ссылка В(&СписокДокументов)
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ДатаМобайл_ДокументыТСД.Ссылка
	                    |
	                    |ИМЕЮЩИЕ
	                    |	(ЕСТЬNULL(КОЛИЧЕСТВО(СписокТерминаловВсего.ТСД), 0) = 0
	                    |			И НЕ(ДатаМобайл_ДокументыТСД.Ссылка.ТСД = &ТСД
	                    |					ИЛИ ДатаМобайл_ДокументыТСД.Ссылка.ТСД = ЗНАЧЕНИЕ(ПланОбмена.ДатаМобайл_СписокТСД.ПустаяСсылка))
	                    |		ИЛИ ЕСТЬNULL(КОЛИЧЕСТВО(СписокТерминаловВсего.ТСД), 0) <> 0
	                    |			И ЕСТЬNULL(КОЛИЧЕСТВО(СписокТерминаловКонкретный.ТСД), 0) = 0)");
							 
	Запрос.УстановитьПараметр("СписокДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("ТСД", УзелПО.Ссылка);
	
	Запрос.УстановитьПараметр("Склады", СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады", ВсеСклады);
	
	Запрос.УстановитьПараметр("Помещения", СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения", ВсеПомещения);
	
	Запрос.УстановитьПараметр("Шаблон", СписокШаблонов);
	Запрос.УстановитьПараметр("ВсеШаблоны", ВсеШаблоны);
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		//Зарегистрируем спорные документы для обновления ТСД
		Попытка
			ПланыОбмена.ЗарегистрироватьИзменения(УзелПО, Рез.Ссылка);
		Исключение
		КонецПопытки;
	КонецЦикла;	
	//Дополнительная верификация документов
			
	Попытка ПланыОбмена.ВыбратьИзменения(УзелПО, 1, Метаданные.Справочники.ДатаМобайл_ДокументыТСД); Исключение КонецПопытки;
		
	Запрос = Новый Запрос(
	//1) Запрос на DMIsMarkDoc = Ложь	
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Номер, """") КАК DMNumber,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК DMDate,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.ПометкаУдаления, ИСТИНА)
	|				ИЛИ ДатаМобайл_ДокументыТСДИзменения.Ссылка.ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|			    ИЛИ НЕ(&ВсеСклады
	|						ИЛИ 
	|						(ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|						ИЛИ ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) В (&Склады)
	|						ИЛИ ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.СкладПолучатель, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) В (&Склады)))
	|		    	ИЛИ НЕ(&ВсеПомещения	
	|						ИЛИ 
	|						(ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Помещение, ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)
	|						ИЛИ ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Помещение, ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)) В (&Помещения)))
	|				ИЛИ НЕ(&ВсеШаблоны
	|						ИЛИ ДатаМобайл_ДокументыТСДИзменения.Ссылка.Шаблон В (&Шаблон))
	//|				ИЛИ ВЫБОР
	//|					КОГДА НЕ(ДатаМобайл_ДокументыТСДИзменения.Ссылка.ТСД = &ТСД
	//|								ИЛИ ДатаМобайл_ДокументыТСДИзменения.Ссылка.ТСД = ЗНАЧЕНИЕ(планобмена.датамобайл_списоктсд.пустаяссылка))
	//|						ТОГДА ИСТИНА
	//|				КОНЕЦ
	|				ИЛИ ВЫБОР
	|					КОГДА ЕСТЬNULL(Количество(СписокТерминаловВсего.ТСД),0)=0 И НЕ (ДатаМобайл_ДокументыТСДИзменения.Ссылка.ТСД = &ТСД ИЛИ ДатаМобайл_ДокументыТСДИзменения.Ссылка.ТСД = ЗНАЧЕНИЕ(планобмена.датамобайл_списоктсд.пустаяссылка))
	|						ТОГДА ИСТИНА
	|					КОГДА ЕСТЬNULL(Количество(СписокТерминаловВсего.ТСД),0)<>0 И ЕСТЬNULL(Количество(СписокТерминаловКонкретный.ТСД),0)=0
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК DMisMarkDoc,
	|	ДатаМобайл_ДокументыТСДИзменения.Ссылка КАК ДокСсылка,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Номер, """") КАК DMBarcode,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Комментарий, """") КАК DMComment,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.ДатаЗавершенияСбора, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК DMisLoaded,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Клиент, ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)) КАК КлиентСсылка,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Склад.Наименование, """") КАК DMWarehouseName,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Склад.Ссылка, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК СкладСсылка,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.СкладПолучатель.Наименование, """") КАК DMWarehouseName2,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.СкладПолучатель.Ссылка, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) КАК СкладПолучательСсылка,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Шаблон.Ссылка, ЗНАЧЕНИЕ(Справочник.ДатаМобайл_ШаблоныДокументов.ПустаяСсылка)) КАК ШаблонСсылка
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД.Изменения КАК ДатаМобайл_ДокументыТСДИзменения
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СписокТерминалов КАК СписокТерминаловВсего
	|		ПО ДатаМобайл_ДокументыТСДИзменения.Ссылка = СписокТерминаловВсего.Ссылка 
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СписокТерминалов КАК СписокТерминаловКонкретный
	|		ПО ДатаМобайл_ДокументыТСДИзменения.Ссылка = СписокТерминаловКонкретный.Ссылка
	|		И  (СписокТерминаловКонкретный.ТСД = &ТСД ИЛИ СписокТерминаловКонкретный.ТСД = ЗНАЧЕНИЕ(планобмена.датамобайл_списоктсд.пустаяссылка))
	|ГДЕ
	|	ДатаМобайл_ДокументыТСДИзменения.Узел = &ТСД
	|	И НЕ ДатаМобайл_ДокументыТСДИзменения.НомерСообщения ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО 
	|  	ДатаМобайл_ДокументыТСДИзменения.Ссылка	
	|
	//2) Запрос на DMIsMarkDoc = Истина
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Номер, """"),
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Дата, ДАТАВРЕМЯ(1, 1, 1)),
	|	ИСТИНА,
	|	ДатаМобайл_ДокументыТСДИзменения.Ссылка,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Номер, """"),
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Комментарий, """"),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.ДатаЗавершенияСбора, ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Клиент, ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)),
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Склад.Наименование, """"),
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Склад.Ссылка, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)),
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.СкладПолучатель.Наименование, """"),
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.СкладПолучатель.Ссылка, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)),
	|	ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Шаблон.Ссылка, ЗНАЧЕНИЕ(Справочник.ДатаМобайл_ШаблоныДокументов.ПустаяСсылка))
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСДИзменения
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СписокТерминалов КАК СписокТерминаловВсего
	|		ПО ДатаМобайл_ДокументыТСДИзменения.Ссылка = СписокТерминаловВсего.Ссылка 
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СписокТерминалов КАК СписокТерминаловКонкретный
	|		ПО ДатаМобайл_ДокументыТСДИзменения.Ссылка = СписокТерминаловКонкретный.Ссылка
	|		И  (СписокТерминаловКонкретный.ТСД = &ТСД ИЛИ СписокТерминаловКонкретный.ТСД = ЗНАЧЕНИЕ(планобмена.датамобайл_списоктсд.пустаяссылка))
	|ГДЕ
	|	ДатаМобайл_ДокументыТСДИзменения.Ссылка В(&СписокДокументов)
	|	И (ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.ПометкаУдаления, ИСТИНА)
	|			ИЛИ ДатаМобайл_ДокументыТСДИзменения.Ссылка.ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|		    ИЛИ НЕ(&ВсеСклады
	|						ИЛИ 
	|						(ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|						ИЛИ ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Склад, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) В (&Склады)
	|						ИЛИ ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.СкладПолучатель, ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)) В (&Склады)))
	|		    ИЛИ НЕ(&ВсеПомещения	
	|						ИЛИ 
	|						(ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Помещение, ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)
	|						ИЛИ ЕСТЬNULL(ДатаМобайл_ДокументыТСДИзменения.Ссылка.Помещение, ЗНАЧЕНИЕ(Справочник.СкладскиеПомещения.ПустаяСсылка)) В (&Помещения)))
	|			ИЛИ НЕ(&ВсеШаблоны
	|					ИЛИ ДатаМобайл_ДокументыТСДИзменения.Ссылка.Шаблон В (&Шаблон)))");
	

	Запрос.УстановитьПараметр("ТСД", УзелПО.Ссылка);
	
	Запрос.УстановитьПараметр("Склады", СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады", ВсеСклады);
	
	Запрос.УстановитьПараметр("Помещения", СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения", ВсеПомещения);

	Запрос.УстановитьПараметр("Шаблон", СписокШаблонов);
	Запрос.УстановитьПараметр("ВсеШаблоны", ВсеШаблоны);
	
	Запрос.УстановитьПараметр("СписокДокументов", МассивДокументов);

	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		
		ОбъектДока = ПолучитьСтруктуруОбъектаДляHttp("doc");

		ОбъектДока.id = "d82-" + XMLСтрока(Рез.ДокСсылка);
		ОбъектДока.is_deleted = Рез.DMisMarkDoc;
		ОбъектДока.comment = ЧистаяСтрока(Рез.DMComment);
		ОбъектДока.barcode = ЧистаяСтрока(Рез.DMBarcode);
		ОбъектДока.date = ЧистаяСтрока(Рез.DMDate);
		ОбъектДока.number = ЧистаяСтрока(Рез.DMNumber);
		ОбъектДока.is_loaded = Рез.DMisLoaded;
				
		Попытка
			ОбъектДока.barcode = ЧисловойКодПоСсылке(Рез.ДокСсылка.ИсходныйДокумент);
		Исключение
			ОбъектДока.barcode = "";
		КонецПопытки;
		
		СсылкаДокумента = Рез.ДокСсылка;	
		Если СсылкаДокумента.СписокДокументов.Количество() > 0 Тогда
			IsParent = Истина;
		Иначе
			IsParent = Ложь;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СсылкаДокумента.РодительскийДокумент) Тогда
			ParentDocOutID = "d82-"+XMLСтрока(СсылкаДокумента.РодительскийДокумент);
		Иначе
			ParentDocOutID = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СсылкаДокумента.Организация) Тогда
			Попытка inn = СсылкаДокумента.Организация.ИНН; Исключение inn = ""; КонецПопытки;
		Иначе
			inn = "";
		КонецЕсли;
		
		ОбъектДока.parent_doc_id = ParentDocOutID;
		ОбъектДока.is_parent = IsParent;
		ОбъектДока.inn = inn;
		ОбъектДока.priority = СсылкаДокумента.Приоритет;
				
		ОбъектШаблона = ПолучитьСтруктуруОбъектаДляHttp("template"); 
		ЗаполнитьОбъектШаблона(ОбъектШаблона, Рез.ШаблонСсылка, AppVersion);
		ОбъектДока.Вставить("template", ОбъектШаблона);
				
		Если ЗначениеЗаполнено(Рез.КлиентСсылка) Тогда
			ОбъектКлиента = ПолучитьСтруктуруОбъектаДляHttp("client");
			ОбъектКлиента.id = "8k-" + XMLСтрока(Рез.КлиентСсылка);
			ОбъектКлиента.name= ЧистаяСтрока(Рез.КлиентСсылка.Наименование);
			Попытка ОбъектКлиента.barcode = Рез.КлиентСсылка.ИНН; Исключение КонецПопытки;
			ОбъектДока.Вставить("client", ОбъектКлиента);
		КонецЕсли;
			
		Если ЗначениеЗаполнено(Рез.СкладСсылка) тогда
			ОбъектСклада = ПолучитьСтруктуруОбъектаДляHttp("warehouse");
			ОбъектСклада.id = XMLСтрока(Рез.СкладСсылка);
			ОбъектСклада.name= Рез.DMWarehouseName;
			ОбъектДока.Вставить("warehouse_1", ОбъектСклада);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Рез.СкладПолучательСсылка) тогда
			ОбъектСклада2 = ПолучитьСтруктуруОбъектаДляHttp("warehouse");
			ОбъектСклада2.id = XMLСтрока(Рез.СкладПолучательСсылка);
			ОбъектСклада2.name = Рез.DMWarehouseName2;
			ОбъектДока.Вставить("warehouse_2", ОбъектСклада2);
		КонецЕсли;
		
		Если Рез.ШаблонСсылка.ИспользоватьДопФормы Тогда
			//Дополнительные формы
			ОбъектСпискаДополнительныхФорм = Новый Массив;
			ЗапросДополнительныхФорм = Новый Запрос;
			ЗапросДополнительныхФорм.Текст = 
			"ВЫБРАТЬ
			|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.ДополнительнаяФорма.Ссылка КАК Ссылка,
			|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.Порядок КАК Порядок,
			|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.РеквизитИзШапки КАК РеквизитИзШапки,
			|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.ПроверятьЗаполнение
			|ИЗ
			|	РегистрСведений.ДатаМобайл_СвязиДополнительныхФормИШаблонов КАК ДатаМобайл_СвязиДополнительныхФормИШаблонов
			|ГДЕ
			|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.Шаблон = &Шаблон
			|	И ДатаМобайл_СвязиДополнительныхФормИШаблонов.ДополнительнаяФорма.ПометкаУдаления = ЛОЖЬ";
			
			ЗапросДополнительныхФорм.УстановитьПараметр("Шаблон", Рез.ШаблонСсылка);
			
			РезультатЗапросаДополнительныхФорм = ЗапросДополнительныхФорм.Выполнить();
			ВыборкаДополнительныхФорм = РезультатЗапросаДополнительныхФорм.Выбрать();
			Пока ВыборкаДополнительныхФорм.Следующий() Цикл
				
				Если НЕ ЗначениеЗаполнено(ВыборкаДополнительныхФорм.Ссылка) тогда 
					Продолжить;
				КонецЕсли;
				
				ОбъектДополнительныхФорм = ПолучитьСтруктуруОбъектаДляHttp("doc_form","doc");
				ОбъектДополнительныхФорм.id = XMLСтрока(ВыборкаДополнительныхФорм.Ссылка);
				ОбъектДополнительныхФорм.doc_id = "d82-" + XMLСтрока(Рез.ДокСсылка);
				ОбъектДополнительныхФорм.is_required = ВыборкаДополнительныхФорм.ПроверятьЗаполнение; 
				ОбъектДополнительныхФорм.form_type = ВыборкаДополнительныхФорм.РеквизитИзШапки;             
				ОбъектСпискаДополнительныхФорм.Добавить(ОбъектДополнительныхФорм);
				
			КонецЦикла;
			ОбъектДока.Вставить("forms", ОбъектСпискаДополнительныхФорм);
		КонецЕсли;
	
		ОбъектСписка.Добавить(ОбъектДока);
	КонецЦикла;	
	
	Попытка ПланыОбмена.УдалитьРегистрациюИзменений(УзелПО, Метаданные.Справочники.ДатаМобайл_ДокументыТСД); Исключение КонецПопытки;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);
КонецФункции

Функция WriteDoc(SN, UserName, СтруктураДокумента, isFinished) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	//Переменные Params
	СтруктураParams = Новый Структура;
	СтруктураParams.Вставить("isFinished", isFinished);

	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(СтруктураДокумента.id, 5));
	Исключение	
		Попытка
			СсылкаНаДок=СоздатьДокумент(SN, UserName,СтруктураДокумента.id, СтруктураДокумента.template.id);
		Исключение		
			СтруктураОтвета.Вставить("Описание", "Не найден документ. ");
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецПопытки;
		
		Если СсылкаНаДок = Неопределено тогда
			СтруктураОтвета.Вставить("Описание", "Не найден документ. ");
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;			
	КонецПопытки;
	
	Шаблон=СсылкаНаДок.Шаблон;
	
	Если (Шаблон.БыстраяПриемка или Шаблон.БыстраяОтгрузка) и НЕ Шаблон.ВидДокументаНового = "ЗаказНаВнутреннееПотребление" Тогда
		Попытка
			Если СтруктураДокумента.client.id = "" Тогда		
				СтруктураОтвета.Вставить("Описание", "Не указан контрагент. ");		
				Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
			Иначе
				Попытка 
					ТекущийКлиент = XMLЗначение(Тип("СправочникСсылка.Партнеры"), Сред(СтруктураДокумента.client.id, 4));
					Если ТекущийКлиент.ПолучитьОбъект() = Неопределено Тогда
						СтруктураОтвета.Вставить("Описание", "Не указан контрагент. ");			
						Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
					Иначе
						
						Если Шаблон.БыстраяОтгрузка и НЕ ТекущийКлиент.Клиент Тогда					
							СтруктураОтвета.Вставить("Описание", "Указанный контрагент не является клиентом, быстрая отгрузка не возможна! ");					
							Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
						КонецЕсли;
					КонецЕсли;	
				Исключение	
					СтруктураОтвета.Вставить("Описание", "Не указан контрагент. ");			
					Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
				КонецПопытки;	
			КонецЕсли;
		Исключение
			СтруктураОтвета.Вставить("Описание", "Не указан контрагент. ");			
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецПопытки;
	КонецЕсли;

	Если Шаблон.БыстроеПеремещение <> 0 Тогда
		
		Попытка
			Модуль_СкладыСервер = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("СкладыСервер");
			
			НаименованиеВторогоСкладаНаТСД = "Контрагент";
			
			Если Шаблон.ИспользоватьВторойСклад Тогда
				ТекущийСкладПолучатель = XMLЗначение(Тип("СправочникСсылка.Склады"), СтруктураДокумента.warehouse_2.id);
				НаименованиеВторогоСкладаНаТСД = "Склад получатель";
			Иначе
				ТекущийСкладПолучатель = XMLЗначение(Тип("СправочникСсылка.Склады"), Сред(СтруктураДокумента.client.id, 4));
			КонецЕсли;
		
			ИспользуетсяОрдернаяСхемаУСкладаПолучателя = Модуль_СкладыСервер.ИспользоватьОрдернуюСхемуПриОтгрузке(ТекущийСкладПолучатель, ТекущаяДата())
															Или Модуль_СкладыСервер.ИспользоватьОрдернуюСхемуПриПоступлении(ТекущийСкладПолучатель, ТекущаяДата());
						
			ТекущийСкладОтправитель = XMLЗначение(Тип("СправочникСсылка.Склады"), СтруктураДокумента.warehouse_1.id);
				
			ИспользуетсяОрдернаяСхемаУСкладаОтправителя = Модуль_СкладыСервер.ИспользоватьОрдернуюСхемуПриОтгрузке(ТекущийСкладОтправитель, ТекущаяДата())
															Или Модуль_СкладыСервер.ИспользоватьОрдернуюСхемуПриПоступлении(ТекущийСкладОтправитель, ТекущаяДата());
			
		Исключение		
			СтруктураОтвета.Вставить("Описание", "Некорректно указан склад. ");			
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецПопытки;
		
		//1 = Перемещение «ордерный – не ордерный»
		//2 = Перемещение «не ордерный – ордерный»		
		ЭтоПеремещениеСОрдерныйНаНеОрдерный = Шаблон.БыстроеПеремещение = 1;												
		
		Если ЭтоПеремещениеСОрдерныйНаНеОрдерный Тогда 
			
			Если Не ИспользуетсяОрдернаяСхемаУСкладаОтправителя Тогда	
				СтруктураОтвета.Вставить("Описание", "В поле ""Склад"" указан не ордерный склад.");			
				Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
			КонецЕсли; 
			
			Если ИспользуетсяОрдернаяСхемаУСкладаПолучателя Тогда 						
				СтруктураОтвета.Вставить("Описание", "В поле " + НаименованиеВторогоСкладаНаТСД + " указан ордерный склад. ");			
				Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
			КонецЕсли;
			
		Иначе
			
			Если ИспользуетсяОрдернаяСхемаУСкладаОтправителя Тогда	
				СтруктураОтвета.Вставить("Описание", "В поле ""Склад"" указан ордерный склад. ");		
				Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
			КонецЕсли; 
			
			Если Не ИспользуетсяОрдернаяСхемаУСкладаПолучателя Тогда	
				СтруктураОтвета.Вставить("Описание", "В поле " + НаименованиеВторогоСкладаНаТСД + " указан не ордерный склад. ");				
				Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
			КонецЕсли;
			
		КонецЕсли;
		                                                           
	КонецЕсли;
	
	
	Если ссылканадок.ПолучитьОбъект()=неопределено Тогда		
		СтруктураОтвета.Вставить("Описание", "Не найден документ " + СтруктураДокумента.id);		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;	
	Если Не СсылкаНаДок.ТСД.Пустая() Тогда
		Если СсылкаНаДок.ТСД <> УзелПО Тогда
			СтруктураОтвета.Вставить("Описание", "Чужой документ.");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
		КонецЕсли;	
	КонецЕсли;	
	Если СсылкаНаДок.ДатаПриемкиОператором<>Дата(1,1,1) Тогда	
		СтруктураОтвета.Вставить("Описание", "Закрытый документ. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);	
	КонецЕсли;	

	Если НЕ Шаблон.ГрупповаяРабота Тогда
		Попытка
			Объект=СсылкаНаДок.ПолучитьОбъект();
			
			Если СсылкаНаДок.ДатаНачалаСбора = Дата(1,1,1) Тогда 		
				Для Каждого СтрокаДокумента из СтруктураДокумента.details.select цикл  
					Объект.ДатаНачалаСбора = СтрокаДокумента.date;
					Прервать;
				КонецЦикла;
				Если Объект.ДатаНачалаСбора=Дата(1,1,1) Тогда 
                	Объект.ДатаНачалаСбора = ТекущаяДата();
				КонецЕсли;
			КонецЕсли;

		Исключение
		КонецПопытки;
		
		Если Объект = неопределено Тогда	
			СтруктураОтвета.Вставить("Описание", "Не нашли документ. ");	
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;
	Иначе
		Объект = Неопределено;
	КонецЕсли;	
	
		Для Каждого СтрокаДокумента Из СтруктураДокумента.details.select Цикл   
			
			//ПРОВЕРКА ДУБЛЕЙ
			Если ПроверитьЗаписи("Select",УзелПО,СсылкаНаДок,СтрокаДокумента,Объект) тогда
				Продолжить;
			КонецЕсли;
			
			//ПРОВЕРКА СЕРИЙ/СЕРИЙНЫХ НОМЕРОВ
			Если СтрокаДокумента.sn<>"" и СтрокаДокумента.sn<>"[]" Тогда
				ШаблонПроверкиСерии = "";
				Если СерияНеПодходит(УзелПО,СсылкаНаДок,СтрокаДокумента,ШаблонПроверкиСерии) Тогда
					СтруктураОтвета.Вставить("Описание", "Серийный номер "+СтрокаДокумента.sn+" не соответсвует шаблону "+ШаблонПроверкиСерии);
					Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
				КонецЕсли;
			КонецЕсли;
			
			//СТРУКТУРА СТРОКИ
			СтруктураСтроки = ПолучитьСтруктуруСтрокиДокумента("Select",УзелПО,СсылкаНаДок,СтрокаДокумента,UserName,Истина);
			
			//ПРОВЕРКА ПРИНАДЛЕЖНОСТИ ЯЧЕЙКИ К СКЛАДУ ДОКУМЕНТА
			Если ЗначениеЗаполнено(СтруктураСтроки.ЯчейкаСсылка) И НЕ СтруктураСтроки.Количество < 0 Тогда
				Если Шаблон.ГрупповаяРабота Тогда
					СкладЯчеек = ДатаМобайл_ОбщийМодуль.ПолучитьСкладВведенныхЯчеекГрупповаяРабота(СсылкаНаДок);			
				Иначе
					СкладЯчеек = ДатаМобайл_ОбщийМодуль.ПолучитьСкладВведенныхЯчеек(Объект.СобранныеДанныеПодбор.Выгрузить());
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СкладЯчеек) И НЕ СтруктураСтроки.ЯчейкаСсылка.Владелец = СкладЯчеек Тогда
					СтруктураОтвета.Вставить("Описание","Введены ячейки разных складов в одном документе, строка не может быть записана!");		
					Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
				КонецЕсли;
			КонецЕсли;
			
			//УдалениеЗначенийДополнительныхФорм
			Если СтруктураСтроки.Количество < 0 Тогда
				ДатаМобайл_ОбщийМодуль.УдалитьЗначениеФормыПоСтроке(СсылкаНаДок, СтруктураСтроки.ИдентификаторСтроки);
			КонецЕсли;
			
			//ПРЕВЫШЕНИЕ ПРИ ГРУППОВОЙ РАБОТЕ
			Если Шаблон.ГрупповаяРабота И Шаблон.ПриПревышенииЗаданияПодбор = 2 Тогда	
				Если ПроверитьПревышениеГрупповогоЗадания("Select",УзелПО,СсылкаНаДок,СтрокаДокумента,СтруктураСтроки) Тогда
					СтруктураОтвета.Вставить("Описание", "Превышено задание по данной номенклатуре.");
					Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
				КонецЕсли;	
			КонецЕсли;

			//ЗАПИСЬ
			Если НЕ Шаблон.ГрупповаяРабота и НЕ Шаблон.БыстроеСканирование Тогда
				НоваяСтрока=Объект.СобранныеДанныеПодбор.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураСтроки);
			Иначе 
				ДатаМобайл_ОбщийМодуль.СоздатьЗаписиГрупповогоДокумента(СтруктураСтроки);
			КонецЕсли;
			
			//ЗАПИСЬ МАРОК
			Если Шаблон.ЕГАИС Тогда
				Если СтрокаДокумента.egais.mark <> "" Тогда
					Если НЕ МаркаСерияУжеЕсть(СтрокаДокумента.egais.mark, СсылкаНаДок, Ложь) Тогда
						МенеджерЗаписиМарки = РегистрыСведений.ДатаМобайл_МаркиДляПроверки.СоздатьМенеджерЗаписи();
						МенеджерЗаписиМарки.Марка = СокрЛП(СтрокаДокумента.egais.mark);
						МенеджерЗаписиМарки.ЗаданиеТСД = СсылкаНаДок;
						МенеджерЗаписиМарки.Статус = Перечисления.ДатаМобайл_СтатусыПроверкиМарок.ОжидаетОтправки;
						МенеджерЗаписиМарки.Серия = "";
						Попытка МенеджерЗаписиМарки.НомерТТН = Объект.ИсходныйДокумент.Номер; Исключение КонецПопытки;
						Попытка МенеджерЗаписиМарки.УТМ = Объект.ИсходныйДокумент.УТМ; Исключение КонецПопытки;
						МенеджерЗаписиМарки.Завершен = Истина;
						МенеджерЗаписиМарки.Записать(Истина);
					Иначе
						НаборЗаписиМарок = РегистрыСведений.ДатаМобайл_МаркиДляПроверки.СоздатьНаборЗаписей();
						ЭлементОтбораЗадание = НаборЗаписиМарок.Отбор.Найти("ЗаданиеТСД");
						ЭлементОтбораЗадание.Использование = Истина;
						ЭлементОтбораЗадание.Значение = СсылкаНаДок;
						ЭлементОтбораЗадание.ВидСравнения = ВидСравнения.Равно;
						ЭлементОтбораМарка = НаборЗаписиМарок.Отбор.Найти("Марка");
						ЭлементОтбораМарка.Использование = Истина;
						ЭлементОтбораМарка.Значение = СокрЛП(СтрокаДокумента.egais.mark);
						ЭлементОтбораСтатус = НаборЗаписиМарок.Отбор.Найти("Статус");
						ЭлементОтбораСтатус.Использование = Истина;
						ЭлементОтбораСтатус.Значение = Перечисления.ДатаМобайл_СтатусыПроверкиМарок.ОжидаетОтправки;
						НаборЗаписиМарок.Прочитать();
						Для Каждого СтрокаНабораЗаписи ИЗ НаборЗаписиМарок Цикл
							Попытка СтрокаНабораЗаписи.НомерТТН = Объект.ИсходныйДокумент.Номер; Исключение КонецПопытки;
							Попытка СтрокаНабораЗаписи.УТМ = Объект.ИсходныйДокумент.УТМ; Исключение КонецПопытки;
							СтрокаНабораЗаписи.Завершен = Истина;
						КонецЦикла;
						НаборЗаписиМарок.Записать(Истина);
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;

			
		КонецЦикла;	
		
		
		Для Каждого СтрокаДокумента из СтруктураДокумента.details.insert цикл
			
			//ПРОВЕРКА ДУБЛЕЙ
			Если ПроверитьЗаписи("Insert",УзелПО,СсылкаНаДок,СтрокаДокумента,Объект) Тогда
				Продолжить;
			КонецЕсли;
			
			//ПРОВЕРКА СЕРИЙ/СЕРИЙНЫХ НОМЕРОВ
			Если СтрокаДокумента.sn <> "" и СтрокаДокумента.sn <> "[]" Тогда
				ШаблонПроверкиСерии = "";
				Если СерияНеПодходит(УзелПО,СсылкаНаДок,СтрокаДокумента,ШаблонПроверкиСерии) Тогда	
					СтруктураОтвета.Вставить("Описание", "Серийный номер "+СтрокаДокумента.sn + " не соответсвует шаблону "+ШаблонПроверкиСерии);
					Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
				КонецЕсли;
			КонецЕсли;

			//СТРУКТУРА СТРОКИ
			СтруктураСтроки = ПолучитьСтруктуруСтрокиДокумента("Insert", УзелПО, СсылкаНаДок, СтрокаДокумента, UserName, Истина);
			
			//ПРОВЕРКА ПРИНАДЛЕЖНОСТИ ЯЧЕЙКИ К СКЛАДУ ДОКУМЕНТА
			Если ЗначениеЗаполнено(СтруктураСтроки.ЯчейкаСсылка) И НЕ СтруктураСтроки.Количество < 0 Тогда
				Если Шаблон.ГрупповаяРабота Тогда
					СкладЯчеек = ДатаМобайл_ОбщийМодуль.ПолучитьСкладВведенныхЯчеекГрупповаяРабота(СсылкаНаДок);			
				Иначе
					СкладЯчеек = ДатаМобайл_ОбщийМодуль.ПолучитьСкладВведенныхЯчеек(Объект.СобранныеДанныеПриемка.Выгрузить());
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СкладЯчеек) И НЕ СтруктураСтроки.ЯчейкаСсылка.Владелец = СкладЯчеек Тогда
					СтруктураОтвета.Вставить("Описание","Введены ячейки разных складов в одном документе, строка не может быть записана!");		
					Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
				КонецЕсли;
			КонецЕсли;
			
			//УдалениеЗначенийДополнительныхФорм
			Если СтруктураСтроки.Количество < 0 Тогда
				ДатаМобайл_ОбщийМодуль.УдалитьЗначениеФормыПоСтроке(СсылкаНаДок, СтруктураСтроки.ИдентификаторСтроки);
			КонецЕсли;
			
			//ПРЕВЫШЕНИЕ ПРИ ГРУППОВОЙ РАБОТЕ
			Если Шаблон.ГрупповаяРабота И Шаблон.ПриПревышенииЗаданияПодбор = 2 Тогда	
				Если ПроверитьПревышениеГрупповогоЗадания("Insert", УзелПО, СсылкаНаДок, СтрокаДокумента, СтруктураСтроки) Тогда	
					СтруктураОтвета.Вставить("Описание", "Превышено задание по данной номенклатуре.");
					Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
				КонецЕсли;	
			КонецЕсли;
			
			//ЗАПИСЬ
			Если НЕ Шаблон.ГрупповаяРабота и НЕ Шаблон.БыстроеСканирование Тогда
				НоваяСтрока=Объект.СобранныеДанныеПриемка.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураСтроки);
			Иначе 
				ДатаМобайл_ОбщийМодуль.СоздатьЗаписиГрупповогоДокумента(СтруктураСтроки);
			КонецЕсли;

		КонецЦикла;	
		
		
		Если НЕ Шаблон.ГрупповаяРабота Тогда
			
			Если isFinished Тогда
				Объект.ДатаЗавершенияСбора=ТекущаяДата();
			КонецЕсли;
			
			Объект.ТСД = УзелПО;
			Объект.Номер = СтруктураДокумента.number;
			Объект.Дата = СтруктураДокумента.date;
			Объект.Комментарий = СтруктураДокумента.comment;
			//Объект.ДатаИзмененияКлиента = DocHead.DMClientSelectDate;
			
			Если Объект.ДатаИзмененияКлиента <> Дата(1,1,1) Тогда
				Попытка
					
					ИДКлиента = Новый УникальныйИдентификатор(Сред(СтруктураДокумента.client.id, 4));
					
					Если НЕ Шаблон.МножествоДокументовКакЗадание Тогда
						
						Если Объект.Клиент.ПолучитьОбъект() = Неопределено Тогда
							Объект.Клиент = Справочники.Склады.ПолучитьСсылку(ИДКлиента);
						КонецЕсли;				
						
						Если Объект.Клиент.ПолучитьОбъект() = Неопределено и ДатаМобайл_ОбщийМодуль.ЕстьМДЛП() Тогда
							Объект.Клиент = Справочники.ОрганизацииМДЛП.ПолучитьСсылку(ИДКлиента);	
						КонецЕсли;
						
						Если Объект.Клиент.ПолучитьОбъект() = Неопределено Тогда
							Объект.Клиент = Справочники.СтруктураПредприятия.ПолучитьСсылку(ИДКлиента);
						КонецЕсли;
						
					КонецЕсли;
				Исключение
				Конецпопытки;
			КонецЕсли;
			
			Попытка 
				Если ЗначениеЗаполнено(СтруктураДокумента.warehouse_1.id) Тогда	
					Объект.Склад = XMLЗначение(Тип("СправочникСсылка.Склады"), СтруктураДокумента.warehouse_1.id);
				КонецЕсли;	
			Исключение
			КонецПопытки;
			
			Попытка
				Если ЗначениеЗаполнено(СтруктураДокумента.warehouse_2.id) Тогда
					Объект.СкладПолучатель = XMLЗначение(Тип("СправочникСсылка.Склады"), СтруктураДокумента.warehouse_2.id);
				КонецЕсли;	
			Исключение
			КонецПопытки;
			
			Попытка 							
				Объект.Записать();
			Исключение	
				СтруктураОтвета.Вставить("Описание", "Ошибка записи. " + ОписаниеОшибки());	
				Возврат ПодготовитьОтветJSON(,СтруктураОтвета);	
			КонецПопытки;	
		Иначе
			
			ДатаСбораПоТСД = ДатаМобайл_ОбщийМодуль.ПолучитьДатуГрупповогоДокумента(SN, СсылкаНаДок, "ДатаНачалаСбора");	
			Если Не ЗначениеЗаполнено(ДатаСбораПоТСД) Тогда	
				ДатаМобайл_ОбщийМодуль.СоздатьНачальнуюЗаписьТСДГрупповыхДокументов(SN, СсылкаНаДок, UserName);		
			КонецЕсли;

		Попытка
			Если СсылкаНаДок.ДатаНачалаСбора=Дата(1,1,1) Тогда
				Объект=СсылкаНаДок.ПолучитьОбъект();
				Объект.ДатаНачалаСбора=ТекущаяДата();
				Объект.Записать();
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Если isFinished Тогда
			ДатаЗавершенияПоТСД = ДатаМобайл_ОбщийМодуль.ПолучитьДатуГрупповогоДокумента(SN, СсылкаНаДок, "ДатаЗавершенияСбора");
			Если (ДатаЗавершенияПоТСД = Неопределено) ИЛИ (ДатаЗавершенияПоТСД = Дата(1,1,1)) Тогда
				ДатаМобайл_ОбщийМодуль.ОбновитьЗаписьТСДГрупповогоДокумента(SN,СсылкаНаДок,ТекущаяДата());	
			КонецЕсли;
			
			Если ДатаМобайл_ОбщийМодуль.ПроверитьЗавершенностьГрупповогоДокумента(СсылкаНаДок) Тогда
				Попытка
					Объект=СсылкаНаДок.ПолучитьОбъект();
					Объект.ДатаЗавершенияСбора=ТекущаяДата();
					
					Попытка
						Если ЗначениеЗаполнено(СтруктураДокумента.warehouse_1.id) Тогда
							Объект.Склад = XMLЗначение(Тип("СправочникСсылка.Склады"), СтруктураДокумента.warehouse_1.id);
						КонецЕсли;
					Исключение 
					КонецПопытки;
					
					Попытка
						Если ЗначениеЗаполнено(СтруктураДокумента.warehouse_2.id) Тогда
							Объект.СкладПолучатель = XMLЗначение(Тип("СправочникСсылка.Склады"), СтруктураДокумента.warehouse_2.id);
 						КонецЕсли;	
					Исключение 
					КонецПопытки;
				
					Объект.Записать();
				Исключение		
					СтруктураОтвета.Вставить("Описание", "Ошибка записи. " + ОписаниеОшибки());
					Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;	
	
	СтруктураОтвета.Вставить("is_success", Истина);
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);

КонецФункции

Функция CreateDoc(SN, UserName,TemplateID, AppVersion) Экспорт 

	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                    |	ДатаМобайл_ШаблоныДокументов.Ссылка КАК ШаблонСсылка
						|ИЗ
	                    |	Справочник.ДатаМобайл_ШаблоныДокументов КАК ДатаМобайл_ШаблоныДокументов
	                    |ГДЕ
	                    |	ДатаМобайл_ШаблоныДокументов.Код = &ИД");
	
	Запрос.УстановитьПараметр("ИД", Число(TemplateID));
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		
		//Создаем док в справочнике
		Объект = Справочники.ДатаМобайл_ДокументыТСД.СоздатьЭлемент();
		Объект.УстановитьНовыйКод();
		Объект.Шаблон=Рез.ШаблонСсылка;
		Попытка 
			Объект.ИсходныйДокумент = Документы[Объект.Шаблон.ВидДокумента].ПустаяСсылка();	
			Если СокрЛП(Объект.Шаблон.ВидДокументаНового) <> "" Тогда
				Объект.НовыйДокумент=Документы[Объект.Шаблон.ВидДокументаНового].Пустаяссылка();
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Если Объект.Шаблон.ГрупповойДокумент Тогда
			Если Объект.СписокДокументов.ВыгрузитьКолонку("ДокументТСД").Количество() = 0 Тогда
				СтруктураОтвета.Вставить("Описание", "Настройка ""Групповой документ"" не поддерживает работу без задания! ");
				Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
			КонецЕсли;
		КонецЕсли;
		
		Объект.ДатаСоздания = ТекущаяДата();
		Объект.Источник = УзелПО;	
		Объект.ДатаНачалаСбора = ТекущаяДата();	
		Если НЕ (Объект.Шаблон.ГрупповаяРабота) Тогда
			Объект.ТСД=УзелПО;
		КонецЕсли;
	    Объект.Дата = ТекущаяДата();
		Объект.Номер = "DMO-" + Формат(Объект.код, "ЧГ=0");
		//Объект.Комментарий = DocOutID;
		
		Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		Объект.ОбменДанными.Получатели.Очистить();
		Объект.ОбменДанными.Получатели.Заполнить();
		Объект.ОбменДанными.Получатели.Удалить(УзелПО);	
		Объект.Записать();
		
				
		//Готовим данные для ТСД по доку
		ОбъектДока = ПолучитьСтруктуруОбъектаДляHttp("doc");		
		ОбъектДока.id = "d82-" + XMLСтрока(Объект.Ссылка);
		ОбъектДока.is_deleted = Ложь;
		ОбъектДока.number = Объект.Номер;
		ОбъектДока.date = Строка(Объект.Дата);
		ОбъектДока.barcode = Объект.Номер;
		ОбъектДока.comment = "";

		//Готовим данные для ТСД по шаблону
		ОбъектШаблона = ПолучитьСтруктуруОбъектаДляHttp("template");
		ЗаполнитьОбъектШаблона(ОбъектШаблона,Рез.ШаблонСсылка, AppVersion);
		ОбъектДока.Вставить("template", ОбъектШаблона);
		
		Если Рез.ШаблонСсылка.ИспользоватьДопФормы Тогда
			//Готовим данные для ТСД по дополнительным формам
			ОбъектСпискаДополнительныхФорм = Новый Массив;
			ЗапросДополнительныхФорм = Новый Запрос;
			ЗапросДополнительныхФорм.Текст = 
			"ВЫБРАТЬ
			|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.ДополнительнаяФорма.Ссылка КАК Ссылка,
			|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.Порядок КАК Порядок,
			|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.РеквизитИзШапки КАК РеквизитИзШапки,
			|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.ПроверятьЗаполнение
			|ИЗ
			|	РегистрСведений.ДатаМобайл_СвязиДополнительныхФормИШаблонов КАК ДатаМобайл_СвязиДополнительныхФормИШаблонов
			|ГДЕ
			|	ДатаМобайл_СвязиДополнительныхФормИШаблонов.Шаблон = &Шаблон
			|	И ДатаМобайл_СвязиДополнительныхФормИШаблонов.ДополнительнаяФорма.ПометкаУдаления = ЛОЖЬ";
			
			ЗапросДополнительныхФорм.УстановитьПараметр("Шаблон", Рез.ШаблонСсылка);
			
			РезультатЗапросаДополнительныхФорм = ЗапросДополнительныхФорм.Выполнить();
			ВыборкаДополнительныхФорм = РезультатЗапросаДополнительныхФорм.Выбрать();
			Пока ВыборкаДополнительныхФорм.Следующий() Цикл
				
				Если НЕ ЗначениеЗаполнено(ВыборкаДополнительныхФорм.Ссылка) тогда 
					Продолжить;
				КонецЕсли;
				
				ОбъектДополнительныхФорм = ПолучитьСтруктуруОбъектаДляHttp("doc_form","doc");
				ОбъектДополнительныхФорм.id = XMLСтрока(ВыборкаДополнительныхФорм.Ссылка);
				ОбъектДополнительныхФорм.doc_id = "d82-" + XMLСтрока(Объект.Ссылка);
				ОбъектДополнительныхФорм.is_required = ВыборкаДополнительныхФорм.ПроверятьЗаполнение; 
				ОбъектДополнительныхФорм.form_type = ВыборкаДополнительныхФорм.РеквизитИзШапки;             
				ОбъектСпискаДополнительныхФорм.Добавить(ОбъектДополнительныхФорм);
				
			КонецЦикла;	
			ОбъектДока.Вставить("forms", ОбъектСпискаДополнительныхФорм);
		КонецЕсли;
	
		Возврат ПодготовитьОтветJSON(ОбъектДока);
	Иначе			
		СтруктураОтвета.Вставить("Описание", "Не найден шаблон. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецЕсли;	
	
КонецФункции

Функция ReopenDoc(SN, UserName, DocOutID) Экспорт
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО=НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;	
	
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));	
	Исключение	
		СтруктураОтвета.Вставить("Описание", "Не найден документ. " );		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;	
	
	Если СсылкаНаДок.ПолучитьОбъект() = Неопределено Тогда		
		СтруктураОтвета.Вставить("Описание", "Не найден документ. " );	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;
	
	Если НЕ СсылкаНаДок.ТСД.Пустая() Тогда
		Если СсылкаНаДок.ТСД <> УзелПО Тогда
			СтруктураОтвета.Вставить("Описание", "Групповой документ не поддерживает очистку. ");	
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕслИ;	
	КонецЕсли;	
	Если СсылкаНаДок.ДатаПриемкиОператором <> Дата(1, 1, 1) Тогда		
		СтруктураОтвета.Вставить("Описание", "Закрытый документ. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕслИ;	
	
	Если СсылкаНаДок.ДатаЗавершенияСбора = Дата(1, 1, 1) И СсылкаНаДок.Шаблон.ГрупповаяРабота Тогда
		ДатаМобайл_ОбщийМодуль.ОбновитьЗаписьТСДГрупповогоДокумента(SN,СсылкаНаДок, Дата(1, 1, 1));
	
		СтруктураОтвета.Вставить("is_success", Истина);		
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	КонецЕслИ;
	
	попытка
		Объект=СсылкаНаДок.ПолучитьОбъект();
		
		Если Объект.ТСД.Пустая() И НЕ(СсылкаНаДок.Шаблон.ГрупповаяРабота) Тогда
			Объект.ТСД = УзелПО;
		КонецЕсли;

		Объект.ДатаЗавершенияСбора = "";
		Объект.Записать();
		
		ДатаМобайл_ОбщийМодуль.ОбновитьЗаписьТСДГрупповогоДокумента(SN,СсылкаНаДок, Дата(1, 1, 1));
		
	Исключение	
		СтруктураОтвета.Вставить("Описание", "Не смогли записать документ. " );		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецПопытки;	
	
	СтруктураОтвета.Вставить("is_success", Истина);
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);

КонецФункции

Функция OnWriteRecSelect(SN, UserName, DocOutID, СтрокаДокумента) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО=НайтиУзел(SN);
	Если УзелПО=Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;	

	попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));
	Исключение			
		СтруктураОтвета.Вставить("Описание", "Не найден документ. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;
	
	Модуль_ОбщегоНазначения = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначения");
	ЗначенияРеквизитовСсылкаНаДок = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДок,"ТСД,ДатаНачалаСбора,ДатаЗавершенияСбора,Шаблон,ИсходныйДокумент,Склад");
	ДокТСД = ЗначенияРеквизитовСсылкаНаДок.ТСД;
	ДокДатаНачалаСбора = ЗначенияРеквизитовСсылкаНаДок.ДатаНачалаСбора;
	ДокДатаЗавершенияСбора = ЗначенияРеквизитовСсылкаНаДок.ДатаЗавершенияСбора;
	Шаблон = ЗначенияРеквизитовСсылкаНаДок.Шаблон;
	ИсходныйДокумент = ЗначенияРеквизитовСсылкаНаДок.ИсходныйДокумент;
	Склад  = ЗначенияРеквизитовСсылкаНаДок.Склад;

	Если Шаблон = Неопределено Тогда		
		СтруктураОтвета.Вставить("Описание", "Не нашли запись документа. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;

	ЗначенияРеквизитовШаблон = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Шаблон,"ГрупповаяРабота,ПечатьЭтикеткиСерииПодбор,ЕГАИС,ИспользоватьМаркировку,МаркировкаОнлайнПроверкаВложенностиУпаковок,ОтсылатьГотовуюЗаписьНаСерверПодбор,ИспользованиеУпаковочныхЛистовПодбор,МаркировкаЗапретитьАгрегациюВЗаполненныеУпаковки,ПриПревышенииЗаданияПодбор,ВидДокумента,БыстроеСканирование,МаркировкаЗапретитьПовторнуюАгрегациюКМ,КонтролироватьОстатокПоСериям");
	Шаблон_ГрупповаяРабота = ЗначенияРеквизитовШаблон.ГрупповаяРабота;
	Шаблон_ПечатьЭтикеткиСерииПодбор = ЗначенияРеквизитовШаблон.ПечатьЭтикеткиСерииПодбор;
	Шаблон_ЕГАИС = ЗначенияРеквизитовШаблон.ЕГАИС;
	Шаблон_ИспользоватьМаркировку = ЗначенияРеквизитовШаблон.ИспользоватьМаркировку;
	Шаблон_МаркировкаОнлайнПроверкаВложенностиУпаковок = ЗначенияРеквизитовШаблон.МаркировкаОнлайнПроверкаВложенностиУпаковок;
	Шаблон_ОтсылатьГотовуюЗаписьНаСерверПодбор = ЗначенияРеквизитовШаблон.ОтсылатьГотовуюЗаписьНаСерверПодбор;
	Шаблон_ИспользованиеУпаковочныхЛистовПодбор = ЗначенияРеквизитовШаблон.ИспользованиеУпаковочныхЛистовПодбор;
	Шаблон_МаркировкаЗапретитьАгрегациюВЗаполненныеУпаковки = ЗначенияРеквизитовШаблон.МаркировкаЗапретитьАгрегациюВЗаполненныеУпаковки;
	Шаблон_МаркировкаЗапретитьПовторнуюАгрегациюКМ = ЗначенияРеквизитовШаблон.МаркировкаЗапретитьПовторнуюАгрегациюКМ;
	Шаблон_ПриПревышенииЗаданияПодбор = ЗначенияРеквизитовШаблон.ПриПревышенииЗаданияПодбор;
	Шаблон_ВидДокумента = ЗначенияРеквизитовШаблон.ВидДокумента;
	Шаблон_БыстроеСканирование = ЗначенияРеквизитовШаблон.БыстроеСканирование;
	Шаблон_КонтролироватьОстатокПоСериям = ЗначенияРеквизитовШаблон.КонтролироватьОстатокПоСериям; 
	
	 
	

	Если ЗначениеЗаполнено(ДокТСД) Тогда
		Если ДокТСД<>УзелПО Тогда		
			СтруктураОтвета.Вставить("Описание", "Чужой документ. ");	
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	КонецЕсли;	
	
	Если ДокДатаЗавершенияСбора<>Дата(1,1,1) Тогда		
		СтруктураОтвета.Вставить("Описание", "Закрытый документ. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;	
	
	
	//ЗАПИСЬ	
	Если НЕ Шаблон_ГрупповаяРабота и НЕ Шаблон_БыстроеСканирование Тогда
		//ОБЫЧНАЯ ЛОГИКА
		Попытка
			Объект=СсылкаНаДок.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		
		Если Объект = Неопределено Тогда	
			СтруктураОтвета.Вставить("Описание", "Не нашли документ. ");	
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;
	Иначе
		Объект = Неопределено;	
	КонецЕсли;
	
	//ПРОВЕРКА ДУБЛЕЙ
	Если ПроверитьЗаписи("Select",УзелПО,СсылкаНаДок,СтрокаДокумента,Объект) Тогда
		СтруктураОтвета.Вставить("is_success", Истина);	
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	КонецЕсли;
	
	//ПРОВЕРКА СЕРИЙ/СЕРИЙНЫХ НОМЕРОВ
	Если СтрокаДокумента.sn <> "" И СтрокаДокумента.sn <> "[]" Тогда
		ШаблонПроверкиСерии = "";
		Если СерияНеПодходит(УзелПО, СсылкаНаДок, СтрокаДокумента, ШаблонПроверкиСерии) Тогда		
			СтруктураОтвета.Вставить("Описание", "Серийный номер " + СтрокаДокумента.sn + " не соответсвует шаблону " + ШаблонПроверкиСерии);	
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;
	КонецЕсли;
		
	//СТРУКТУРА СТРОКИ
	СтруктураСтроки = ПолучитьСтруктуруСтрокиДокумента("Select",УзелПО,СсылкаНаДок,СтрокаДокумента,UserName);
	
	//ПРОВЕРКА ПРИНАДЛЕЖНОСТИ ЯЧЕЙКИ К СКЛАДУ ДОКУМЕНТА
	Если ЗначениеЗаполнено(СтруктураСтроки.ЯчейкаСсылка) И НЕ СтруктураСтроки.Количество < 0 Тогда
		Если Шаблон_ГрупповаяРабота Тогда
			СкладЯчеек = ДатаМобайл_ОбщийМодуль.ПолучитьСкладВведенныхЯчеекГрупповаяРабота(СсылкаНаДок);			
		Иначе
			СкладЯчеек = ДатаМобайл_ОбщийМодуль.ПолучитьСкладВведенныхЯчеек(СсылкаНаДок.СобранныеДанныеПодбор.Выгрузить());
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СкладЯчеек) И НЕ СтруктураСтроки.ЯчейкаСсылка.Владелец = СкладЯчеек Тогда
			СтруктураОтвета.Вставить("Описание","Введены ячейки разных складов в одном документе, строка не может быть записана!");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;
	КонецЕсли;
	
	//УдалениеЗначенийДополнительныхФорм
	Если СтруктураСтроки.Количество < 0 Тогда
		ДатаМобайл_ОбщийМодуль.УдалитьЗначениеФормыПоСтроке(СсылкаНаДок, СтруктураСтроки.ИдентификаторСтроки);
	КонецЕсли;
	
	//ПРОВЕРКА ОСТАТКОВ ПО СЕРИЯМ
	Если Шаблон_КонтролироватьОстатокПоСериям И СтрокаДокумента.sn <> "" и СтрокаДокумента.sn<>"[]" и СтруктураСтроки.Количество > 0 Тогда 		
		СообщениеОПревышении="";
		Если ПроверитьПревышениеОстатковПоСерии(УзелПО,СсылкаНаДок,СтрокаДокумента,СтруктураСтроки,СообщениеОПревышении) Тогда
			СтруктураОтвета.Вставить("Описание",СообщениеОПревышении);		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;
	КонецЕсли;	
	
	//ПЕЧАТЬ ЭТИКЕТОК СЕРИЙ/СЕРИЙНЫХ НОМЕРОВ
	Если Шаблон_ПечатьЭтикеткиСерииПодбор и СтрокаДокумента.sn<>"" и СтрокаДокумента.sn<>"[]" и СтруктураСтроки.Количество>0 Тогда
		ОписаниеОшибки="";
		ОтправитьСериюНаПечать(SN,UserName,DocOutID,СтруктураСтроки,ОписаниеОшибки);
		Если ОписаниеОшибки<>"" Тогда		
			СтруктураОтвета.Вставить("Описание", "ОписаниеОшибки" );		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	КонецЕсли;	

	//ПРОВЕРКА УНИКАЛЬНОСТИ МАРКИ ЕГАИС ПРИ ГРУППОВОЙ РАБОТЕ
	Если Шаблон_ГрупповаяРабота И Шаблон_ЕГАИС и Число(СтрокаДокумента.qty) > 0 и СтрокаДокумента.egais.mark <> ""  Тогда	
		Если ПроверитьУникальностьМаркиЕгаисГрупповогоЗадания("Select", УзелПО, СсылкаНаДок, СтрокаДокумента, СтруктураСтроки) Тогда		
			СтруктураОтвета.Вставить("Описание", "Данная марка уже была отсканирована ранее." );		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	КонецЕсли;
	
	//ПРОВЕРКА УНИКАЛЬНОСТИ КМ ПРИ ГРУППОВОЙ РАБОТЕ
	Если Шаблон_ГрупповаяРабота И Шаблон_ИспользоватьМаркировку и Число(СтрокаДокумента.qty) > 0 и СтрокаДокумента.egais.mark <> ""  Тогда	
		Если ПроверитьУникальностьКодаМаркировкиГрупповогоЗадания("Select",УзелПО,СсылкаНаДок,СтрокаДокумента,СтруктураСтроки) Тогда	
			СтруктураОтвета.Вставить("Описание", "Данный КМ уже был отсканирован ранее. ");	
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	КонецЕсли;
	
	//ПРОВЕРКА УНИКАЛЬНОСТИ КМ ПРИ РАБОТЕ С УПАКОВКАМИ
	Если Шаблон_ИспользоватьМаркировку и Шаблон_МаркировкаОнлайнПроверкаВложенностиУпаковок и Число(СтрокаДокумента.qty)>0  Тогда
		Если БылоСканированиеУпаковкиВСоставеДругойВЭтомДокументе(СтруктураСтроки, СсылкаНаДок, Шаблон) Тогда	
			СтруктураОтвета.Вставить("Описание", "Нарушение состава упаковки при сканировании (вложение или агрегат уже были отсканированы в документе ранее).");
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);	
		КонецЕсли;	
	КонецЕсли;
	
	//ПРОВЕРКА УПАКОВКИ КМ ПРИ АГРЕГАЦИИ
	Если Шаблон_ИспользоватьМаркировку и Шаблон_ОтсылатьГотовуюЗаписьНаСерверПодбор и Шаблон_ИспользованиеУпаковочныхЛистовПодбор<>0 и Шаблон_ИспользованиеУпаковочныхЛистовПодбор<>2 и Число(СтрокаДокумента.qty)>0  Тогда				
		Если Шаблон_МаркировкаЗапретитьПовторнуюАгрегациюКМ Тогда
			Если КодМаркировкиУжеАгрегирован(СтруктураСтроки, СсылкаНаДок, Шаблон) Тогда
				СтруктураОтвета.Вставить("Описание", "Код маркировки уже помещен в другую упаковку.");
				Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
			КонецЕсли;
		КонецЕсли;

		Если Шаблон_МаркировкаЗапретитьАгрегациюВЗаполненныеУпаковки Тогда
			Если УпаковочныйЛистУжеИмеетВложенность(СтруктураСтроки, СсылкаНаДок, Шаблон) Тогда
				СтруктураОтвета.Вставить("Описание", "Групповая упаковка не может быть использована, т.к. уже была заполнена ранее.");
				Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
		
	
	//ПРЕВЫШЕНИЕ ПРИ ГРУППОВОЙ РАБОТЕ
	Если Шаблон_ГрупповаяРабота И Шаблон_ПриПревышенииЗаданияПодбор = 2 Тогда	
		Если ПроверитьПревышениеГрупповогоЗадания("Select",УзелПО,СсылкаНаДок,СтрокаДокумента,СтруктураСтроки) Тогда
			СтруктураОтвета.Вставить("Описание", "Превышено задание по данной номенклатуре. ");
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	КонецЕсли;

	// аст ПРЕВЫШЕНИЕ ПО СПРАВКАМ ЕГАИС
	Если Шаблон_ЕГАИС И Шаблон_ВидДокумента = "астТоварноТранспортныеНакладныеИзЕГАИС" И Шаблон_ПриПревышенииЗаданияПодбор = 2  и Число(СтрокаДокумента.qty)>0 Тогда
		
		Модуль_ОбщегоНазначения = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначения");
		ТипДокумента = Модуль_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйДокумент, "ТипДокумента");
		
		Если ТипДокумента = ПредопределенноеЗначение("Перечисление.астТипыАктовТоварноТранспортныхНакладныхЕГАИС.Исходящий") Тогда		
			ЗначениеВозврата = ПроверитьПревышениеЗаданияПоСправкамЕГАИС("Select",УзелПО,СсылкаНаДок,СтрокаДокумента,СтруктураСтроки);
			Если ЗначениеВозврата = 1 Тогда
				СтруктураОтвета.Вставить("Описание", "Превышено задание по данной справке Б. ");
				Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
			ИначеЕсли ЗначениеВозврата = 2 Тогда
				СтруктураОтвета.Вставить("Описание", "Не найдена справка Б в документе.");			
				Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
			ИначеЕсли ЗначениеВозврата = 3 Тогда			
				СтруктураОтвета.Вставить("Описание", "Не найдена справка Б по новой марке.");				
				Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
			КонецЕсли;			
		КонецЕсли;	
	КонецЕсли;
	
	//ЗАПИСЬ МАРОК
	Если Шаблон_ЕГАИС Тогда
		Если СтрокаДокумента.egais.mark <> "" Тогда
			Если НЕ МаркаСерияУжеЕсть(СтрокаДокумента.egais.mark, СсылкаНаДок, Ложь) Тогда
				МенеджерЗаписиМарки = РегистрыСведений.ДатаМобайл_МаркиДляПроверки.СоздатьМенеджерЗаписи();
				МенеджерЗаписиМарки.Марка = СтрокаДокумента.egais.mark;
				МенеджерЗаписиМарки.ЗаданиеТСД = СсылкаНаДок;
				МенеджерЗаписиМарки.Статус = Перечисления.ДатаМобайл_СтатусыПроверкиМарок.ОжидаетОтправки;
				МенеджерЗаписиМарки.Серия = "";	
				Попытка МенеджерЗаписиМарки.НомерТТН = ИсходныйДокумент.Номер; Исключение КонецПопытки;
				Попытка МенеджерЗаписиМарки.УТМ = ИсходныйДокумент.УТМ; Исключение КонецПопытки;
				МенеджерЗаписиМарки.Записать(Истина);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	
	//ЗАПИСЬ	
	Если НЕ Шаблон_ГрупповаяРабота И НЕ Шаблон_БыстроеСканирование Тогда
				
		Если Не ЗначениеЗаполнено(ДокДатаНачалаСбора) Тогда
			Объект.ДатаНачалаСбора=ТекущаяДата();
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДокТСД) Тогда
			Объект.ТСД=УзелПО;
		КонецЕсли;

		НоваяСтрока=Объект.СобранныеДанныеПодбор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураСтроки);
		
		Попытка
			Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
			Объект.ОбменДанными.Получатели.Очистить();
			Объект.ОбменДанными.Получатели.Заполнить();
			Объект.ОбменДанными.Получатели.Удалить(УзелПО);
			Объект.ДополнительныеСвойства.Вставить("OnWriteRecSelect", Истина);
			Объект.Записать();
			
			//ЗафиксироватьТранзакцию();

		Исключение
			СтруктураОтвета.Вставить("Описание", "Не смогли записать документ. ");				
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецПопытки;

	Иначе
		//ГРУППОВОЙ ДОКУМЕНТ
		ДатаМобайл_ОбщийМодуль.СоздатьЗаписиГрупповогоДокумента(СтруктураСтроки);
		
		Если Шаблон_ГрупповаяРабота Тогда			
			ДатаСбораПоТСД = ДатаМобайл_ОбщийМодуль.ПолучитьДатуГрупповогоДокумента(SN, СсылкаНаДок, "ДатаНачалаСбора");	
			Если Не ЗначениеЗаполнено(ДатаСбораПоТСД)  Тогда	
				ДатаМобайл_ОбщийМодуль.СоздатьНачальнуюЗаписьТСДГрупповыхДокументов(SN, СсылкаНаДок, UserName);		
			КонецЕсли;
		КонецЕсли;	
		
		Если Не ЗначениеЗаполнено(ДокДатаНачалаСбора) Тогда
			Попытка
				Объект=СсылкаНаДок.ПолучитьОбъект();
				Объект.ДатаНачалаСбора=ТекущаяДата();
				
				Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
				Объект.ОбменДанными.Получатели.Очистить();
				Объект.ДополнительныеСвойства.Вставить("OnWriteRecSelect", Истина);
				Объект.Записать();
			Исключение
			КонецПопытки;	
			
		КонецЕсли;
	
	КонецЕсли;	
	
	СтруктураОтвета.Вставить("is_success", Истина);
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);

КонецФункции

Функция OnWriteRecInsert(SN, UserName, DocOutID, СтрокаДокумента) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);	
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;	
	
	попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));	
	Исключение			
		СтруктураОтвета.Вставить("Описание", "Не найден документ. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;
	
	Модуль_ОбщегоНазначения = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначения");
	ЗначенияРеквизитовСсылкаНаДок = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДок,"ТСД, ДатаНачалаСбора,ДатаЗавершенияСбора,Шаблон,ИсходныйДокумент,Склад");
	ДокТСД = ЗначенияРеквизитовСсылкаНаДок.ТСД;
	ДокДатаНачалаСбора = ЗначенияРеквизитовСсылкаНаДок.ДатаНачалаСбора;
	ДокДатаЗавершенияСбора = ЗначенияРеквизитовСсылкаНаДок.ДатаЗавершенияСбора;
	Шаблон = ЗначенияРеквизитовСсылкаНаДок.Шаблон;
	ИсходныйДокумент = ЗначенияРеквизитовСсылкаНаДок.ИсходныйДокумент;
	Склад  = ЗначенияРеквизитовСсылкаНаДок.Склад;

	Если Шаблон = Неопределено Тогда	
		СтруктураОтвета.Вставить("Описание", "Не нашли запись документа. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;

	ЗначенияРеквизитовШаблон 				    = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Шаблон,"ГрупповаяРабота,ОтсылатьГотовуюЗаписьНаСерверПриемка,ПриПревышенииЗаданияПриемка,ВидДокумента,БыстроеСканирование");
	Шаблон_ГрупповаяРабота 					    = ЗначенияРеквизитовШаблон.ГрупповаяРабота;
	Шаблон_ОтсылатьГотовуюЗаписьНаСерверПриемка = ЗначенияРеквизитовШаблон.ОтсылатьГотовуюЗаписьНаСерверПриемка;
	Шаблон_ПриПревышенииЗаданияПриемка 	  		= ЗначенияРеквизитовШаблон.ПриПревышенииЗаданияПриемка;
	Шаблон_ВидДокумента 					    = ЗначенияРеквизитовШаблон.ВидДокумента;
	Шаблон_БыстроеСканирование 				    = ЗначенияРеквизитовШаблон.БыстроеСканирование;

	
	Если ЗначениеЗаполнено(ДокТСД) Тогда
		Если ДокТСД <> УзелПО Тогда		
			СтруктураОтвета.Вставить("Описание", "Чужой документ.");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	КонецЕсли;	
	
	Если ДокДатаЗавершенияСбора<>Дата(1,1,1) Тогда	
		СтруктураОтвета.Вставить("Описание", "Закрытый документ.");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;	
	
	//ЗАПИСЬ	
	Если НЕ Шаблон_ГрупповаяРабота и НЕ Шаблон_БыстроеСканирование Тогда
		//ОБЫЧНАЯ ЛОГИКА
		Попытка
			Объект=СсылкаНаДок.ПолучитьОбъект();
		Исключение
		КонецПопытки;
		
		Если Объект = неопределено Тогда			
			СтруктураОтвета.Вставить("Описание", "Не нашли документ. ");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;
	Иначе
		Объект = Неопределено;	
	КонецЕсли;

	//ПРОВЕРКА ДУБЛЕЙ
	Если ПроверитьЗаписи("Insert", УзелПО, СсылкаНаДок, СтрокаДокумента, Объект) Тогда		
		СтруктураОтвета.Вставить("is_success", Истина);		
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	КонецЕсли;
	
	//ПРОВЕРКА СЕРИЙ/СЕРИЙНЫХ НОМЕРОВ
	Если СтрокаДокумента.sn <> "" и СтрокаДокумента.sn <> "[]" Тогда
		ШаблонПроверкиСерии = "";
		Если СерияНеПодходит(УзелПО,СсылкаНаДок,СтрокаДокумента,ШаблонПроверкиСерии) Тогда			
			СтруктураОтвета.Вставить("Описание", "Серийный номер " + СтрокаДокумента.sn + " не соответсвует шаблону " + ШаблонПроверкиСерии);		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;
	КонецЕсли;

	//СТРУКТУРА СТРОКИ
	СтруктураСтроки = ПолучитьСтруктуруСтрокиДокумента("Insert", УзелПО, СсылкаНаДок, СтрокаДокумента,UserName);
	
	//ПРОВЕРКА ПРИНАДЛЕЖНОСТИ ЯЧЕЙКИ К СКЛАДУ ДОКУМЕНТА
	Если ЗначениеЗаполнено(СтруктураСтроки.ЯчейкаСсылка) И НЕ СтруктураСтроки.Количество < 0 Тогда
		Если Шаблон_ГрупповаяРабота Тогда
			СкладЯчеек = ДатаМобайл_ОбщийМодуль.ПолучитьСкладВведенныхЯчеекГрупповаяРабота(СсылкаНаДок);			
		Иначе
			СкладЯчеек = ДатаМобайл_ОбщийМодуль.ПолучитьСкладВведенныхЯчеек(СсылкаНаДок.СобранныеДанныеПриемка.Выгрузить());
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СкладЯчеек) И НЕ СтруктураСтроки.ЯчейкаСсылка.Владелец = СкладЯчеек Тогда
			СтруктураОтвета.Вставить("Описание","Введены ячейки разных складов в одном документе, строка не может быть записана!");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;
	КонецЕсли;
	
	//УдалениеЗначенийДополнительныхФорм
	Если СтруктураСтроки.Количество < 0 Тогда
		ДатаМобайл_ОбщийМодуль.УдалитьЗначениеФормыПоСтроке(СсылкаНаДок, СтруктураСтроки.ИдентификаторСтроки);
	КонецЕсли;
	
	//ПРЕВЫШЕНИЕ ПРИ ГРУППОВОЙ РАБОТЕ
	Если Шаблон_ГрупповаяРабота И Шаблон_ПриПревышенииЗаданияПриемка = 2 Тогда	
		Если ПроверитьПревышениеГрупповогоЗадания("Insert",УзелПО,СсылкаНаДок,СтрокаДокумента,СтруктураСтроки) Тогда		
			СтруктураОтвета.Вставить("Описание", "Превышено задание по данной номенклатуре.");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
		КонецЕсли;	
	
	КонецЕсли;
		
	//ЗАПИСЬ	
	Если НЕ Шаблон_ГрупповаяРабота И НЕ Шаблон_БыстроеСканирование Тогда
				
		Если Не ЗначениеЗаполнено(ДокДатаНачалаСбора) Тогда
			Объект.ДатаНачалаСбора = ТекущаяДата();
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДокТСД) Тогда
			Объект.ТСД=УзелПО;
		КонецЕсли;

		НоваяСтрока=Объект.СобранныеДанныеПриемка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтруктураСтроки);
		
		Попытка
			Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
			Объект.ОбменДанными.Получатели.Очистить();
			Объект.ОбменДанными.Получатели.Заполнить();
			Объект.ОбменДанными.Получатели.Удалить(УзелПО);

			Объект.Записать();
			
			//ЗафиксироватьТранзакцию();

		Исключение			
			СтруктураОтвета.Вставить("Описание", "Не смогли записать документ. ");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецПопытки;
		
	Иначе
		
		//ГРУППОВОЙ ДОКУМЕНТ
		ДатаМобайл_ОбщийМодуль.СоздатьЗаписиГрупповогоДокумента(СтруктураСтроки);
		
		Если Шаблон_ГрупповаяРабота Тогда
					
			ДатаСбораПоТСД = ДатаМобайл_ОбщийМодуль.ПолучитьДатуГрупповогоДокумента(SN, СсылкаНаДок, "ДатаНачалаСбора");	
			Если Не ЗначениеЗаполнено(ДатаСбораПоТСД)  Тогда	
				ДатаМобайл_ОбщийМодуль.СоздатьНачальнуюЗаписьТСДГрупповыхДокументов(SN, СсылкаНаДок, UserName);		
			КонецЕсли;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДокДатаНачалаСбора) Тогда
			Попытка
				Объект=СсылкаНаДок.ПолучитьОбъект();
				Объект.ДатаНачалаСбора=ТекущаяДата();
				
				Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
				Объект.ОбменДанными.Получатели.Очистить();
				Объект.Записать();
			Исключение
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЕсли;	
	
	СтруктураОтвета.Вставить("is_success", Истина);
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);

КонецФункции

Функция SetDocWarehouse(SN, UserName, DocOutID, WarehouseID, Type) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);	
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;	
	
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));	
	Исключение			
		СтруктураОтвета.Вставить("Описание", "Не найден документ. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;	
	
	Если СсылкаНаДок.ПолучитьОбъект() = Неопределено Тогда		
		СтруктураОтвета.Вставить("Описание", "Не найден документ. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;	
	
	Если Не СсылкаНаДок.ТСД.Пустая() Тогда
		Если СсылкаНаДок.ТСД <> УзелПО Тогда			
			СтруктураОтвета.Вставить("Описание", "Чужой документ. ");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	КонецЕсли;

	
	Объект = СсылкаНаДок.ПолучитьОбъект();
	Если Объект.ДатаНачалаСбора = Дата(1,1,1) Тогда
		Объект.ДатаНачалаСбора = ТекущаяДата();
	КонецЕсли;
	
	Объект.ДатаИзмененияКлиента = ТекущаяДата();
	Попытка 
		Если Type = 1 Тогда
			Если WarehouseID = "" Тогда
				Объект.Склад = Справочники.Склады.ПустаяСсылка();	
			Иначе	
				Объект.Склад = XMLЗначение(Тип("СправочникСсылка.Склады"), WarehouseID);
			КонецЕсли;
		ИначеЕсли Type = 2 Тогда
			Если WarehouseID = "" Тогда
				Объект.СкладПолучатель = Справочники.Склады.ПустаяСсылка();	
			Иначе	
				Объект.СкладПолучатель = XMLЗначение(Тип("СправочникСсылка.Склады"), WarehouseID);    			
			КонецЕсли;	
		Конецесли;
	Исключение	
		СтруктураОтвета.Вставить("Описание", "Не найден склад. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;	
	
	Если НЕ (Объект.Шаблон.ГрупповаяРабота) Тогда
		Объект.ТСД = УзелПО;	
	КонецЕсли;
	
	Попытка
		Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		Объект.ОбменДанными.Получатели.Очистить();
		Объект.ОбменДанными.Получатели.Заполнить();
		Объект.ОбменДанными.Получатели.Удалить(УзелПО);
		
		Объект.Записать();
	Исключение			
		СтруктураОтвета.Вставить("Описание", "Не смогли записать документ.  ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;	
	
	СтруктураОтвета.Вставить("is_success", Истина);
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);

КонецФункции

Функция SetDocClient(SN, UserName, DocOutID, ClientID) Экспорт
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;

	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));	
	Исключение			
		СтруктураОтвета.Вставить("Описание", "Не найден документ. " );		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;	
	
	Если СсылкаНаДок.ПолучитьОбъект() = Неопределено Тогда
		СтруктураОтвета.Вставить("Описание", "Не найден документ. " );	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;
	
	Если НЕ СсылкаНаДок.ТСД.Пустая() Тогда
		Если СсылкаНаДок.ТСД <> УзелПО Тогда
			СтруктураОтвета.Вставить("Описание", "Чужой документ. " );	
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	КонецЕсли;	
	
	Если СсылкаНаДок.ДатаЗавершенияСбора <> Дата(1, 1, 1) Тогда		
		СтруктураОтвета.Вставить("Описание", "Закрытый документ.");
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;	
	
	Объект = СсылкаНаДок.ПолучитьОбъект();
	Если Объект.ДатаНачалаСбора = Дата(1, 1, 1) Тогда
		Объект.ДатаНачалаСбора = ТекущаяДата();
	КонецЕсли;	
	Объект.ДатаИзмененияКлиента = ТекущаяДата();
	Попытка
		Объект.Клиент = XMLЗначение(Тип("СправочникСсылка.Партнеры"), Сред(ClientID, 4));
		Если Объект.Клиент.ПолучитьОбъект() = Неопределено Тогда
			Объект.Клиент = XMLЗначение(Тип("СправочникСсылка.Склады"), Сред(ClientID, 4));
		КонецЕсли;
	Исключение			
		СтруктураОтвета.Вставить("Описание", "Не найден клиент. " );	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецПопытки;	
	
	Если НЕ (Объект.Шаблон.ГрупповаяРабота) Тогда
		Объект.ТСД=УзелПО;	
	КонецЕсли;
	
	Попытка
		Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		Объект.ОбменДанными.Получатели.Очистить();
		Объект.ОбменДанными.Получатели.Заполнить();
		Объект.ОбменДанными.Получатели.Удалить(УзелПО);
		
		Объект.Записать();
	Исключение		
		СтруктураОтвета.Вставить("Описание", "Не смогли записать документ. " );		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецПопытки;	
	
	СтруктураОтвета.Вставить("is_success", Истина);
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);

КонецФункции

Функция SetDocComment(SN, UserName, DocOutID, Comment) Экспорт
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));	
	Исключение	
		СтруктураОтвета.Вставить("Описание", "Не найден документ. " );		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;
	
	Если СсылкаНаДок.ПолучитьОбъект() = Неопределено Тогда
		СтруктураОтвета.Вставить("Описание", "Не найден документ. " );		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;
	
	Если НЕ СсылкаНаДок.ТСД.Пустая() Тогда
		Если СсылкаНаДок.ТСД <> УзелПО Тогда		
			СтруктураОтвета.Вставить("Описание", "Чужой документ. " );		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕслИ;	
	КонецЕсли;
	
	Если ССылкаНаДок.Шаблон.ЗапретитьРучноеИзменениеКомментария Тогда		
		СтруктураОтвета.Вставить("Описание", "Изменение комментария запрещено шаблоном. " );		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;
	
	Если СсылкаНаДок.ДатаЗавершенияСбора <> Дата(1, 1, 1) Тогда		
		СтруктураОтвета.Вставить("Описание", "Закрытый документ.");
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;	
	
	Объект = СсылкаНаДок.ПолучитьОбъект();
	Если Объект.ДатаНачалаСбора = Дата(1, 1, 1) Тогда
		Объект.ДатаНачалаСбора = ТекущаяДата();
	КонецЕсли;	
	
	Объект.Комментарий = Comment;
	
	Если Объект.ТСД.Пустая() И НЕ(СсылкаНаДок.Шаблон.ГрупповаяРабота) Тогда
		Объект.ТСД = УзелПО;
	КонецЕсли;
	
	Попытка
		Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		Объект.ОбменДанными.Получатели.Очистить();
		Объект.ОбменДанными.Получатели.Заполнить();
		Объект.ОбменДанными.Получатели.Удалить(УзелПО);
		
		Объект.Записать();
	Исключение			
		СтруктураОтвета.Вставить("Описание", "Не смогли записать документ. " );		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;	
	
	СтруктураОтвета.Вставить("is_success", Истина);
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);

КонецФункции

Функция DeleteDoc(SN, UserName, DocOutID) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5)); 		
	Исключение	
		СтруктураОтвета.Вставить("is_success", Истина);
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	КонецПопытки;
	
	Если СсылкаНаДок.ПолучитьОбъект() = Неопределено Тогда
		СтруктураОтвета.Вставить("is_success", Истина);
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	КонецЕсли;	
	Если Не СсылкаНаДок.ТСД.Пустая() Тогда
		Если СсылкаНаДок.ТСД <> УзелПО Тогда
			СтруктураОтвета.Вставить("Описание", "Чужой документ. " );		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
		КонецЕсли;	
	КонецЕсли;	
	Если СсылкаНаДок.ДатаЗавершения=Дата(1,1,1) Тогда		
		СтруктураОтвета.Вставить("Описание", "Удалить можно только завершенный документ. " );		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецЕсли;	
	
	СтруктураОтвета.Вставить("is_success", Истина);
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	
КонецФункции

Функция ClearDoc(SN, UserName, DocOutID) Экспорт
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;		
	
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));	
	Исключение	
		СтруктураОтвета.Вставить("is_success", Истина);
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	КонецПопытки;
	
	Если СсылкаНаДок.Шаблон.ГрупповаяРабота Тогда		
		СтруктураОтвета.Вставить("Описание", "Групповой документ или документ с быстрым сканированием не поддерживают очистку. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;
	
	Если СсылкаНаДок.ПолучитьОбъект() = Неопределено Тогда
		СтруктураОтвета.Вставить("is_success", Истина);
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
		
	КонецЕсли;	
	
	Если Не СсылкаНаДок.ТСД.Пустая() Тогда
		Если СсылкаНаДок.ТСД <> УзелПО Тогда		
			СтруктураОтвета.Вставить("Описание", "Чужой документ. ");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	КонецЕсли;	
	
	Если СсылкаНаДок.ДатаЗавершенияСбора<>Дата(1,1,1) Тогда		
		СтруктураОтвета.Вставить("Описание", "Закрытый документ. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;	
	
	Попытка
		Объект = СсылкаНаДок.ПолучитьОбъект();
		Объект.ДатаНачалаСбора = "";
		Объект.ДатаЗавершенияСбора = "";
		
		Объект.СобранныеДанныеПодбор.Очистить();
		Объект.СобранныеДанныеПриемка.Очистить();
		
		Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		Объект.ОбменДанными.Получатели.Очистить();
		Объект.ОбменДанными.Получатели.Заполнить();
		Объект.ОбменДанными.Получатели.Удалить(УзелПО);

		Объект.Записать();
		
	Исключение			
		СтруктураОтвета.Вставить("Описание", "Ошибка очистки. " + ОписаниеОшибки());		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;	
	
	СтруктураОтвета.Вставить("is_success", Истина);
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	
КонецФункции

#КонецОбласти

#Область Print

Функция SendArtToPrint(SN, UserName, ArtID, Barcode, Count, qty_int, qty_frac, sn_values, measure_name, is_km, gs1) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО=Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	СтруктураParams = Новый Структура;
	
	СтруктураParams.Вставить("QtyInt",      qty_int);
	СтруктураParams.Вставить("QtyFrac",     qty_frac);
	СтруктураParams.Вставить("snValues",    sn_values);
	СтруктураParams.Вставить("MeasureName", measure_name);
	СтруктураParams.Вставить("GS1", 	    gs1);
	
	Если УзелПО.ОнлайнСвязьСПринтсервером Тогда	
		АдресПринтсервера = УзелПО.АдресПринтсервера;
		ПортПринтсервера = УзелПО.ПортПринтсервера;
		Если АдресПринтсервера = "" или ПортПринтсервера = 0 Тогда			
			СтруктураОтвета.Вставить("Описание", "В обработке АРМ для терминала не указаны настройки онлайн связи с принтсервером. ");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);			
		КонецЕсли;	
	Иначе	
		КаталогСохранения = УзелПО.КаталогВыгрузкиФайлаПечати;
		Если КаталогСохранения = "" Тогда		
			СтруктураОтвета.Вставить("Описание", "В обработке АРМ для терминала не указан каталог сохранения файлов печати. ");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);			
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		
		Если ЗначениеЗаполнено(ArtID) Тогда
			Если Лев(ArtID, 3) = "8U-" Тогда
				лТовар = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(ArtID, 4, 36));
				ИДХК = Сред(ArtID,40,36);
				Если ИДХК <> "00000000-0000-0000-0000-000000000000" Тогда
					лХарактеристика = XMLЗначение(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"), ИДХК);
				Иначе
					лХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
				КонецЕсли;
			ИначеЕсли Лев(ArtID, 3) = "8n-" Тогда
				лТовар = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_НовыеТовары"), Сред(ArtID, 4));
				лХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();			
			Иначе 	
				лТовар = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), СРЕД(ArtID, 4));
				лХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();	
			КонецЕсли;
		Иначе
			лТовар = Справочники.Номенклатура.ПустаяСсылка();
			лХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();	
		КонецЕсли;	
		
	Исключение
		
		лТовар = Справочники.Номенклатура.ПустаяСсылка();
		лХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();	
		
	КонецПопытки;
	
	Если is_km = Истина Тогда 			
		Если ДатаМобайл_Маркировка.ПолучитьТипМаркированнойПродукции(лТовар) = 2 Тогда	//Маркировка обувь
			
			ОписаниеОшибки = "";
			ВыполнитьПечатьКодовМаркировкиОбувь(УзелПО, лТовар, лХарактеристика, Barcode, Count, СтруктураParams,ОписаниеОшибки);
			Если ОписаниеОшибки<>"" Тогда
				СтруктураОтвета.Вставить("Описание", ОписаниеОшибки);			
				Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
			КонецЕсли;

		Иначе			
			СтруктураОтвета.Вставить("Описание", "Для данного типа маркированной продукции не предусмотрена печать. ");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
		КонецЕсли;			
	Иначе
		
		СтруктураПоиска = Новый Структура("ТипОперации", "Печать этикетки");
		СтрокиРеквизитов = УзелПО.Печать.НайтиСтроки(СтруктураПоиска);
		Если СтрокиРеквизитов.Количество() = 0 Тогда		
			СтруктураОтвета.Вставить("Описание", "В обработке АРМ для терминала не указан шаблон печати этикеток. ");
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
		КонецЕсли;
		ОписаниеОшибки = "";		
		ВыполнитьПечатьОбычныхТоваров(УзелПО, лТовар, лХарактеристика, Barcode, Count, СтруктураParams, ОписаниеОшибки);
		Если ОписаниеОшибки<>"" Тогда
			СтруктураОтвета.Вставить("Описание", ОписаниеОшибки);			
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;

	КонецЕсли;
	
	СтруктураОтвета.Вставить("is_success", Истина);
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	
КонецФункции

Функция SendPackToPrint(SN, UserName, DocID, Pack) Экспорт
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;	
	
	Если УзелПО.ОнлайнСвязьСПринтсервером Тогда	
		АдресПринтсервера = УзелПО.АдресПринтсервера;
		ПортПринтсервера = УзелПО.ПортПринтсервера;
		Если АдресПринтсервера = "" ИЛИ ПортПринтсервера = 0 Тогда	
			СтруктураОтвета.Вставить("Описание", "В обработке АРМ для терминала не указаны настройки онлайн связи с принтсервером. ");	
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	Иначе	
		КаталогСохранения = УзелПО.КаталогВыгрузкиФайлаПечати;
		Если КаталогСохранения = "" Тогда		
			СтруктураОтвета.Вставить("Описание", "В обработке АРМ для терминала не указан каталог сохранения файлов печати. ");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("ТипОперации", "Печать упаковочного листа");
	
	СтрокиРеквизитов = УзелПО.Печать.НайтиСтроки(СтруктураПоиска);
	Если СтрокиРеквизитов.Количество() = 0 Тогда		
		СтруктураОтвета.Вставить("Описание", "В обработке АРМ для терминала не указан шаблон печати упаковочного листа. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецЕсли;	

	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocID, 5));
	Исключение		
		СтруктураОтвета.Вставить("Описание", "Не найден документ. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;
	
	ЗапросДанныхПодбор = Новый Запрос();
	ЗапросДанныхПодбор.Текст = "ВЫБРАТЬ
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ИдентификаторСтроки,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Номенклатура,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ХарактеристикаНоменклатуры,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.НазваниеТовара,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЕдиницаИзмерения,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЯчейкаСсылка,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.СерийныйНомер,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ШтрихКод,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.УпаковочныйЛист,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Количество
	                     |ИЗ
	                     |	Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор
						 |ГДЕ
						 |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Ссылка = &СсылкаНаДок
						 |	И ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.УпаковочныйЛист = &ТекущийУпакЛист
						 
						 |
	                     |ОБЪЕДИНИТЬ ВСЕ
	                     |
	                     |ВЫБРАТЬ
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.ИдентификаторСтроки,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.Номенклатура,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.ХарактеристикаНоменклатуры,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.НазваниеТовара,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.ЕдиницаИзмерения,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.ЯчейкаСсылка,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.СерийныйНомер,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.Штрихкод,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.УпаковочныйЛист,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.Количество
	                     |ИЗ
	                     |	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК ДатаМобайл_СтрокиГрупповыхДокументов
						 |ГДЕ
						 |	ДатаМобайл_СтрокиГрупповыхДокументов.ДокументТСД = &СсылкаНаДок
						 |	И НЕ ДатаМобайл_СтрокиГрупповыхДокументов.ДляОбмена
						 |	И ДатаМобайл_СтрокиГрупповыхДокументов.УпаковочныйЛист = &ТекущийУпакЛист
						 |	И ДатаМобайл_СтрокиГрупповыхДокументов.ИмяТаблицы = &ИмяТаблицы";
	
	
	ЗапросДанныхПодбор.УстановитьПараметр("СсылкаНаДок",СсылкаНаДок);		
	ЗапросДанныхПодбор.УстановитьПараметр("ИмяТаблицы","Select");
	Если СсылкаНаДок.Шаблон.ИспользоватьМаркировку Тогда
		ТекущийУпаковочныйЛист = Pack;
		ТекущийУпаковочныйЛист = СтрЗаменить(ТекущийУпаковочныйЛист,"[","(");
		ТекущийУпаковочныйЛист = СтрЗаменить(ТекущийУпаковочныйЛист,"]",")");
	
		Если СтрДлина(ТекущийУпаковочныйЛист) = 20 и Лев(ТекущийУпаковочныйЛист,2) = "00" Тогда		
			ТекущийУпаковочныйЛист = "(00)" +  Сред(ТекущийУпаковочныйЛист,3,18);
		КонецЕсли;	

		ЗапросДанныхПодбор.УстановитьПараметр("ТекущийУпакЛист",ТекущийУпаковочныйЛист);
	Иначе
		ЗапросДанныхПодбор.УстановитьПараметр("ТекущийУпакЛист",Pack);		
	КонецЕсли;
	
	ТЗСобранныеДанныеПодбор  = ЗапросДанныхПодбор.Выполнить().Выгрузить();
	ТЗСобранныеДанныеПодбор.Колонки.Добавить("КоличествоСтрок", Новый ОписаниеТипов("Число"));
	Для каждого строка из  ТЗСобранныеДанныеПодбор цикл
		Если строка.Количество > 0 Тогда
			строка.КоличествоСтрок = 1;
		ИначеЕсли строка.Количество < 0 Тогда
			строка.КоличествоСтрок = -1;
		КонецЕсли;			
	КонецЦикла;	
	ТЗСобранныеДанныеПодбор.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,НазваниеТовара,ЕдиницаИзмерения,ЯчейкаСсылка,СерийныйНомер,ШтрихКод,УпаковочныйЛист","Количество,КоличествоСтрок");
	
	
	
	ЗапросДанныхПриемка = Новый Запрос();
	ЗапросДанныхПриемка.Текст = "ВЫБРАТЬ
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.ИдентификаторСтроки,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.Номенклатура,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.ХарактеристикаНоменклатуры,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.НазваниеТовара,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.ЕдиницаИзмерения,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.ЯчейкаСсылка,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.СерийныйНомер,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.ШтрихКод,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.УпаковочныйЛист,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.Количество
	                     |ИЗ
	                     |	Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПриемка КАК ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка
						 |ГДЕ
						 |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.Ссылка = &СсылкаНаДок
						 |	И ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.УпаковочныйЛист = &ТекущийУпакЛист
	                     |
	                     |ОБЪЕДИНИТЬ ВСЕ
	                     |
	                     |ВЫБРАТЬ
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.ИдентификаторСтроки,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.Номенклатура,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.ХарактеристикаНоменклатуры,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.НазваниеТовара,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.ЕдиницаИзмерения,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.ЯчейкаСсылка,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.СерийныйНомер,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.Штрихкод,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.УпаковочныйЛист,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.Количество
	                     |ИЗ
	                     |	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК ДатаМобайл_СтрокиГрупповыхДокументов
						 |ГДЕ
						 |	ДатаМобайл_СтрокиГрупповыхДокументов.ДокументТСД = &СсылкаНаДок
						 |	И НЕ ДатаМобайл_СтрокиГрупповыхДокументов.ДляОбмена
						 |	И ДатаМобайл_СтрокиГрупповыхДокументов.УпаковочныйЛист = &ТекущийУпакЛист
						 |	И ДатаМобайл_СтрокиГрупповыхДокументов.ИмяТаблицы = &ИмяТаблицы";
	
	
	ЗапросДанныхПриемка.УстановитьПараметр("СсылкаНаДок",СсылкаНаДок);
	ЗапросДанныхПриемка.УстановитьПараметр("ИмяТаблицы","Insert");
	Если СсылкаНаДок.Шаблон.ИспользоватьМаркировку Тогда
		ТекущийУпаковочныйЛист = Pack;
		ТекущийУпаковочныйЛист = СтрЗаменить(ТекущийУпаковочныйЛист,"[","(");
		ТекущийУпаковочныйЛист = СтрЗаменить(ТекущийУпаковочныйЛист,"]",")");
	
		Если СтрДлина(ТекущийУпаковочныйЛист) = 20 и Лев(ТекущийУпаковочныйЛист,2) = "00" Тогда		
			ТекущийУпаковочныйЛист = "(00)" +  Сред(ТекущийУпаковочныйЛист,3,18);
		КонецЕсли;	

		ЗапросДанныхПриемка.УстановитьПараметр("ТекущийУпакЛист",ТекущийУпаковочныйЛист);
	Иначе
		ЗапросДанныхПриемка.УстановитьПараметр("ТекущийУпакЛист",Pack);		
	КонецЕсли;

	
	
	ТЗСобранныеДанныеПриемка  = ЗапросДанныхПриемка.Выполнить().Выгрузить();
	ТЗСобранныеДанныеПриемка.Колонки.Добавить("КоличествоСтрок", Новый ОписаниеТипов("Число"));
	Для Каждого строка Из  ТЗСобранныеДанныеПриемка Цикл
		Если строка.Количество > 0 Тогда
			строка.КоличествоСтрок = 1;
		ИначеЕсли строка.Количество<0 Тогда
			строка.КоличествоСтрок = -1;
		КонецЕсли;			
	КонецЦикла;	
	ТЗСобранныеДанныеПриемка.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,НазваниеТовара,ЕдиницаИзмерения,ЯчейкаСсылка,СерийныйНомер,ШтрихКод,УпаковочныйЛист","Количество,КоличествоСтрок");
	
	СтруктураПоиска = Новый Структура("ТипОперации", "Печать упаковочного листа");
	
	СтрокиРеквизитов = УзелПО.Печать.НайтиСтроки(СтруктураПоиска);
	Если СтрокиРеквизитов.Количество() = 0 Тогда		
		СтруктураОтвета.Вставить("Описание", "В обработке АРМ для терминала не указан шаблон печати упак. листа. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;	
	
	
	ЗаписьXML = Новый ЗаписьXML;
		
	Если НЕ УзелПО.ОнлайнСвязьСПринтсервером Тогда
		ИмяФайла = ПолучитьНовоеИмяФайла();	
		Попытка
			ЗаписьXML.ОткрытьФайл(КаталогСохранения+ИмяФайла+".xml", "UTF-8");
		Исключение			
			СтруктураОтвета.Вставить("Описание", "Не удалось сохранить файл печати в каталоге: "+КаталогСохранения+" по причине: " + ОписаниеОшибки());			
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецПопытки;
	Иначе
		ЗаписьXML.УстановитьСтроку("UTF-8");
	КонецЕсли;

	
	Если СсылкаНаДок.Шаблон.ИспользоватьМаркировку Тогда		
		ТекущийУпаковочныйЛист = Pack;
		ТекущийУпаковочныйЛист = СтрЗаменить(ТекущийУпаковочныйЛист,"[","(");
		ТекущийУпаковочныйЛист = СтрЗаменить(ТекущийУпаковочныйЛист,"]",")");	
		
		ОписаниеОшибки = "";
		ВыполнитьПечатьШтрихкодаКороба(УзелПО,СтрокиРеквизитов, ЗаписьXML, ТекущийУпаковочныйЛист, ТЗСобранныеДанныеПодбор,ОписаниеОшибки);		
		
		Если ОписаниеОшибки<>"" Тогда
			СтруктураОтвета.Вставить("Описание", ОписаниеОшибки);			
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;
		
		СтруктураОтвета.Вставить("is_success", Истина);		
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);	
	КонецЕсли;
		
	ЗаписьXML.ЗаписатьОбъявлениеXML();	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("PrintData");
	
			
		ЗаписьXML.ЗаписатьНачалоЭлемента("PrinterName");
			ЗаписьXML.ЗаписатьТекст(СтрокиРеквизитов[0].ИмяПринтера);
		ЗаписьXML.ЗаписатьКонецЭлемента();		

		ЗаписьXML.ЗаписатьНачалоЭлемента("TemplateName");
			ЗаписьXML.ЗаписатьТекст(СтрокиРеквизитов[0].ИмяШаблона);
		ЗаписьXML.ЗаписатьКонецЭлемента();		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Count");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокиРеквизитов[0].КоличествоКопий));
		ЗаписьXML.ЗаписатьКонецЭлемента();		
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("Head");
	
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("Client");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СсылкаНаДок.Клиент));
		ЗаписьXML.ЗаписатьКонецЭлемента();//Client
		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Date");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СсылкаНаДок.Дата));
		ЗаписьXML.ЗаписатьКонецЭлемента();//Date
		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Number");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СсылкаНаДок.Номер));
		ЗаписьXML.ЗаписатьКонецЭлемента();//Number
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Barcode");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(Pack));
		ЗаписьXML.ЗаписатьКонецЭлемента();//Barcode
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Pack");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(Сред(Pack,4)));
		ЗаписьXML.ЗаписатьКонецЭлемента();//Barcode
		
		
		
		QRData = "";
		Для Каждого СтрокаТЧ ИЗ ТЗСобранныеДанныеПодбор Цикл	
			QRData = QRData + ЧистаяСтрока(СтрокаТЧ.Штрихкод) + "\r\n";
		КонецЦикла;
		
		Для Каждого СтрокаТЧ ИЗ ТЗСобранныеДанныеПриемка Цикл
			QRData = QRData + ЧистаяСтрока(СтрокаТЧ.Штрихкод) + "\r\n";
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("QRData");
		ЗаписьXML.ЗаписатьТекст(QRData);
		ЗаписьXML.ЗаписатьКонецЭлемента();//BC>
		
		
	ЗаписьXML.ЗаписатьКонецЭлемента();//Head
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Detail");
	
	ИтогоТоваров=0;
	ИтогоМест = 0;
	
	Для Каждого СтрокаТЧ ИЗ ТЗСобранныеДанныеПодбор Цикл
		Если СтрокаТЧ.Количество=0 Тогда
			продолжить;
		КонецЕсли;	
 
				ЗаписьXML.ЗаписатьНачалоЭлемента("Item");
				
				ИтогоТоваров = ИтогоТоваров + СтрокаТЧ.Количество*?(СтрокаТЧ.ЕдиницаИзмерения.Числитель = 0,1,СтрокаТЧ.ЕдиницаИзмерения.Числитель);
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ArtName");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.НазваниеТовара));
				ЗаписьXML.ЗаписатьКонецЭлемента();//ArtName
				ЗаписьXML.ЗаписатьНачалоЭлемента("Barcode");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.ШтрихКод));
				ЗаписьXML.ЗаписатьКонецЭлемента();//Barcode 
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("QNT");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.Количество*?(СтрокаТЧ.ЕдиницаИзмерения.Числитель = 0,1,СтрокаТЧ.ЕдиницаИзмерения.Числитель)));
				ЗаписьXML.ЗаписатьКонецЭлемента();//QNT 
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("QNTPack");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.Количество));
				ЗаписьXML.ЗаписатьКонецЭлемента();//QNTPack

				ЗаписьXML.ЗаписатьНачалоЭлемента("Unit");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.ЕдиницаИзмерения.Наименование));
				ЗаписьXML.ЗаписатьКонецЭлемента();//QNTPack 
			
				ЗаписьXML.ЗаписатьНачалоЭлемента("SN");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.СерийныйНомер));
				ЗаписьXML.ЗаписатьКонецЭлемента();//SN

				ЗаписьXML.ЗаписатьНачалоЭлемента("QNTRows");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.КоличествоСтрок));
				ЗаписьXML.ЗаписатьКонецЭлемента();//QNTPack

				ИтогоМест = ИтогоМест + СтрокаТЧ.КоличествоСтрок;

				ЗаписьXML.ЗаписатьКонецЭлемента();//Item

	КонецЦикла;
		
	Для Каждого СтрокаТЧ ИЗ ТЗСобранныеДанныеПриемка Цикл
		Если СтрокаТЧ.Количество=0 Тогда
			продолжить;
		КонецЕсли;

				ЗаписьXML.ЗаписатьНачалоЭлемента("Item");
				
				ИтогоТоваров = ИтогоТоваров + СтрокаТЧ.Количество*?(СтрокаТЧ.ЕдиницаИзмерения.Числитель = 0,1,СтрокаТЧ.ЕдиницаИзмерения.Числитель);
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ArtName");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.НазваниеТовара));
				ЗаписьXML.ЗаписатьКонецЭлемента();//Param1
				ЗаписьXML.ЗаписатьНачалоЭлемента("Barcode");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.ШтрихКод));
				ЗаписьXML.ЗаписатьКонецЭлемента();//Param2              
				ЗаписьXML.ЗаписатьНачалоЭлемента("QNT");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.Количество*?(СтрокаТЧ.ЕдиницаИзмерения.Числитель = 0,1,СтрокаТЧ.ЕдиницаИзмерения.Числитель)));
				ЗаписьXML.ЗаписатьКонецЭлемента();//Param3  
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("QNTPack");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.Количество));
				ЗаписьXML.ЗаписатьКонецЭлемента();//QNTPack
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("Unit");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.ЕдиницаИзмерения.Наименование));
				ЗаписьXML.ЗаписатьКонецЭлемента();//Unit 

				
				ЗаписьXML.ЗаписатьНачалоЭлемента("SN");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.СерийныйНомер));
				ЗаписьXML.ЗаписатьКонецЭлемента();//SN

				ЗаписьXML.ЗаписатьНачалоЭлемента("QNTRows");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.КоличествоСтрок));
				ЗаписьXML.ЗаписатьКонецЭлемента();//QNTPack

				ИтогоМест = ИтогоМест + СтрокаТЧ.КоличествоСтрок;


				ЗаписьXML.ЗаписатьКонецЭлемента();//Item
	
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();//Detail
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Summary");



		ЗаписьXML.ЗаписатьНачалоЭлемента("Summ"); 
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(ИтогоТоваров));			
		ЗаписьXML.ЗаписатьКонецЭлемента();//Summ
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("SummRows"); 
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(ИтогоМест));			
		ЗаписьXML.ЗаписатьКонецЭлемента();//SummRows 

	ЗаписьXML.ЗаписатьКонецЭлемента();//Summary
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("Footer");
		
	
		Год = Строка(Формат(Год(ТекущаяДата()),"ЧГ="));
		Месяц = Строка(Месяц(ТекущаяДата()));
		День = Строка(День(ТекущаяДата()));
		ДатаСтрока = ГОД+Строка(Месяц)+Строка(День);
		ЗаписьXML.ЗаписатьНачалоЭлемента("Date");	
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(ГОД+Месяц+ДЕНЬ));
		ЗаписьXML.ЗаписатьКонецЭлемента();//Date
		ЗаписьXML.ЗаписатьНачалоЭлемента("User");	
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(UserName));
		ЗаписьXML.ЗаписатьКонецЭлемента();//User
	ЗаписьXML.ЗаписатьКонецЭлемента();//Footer
	
	ЗаписьXML.ЗаписатьКонецЭлемента();//PrintData
	
	ОписаниеОшибки="";
	Если НЕ УзелПО.ОнлайнСвязьСПринтсервером Тогда
		ЗаписьXML.Закрыть();
	Иначе
		СтрокаДляЗапроса = ЗаписьXML.Закрыть();
		ОтправитьДанныеНаПринтсервер(УзелПО,СтрокаДляЗапроса,ОписаниеОшибки);
	КонецЕсли;

	Если ОписаниеОшибки<>"" Тогда
		СтруктураОтвета.Вставить("Описание", ОписаниеОшибки);			
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;
		
	СтруктураОтвета.Вставить("is_success", Истина);
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);

КонецФункции

Функция SendDocToPrint(SN, UserName, DocID) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО=НайтиУзел(SN);
	Если УзелПО=Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;

	Если УзелПО.ОнлайнСвязьСПринтсервером Тогда	
		АдресПринтсервера = УзелПО.АдресПринтсервера;
		ПортПринтсервера = УзелПО.ПортПринтсервера;
		Если АдресПринтсервера = "" или ПортПринтсервера=0 Тогда	
			СтруктураОтвета.Вставить("Описание", "В обработке АРМ для терминала не указаны настройки онлайн связи с принтсервером. ");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	Иначе	
		КаталогСохранения = УзелПО.КаталогВыгрузкиФайлаПечати;
		Если КаталогСохранения = "" Тогда		
			СтруктураОтвета.Вставить("Описание", "В обработке АРМ для терминала не указан каталог сохранения файлов печати. ");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;
	КонецЕсли;


	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocID, 5));
	Исключение
		СтруктураОтвета.Вставить("Описание", "Не найден документ. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;
	
	
	Если СсылкаНаДок.Шаблон.ВидДокумента = "ОтборРазмещениеТоваров" Тогда
		Если ЗначениеЗаполнено(СсылкаНаДок.ИсходныйДокумент) Тогда
			
		КонецЕсли;
	КонецЕсли;
	
	ЗапросДанныхПодбор = Новый Запрос();
	ЗапросДанныхПодбор.Текст = "ВЫБРАТЬ
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ИдентификаторСтроки,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Номенклатура,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ХарактеристикаНоменклатуры,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.НазваниеТовара,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЕдиницаИзмерения,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЯчейкаСсылка,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.СерийныйНомер,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ШтрихКод,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.УпаковочныйЛист,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Количество
	                     |ИЗ
	                     |	Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор
						 |ГДЕ
						 |	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Ссылка = &СсылкаНаДок						 
						 |
	                     |ОБЪЕДИНИТЬ ВСЕ
	                     |
	                     |ВЫБРАТЬ
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.ИдентификаторСтроки,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.Номенклатура,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.ХарактеристикаНоменклатуры,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.НазваниеТовара,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.ЕдиницаИзмерения,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.ЯчейкаСсылка,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.СерийныйНомер,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.Штрихкод,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.УпаковочныйЛист,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.Количество
	                     |ИЗ
	                     |	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК ДатаМобайл_СтрокиГрупповыхДокументов
						 |ГДЕ
						 |	ДатаМобайл_СтрокиГрупповыхДокументов.ДокументТСД = &СсылкаНаДок
						 |	И НЕ ДатаМобайл_СтрокиГрупповыхДокументов.ДляОбмена
						 |	И ДатаМобайл_СтрокиГрупповыхДокументов.ИмяТаблицы = &ИмяТаблицы";
		
	ЗапросДанныхПодбор.УстановитьПараметр("СсылкаНаДок",СсылкаНаДок);		
	ЗапросДанныхПодбор.УстановитьПараметр("ИмяТаблицы","Select");
		
	ТЗСобранныеДанныеПодбор  = ЗапросДанныхПодбор.Выполнить().Выгрузить();
	ТЗСобранныеДанныеПодбор.Колонки.Добавить("КоличествоСтрок", Новый ОписаниеТипов("Число"));
	Для каждого строка из  ТЗСобранныеДанныеПодбор цикл
		Если строка.Количество > 0 Тогда
			строка.КоличествоСтрок = 1;
		ИначеЕсли строка.Количество < 0 Тогда
			строка.КоличествоСтрок = -1;
		КонецЕсли;			
	КонецЦикла;	
	ТЗСобранныеДанныеПодбор.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,НазваниеТовара,ЕдиницаИзмерения,ЯчейкаСсылка,СерийныйНомер,ШтрихКод,УпаковочныйЛист","Количество,КоличествоСтрок");
		
	ЗапросДанныхПриемка = Новый Запрос();
	ЗапросДанныхПриемка.Текст = "ВЫБРАТЬ
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.ИдентификаторСтроки,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.Номенклатура,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.ХарактеристикаНоменклатуры,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.НазваниеТовара,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.ЕдиницаИзмерения,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.ЯчейкаСсылка,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.СерийныйНомер,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.ШтрихКод,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.УпаковочныйЛист,
	                     |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.Количество
	                     |ИЗ
	                     |	Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПриемка КАК ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка
						 |ГДЕ
						 |	ДатаМобайл_ДокументыТСДСобранныеДанныеПриемка.Ссылка = &СсылкаНаДок
	                     |
	                     |ОБЪЕДИНИТЬ ВСЕ
	                     |
	                     |ВЫБРАТЬ
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.ИдентификаторСтроки,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.Номенклатура,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.ХарактеристикаНоменклатуры,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.НазваниеТовара,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.ЕдиницаИзмерения,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.ЯчейкаСсылка,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.СерийныйНомер,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.Штрихкод,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.УпаковочныйЛист,
	                     |	ДатаМобайл_СтрокиГрупповыхДокументов.Количество
	                     |ИЗ
	                     |	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК ДатаМобайл_СтрокиГрупповыхДокументов
						 |ГДЕ
						 |	ДатаМобайл_СтрокиГрупповыхДокументов.ДокументТСД = &СсылкаНаДок
						 |	И НЕ ДатаМобайл_СтрокиГрупповыхДокументов.ДляОбмена
						 |	И ДатаМобайл_СтрокиГрупповыхДокументов.ИмяТаблицы = &ИмяТаблицы";
		
	ЗапросДанныхПриемка.УстановитьПараметр("СсылкаНаДок",СсылкаНаДок);
	ЗапросДанныхПриемка.УстановитьПараметр("ИмяТаблицы","Insert");
	
	ТЗСобранныеДанныеПриемка  = ЗапросДанныхПриемка.Выполнить().Выгрузить();
	ТЗСобранныеДанныеПриемка.Колонки.Добавить("КоличествоСтрок", Новый ОписаниеТипов("Число"));
	Для Каждого строка Из  ТЗСобранныеДанныеПриемка Цикл
		Если строка.Количество > 0 Тогда
			строка.КоличествоСтрок = 1;
		ИначеЕсли строка.Количество<0 Тогда
			строка.КоличествоСтрок = -1;
		КонецЕсли;			
	КонецЦикла;	
	ТЗСобранныеДанныеПриемка.Свернуть("Номенклатура,ХарактеристикаНоменклатуры,НазваниеТовара,ЕдиницаИзмерения,ЯчейкаСсылка,СерийныйНомер,ШтрихКод,УпаковочныйЛист","Количество,КоличествоСтрок");
	
	СтруктураПоиска = Новый Структура("ТипОперации", "Печать документа");
	
	СтрокиРеквизитов = УзелПО.Печать.НайтиСтроки(СтруктураПоиска);
	Если СтрокиРеквизитов.Количество() = 0 Тогда
		СтруктураОтвета.Вставить("Описание", "В обработке АРМ для терминала не указан шаблон печати документа. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;	
	
	ЗаписьXML = Новый ЗаписьXML;
	
	Если НЕ УзелПО.ОнлайнСвязьСПринтсервером Тогда
		ИмяФайла = ПолучитьНовоеИмяФайла();	
		Попытка
			ЗаписьXML.ОткрытьФайл(КаталогСохранения+ИмяФайла+".xml", "UTF-8");
		Исключение			
			СтруктураОтвета.Вставить("Описание", "Не удалось сохранить файл печати в каталоге: " + КаталогСохранения + " по причине: " + ОписаниеОшибки());		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецПопытки;
	Иначе
		ЗаписьXML.УстановитьСтроку("UTF-8");
	КонецЕсли;

		
	ЗаписьXML.ЗаписатьОбъявлениеXML();	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("PrintData");
	
			
		ЗаписьXML.ЗаписатьНачалоЭлемента("PrinterName");
			ЗаписьXML.ЗаписатьТекст(СтрокиРеквизитов[0].ИмяПринтера);
		ЗаписьXML.ЗаписатьКонецЭлемента();		

		ЗаписьXML.ЗаписатьНачалоЭлемента("TemplateName");
			ЗаписьXML.ЗаписатьТекст(СтрокиРеквизитов[0].ИмяШаблона);
		ЗаписьXML.ЗаписатьКонецЭлемента();		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Count");
			ЗаписьXML.ЗаписатьТекст(Строка(СтрокиРеквизитов[0].КоличествоКопий));
		ЗаписьXML.ЗаписатьКонецЭлемента();		
		
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("Head");
	
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("Client");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СсылкаНаДок.Клиент));
		ЗаписьXML.ЗаписатьКонецЭлемента();//Client
		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Date");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СсылкаНаДок.Дата));
		ЗаписьXML.ЗаписатьКонецЭлемента();//Date
		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Number");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СсылкаНаДок.Номер));
		ЗаписьXML.ЗаписатьКонецЭлемента();//Number
		
		
		QRData = "";
		Для Каждого СтрокаТЧ ИЗ ТЗСобранныеДанныеПодбор Цикл
				QRData = QRData + ЧистаяСтрока(СтрокаТЧ.Штрихкод)+"\r\n";
		КонецЦикла;
		
		Для Каждого СтрокаТЧ ИЗ ТЗСобранныеДанныеПриемка Цикл
				QRData = QRData + ЧистаяСтрока(СтрокаТЧ.Штрихкод)+"\r\n";
		КонецЦикла;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("QRData");
		ЗаписьXML.ЗаписатьТекст(QRData);
		ЗаписьXML.ЗаписатьКонецЭлемента();//BC>
		
		
	ЗаписьXML.ЗаписатьКонецЭлемента();//Head
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Detail");
	
	ИтогоТоваров=0;
	  Для Каждого СтрокаТЧ ИЗ ТЗСобранныеДанныеПодбор Цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("Item");
				
				ИтогоТоваров = ИтогоТоваров + СтрокаТЧ.Количество*?(СтрокаТЧ.ЕдиницаИзмерения.Числитель = 0,1,СтрокаТЧ.ЕдиницаИзмерения.Числитель);
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ArtName");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.НазваниеТовара));
				ЗаписьXML.ЗаписатьКонецЭлемента();//ArtName
				ЗаписьXML.ЗаписатьНачалоЭлемента("Barcode");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.ШтрихКод));
				ЗаписьXML.ЗаписатьКонецЭлемента();//Barcode              
				ЗаписьXML.ЗаписатьНачалоЭлемента("QNT");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.Количество*?(СтрокаТЧ.ЕдиницаИзмерения.Числитель = 0,1,СтрокаТЧ.ЕдиницаИзмерения.Числитель)));
				ЗаписьXML.ЗаписатьКонецЭлемента();//QNT 
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("QNTPack");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.Количество));
				ЗаписьXML.ЗаписатьКонецЭлемента();//QNTPack

				ЗаписьXML.ЗаписатьНачалоЭлемента("Unit");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.ЕдиницаИзмерения.Наименование));
				ЗаписьXML.ЗаписатьКонецЭлемента();//Unit 
			
				ЗаписьXML.ЗаписатьНачалоЭлемента("SN");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.СерийныйНомер));
				ЗаписьXML.ЗаписатьКонецЭлемента();//SN
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("Pack");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрЗаменить(СтрокаТЧ.УпаковочныйЛист,"/////","")));
				ЗаписьXML.ЗаписатьКонецЭлемента();//Pack

				ЗаписьXML.ЗаписатьКонецЭлемента();//Item
		КонецЦикла;
		
		Для Каждого СтрокаТЧ ИЗ ТЗСобранныеДанныеПриемка Цикл
				ЗаписьXML.ЗаписатьНачалоЭлемента("Item");
				
				ИтогоТоваров = ИтогоТоваров + СтрокаТЧ.Количество*?(СтрокаТЧ.ЕдиницаИзмерения.Числитель = 0,1,СтрокаТЧ.ЕдиницаИзмерения.Числитель);
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ArtName");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.НазваниеТовара));
				ЗаписьXML.ЗаписатьКонецЭлемента();//Param1
				ЗаписьXML.ЗаписатьНачалоЭлемента("Barcode");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.ШтрихКод));
				ЗаписьXML.ЗаписатьКонецЭлемента();//Param2              
				ЗаписьXML.ЗаписатьНачалоЭлемента("QNT");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.Количество*?(СтрокаТЧ.ЕдиницаИзмерения.Числитель = 0,1,СтрокаТЧ.ЕдиницаИзмерения.Числитель)));
				ЗаписьXML.ЗаписатьКонецЭлемента();//Param3  
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("QNTPack");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.Количество));
				ЗаписьXML.ЗаписатьКонецЭлемента();//QNTPack
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("Unit");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.ЕдиницаИзмерения.Наименование));
				ЗаписьXML.ЗаписатьКонецЭлемента();//QNTPack 
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("SN");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.СерийныйНомер));
				ЗаписьXML.ЗаписатьКонецЭлемента();//SN

				ЗаписьXML.ЗаписатьНачалоЭлемента("Pack");
				ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрЗаменить(СтрокаТЧ.УпаковочныйЛист,"/////","")));
				ЗаписьXML.ЗаписатьКонецЭлемента();//Pack
				
				ЗаписьXML.ЗаписатьКонецЭлемента();//Item
		КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();//Detail
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Summary");
		ЗаписьXML.ЗаписатьНачалоЭлемента("Itog");
		ЗаписьXML.ЗаписатьТекст("Итого:");
		ЗаписьXML.ЗаписатьКонецЭлемента();//ITOG ?
		ЗаписьXML.ЗаписатьНачалоЭлемента("Summ"); 
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(ИтогоТоваров));			
		ЗаписьXML.ЗаписатьКонецЭлемента();//Summ ?
		ЗаписьXML.ЗаписатьКонецЭлемента();//Summary
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Footer");
		
	
		Год = Строка(Формат(Год(ТекущаяДата()),"ЧГ="));
		Месяц = Строка(Месяц(ТекущаяДата()));
		День = Строка(День(ТекущаяДата()));
		ДатаСтрока = ГОД+Строка(Месяц)+Строка(День);
		ЗаписьXML.ЗаписатьНачалоЭлемента("Date");	
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(ГОД+Месяц+ДЕНЬ));
		ЗаписьXML.ЗаписатьКонецЭлемента();//Date
		ЗаписьXML.ЗаписатьНачалоЭлемента("User");	
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(UserName));
		ЗаписьXML.ЗаписатьКонецЭлемента();//User
	ЗаписьXML.ЗаписатьКонецЭлемента();//Footer
	
	ЗаписьXML.ЗаписатьКонецЭлемента();//PrintData
	
	ОписаниеОшибки="";
	Если НЕ УзелПО.ОнлайнСвязьСПринтсервером Тогда
		ЗаписьXML.Закрыть();
	Иначе
		СтрокаДляЗапроса = ЗаписьXML.Закрыть();
		ОтправитьДанныеНаПринтсервер(УзелПО,СтрокаДляЗапроса,ОписаниеОшибки);
	КонецЕсли;

	Если ОписаниеОшибки<>"" Тогда
		СтруктураОтвета.Вставить("Описание", ОписаниеОшибки);			
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;
	
	СтруктураОтвета.Вставить("is_success", Истина);
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);

КонецФункции

#КонецОбласти

#Область FastAccess

Функция FastAccess(SN, UserName, Barcode, Params = Неопределено, ИмяМетода = "", ВерсияПО = "") Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО=НайтиУзел(SN);
	Если УзелПО=Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Если УзелПО.НеОтображатьОстатки Тогда		
		СтруктураОтвета.Вставить("Описание", "Отображение информации для ТСД отключено в настройках АРМ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецЕсли;
		
	Если Лев(ВерсияПО,1) = "3" тогда	
		Если ИмяМетода = "/text" тогда
			Возврат ПолучитьИнфоTEXT(УзелПО, Barcode);
		ИначеЕсли ИмяМетода = "/url" тогда
			Возврат ПолучитьИнфоURL(УзелПО, Barcode);
		ИначеЕсли ИмяМетода = "/html" тогда
			Возврат ПолучитьИнфоHTML(УзелПО, Barcode);
		Иначе
			Возврат ПолучитьИнфоJSON(УзелПО, Barcode);	
		КонецЕсли;
	Иначе	
		Возврат ПолучитьИнфо(УзелПО, Barcode);
	КонецЕсли;

КонецФункции

Функция FastAccessDoc(SN, UserName, DocID, Barcode, Params = Неопределено, ИмяМетода = "", ВерсияПО = "") Экспорт
	
	СтруктураОтвета = Новый Структура;
	
	Если Barcode = "" Тогда		
		СтруктураОтвета.Вставить("Описание", "Отсканируйте штрихкод "); 
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	Иначе
		Возврат FastAccess(SN, UserName, Barcode, Params, ИмяМетода, ВерсияПО);
	КонецЕсли;

КонецФункции

#КонецОбласти

#Область Photos

Функция GetArtPhotos(SN, UserName, ArtID) Экспорт
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Если Лев(ArtID, 3) = "8U-" Тогда
		Номенклатура = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(ArtID, 4));    		
	ИначеЕсли Лев(ArtID, 3) = "8e-" Тогда
		НоменклатураЕГАИС = XMLЗначение(Тип("СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС"), Сред(ArtID, 4));    		
		Если ТоварСопоставленОдинКОдному(НоменклатураЕГАИС) Тогда
			Номенклатура = ДатаМобайл_ОбщийМодуль.ПолучитьНоменклатуруПоЕГАИС(НоменклатураЕГАИС);
		Иначе 				
			СтруктураОтвета.Вставить("Описание", "Номенклатура ЕГАИС сопоставлена с несколькими обычными. ");			
			Возврат ПодготовитьОтветJSON(, СтруктураОтвета);
		КонецЕсли;
	Иначе
		СтруктураОтвета.Вставить("Описание", "Не найдена номенклатура. ");		
		Возврат ПодготовитьОтветJSON(, СтруктураОтвета);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	Файлы.Ссылка КАК Файл,
				  |	Файлы.ВладелецФайла КАК Номенклатура,
	              |	Файлы.Наименование КАК Наименование,
	              |	Файлы.Описание КАК Описание,
	              |	Файлы.Том КАК Том,
	              |	Файлы.Расширение КАК Расширение,
	              |	Файлы.ПутьКФайлу КАК ПутьКФайлу
	              |ИЗ
	              |	Справочник.НоменклатураПрисоединенныеФайлы КАК Файлы
	              |ГДЕ
	              |	Файлы.ВладелецФайла = &Номенклатура
				  |	И НЕ Файлы.ПометкаУдаления
	              |УПОРЯДОЧИТЬ ПО
	              |	Номенклатура";

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() цикл
		ОбъектКартинки = ПолучитьСтруктуруОбъектаДляHttp("image");
		ОбъектКартинки.Art_ID = ArtID;
		ОбъектКартинки.ID = "8i-" + XMLСтрока(Выборка.Файл);
		ДанныеФайла = ДатаМобайл_ОбщийМодуль.ДанныеФайла(Выборка.Файл, Новый УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
		ДанныеИзХранилища = ПолучитьИзвременногоХранилища(ДанныеФайла) ;
		
		Попытка
			ОбъектКартинки.data = Base64Строка(ПолучитьИзвременногоХранилища(ДатаМобайл_ОбщийМодуль.ДанныеФайла(Выборка.Файл, Новый УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла));
		Исключение
			Продолжить;
		КонецПопытки;
		
		ОбъектСписка.Добавить(ОбъектКартинки);
	КонецЦикла;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);

КонецФункции

Функция GetArtsPhotos(SN, UserName) Экспорт
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;

	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
 	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	Файлы.Ссылка КАК Файл,
	              |	Файлы.ВладелецФайла КАК Номенклатура,
	              |	Файлы.Наименование КАК Наименование,
	              |	Файлы.Описание КАК Описание,
	              |	Файлы.Том КАК Том,
	              |	Файлы.Расширение КАК Расширение,
	              |	Файлы.ПутьКФайлу КАК ПутьКФайлу,
	              |	Файлы.ВладелецФайла.Ссылка КАК ВладелецФайлаСсылка
	              |ИЗ
	              |	Справочник.НоменклатураПрисоединенныеФайлы КАК Файлы
	              |ГДЕ
	              |	НЕ Файлы.ПометкаУдаления
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Номенклатура";

	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() цикл
		ОбъектКартинки = ПолучитьСтруктуруОбъектаДляHttp("image");
		ОбъектКартинки.Art_ID = "8U-" + XMLСтрока(Выборка.Номенклатура) + XMLСтрока(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		ОбъектКартинки.ID = "8i-" + XMLСтрока(Выборка.Файл);
		
		Попытка
			ОбъектКартинки.data = Base64Строка(ПолучитьИзвременногоХранилища(ДатаМобайл_ОбщийМодуль.ДанныеФайла(Выборка.Файл, Новый УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла));
		Исключение
			Продолжить;
		КонецПопытки;	
		ОбъектСписка.Добавить(ОбъектКартинки);
	КонецЦикла;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);

КонецФункции

Функция SetRowPhoto(SN, UserName, DocID, ArtID, Barcode, Byte) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО=НайтиУзел(SN);
	Если УзелПО=Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocID, 5));
	Исключение
		
		СтруктураОтвета.Вставить("is_success", Ложь);		
		
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
		
	КонецПопытки;
	
	Шаблон = ССылкаНаДок.Шаблон;
	
	СтруктураПоиска = новый Структура("КодТовара, Штрихкод", СокрЛП(ArtID), СокрЛП(Barcode));
	
	Объект = СсылкаНаДок.ПолучитьОбъект();
	
	Если Шаблон.ИспользоватьФотофиксациюПодбор Тогда
		СтрокиПодбор = Объект.СобранныеДанныеПодбор.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиПодбор.Количество() > 0 Тогда
			
			ИмяПапки = Объект.Номер + ЛЕВ(СтрЗаменить(Объект.Дата, ".", ""),8);
			
			Папка = (Шаблон.ПутьВыгрузкиИзображенияПодбор + ИмяПапки + "\");
			
			Если НайтиФайлы(Папка).Количество() = 0 Тогда
				СоздатьКаталог(Папка);
			КонецЕсли;
			ПутьСохранения = Папка;
			
			Изображение = Новый Картинка(Byte);		
			
			ПутьКФайлу = ПутьСохранения+Barcode+"_"+СтрЗаменить(Формат(ТекущаяДата(),"ДЛФ=T"),":","")+".jpg";				
			
			//ПутьКФайлу = СокрЛП(Шаблон.ПутьВыгрузкиИзображенияПодбор)+ArtId+".jpg";
			Попытка
				Изображение.Записать(ПутьКФайлу);
			Исключение
				СтруктураОтвета.Вставить("is_success", Ложь);		
				
				Возврат ПодготовитьОтветJSON(СтруктураОтвета);

			КонецПопытки;
			
			Для Н=0 По СтрокиПодбор.Количество() - 1 Цикл
				СтрокиПодбор[Н].СсылкаНаИзображение = Строка(ПутьКФайлу);	
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Шаблон.ИспользоватьФотофиксациюПриемка Тогда
		
		СтрокиПриемка = Объект.СобранныеДанныеПриемка.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиПриемка.Количество() > 0 Тогда
			
			Папка = (Шаблон.ПутьВыгрузкиИзображенияПриемка+ИмяПапки+"\");
			
			Если НайтиФайлы(Папка).Количество() = 0 Тогда
				СоздатьКаталог(Папка);
			КонецЕсли;
			ПутьСохранения = Папка;
			
			Изображение = Новый Картинка(Byte);
			ПутьКФайлу = ПутьСохранения+Barcode+"_"+СтрЗаменить(Формат(ТекущаяДата(),"ДЛФ=T"),":","")+".jpg";				
			Попытка
				Изображение.Записать(ПутьКФайлу);
			Исключение
				СтруктураОтвета.Вставить("is_success", Ложь);		
				
				Возврат ПодготовитьОтветJSON(СтруктураОтвета);

			КонецПопытки;
			
			Для Н=0 По СтрокиПриемка.Количество() - 1 Цикл
				СтрокиПриемка[Н].СсылкаНаИзображение = ПутьКФайлу;	
			КонецЦикла;		
			
		КонецЕсли;
	КонецЕсли;
	
	Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	Объект.ОбменДанными.Получатели.Очистить();
	Объект.ОбменДанными.Получатели.Заполнить();
	Объект.ОбменДанными.Получатели.Удалить(УзелПО);
	
	Объект.Записать();
	
	СтруктураОтвета.Вставить("is_success", Истина);		
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);

	
КонецФункции

Функция SetDocPhoto(SN, UserName, DocID, Byte) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocID, 5));	
	Исключение                                       
		
		СтруктураОтвета.Вставить("is_success", Ложь);
		
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	КонецПопытки;
	
	Объект = ССылкаНаДок.ПолучитьОбъект();
	
	Шаблон = СсылкаНаДок.Шаблон;
	
	
	ИмяПапки = Объект.Номер+ЛЕВ(СтрЗаменить(Объект.Дата,".",""),8);
	
	Папка = (Шаблон.ПутьВыгрузкиИзображения+ИмяПапки+"\");
	
	Если НайтиФайлы(Папка).Количество() = 0 Тогда
		СоздатьКаталог(Папка);
	КонецЕсли;
	
	ПутьСохранения = Папка;
	
	Изображение = Новый Картинка(Byte);
	Файлы = НайтиФайлы(ПутьСохранения, DocID+"??.jpg",);
	
	Если Файлы.Количество() > 0 Тогда
		ПутьКФайлу = ПутьСохранения+DocID+"_"+Файлы.Количество()+".jpg";				
	Иначе
		ПутьКФайлу = ПутьСохранения+DocID+".jpg";
	КонецЕсли;
	
	Попытка
		Изображение.Записать(ПутьКФайлу);
	Исключение
		
		СтруктураОтвета.Вставить("is_success", Ложь);
		
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
		
	КонецПопытки;
	
	Объект.СсылкаНаИзображение = Строка(ПутьКФайлу);
	
	Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
	Объект.ОбменДанными.Получатели.Очистить();
	Объект.ОбменДанными.Получатели.Заполнить();
	Объект.ОбменДанными.Получатели.Удалить(УзелПО);
	
	Объект.Записать();
	
	СтруктураОтвета.Вставить("is_success", Истина);
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);
		
КонецФункции

Функция SetArtPhoto(SN, UserName, DMImage) Экспорт
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);	
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Если Не РазрешеноРедактированиеТовара(УзелПО,UserName) Тогда		
		СтруктураОтвета.Вставить("Описание", "Пользователю в настройках прав в АРМ 1С не разрешено редактирование существующих товаров.");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;		
	
	Если Лев(DMImage.art_id, 3) = "8U-" Тогда
		Номенклатура = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(DMImage.art_id, 4));  		
	ИначеЕсли Лев(DMImage.art_id, 3) = "8e-" Тогда 
		НоменклатураЕГАИС = XMLЗначение(Тип("СправочникСсылка.КлассификаторАлкогольнойПродукцииЕГАИС"), Сред(DMImage.art_id, 4));	
		Если ТоварСопоставленОдинКОдному(НоменклатураЕГАИС) Тогда
			Номенклатура = ДатаМобайл_ОбщийМодуль.ПолучитьНоменклатуруПоЕГАИС(НоменклатураЕГАИС);
		Иначе 			
			СтруктураОтвета.Вставить("Описание", "Номенклатура ЕГАИС сопоставлена с несколькими обычными. ");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
		КонецЕсли;	
	Иначе 		
		СтруктураОтвета.Вставить("Описание", "Не найдена номенклатура. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;
	
	Попытка	
		АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(DMImage.data);
		
		ПараметрыФайла = Новый Структура;
		ПараметрыФайла.Вставить("ВладелецФайлов", Номенклатура);
		лАвтор = Справочники.Пользователи.НайтиПоНаименованию(UserName);
		Если лАвтор.Пустая() Тогда
			ВыборкаПользователей = Справочники.Пользователи.Выбрать();
			Пока  ВыборкаПользователей.Следующий() цикл
				Если ВыборкаПользователей.Наименование<>"<Не указан>" Тогда
					лАвтор = ВыборкаПользователей.Ссылка;
				Прервать;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	
		ПараметрыФайла.Вставить("Автор", лАвтор);
		ПараметрыФайла.Вставить("ИмяБезРасширения", НСтр("ru = 'Изображение из DataMobile'"));
		ПараметрыФайла.Вставить("РасширениеБезТочки", "jpg");
		ПараметрыФайла.Вставить("ВремяИзменения", Неопределено);
		ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
		
		ПрисоединенныйФайл = ДатаМобайл_ОбщийМодуль.ДобавитьФайл(ПараметрыФайла, АдресФайлаВХранилище);
		
		Если Номенклатура.ФайлКартинки.Пустая() Тогда
			НоменклатураОбъект =  Номенклатура.ПолучитьОбъект();
			НоменклатураОбъект.ФайлКартинки =  ПрисоединенныйФайл.Ссылка;
			НоменклатураОбъект.Записать();
		КонецЕсли;
		
		СтруктураОтвета.Вставить("data", "8i-" + XMLСтрока(ПрисоединенныйФайл)); 
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	Исключение	
		СтруктураОтвета.Вставить("Описание", "Ошибка добавления изображения. " + ОписаниеОшибки());		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;
	
КонецФункции

Функция DeleteArtPhoto(SN, UserName, ArtID, DMImageID) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;	
	
	Если НЕ РазрешеноРедактированиеТовара(УзелПО,UserName) Тогда		
		СтруктураОтвета.Вставить("Описание", "Пользователю в настройках прав в АРМ 1С не разрешено редактирование существующих товаров. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;

	Если Лев(DMImageID, 3) = "8i-" Тогда
		Изображение = XMLЗначение(Тип("СправочникСсылка.НоменклатураПрисоединенныеФайлы"), Сред(DMImageID, 4));	
	Иначе		
		СтруктураОтвета.Вставить("Описание", "Не найдено изображение для удаления. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецЕсли;
	
	Попытка
		ИзображениеОбъект = Изображение.ПолучитьОбъект();
		ИзображениеОбъект.ПометкаУдаления = Истина;
		ИзображениеОбъект.Записать();
	Исключение		
		СтруктураОтвета.Вставить("Описание", "Ошибка удаления изображения. "+ ОписаниеОшибки());		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;	
	
	СтруктураОтвета.Вставить("is_success", Истина);
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);
КонецФункции

#КонецОбласти

#Область Others

Функция GetArtQtyByScales(SN, UserName, DocOutID, ArtID, Cell, ArtSN, ScalesBarcode) Экспорт 
	
	СтруктураОтвета = Новый Структура;
	
	Ответ = 1.55;
		
	СтруктураОтвета.Вставить("data", Ответ); 
	
	Возврат ПодготовитьОтветJSON(СтруктураОтвета);	
	
КонецФункции

#КонецОбласти

#Область Egais

Функция OnArtEgaisScan(SN, UserName, ArtID, Barcode, PDFBarcode, DocOutID, Cell) Экспорт 
	
	Если ДатаМобайл_ОбщийМодуль.ЕстьКТ2000() Тогда
		Возврат OnArtEgaisScan_КТ2000(SN, UserName, ArtID, Barcode, PDFBarcode, DocOutID, Cell);
	КонецЕсли;

	СтруктураОтвета = Новый Структура;
	
	ОбъектТовараЕГАИС = ПолучитьСтруктуруОбъектаДляHttp("egais_art");
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);   
	КонецЕсли;
	
	Если НЕ (СтрДлина(PDFBarcode) = 68 ИЛИ СтрДлина(PDFBarcode) = 150) Тогда  // формат марки	
		СтруктураОтвета.Вставить("Описание", "Некорректный формат марки. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецЕсли;
	
	Попытка		
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));		
	Исключение		
		СтруктураОтвета.Вставить("Описание", "Не удалось найти документ. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецПопытки;
	
	Шаблон = СсылкаНаДок.Шаблон;
	
	
	Если НЕ ДатаМобайл_ОбщийМодуль.ЕстьАСТ() Тогда
		Если стрДлина(PDFBarcode) = 68 Тогда 
			Алкокод=КодНоменклатурыЕГАИСПоPDF417(PDFBarcode);
			
			ЗапросЕГАИС = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЕГАИС_Номенклатура.Ссылка КАК Ссылка,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.Наименование, """") КАК name,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.Производитель.Наименование, """") КАК manufacturer,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.Импортер.Наименование, """") КАК importer,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.Объем, 0) КАК capacity,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.Крепость, 0) КАК percent_alco,
			|	ВЫБОР
			|		КОГДА НЕ ЕГАИС_Номенклатура.ВидПродукции.Код ЕСТЬ NULL
			|			ТОГДА ЕГАИС_Номенклатура.ВидПродукции.Код + "" ""+ЕГАИС_Номенклатура.ВидПродукции.Наименование
			|		ИНАЧЕ ЕСТЬNULL(ЕГАИС_Номенклатура.Ссылка.ВидПродукции.Код + "" "", """") + ЕСТЬNULL(ЕГАИС_Номенклатура.Ссылка.ВидПродукции.Наименование + "" "", """")
			|	КОНЕЦ КАК type_alco
			|ИЗ
			|	Справочник.КлассификаторАлкогольнойПродукцииЕГАИС КАК ЕГАИС_Номенклатура
			|ГДЕ
			|	ЕГАИС_Номенклатура.Код = &Код
			|	И НЕ ЕГАИС_Номенклатура.ПометкаУдаления");
			
			ЗапросЕГАИС.УстановитьПараметр("Код", Алкокод);
			
			ВыборкаЕГАИС = ЗапросЕГАИС.Выполнить().Выбрать();
			
			Пока ВыборкаЕГАИС.Следующий() Цикл			
				OnArtEgaisScan_ЗаполнитьОбъектТовара(ВыборкаЕГАИС, ОбъектТовараЕГАИС);			
			КонецЦикла;
			
			Возврат ПодготовитьОтветJSON(ОбъектТовараЕГАИС);
			
		ИначеЕсли стрДлина(PDFBarcode) = 150 Тогда
			
			МаркаСсылка = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода", PDFBarcode);
			
			ЗапросЕГАИС = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЕГАИС_РегистрМарок.АлкогольнаяПродукция.Ссылка КАК Ссылка,
			|	ЕСТЬNULL(ЕГАИС_РегистрМарок.АлкогольнаяПродукция.Наименование, """") КАК name,
			|	ЕСТЬNULL(ЕГАИС_РегистрМарок.АлкогольнаяПродукция.Производитель.Наименование, """") КАК manufacturer,
			|	ЕСТЬNULL(ЕГАИС_РегистрМарок.АлкогольнаяПродукция.Импортер.Наименование, """") КАК importer,
			|	ЕСТЬNULL(ЕГАИС_РегистрМарок.АлкогольнаяПродукция.Объем, 0) КАК capacity,
			|	ЕСТЬNULL(ЕГАИС_РегистрМарок.АлкогольнаяПродукция.Крепость, 0) КАК percent_alco,
			|	ВЫБОР
			|		КОГДА НЕ ЕГАИС_РегистрМарок.АлкогольнаяПродукция.ВидПродукции.Код ЕСТЬ NULL
			|			ТОГДА ЕГАИС_РегистрМарок.АлкогольнаяПродукция.ВидПродукции.Код + "" ""+ЕГАИС_РегистрМарок.АлкогольнаяПродукция.ВидПродукции.Наименование
			|		ИНАЧЕ ЕСТЬNULL(ЕГАИС_РегистрМарок.АлкогольнаяПродукция.Ссылка.ВидПродукции.Код + "" "", """") + ЕСТЬNULL(ЕГАИС_РегистрМарок.АлкогольнаяПродукция.Ссылка.ВидПродукции.Наименование + "" "", """")
			|	КОНЕЦ КАК type_alco
			|ИЗ
			|	РегистрСведений.АкцизныеМаркиЕГАИС КАК ЕГАИС_РегистрМарок
			|ГДЕ
			|	ЕГАИС_РегистрМарок.АкцизнаяМарка = &ЕГАИС_Код
			|	И НЕ ЕГАИС_РегистрМарок.АлкогольнаяПродукция.ПометкаУдаления");
			ЗапросЕГАИС.УстановитьПараметр("ЕГАИС_Код", МаркаСсылка);
			
			ВыборкаЕГАИС = ЗапросЕГАИС.Выполнить().Выбрать();
			
			Пока ВыборкаЕГАИС.Следующий() Цикл			
				OnArtEgaisScan_ЗаполнитьОбъектТовара(ВыборкаЕГАИС, ОбъектТовараЕГАИС);			
			КонецЦикла;
			
			Возврат ПодготовитьОтветJSON(ОбъектТовараЕГАИС);
			
		Иначе
			Возврат ПодготовитьОтветJSON(Новый Структура);	
		КонецЕсли;
		
	Иначе                  
		
		Если стрДлина(PDFBarcode)=68 Тогда
			Алкокод=КодНоменклатурыЕГАИСПоPDF417(PDFBarcode);	
			ЗапросЕГАИС = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЕГАИС_Номенклатура.Ссылка,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.Наименование, """") КАК name,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.ПроизводительИмпортер.Наименование, """") КАК manufacturer,
			//|	ЕСТЬNULL(ЕГАИС_Номенклатура.Импортер.Наименование, """") КАК Importer,
			|	"""" КАК importer,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.Объем, 0) КАК capacity,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.Крепость, 0) КАК percent_alco,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.ВидПродукции.Наименование, """") КАК type_alco
			|ИЗ
			|	Справочник.астНоменклатураЕГАИС КАК ЕГАИС_Номенклатура
			|ГДЕ
			|	ЕГАИС_Номенклатура.Код = &Код
			|	И НЕ ЕГАИС_Номенклатура.ПометкаУдаления");
			
			ЗапросЕГАИС.УстановитьПараметр("Код", Алкокод);
			
		ИначеЕсли стрДлина(PDFBarcode)=150 Тогда	
			
			//во входящей ттн упаковки смотрим в самом доке
			ЭтоВходящаяТТН = Ложь;
			Попытка
				Если  Шаблон.ВидДокумента = "астТоварноТранспортныеНакладныеИзЕГАИС" Тогда
					Если СсылкаНаДок.ИсходныйДокумент.ТипДокумента = Перечисления.астТипыАктовТоварноТранспортныхНакладныхЕГАИС.Входящий Тогда
						ЭтоВходящаяТТН = Истина;
					КонецЕсли;
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			Если ЭтоВходящаяТТН Тогда			
				
				Возврат ПодготовитьОтветJSON(Новый Структура);
								
			Иначе		
				
				ЗапросЕГАИС = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
				|	астМаркиЕГАИС.НоменклатураЕГАИС.Ссылка КАК Ссылка,
				|	ЕСТЬNULL(астМаркиЕГАИС.НоменклатураЕГАИС.Наименование, """") КАК name,
				|	ЕСТЬNULL(астМаркиЕГАИС.НоменклатураЕГАИС.ПроизводительИмпортер.Наименование, """") КАК manufacturer,
				//|	ЕСТЬNULL(ЕГАИС_Номенклатура.Импортер.Наименование, """") КАК Importer,
				|	"""" КАК importer,
				|	ЕСТЬNULL(астМаркиЕГАИС.НоменклатураЕГАИС.Объем, 0) КАК capacity,
				|	ЕСТЬNULL(астМаркиЕГАИС.НоменклатураЕГАИС.Крепость, 0) КАК percent_alco,
				|	ЕСТЬNULL(астМаркиЕГАИС.НоменклатураЕГАИС.ВидПродукции.Наименование, """") КАК type_alco
				|ИЗ
				|	Справочник.астМаркиЕГАИС КАК астМаркиЕГАИС
				|ГДЕ
				|	астМаркиЕГАИС.Наименование = &Код
				|	И НЕ астМаркиЕГАИС.ПометкаУдаления");
				
				ЗапросЕГАИС.УстановитьПараметр("Код", PDFBarcode);
				
			КонецЕсли;	
			
		Иначе
			Возврат ПодготовитьОтветJSON(Новый Структура);
		КонецЕсли;
		
		ВыборкаЕГАИС = ЗапросЕГАИС.Выполнить().Выбрать();
		
		Пока ВыборкаЕГАИС.Следующий() Цикл
			
			OnArtEgaisScan_ЗаполнитьОбъектТовара(ВыборкаЕГАИС, ОбъектТовараЕГАИС);
			
		КонецЦикла;
		
		Возврат ПодготовитьОтветJSON(ОбъектТовараЕГАИС);
		
	КонецЕсли;
	
КонецФункции

Функция GetEgaisArts(SN, UserName) Экспорт 
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;
	
	Если НЕ ДатаМобайл_ОбщийМодуль.ЕстьЕГАИС() И НЕ ДатаМобайл_ОбщийМодуль.ЕстьАСТ() И НЕ ДатаМобайл_ОбщийМодуль.ЕстьКТ2000() Тогда
		Возврат ПодготовитьОтветJSON(ОбъектСписка);
	КонецЕсли;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Если ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО, "ОчиститьТоварыЕГАИС") Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьФлаговОбменаТСД(УзелПО, "ОчиститьТоварыЕГАИС", Ложь);	 
	КонецЕсли;
	
	
	Если ДатаМобайл_ОбщийМодуль.ЕстьАСТ() Тогда  // аст
		ЗапросТоваров = Новый Запрос;
		ЗапросТоваров.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ЕГАИС_НоменклатураИзменения.Ссылка, ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяССылка)) КАК Ссылка
		|ИЗ
		|	Справочник.КлассификаторАлкогольнойПродукцииЕГАИС КАК ЕГАИС_НоменклатураИзменения
		|ГДЕ
		| НЕ ЕГАИС_НоменклатураИзменения.Ссылка.ПометкаУдаления";
		ЗапросТоваров.Текст = СтрЗаменить(ЗапросТоваров.Текст, "КлассификаторАлкогольнойПродукцииЕГАИС", "астНоменклатураЕГАИС");
		
		ВыборкаТоваров = ЗапросТоваров.Выполнить().Выбрать();
		Пока ВыборкаТоваров.Следующий() Цикл
			ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("egais_art");
			
			ОбъектТовара.id = "8e-" + XMLСтрока(ВыборкаТоваров.Ссылка);	
			ОбъектТовара.name = ЧистаяСтрока(Лев(ВыборкаТоваров.Ссылка.Наименование, 100));
			ОбъектТовара.alcocode = ЧистаяСтрока(ВыборкаТоваров.Ссылка.Код);
			ОбъектТовара.manufacturer = ЧистаяСтрока(Лев(ВыборкаТоваров.Ссылка.ПроизводительИмпортер.Наименование, 100));
			ОбъектТовара.importer = ""; // импортера не используем
			ОбъектТовара.capacity = ВыборкаТоваров.Ссылка.Объем;
			ОбъектТовара.percent_alco = ВыборкаТоваров.Ссылка.Крепость;
			ОбъектТовара.type_alco = ЧистаяСтрока(ВыборкаТоваров.Ссылка.ВидПродукции.Код + " " + ВыборкаТоваров.Ссылка.ВидПродукции.Наименование);
			ОбъектТовара.is_compared = ТоварСопоставленОдинКОдному(ВыборкаТоваров.Ссылка);
			ОбъектТовара.box_coef = 0; // количество единиц в коробе
			
			ОбъектСписка.Добавить(ОбъектТовара);
		КонецЦикла;
		
	ИначеЕсли ДатаМобайл_ОбщийМодуль.ЕстьКТ2000() Тогда // кт2000
		ЗапросТоваров = Новый Запрос;
		ЗапросТоваров.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ЕГАИС_НоменклатураИзменения.Ссылка, ЗНАЧЕНИЕ(Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС.ПустаяССылка)) КАК ССылка
		|ИЗ
		|	Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС КАК ЕГАИС_НоменклатураИзменения";
		ВыборкаТоваров = ЗапросТоваров.Выполнить().Выбрать(); 
		
		Пока ВыборкаТоваров.Следующий() Цикл
			ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("egais_art");
			
			ОбъектТовара.id = "8e-" + XMLСтрока(ВыборкаТоваров.Ссылка);	
			ОбъектТовара.name = ЧистаяСтрока(Лев(ВыборкаТоваров.Ссылка.Наименование, 100));
			ОбъектТовара.alcocode = ЧистаяСтрока(ВыборкаТоваров.Ссылка.Код);
			ОбъектТовара.manufacturer = ЧистаяСтрока(Лев(ВыборкаТоваров.Ссылка.Производитель.Наименование, 100));
			ОбъектТовара.importer = ""; // импортера не используем
			ОбъектТовара.capacity = ВыборкаТоваров.Ссылка.Объем;
			ОбъектТовара.percent_alco = ВыборкаТоваров.Ссылка.Крепость;
			ОбъектТовара.type_alco = ЧистаяСтрока(ВыборкаТоваров.Ссылка.ВидПродукции.Код + " " + ВыборкаТоваров.Ссылка.ВидПродукции.Наименование);
			ОбъектТовара.is_compared = ТоварСопоставленОдинКОдному(ВыборкаТоваров.Ссылка);
			ОбъектТовара.box_coef = 6; // количество единиц в коробе
			
			ОбъектСписка.Добавить(ОбъектТовара);
		КонецЦикла;
		
	Иначе		
		ЗапросТоваров = Новый Запрос;
		ЗапросТоваров.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ЕГАИС_НоменклатураИзменения.Ссылка, ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяССылка)) КАК ССылка
		|ИЗ
		|	Справочник.КлассификаторАлкогольнойПродукцииЕГАИС КАК ЕГАИС_НоменклатураИзменения
		|ГДЕ
		| НЕ ЕГАИС_НоменклатураИзменения.Ссылка.ПометкаУдаления";
		
		ВыборкаТоваров = ЗапросТоваров.Выполнить().Выбрать();
		Пока ВыборкаТоваров.Следующий() Цикл
			ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("egais_art");
			
			ОбъектТовара.id = "8e-" + XMLСтрока(ВыборкаТоваров.Ссылка);	
			ОбъектТовара.name = ЧистаяСтрока(Лев(ВыборкаТоваров.Ссылка.Наименование, 100));
			ОбъектТовара.alcocode = ЧистаяСтрока(ВыборкаТоваров.Ссылка.Код);
			ОбъектТовара.manufacturer = ЧистаяСтрока(Лев(ВыборкаТоваров.Ссылка.Производитель.Наименование, 100));
			ОбъектТовара.importer = ""; // импортера не используем
			ОбъектТовара.capacity = ВыборкаТоваров.Ссылка.Объем;
			ОбъектТовара.percent_alco = ВыборкаТоваров.Ссылка.Крепость;
			ОбъектТовара.type_alco = ЧистаяСтрока(ВыборкаТоваров.Ссылка.ВидПродукции.Код + " " + ВыборкаТоваров.Ссылка.ВидПродукции.Наименование);
			ОбъектТовара.is_compared = ТоварСопоставленОдинКОдному(ВыборкаТоваров.Ссылка);
			ОбъектТовара.box_coef = 0; // количество единиц в коробе
			
			ОбъектСписка.Добавить(ОбъектТовара);
		КонецЦикла;	
	КонецЕсли;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);

КонецФункции

Функция GetEgaisMarks(SN, UserName) Экспорт 
		
	ОбъектСписка =  Новый Массив;
	СтруктураОтвета = Новый Структура;
	
	Если НЕ ДатаМобайл_ОбщийМодуль.ЕстьЕГАИС() И НЕ ДатаМобайл_ОбщийМодуль.ЕстьАСТ() И НЕ ДатаМобайл_ОбщийМодуль.ЕстьКТ2000() Тогда		
		Возврат ПодготовитьОтветJSON(ОбъектСписка);
	КонецЕсли;	
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Если ДатаМобайл_ОбщийМодуль.ЧтениеФлаговОбменаТСД(УзелПО, "ОчиститьМаркиЕГАИС") Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьФлаговОбменаТСД(УзелПО, "ОчиститьМаркиЕГАИС", Ложь);	 
	КонецЕсли;
	
	Если ДатаМобайл_ОбщийМодуль.ЕстьАСТ() Тогда
		ЗапросМарок = Новый Запрос("ВЫБРАТЬ
		|	астМаркиЕГАИС.Наименование КАК АкцизнаяМарка,
		|	астМаркиЕГАИС.НоменклатураЕГАИС КАК АлкогольнаяПродукция
		|ИЗ
		|	Справочник.астМаркиЕГАИС КАК астМаркиЕГАИС
		|ГДЕ
		|	НЕ астМаркиЕГАИС.ПометкаУдаления");
		
		ВыборкаМарок = ЗапросМарок.Выполнить().Выбрать();
		
		Пока ВыборкаМарок.Следующий() Цикл
			
			ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("egais_art_mark");
			
			ОбъектТовара.art_id = "8e-" + XMLСтрока(ВыборкаМарок.АлкогольнаяПродукция); 
			ОбъектТовара.mark = ВыборкаМарок.АкцизнаяМарка;
			
			ОбъектСписка.Добавить(ОбъектТовара);
			
		КонецЦикла;
		
	ИначеЕсли ДатаМобайл_ОбщийМодуль.ЕстьКТ2000() Тогда
		ЗапросМарок = Новый Запрос(	"ВЫБРАТЬ
		|	АкцизныеМаркиЕГАИС.Марка КАК АкцизнаяМарка,
		|	АкцизныеМаркиЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция
		|ИЗ
		|	РегистрСведений.алкХранилищеАкцизныхМарок.СрезПоследних КАК АкцизныеМаркиЕГАИС");
		
		ВыборкаМарок = ЗапросМарок.Выполнить().Выбрать();
		
		Пока ВыборкаМарок.Следующий() Цикл
			ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("egais_art_mark");
			
			ОбъектТовара.art_id = "8e-" + XMLСтрока(ВыборкаМарок.АлкогольнаяПродукция); 
			ОбъектТовара.mark = ВыборкаМарок.АкцизнаяМарка;
			
			ОбъектСписка.Добавить(ОбъектТовара);
		КонецЦикла;
		
	Иначе 		
		ЗапросМарок = Новый Запрос ("ВЫБРАТЬ
		|	ЕстьNull(ЕГАИС_ДанныеМарки.АкцизнаяМарка.ЗначениеШтрихкода,"""") КАК АкцизнаяМарка,
		|	ЕГАИС_ДанныеМарки.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	ЕстьNull(ЕГАИС_ДанныеМарки.АлкогольнаяПродукция.ПометкаУдаления, Ложь) КАК ПометкаУдаления,
		|	ЕСТЬNULL(ДанныеУпаковкиУровень1.Ссылка.ЗначениеШтрихкода,"""") КАК Короб,
		|	ЕСТЬNULL(ДанныеУпаковкиУровень2.Ссылка.ЗначениеШтрихкода,"""") КАК Палета 
		|ИЗ
		|	РегистрСведений.АкцизныеМаркиЕГАИС КАК ЕГАИС_ДанныеМарки
		|   ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ДанныеУпаковкиУровень1
		|   ПО ДанныеУпаковкиУровень1.Штрихкод.ЗначениеШтрихкода = ЕГАИС_ДанныеМарки.АкцизнаяМарка.ЗначениеШтрихкода
		|   И (ДанныеУпаковкиУровень1.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
		|			ИЛИ ДанныеУпаковкиУровень1.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка))
		|   ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ДанныеУпаковкиУровень2
		|   ПО ДанныеУпаковкиУровень2.Штрихкод.ЗначениеШтрихкода = ДанныеУпаковкиУровень1.Ссылка.ЗначениеШтрихкода
		|   И (ДанныеУпаковкиУровень2.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
		|			ИЛИ ДанныеУпаковкиУровень2.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка))");
		
		ВыборкаМарок = ЗапросМарок.Выполнить().Выбрать();
		
		Пока ВыборкаМарок.Следующий() Цикл
			Попытка 
				Если НЕ ЗначениеЗаполнено(ВыборкаМарок.АкцизнаяМарка) или НЕ ЗначениеЗаполнено(ВыборкаМарок.АлкогольнаяПродукция) или ВыборкаМарок.ПометкаУдаления  тогда
					Продолжить;
				КонецЕсли;
				
				ОбъектТовара =  ПолучитьСтруктуруОбъектаДляHttp("egais_art_mark");
				
				ОбъектТовара.art_id = "8e-" + XMLСтрока(ВыборкаМарок.АлкогольнаяПродукция); 
				ОбъектТовара.mark = ВыборкаМарок.АкцизнаяМарка;
				ОбъектТовара.box = ВыборкаМарок.Короб;
				ОбъектТовара.pallet = ВыборкаМарок.Палета;
				
				ОбъектСписка.Добавить(ОбъектТовара);
			Исключение 
				Продолжить;
			КонецПопытки;	
		КонецЦикла;
	КонецЕсли;	
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

Функция GetDocArtsEgais(SN, UserName, DocID) Экспорт 
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocID, 5));   		
	Исключение
                                                                                                   
		СтруктураОтвета.Вставить("is_success", Ложь);

		Возврат ПодготовитьОтветJSON(СтруктураОтвета);

	КонецПопытки;
	
	Шаблон = СсылкаНаДок.Шаблон;
	
	ИмяДокумента = Шаблон.ВидДокумента;
	ИмяТЧ = Шаблон.ИмяТабличнойЧастиПодбор;
	
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаДок.ИсходныйДокумент) ИЛИ НЕ Шаблон.ЕГАИС Тогда
		Возврат ПодготовитьОтветJSON(ОбъектСписка);	
	КонецЕсли;
	
	
	Если ДатаМобайл_ОбщийМодуль.ЕстьАСТ() Тогда
		ЗапросТоваров = Новый Запрос;
		ЗапросТоваров.УстановитьПараметр("ТТН", СсылкаНаДок.ИсходныйДокумент);
		
		ЗапросТоваров.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕГАИС_ТТНТовары.НоменклатураЕГАИС КАК Номенклатура,
		|	СУММА(ЕГАИС_ТТНТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ТоварыВОсновании
		|ИЗ
		|	Документ.астТоварноТранспортныеНакладныеИзЕГАИС.Товары КАК ЕГАИС_ТТНТовары
		|ГДЕ
		|	ЕГАИС_ТТНТовары.Ссылка = &ТТН
		|   И ЕГАИС_ТТНТовары.Количество > 0
		|СГРУППИРОВАТЬ ПО
		|	ЕГАИС_ТТНТовары.НоменклатураЕГАИС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ТоварыВОсновании.Номенклатура.Код, """") КАК alcocode,
		|	ЕСТЬNULL(ТоварыВОсновании.Номенклатура.ПроизводительИмпортер.Наименование, """") КАК manufacturer,
		//|	ЕСТЬNULL(ЕГАИС_Номенклатура.Импортер.Наименование, """") КАК Importer,
		|	"""" КАК importer,
		|	ЕСТЬNULL(ТоварыВОсновании.Номенклатура.Объем, 0) КАК capacity,
		|	ЕСТЬNULL(ТоварыВОсновании.Номенклатура.Крепость, 0) КАК percent_alco,
		|	ЕСТЬNULL(ТоварыВОсновании.Номенклатура.ВидПродукции.Наименование, """") КАК type_alco,
		|	ЕСТЬNULL(ТоварыВОсновании.Номенклатура.Наименование, """") КАК name,
		|	ЕСТЬNULL(ТоварыВОсновании.Номенклатура, ЗНАЧЕНИЕ(Справочник.астНоменклатураЕГАИС.ПустаяССылка)) КАК ССылка
		|ИЗ
		|	ТоварыВОсновании КАК ТоварыВОсновании";
		
		ЗапросТоваров.Текст = СтрЗаменить(ЗапросТоваров.Текст, "астТоварноТранспортныеНакладныеИзЕГАИС", Шаблон.ВидДокумента);
		ЗапросТоваров.Текст = СтрЗаменить(ЗапросТоваров.Текст, ".Товары КАК ", "." + Шаблон.ИмяТабличнойЧастиПодбор + " КАК ");
		
		Если Шаблон.ВидДокумента = "астАктФиксацииШтрихкодовНаБалансеОрганизации" Тогда
			ЗапросТоваров.Текст = СтрЗаменить(ЗапросТоваров.Текст, "ЕГАИС_ТТНТовары.Количество", "ЕГАИС_ТТНТовары.КоличествоМарок");				
		КонецЕсли;
		
		
		ВыборкаТоваров = ЗапросТоваров.Выполнить().Выбрать();
		Пока ВыборкаТоваров.Следующий() Цикл
			ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("egais_art");
			ОбъектТовара.id = "8e-" + XMLСтрока(ВыборкаТоваров.Ссылка);	
			ЗаполнитьЗначенияСвойств(ОбъектТовара, ВыборкаТоваров);
			ОбъектТовара.name = ЧистаяСтрока(ОбъектТовара.ArtName);
			ОбъектТовара.is_compared = ТоварСопоставленОдинКОдному(ВыборкаТоваров.ССылка);
			ОбъектТовара.box_coef = 0; // количество единиц в коробе
			
			ОбъектСписка.Добавить(ОбъектТовара);
		КонецЦикла;
		
	ИначеЕсли ДатаМобайл_ОбщийМодуль.ЕстьКТ2000() Тогда
		ЗапросТоваров = Новый Запрос;
		ЗапросТоваров.УстановитьПараметр("ТТН", СсылкаНаДок.ИсходныйДокумент);
		
		ЗапросТоваров.Текст = "ВЫБРАТЬ
		|	ЕГАИС_ТТНТовары.АлкогольнаяПродукция КАК Номенклатура,
		|	СУММА(ЕГАИС_ТТНТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ТоварыВОсновании
		|ИЗ
		|	Документ.алкТоварноТранспортнаяНакладнаяЕГАИС.Товары КАК ЕГАИС_ТТНТовары
		|ГДЕ
		|	ЕГАИС_ТТНТовары.Ссылка = &ТТН
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕГАИС_ТТНТовары.АлкогольнаяПродукция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.Код, """") КАК alcocode,
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.Производитель.Наименование, """") КАК manufacturer,
		//|	ЕСТЬNULL(ЕГАИС_Номенклатура.Импортер.Наименование, """") КАК importer,
		|	"""" КАК importer,
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.Объем, 0) КАК capacity,
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.Крепость, 0) КАК percent_alco,
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.ВидПродукции.Наименование, """") КАК type_alco,
		|	ЕСТЬNULL(ТоварыВОсновании.Количество, 0) КАК Quant,
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.Наименование, """") КАК name,
		|	ЕСТЬNULL(ТоварыВОсновании.Номенклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС.ПустаяССылка)) КАК ССылка
		|ИЗ
		|	ТоварыВОсновании КАК ТоварыВОсновании
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС КАК ЕГАИС_Номенклатура
		|		ПО ТоварыВОсновании.Номенклатура = ЕГАИС_Номенклатура.Ссылка";
		
		ЗапросТоваров.Текст=СтрЗаменить(ЗапросТоваров.Текст,".ЕГАИС_ТТН.","."+Шаблон.ВидДокумента+".");
		ЗапросТоваров.Текст=СтрЗаменить(ЗапросТоваров.Текст,".Товары КАК ","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК ");
		
		ЗапросТоваров.Текст=СтрЗаменить(ЗапросТоваров.Текст,".алкТоварноТранспортнаяНакладнаяЕГАИС.","."+Шаблон.ВидДокумента+".");
		ЗапросТоваров.Текст=СтрЗаменить(ЗапросТоваров.Текст,".Товары КАК ","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК ");
		
		Если Шаблон.ВидДокумента = "ДатаМобайл_УпаковочныйЛист" или Шаблон.ВидДокумента = "ДатаМобайл_ЗаявкаНаСклад" тогда 
			ЗапросТоваров.Текст=СтрЗаменить(ЗапросТоваров.Текст,"ТТНТовары.АлкогольнаяПродукция","ТТНТовары.ЕГАИС_Номенклатура");
		ИначеЕсли Шаблон.ВидДокумента = "алкАктФиксацииШтрихкодовНаБалансеОрганизацииЕГАИС" тогда 
			ЗапросТоваров.Текст=СтрЗаменить(ЗапросТоваров.Текст,"ЕГАИС_ТТНТовары.Количество","0");
		ИначеЕсли Шаблон.ВидДокумента = "РеализацияТоваровУслуг" тогда 				  		
			ЗапросТоваров.Текст = "ВЫБРАТЬ
			|ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция,ЗНАЧЕНИЕ(Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС.ПустаяССылка)) КАК Номенклатура,
			|ЕГАИС_ТТНТовары.Номенклатура КАК НоменклатураУчетная
			|ПОМЕСТИТЬ ТоварыВОсновании
			|ИЗ
			|	Документ.РеализацияТоваровУслуг.Товары КАК ЕГАИС_ТТНТовары
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры КАК СоответствиеНоменклатурыЕГАИС
			|	ПО СоответствиеНоменклатурыЕГАИС.Номенклатура = ЕГАИС_ТТНТовары.Номенклатура И СоответствиеНоменклатурыЕГАИС.СерияНоменклатуры = ЕГАИС_ТТНТовары.Серия
			|ГДЕ
			|	ЕГАИС_ТТНТовары.Ссылка = &ТТН
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция,ЗНАЧЕНИЕ(Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС.ПустаяССылка)),
			|	ЕГАИС_ТТНТовары.Номенклатура
			|	
			|ОБЪЕДИНИТЬ
			|	
			|	ВЫБРАТЬ
			|ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция,ЗНАЧЕНИЕ(Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС.ПустаяССылка)) КАК Номенклатура,
			|ЕГАИС_ТТНТовары.Номенклатура КАК НоменклатураУчетная
			|ИЗ
			|	Документ.РеализацияТоваровУслуг.Товары КАК ЕГАИС_ТТНТовары
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры КАК СоответствиеНоменклатурыЕГАИС
			|	ПО СоответствиеНоменклатурыЕГАИС.Номенклатура = ЕГАИС_ТТНТовары.Номенклатура
			|ГДЕ
			|	ЕГАИС_ТТНТовары.Ссылка = &ТТН
			|
			|СГРУППИРОВАТЬ ПО
			|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция,ЗНАЧЕНИЕ(Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС.ПустаяССылка)),
			|	ЕГАИС_ТТНТовары.Номенклатура 
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.Код, """") КАК alcocode,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.Производитель.Наименование, """") КАК manufacturer,
			|	"""" КАК importer,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.Объем, 0) КАК capacity,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.Крепость, 0) КАК percent_alco,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.ВидПродукции.Наименование, """") КАК type_alco,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.Наименование, """") КАК name,
			|	ТоварыВОсновании.Номенклатура КАК Ссылка,
			|	ТоварыВОсновании.НоменклатураУчетная КАК НоменклатураУчетная
			|ИЗ
			|	ТоварыВОсновании КАК ТоварыВОсновании
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС КАК ЕГАИС_Номенклатура
			|		ПО ТоварыВОсновании.Номенклатура = ЕГАИС_Номенклатура.Ссылка
			|ГДЕ НЕ ТоварыВОсновании.Номенклатура = ЗНАЧЕНИЕ(Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС.ПустаяССылка)";						  
		КонецЕсли;		
		
		ВыборкаТоваров = ЗапросТоваров.Выполнить().Выбрать();
		Пока ВыборкаТоваров.Следующий() Цикл
			ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("egais_art");
			ОбъектТовара.id = "8e-" + XMLСтрока(ВыборкаТоваров.Ссылка);	
			ЗаполнитьЗначенияСвойств(ОбъектТовара, ВыборкаТоваров);
			ОбъектТовара.name = ЧистаяСтрока(ОбъектТовара.name);
			ОбъектТовара.is_compared = ТоварСопоставленОдинКОдному(ВыборкаТоваров.Ссылка);
			ОбъектТовара.box_coef = 6; // количество единиц в коробе
			
			ОбъектСписка.Добавить(ОбъектТовара);
		КонецЦикла;
		
	Иначе
		ЗапросТоваров = Новый Запрос;
		ЗапросТоваров.УстановитьПараметр("ТТН", СсылкаНаДок.ИсходныйДокумент);
		ЗАпросТоваров.Текст = 
		"ВЫБРАТЬ
		|	ЕГАИС_ТТНТовары.АлкогольнаяПродукция КАК Номенклатура,
		|	СУММА(ЕГАИС_ТТНТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ТоварыВОсновании
		|ИЗ
		|	Документ.ТТНВходящаяЕГАИС.Товары КАК ЕГАИС_ТТНТовары
		|ГДЕ
		|	ЕГАИС_ТТНТовары.Ссылка = &ТТН
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕГАИС_ТТНТовары.АлкогольнаяПродукция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.Код, """") КАК alcocode,
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.Производитель.Наименование, """") КАК manufacturer,
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.Импортер.Наименование, """") КАК importer,
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.Объем, 0) КАК capacity,
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.Крепость, 0) КАК percent_alco,
		|	ВЫБОР
		|		КОГДА ЕГАИС_Номенклатура.ВидПродукции.Код ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(ЕГАИС_Номенклатура.ВидПродукции.Код + "" "", """") + ЕСТЬNULL(ЕГАИС_Номенклатура.ВидПродукции.Наименование, """")
		|		ИНАЧЕ ЕСТЬNULL(Товары.Номенклатура.ВидАлкогольнойПродукции.Код + "" "", """") + ЕСТЬNULL(Товары.Номенклатура.ВидАлкогольнойПродукции.Наименование + "" "", """")
		|	КОНЕЦ КАК type_alco,
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.Наименование, """") КАК name,
		|	ЕСТЬNULL(ТоварыВОсновании.Номенклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяССылка)) КАК Ссылка
		|ИЗ
		|	ТоварыВОсновании КАК ТоварыВОсновании
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|			МАКСИМУМ(СоответствиеНоменклатурыЕГАИС.Номенклатура) КАК Номенклатура
		|		ИЗ
		|			РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
		|		
		|		СГРУППИРОВАТЬ ПО
		|			СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция) КАК Товары
		|		ПО (Товары.АлкогольнаяПродукция = ТоварыВОсновании.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторАлкогольнойПродукцииЕГАИС КАК ЕГАИС_Номенклатура
		|		ПО ТоварыВОсновании.Номенклатура = ЕГАИС_Номенклатура.Ссылка";
		
		ЗапросТоваров.Текст = СтрЗаменить(ЗапросТоваров.Текст, ".ТТНВходящаяЕГАИС.Товары", "." + Шаблон.ВидДокумента + "." + Шаблон.ИмяТабличнойЧастиПодбор);
		ТаблицаТоваров = ЗапросТоваров.Выполнить().Выгрузить();
		Для Каждого ВыборкаТоваров Из ТаблицаТоваров Цикл
			
			ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("egais_art");
			ОбъектТовара.id = "8e-" + XMLСтрока(ВыборкаТоваров.Ссылка);	
			ЗаполнитьЗначенияСвойств(ОбъектТовара, ВыборкаТоваров);
			ОбъектТовара.is_compared = ТоварСопоставленОдинКОдному(ВыборкаТоваров.Ссылка); 
			ОбъектТовара.box_coef = 0; // количество единиц в коробе
			
			ОбъектСписка.Добавить(ОбъектТовара);
			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

Функция GetArtEgaisDateBottling(SN, UserName, DocOutID, ArtID, Barcode, PDFBarcode) Экспорт 
	
	ОбъектСписка = Новый Массив;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;

	ДатаРозлива = Строка(ТекущаяДата());
	ОбъектСписка.Добавить(ДатаРозлива);
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);		
	
КонецФункции

Функция OnEgaisPalletScan(SN, UserName, Barcode, DocOutID, Cell) Экспорт 
	
	Если ДатаМобайл_ОбщийМодуль.ЕстьКТ2000() Тогда
		Возврат OnEgaisPalletScan_КТ2000(SN, UserName, Barcode, DocOutID, Cell);
	КонецЕсли;
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);  
	КонецЕсли;	
	
	попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));	
	Исключение		
		СтруктураОтвета.Вставить("Описание", "Не нашли документ. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецПопытки;
	
	Шаблон = СсылкаНаДок.Шаблон;	
	ШаблонЕГАИС = Шаблон.ЕГАИС;	
	

	Если НЕ ДатаМобайл_ОбщийМодуль.ЕстьАСТ() Тогда
		
		//во входящей ттн упаковки в самом доке	
		Если ШаблонЕГАИС и Шаблон.ВидДокумента = "ТТНВходящаяЕГАИС" Тогда
			
			//ТЗМарок = ДатаМобайл_ОбщийМодуль.ПолучитьМаркиВходящейТТН_ЕГАИС(СсылкаНаДок.ИсходныйДокумент);
			//
			////поиск палет
			//СтруктураПоискаМарок = Новый Структура("Палета", Barcode);
			//СтрокиПоискаМарок = ТЗМарок.НайтиСтроки(СтруктураПоискаМарок);	
			//Для Каждого СтрокаДока ИЗ СтрокиПоискаМарок Цикл
			//	
			//	СтруктураТекущейСтроки = Новый Структура;
			//	
			//	qty  = 1; 
			//	СтруктураТекущейСтроки.Вставить("qty", qty);
			//	
			//	ОбъектЕГАИС = ПолучитьСтруктуруОбъектаДляHttp("egais");
			//	ОбъектЕГАИС.mark = СтрокаДока.Марка;	
			//	СтруктураТекущейСтроки.Вставить("egais", ОбъектЕГАИС);
			//
			//	Если ЗначениеЗаполнено(ОбъектЕГАИС.mark) Тогда				
			//		ОбъектСписка.Добавить(СтруктураТекущейСтроки);
			//	КонецЕсли;
			//	
			//КонецЦикла;
			//
			////поиск коробов
			//СтруктураПоискаМарок = Новый Структура("Короб",Barcode);
			//СтрокиПоискаМарок = ТЗМарок.НайтиСтроки(СтруктураПоискаМарок);	
			//Для Каждого СтрокаДока ИЗ СтрокиПоискаМарок Цикл
			//	
			//	СтруктураТекущейСтроки = Новый Структура;
			//	
			//	qty  = 1; 
			//	СтруктураТекущейСтроки.Вставить("qty", qty);
			//	
			//	ОбъектЕГАИС = ПолучитьСтруктуруОбъектаДляHttp("egais");
			//	ОбъектЕГАИС.mark = СтрокаДока.Марка;	
			//	СтруктураТекущейСтроки.Вставить("egais", ОбъектЕГАИС);
			//
			//	Если ЗначениеЗаполнено(ОбъектЕГАИС.mark) Тогда				
			//		ОбъектСписка.Добавить(СтруктураТекущейСтроки);
			//	КонецЕсли;
			//КонецЦикла;
			
		Иначе	  
			
			//Упаковки из 1С	
			ТЗМарок = ПолучитьТаблицуУпакованныхМарок(Barcode);
			Если ТЗМарок.Количество()>0 Тогда
				
				Для Каждого СтрокаДока ИЗ ТЗМарок Цикл	
						
					СтруктураТекущейСтроки = Новый Структура;
					
					qty  = 1; 
					СтруктураТекущейСтроки.Вставить("qty", qty);
					
					ОбъектЕГАИС = ПолучитьСтруктуруОбъектаДляHttp("egais");
					ОбъектЕГАИС.mark = СтрокаДока.Марка;	
					СтруктураТекущейСтроки.Вставить("egais", ОбъектЕГАИС);

					Если ЗначениеЗаполнено(ОбъектЕГАИС.mark) Тогда				
						ОбъектСписка.Добавить(СтруктураТекущейСтроки);
					КонецЕсли;
					
				КонецЦикла;	
			КонецЕсли;	
		КонецЕсли;
		
		
	Иначе
		
		ТЗМарок = ДатаМобайл_ОбщийМодуль.ПолучитьТаблицуУпакованныхМарокАСТ(Barcode);
		Для Каждого СтрокаДока ИЗ ТЗМарок Цикл	
			
			СтруктураТекущейСтроки = Новый Структура;
			
			qty  = 1; 
			СтруктураТекущейСтроки.Вставить("qty", qty);

			ОбъектЕГАИС = ПолучитьСтруктуруОбъектаДляHttp("egais");
			ОбъектЕГАИС.mark = СтрокаДока.Марка;	
			СтруктураТекущейСтроки.Вставить("egais", ОбъектЕГАИС);
			
			Если ЗначениеЗаполнено(ОбъектЕГАИС.mark) Тогда				
				ОбъектСписка.Добавить(СтруктураТекущейСтроки);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

#КонецОбласти


#Область ВспомогательныеПродедурыИФункции

#Область OnArtScan_OnArtMarkScan

Процедура OnArtScan_Select_Insert_Cells(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок, Запрос, Тип, Ячейка)
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
	|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатуры.Упаковка.ЕдиницаИзмерения.Наименование КАК Наименование,
	|	ВЫБОР
	|		КОГДА ШтрихкодыНоменклатуры.Упаковка.Числитель = 0
	|				ИЛИ ШтрихкодыНоменклатуры.Упаковка.Числитель ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ ШтрихкодыНоменклатуры.Упаковка.Числитель
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ШтрихкодыНоменклатуры.Упаковка.Знаменатель = 0
	|				ИЛИ ШтрихкодыНоменклатуры.Упаковка.Знаменатель ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ ШтрихкодыНоменклатуры.Упаковка.Знаменатель
	|	КОНЕЦ КАК Коэффициент
	|ПОМЕСТИТЬ ДоступныеТовары
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	(ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	|			ИЛИ ШтрихкодыНоменклатуры.Штрихкод = &ВесовойШтрихкод)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДатаМобайл_НовыеШтрихкоды.Номенклатура,
	|	ДатаМобайл_НовыеШтрихкоды.Характеристика,
	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
	|	ДатаМобайл_НовыеШтрихкоды.ШтрихКод,
	|	ДатаМобайл_НовыеШтрихкоды.Наименование,
	|	ДатаМобайл_НовыеШтрихкоды.Коэффициент
	|ИЗ
	|	РегистрСведений.ДатаМобайл_НовыеШтрихкоды КАК ДатаМобайл_НовыеШтрихкоды
	|ГДЕ
	|	ДатаМобайл_НовыеШтрихкоды.ШтрихКод = &Штрихкод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДокументыСРезервамиТСД
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
	|ГДЕ	
	|	(ДатаМобайл_ДокументыТСД.Ссылка <> &ИсходноеЗадание)
	|		И (ДатаМобайл_ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1))
	|			И (ДатаМобайл_ДокументыТСД.Шаблон.РезервироватьТовар)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество,0)) КАК Количество
	|ПОМЕСТИТЬ ДанныеДокументыСРезервамиТСД
	|ИЗ
	|	ДокументыСРезервамиТСД КАК ДокументыСРезервамиТСД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	|		ПО ДокументыСРезервамиТСД.Ссылка = ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеТовары.Номенклатура КАК Номенклатура,
	|	ДоступныеТовары.Характеристика КАК Характеристика,
	|	ДоступныеТовары.Упаковка КАК Упаковка,
	|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество * (ВЫБОР
	|							КОГДА ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель = 0
	|									ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель ЕСТЬ NULL
	|								ТОГДА 1
	|							ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель
	|						КОНЕЦ / ВЫБОР
	|							КОГДА ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель = 0
	|									ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель ЕСТЬ NULL
	|								ТОГДА 1
	|							ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель
	|						КОНЕЦ), 0)) КАК ВРезервеТСД
	|ПОМЕСТИТЬ ТоварыСРезервамиТСД
	|ИЗ
	|	ДоступныеТовары КАК ДоступныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументыСРезервамиТСД КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	|		ПО ДоступныеТовары.Характеристика = ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры
	|			И ДоступныеТовары.Упаковка = ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
	|				И ДоступныеТовары.Номенклатура = ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура							
	
	
	
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоступныеТовары.Упаковка,
	|	ДоступныеТовары.Характеристика,
	|	ДоступныеТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(ТоварыВЯчейкахОстатки.ВНаличииОстаток * (ВЫБОР
	|				КОГДА ТоварыВЯчейкахОстатки.Упаковка.Числитель = 0
	|						ИЛИ ТоварыВЯчейкахОстатки.Упаковка.Числитель ЕСТЬ NULL
	|					ТОГДА 1
	|				ИНАЧЕ ТоварыВЯчейкахОстатки.Упаковка.Числитель
	|			КОНЕЦ / ВЫБОР
	|				КОГДА ТоварыВЯчейкахОстатки.Упаковка.Знаменатель = 0
	|						ИЛИ ТоварыВЯчейкахОстатки.Упаковка.Знаменатель ЕСТЬ NULL
	|					ТОГДА 1
	|				ИНАЧЕ ТоварыВЯчейкахОстатки.Упаковка.Знаменатель
	|			КОНЕЦ), 0)) КАК ВНаличии,
	|	СУММА(ЕСТЬNULL(ТоварыВЯчейкахОстатки.КОтборуОстаток * (ВЫБОР
	|				КОГДА ТоварыВЯчейкахОстатки.Упаковка.Числитель = 0
	|						ИЛИ ТоварыВЯчейкахОстатки.Упаковка.Числитель ЕСТЬ NULL
	|					ТОГДА 1
	|				ИНАЧЕ ТоварыВЯчейкахОстатки.Упаковка.Числитель
	|			КОНЕЦ / ВЫБОР
	|				КОГДА ТоварыВЯчейкахОстатки.Упаковка.Знаменатель = 0
	|						ИЛИ ТоварыВЯчейкахОстатки.Упаковка.Знаменатель ЕСТЬ NULL
	|					ТОГДА 1
	|				ИНАЧЕ ТоварыВЯчейкахОстатки.Упаковка.Знаменатель
	|			КОНЕЦ), 0)) КАК ВРезерве,
	|	ДоступныеТовары.Номенклатура КАК Номенклатура,
	|	ДоступныеТовары.Характеристика КАК Характеристика,
	|	ДоступныеТовары.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ ТоварыСОстатками1С
	|ИЗ
	|	ДоступныеТовары КАК ДоступныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				(&ВсеЯчейки
	|					ИЛИ Ячейка = &Ячейка)) КАК ТоварыВЯчейкахОстатки
	|		ПО ДоступныеТовары.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|			И ДоступныеТовары.Характеристика = ТоварыВЯчейкахОстатки.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоступныеТовары.Характеристика,
	|	ДоступныеТовары.Номенклатура,
	|	ДоступныеТовары.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеТовары.Номенклатура КАК Номенклатура,
	|	ДоступныеТовары.Характеристика КАК Характеристика,
	|	ДоступныеТовары.Упаковка КАК Упаковка,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ВЫБОР
	|				КОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель, 0) = 0
	|					ТОГДА 1
	|				ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель
	|			КОНЕЦ КАК ЧИСЛО(19, 2))) КАК Цена
	|ПОМЕСТИТЬ ТоварыСЦенами
	|ИЗ
	|	ДоступныеТовары КАК ДоступныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ВидЦены = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ДоступныеТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ДоступныеТовары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоступныеТовары.Номенклатура,
	|	ДоступныеТовары.Характеристика,
	|	ДоступныеТовары.Упаковка
	|;
	|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|	Ячейки.Номенклатура КАК Номенклатура,
	//|	МАКСИМУМ(ЕСТЬNULL(Ячейки.Ячейка.Наименование, """")) КАК АдресХранения
	//|ПОМЕСТИТЬ СписокЯчеек
	//|ИЗ
	//|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК Ячейки
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Ячейки.Номенклатура
	//|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеТовары.Номенклатура КАК Номенклатура,
	|	ДоступныеТовары.Характеристика КАК Характеристика,
	|	ДоступныеТовары.Упаковка КАК Упаковка,
	|	0 КАК ВЗадании,
	|	ТоварыСОстатками1С.ВНаличии КАК ВНаличии,
	|	ТоварыСОстатками1С.ВРезерве КАК ВРезерве,
	|	ТоварыСРезервамиТСД.ВРезервеТСД КАК ВРезервеТСД,
	|	ЕСТЬNULL(ТоварыСЦенами.Цена, 0) КАК Цена,
	//|	ЕСТЬNULL(СписокЯчеек.АдресХранения, """") КАК АдресХранения,
	|	ЕСТЬNULL(ДоступныеТовары.Наименование, ДоступныеТовары.Номенклатура.ЕдиницаИзмерения.Наименование) КАК НаименованиеУпаковки,
	|	ЕСТЬNULL(ДоступныеТовары.Коэффициент, 1) КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА &ВключатьАртикул
	|				И ТИПЗНАЧЕНИЯ(ДоступныеТовары.Номенклатура) = ТИП(Справочник.Номенклатура)
	|			ТОГДА ДоступныеТовары.Номенклатура.Артикул + ""-""
	|		ИНАЧЕ """"
	|	КОНЕЦ + ДоступныеТовары.Номенклатура.Наименование + "" "" + ЕСТЬNULL(ДоступныеТовары.Характеристика.Наименование, """") КАК НаименованиеТовара,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДоступныеТовары.Номенклатура) = ТИП(справочник.номенклатура)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоНовыйТовар
	|ИЗ
	|	ДоступныеТовары КАК ДоступныеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСРезервамиТСД КАК ТоварыСРезервамиТСД
	|		ПО ДоступныеТовары.Характеристика = ТоварыСРезервамиТСД.Характеристика
	|			И ДоступныеТовары.Номенклатура = ТоварыСРезервамиТСД.Номенклатура
	|			И ДоступныеТовары.Упаковка = ТоварыСРезервамиТСД.Упаковка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСОстатками1С КАК ТоварыСОстатками1С
	|		ПО ДоступныеТовары.Номенклатура = ТоварыСОстатками1С.Номенклатура
	|			И ДоступныеТовары.Характеристика = ТоварыСОстатками1С.Характеристика
	|			И ДоступныеТовары.Упаковка = ТоварыСОстатками1С.Упаковка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСЦенами КАК ТоварыСЦенами
	|		ПО ДоступныеТовары.Номенклатура = ТоварыСЦенами.Номенклатура
	|			И ДоступныеТовары.Характеристика = ТоварыСЦенами.Характеристика
	|			И ДоступныеТовары.Упаковка = ТоварыСЦенами.Упаковка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ СписокЯчеек КАК СписокЯчеек
	//|		ПО ДоступныеТовары.Номенклатура = СписокЯчеек.Номенклатура
	|";
	
	СкорректироватьЗапросПоЦенообразованию25(Запрос.Текст, "OnArtScan_Select_Insert_Cells");
	
	Запрос.Текст=СтрЗаменить(Запрос.Текст,".ОтборРазмещениеТоваров.","."+Шаблон.ВидДокумента+".");
	
	
	//ТекущаяЯчейкаСсылка = ?(УзелПО.ВыгружатьВКодЯчейки=1,Справочники.СкладскиеЯчейки.НайтиПоКоду(Ячейка), ДатаМобайл_ОбщийМодуль.ПолучитьЯчейкуПоШтрихкоду(Ячейка));
	ТекущаяЯчейкаСсылка = ДатаМобайл_ОбщийМодуль.ПолучитьЯчейкуПоКодуИлиШтрихкоду(Ячейка);
	
	Запрос.УстановитьПараметр("Ячейка",ТекущаяЯчейкаСсылка);
	Запрос.УстановитьПараметр("ВсеЯчейки",Ложь);

	Если Тип = "Select" Тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".ТоварыОтбор КАК","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК");
	Иначе 
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".ТоварыОтбор КАК","."+Шаблон.ИмяТабличнойЧастиПриемка+" КАК");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор","Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПриемка");	
	КонецЕсли;
	
	
КонецПроцедуры

Процедура OnArtScan_Select_Insert_Casual(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок, Запрос, Тип)
	
	Модуль_ОбщегоНазначения = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначения");
	РеквизитыШаблона = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Шаблон,"ВидДокумента,ИмяТабличнойЧастиПодбор,ИмяТабличнойЧастиПриемка");
	
	ВидДокумента 				= РеквизитыШаблона.ВидДокумента;
	ИмяТабличнойЧастиПодбор 	= РеквизитыШаблона.ИмяТабличнойЧастиПодбор;
	ИмяТабличнойЧастиПриемка 	= РеквизитыШаблона.ИмяТабличнойЧастиПриемка;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	               |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
	               |	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
	               |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	               |	ШтрихкодыНоменклатуры.Упаковка.ЕдиницаИзмерения.Наименование КАК Наименование,
	               |	ВЫБОР
	               |		КОГДА ШтрихкодыНоменклатуры.Упаковка.Числитель = 0
	               |				ИЛИ ШтрихкодыНоменклатуры.Упаковка.Числитель ЕСТЬ NULL
	               |			ТОГДА 1
	               |		ИНАЧЕ ШтрихкодыНоменклатуры.Упаковка.Числитель
	               |	КОНЕЦ / ВЫБОР
	               |		КОГДА ШтрихкодыНоменклатуры.Упаковка.Знаменатель = 0
	               |				ИЛИ ШтрихкодыНоменклатуры.Упаковка.Знаменатель ЕСТЬ NULL
	               |			ТОГДА 1
	               |		ИНАЧЕ ШтрихкодыНоменклатуры.Упаковка.Знаменатель
	               |	КОНЕЦ КАК Коэффициент
	               |ПОМЕСТИТЬ ДоступныеТовары
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	(ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
	               |			ИЛИ ШтрихкодыНоменклатуры.Штрихкод = &ВесовойШтрихкод)
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДатаМобайл_НовыеШтрихкоды.Номенклатура,
	               |	ДатаМобайл_НовыеШтрихкоды.Характеристика,
	               |	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
	               |	ДатаМобайл_НовыеШтрихкоды.ШтрихКод,
	               |	ДатаМобайл_НовыеШтрихкоды.Наименование,
	               |	ДатаМобайл_НовыеШтрихкоды.Коэффициент
	               |ИЗ
	               |	РегистрСведений.ДатаМобайл_НовыеШтрихкоды КАК ДатаМобайл_НовыеШтрихкоды
	               |ГДЕ
	               |	ДатаМобайл_НовыеШтрихкоды.ШтрихКод = &Штрихкод
				   |
				   |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Номенклатура.Ссылка,
	               |	ВЫБОР КОГДА ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL ТОГДА ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.) ИНАЧЕ ХарактеристикиНоменклатуры.Ссылка Конец,
	               |	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
	               |	Номенклатура.Артикул,
	               |	Номенклатура.ЕдиницаИзмерения.Наименование,
	               |	1
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	               |		ПО (Номенклатура.ВидНоменклатуры = ХарактеристикиНоменклатуры.Владелец)
	               |ГДЕ
	               |	Номенклатура.Артикул = &Артикул
	               |;
	               |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка
				   |ПОМЕСТИТЬ ДокументыСРезервамиТСД
				   |ИЗ
				   |	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
				   |ГДЕ	
				   |	(ДатаМобайл_ДокументыТСД.Ссылка <> &ИсходноеЗадание)
				   |		И (ДатаМобайл_ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1))
				   |			И (ДатаМобайл_ДокументыТСД.Шаблон.РезервироватьТовар)
				   |;
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
				   |	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				   |	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
				   |	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество,0)) КАК Количество
				   |ПОМЕСТИТЬ ДанныеДокументыСРезервамиТСД
				   |ИЗ
				   |	ДокументыСРезервамиТСД КАК ДокументыСРезервамиТСД
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
				   |		ПО ДокументыСРезервамиТСД.Ссылка = ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка
				   |СГРУППИРОВАТЬ ПО
				   |	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
				   |	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры,
				   |	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
				   |;
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДоступныеТовары.Номенклатура КАК Номенклатура,
	               |	ДоступныеТовары.Характеристика КАК Характеристика,
	               |	ДоступныеТовары.Упаковка КАК Упаковка,
	               |	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество * (ВЫБОР
	               |							КОГДА ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель = 0
	               |									ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель ЕСТЬ NULL
	               |								ТОГДА 1
	               |							ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель
	               |						КОНЕЦ / ВЫБОР
	               |							КОГДА ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель = 0
	               |									ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель ЕСТЬ NULL
	               |								ТОГДА 1
	               |							ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель
	               |						КОНЕЦ), 0)) КАК ВРезервеТСД
	               |ПОМЕСТИТЬ ТоварыСРезервамиТСД
	               |ИЗ
	               |	ДоступныеТовары КАК ДоступныеТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументыСРезервамиТСД КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	               |		ПО ДоступныеТовары.Характеристика = ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры
	               |			И ДоступныеТовары.Упаковка = ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
	               |				И ДоступныеТовары.Номенклатура = ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура



	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДоступныеТовары.Упаковка,
	               |	ДоступныеТовары.Характеристика,
	               |	ДоступныеТовары.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
	               |	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.КОтгрузкеОстаток, 0)) КАК ВРезерве,
	               |	ДоступныеТовары.Номенклатура КАК Номенклатура,
	               |	ДоступныеТовары.Характеристика КАК Характеристика,
	               |	ДоступныеТовары.Упаковка КАК Упаковка
	               |ПОМЕСТИТЬ ТоварыСОстатками1С
	               |ИЗ
	               |	ДоступныеТовары КАК ДоступныеТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |				,
	               |				(&ВсеСклады
	               |					ИЛИ Склад В (&Склады))
				   |				И (&ВсеПомещения
	               |					ИЛИ Помещение В (&Помещения))) КАК СвободныеОстаткиОстатки
	               |		ПО ДоступныеТовары.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
	               |			И ДоступныеТовары.Характеристика = СвободныеОстаткиОстатки.Характеристика
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДоступныеТовары.Характеристика,
	               |	ДоступныеТовары.Номенклатура,
	               |	ДоступныеТовары.Упаковка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДоступныеТовары.Номенклатура КАК Номенклатура,
	               |	ДоступныеТовары.Характеристика КАК Характеристика,
				   |	ДоступныеТовары.Упаковка КАК Упаковка,
				   |	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ВЫБОР
				   |				КОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель, 0) = 0
				   |					ТОГДА 1
				   |				ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель
				   |			КОНЕЦ КАК ЧИСЛО(19, 2))) КАК Цена
	               |ПОМЕСТИТЬ ТоварыСЦенами
	               |ИЗ
	               |	ДоступныеТовары КАК ДоступныеТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ВидЦены = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО ДоступныеТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	               |			И ДоступныеТовары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДоступныеТовары.Номенклатура,
	               |	ДоступныеТовары.Характеристика,
	               |	ДоступныеТовары.Упаковка
	               |;
	               |
				   //|////////////////////////////////////////////////////////////////////////////////
				   //|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				   //|	Ячейки.Номенклатура КАК Номенклатура,
				   //|	МАКСИМУМ(ЕСТЬNULL(Ячейки.Ячейка.Наименование, """")) КАК АдресХранения
				   //|ПОМЕСТИТЬ СписокЯчеек
				   //|ИЗ
				   //|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК Ячейки
				   //|
				   //|СГРУППИРОВАТЬ ПО
				   //|	Ячейки.Номенклатура
				   //|;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДоступныеТовары.Номенклатура КАК Номенклатура,
	               |	ДоступныеТовары.Характеристика КАК Характеристика,
	               |	ДоступныеТовары.Упаковка КАК Упаковка,
	               |	0 КАК ВЗадании,
	               |	ТоварыСОстатками1С.ВНаличии КАК ВНаличии,
	               |	ТоварыСОстатками1С.ВРезерве КАК ВРезерве,
	               |	ТоварыСРезервамиТСД.ВРезервеТСД КАК ВРезервеТСД,
	               |	ЕСТЬNULL(ТоварыСЦенами.Цена, 0) КАК Цена,
	               //|	ЕСТЬNULL(СписокЯчеек.АдресХранения, """") КАК АдресХранения,
	               |	ЕСТЬNULL(ДоступныеТовары.Наименование, ДоступныеТовары.Номенклатура.ЕдиницаИзмерения.Наименование) КАК НаименованиеУпаковки,
	               |	ЕСТЬNULL(ДоступныеТовары.Коэффициент, 1) КАК Коэффициент,
	               |	ВЫБОР
	               |		КОГДА &ВключатьАртикул
	               |				И ТИПЗНАЧЕНИЯ(ДоступныеТовары.Номенклатура) = ТИП(Справочник.Номенклатура)
	               |			ТОГДА ВЫБОР
	               |					КОГДА ДоступныеТовары.Номенклатура.Артикул = """"
	               |						ТОГДА """"
	               |					ИНАЧЕ ДоступныеТовары.Номенклатура.Артикул + "" ""
	               |				КОНЕЦ
	               |		ИНАЧЕ """"
	               |	КОНЕЦ + ДоступныеТовары.Номенклатура.Наименование + "" "" + ЕСТЬNULL(ДоступныеТовары.Характеристика.Наименование, """") КАК НаименованиеТовара,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ДоступныеТовары.Номенклатура) = ТИП(справочник.номенклатура)
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК ЭтоНовыйТовар
	               |ИЗ
	               |	ДоступныеТовары КАК ДоступныеТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСРезервамиТСД КАК ТоварыСРезервамиТСД
	               |		ПО ДоступныеТовары.Характеристика = ТоварыСРезервамиТСД.Характеристика
	               |			И ДоступныеТовары.Номенклатура = ТоварыСРезервамиТСД.Номенклатура
	               |			И ДоступныеТовары.Упаковка = ТоварыСРезервамиТСД.Упаковка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСОстатками1С КАК ТоварыСОстатками1С
	               |		ПО ДоступныеТовары.Номенклатура = ТоварыСОстатками1С.Номенклатура
	               |			И ДоступныеТовары.Характеристика = ТоварыСОстатками1С.Характеристика
	               |			И ДоступныеТовары.Упаковка = ТоварыСОстатками1С.Упаковка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСЦенами КАК ТоварыСЦенами
	               |		ПО ДоступныеТовары.Номенклатура = ТоварыСЦенами.Номенклатура
	               |			И ДоступныеТовары.Характеристика = ТоварыСЦенами.Характеристика
	               |			И ДоступныеТовары.Упаковка = ТоварыСЦенами.Упаковка
				   //|		ЛЕВОЕ СОЕДИНЕНИЕ СписокЯчеек КАК СписокЯчеек
				   //|		ПО ДоступныеТовары.Номенклатура = СписокЯчеек.Номенклатура
				   |";
				   
	СкорректироватьЗапросПоЦенообразованию25(Запрос.Текст, "OnArtScan_Select_Insert_Casual");
	
	Запрос.Текст=СтрЗаменить(Запрос.Текст,".ПриобретениеТоваровУслуг.","."+ВидДокумента+".");
	
	Если ВидДокумента = "ОприходованиеИзлишковТоваров" или ВидДокумента = "СписаниеНедостачТоваров" ИЛИ (ВидДокумента = "РасходныйОрдерНаТовары" И ИмяТабличнойЧастиПодбор = "ТоварыПоРаспоряжениям")  Тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ДоступныеТовары.Упаковка = Документ1С.Упаковка", "ИСТИНА");	
	КонецЕсли;
	
	Если ВидДокумента = "ПеремаркировкаТоваровИСМП" Тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ДоступныеТовары.Упаковка = Документ1С.Упаковка", "ИСТИНА");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"Документ1С.Количество", 0);
	КонецЕсли; 
	
	Если Тип = "Select" Тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".Товары КАК","."+ИмяТабличнойЧастиПодбор+" КАК");
	Иначе 
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".Товары КАК","."+ИмяТабличнойЧастиПриемка+" КАК");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор","Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПриемка");	
	КонецЕсли;


КонецПроцедуры

Процедура OnArtScan_Select_EGAIS(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок, Запрос, Тип)
	
	Если ДатаМобайл_ОбщийМодуль.ЕстьАСТ() Тогда
		
		Запрос=Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика,
		|	ШтрихкодыНоменклатуры.Упаковка,
		|	ШтрихкодыНоменклатуры.Штрихкод,
		|	ШтрихкодыНоменклатуры.Упаковка.ЕдиницаИзмерения.Наименование КАК Наименование,
		|	ВЫБОР
		|		КОГДА ШтрихкодыНоменклатуры.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ШтрихкодыНоменклатуры.Упаковка.Числитель
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ШтрихкодыНоменклатуры.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ШтрихкодыНоменклатуры.Упаковка.Знаменатель
		|	КОНЕЦ КАК Коэффициент
		|ПОМЕСТИТЬ ДоступныеТовары
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДатаМобайл_НовыеШтрихкоды.Номенклатура,
		|	ДатаМобайл_НовыеШтрихкоды.Характеристика,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
		|	ДатаМобайл_НовыеШтрихкоды.ШтрихКод,
		|	ДатаМобайл_НовыеШтрихкоды.Наименование,
		|	ДатаМобайл_НовыеШтрихкоды.Коэффициент
		|ИЗ
		|	РегистрСведений.ДатаМобайл_НовыеШтрихкоды КАК ДатаМобайл_НовыеШтрихкоды
		|ГДЕ
		|	ДатаМобайл_НовыеШтрихкоды.ШтрихКод = &Штрихкод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ДокументыСРезервамиТСД
		|ИЗ
		|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
		|ГДЕ	
		|	(ДатаМобайл_ДокументыТСД.Ссылка <> &ИсходноеЗадание)
		|		И (ДатаМобайл_ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1))
		|			И (ДатаМобайл_ДокументыТСД.Шаблон.РезервироватьТовар)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество,0)) КАК Количество
		|ПОМЕСТИТЬ ДанныеДокументыСРезервамиТСД
		|ИЗ
		|	ДокументыСРезервамиТСД КАК ДокументыСРезервамиТСД
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
		|		ПО ДокументыСРезервамиТСД.Ссылка = ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
		|;	
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка,
		|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество*ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель, 0)) КАК ВРезервеТСД
		|ПОМЕСТИТЬ ТоварыСРезервамиТСД
		|ИЗ
		|	ДоступныеТовары КАК ДоступныеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументыСРезервамиТСД КАК ДатаМобайл_ДокументыТСДСобранныеДанные
		|		ПО ДоступныеТовары.Характеристика = ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры
		|			И ДоступныеТовары.Упаковка = ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
		|				И ДоступныеТовары.Номенклатура = ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоступныеТовары.Упаковка,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
		|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.КОтгрузкеОстаток, 0)) КАК ВРезерве,
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка
		|ПОМЕСТИТЬ ТоварыСОстатками1С
		|ИЗ
		|	ДоступныеТовары КАК ДоступныеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				,
		|				(&ВсеСклады
		|					ИЛИ Склад В (&Склады))
		|				И (&ВсеПомещения
		|					ИЛИ Помещение В (&Помещения))) КАК СвободныеОстаткиОстатки
		|		ПО ДоступныеТовары.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
		|			И ДоступныеТовары.Характеристика = СвободныеОстаткиОстатки.Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка,
		|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ВЫБОР
		|				КОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель, 0) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель
		|			КОНЕЦ КАК ЧИСЛО(19, 2))) КАК Цена
		|ПОМЕСТИТЬ ТоварыСЦенами
		|ИЗ
		|	ДоступныеТовары КАК ДоступныеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ВидЦены = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ДоступныеТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ДоступныеТовары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
		|			И (ДоступныеТовары.Номенклатура.ИспользоватьУпаковки
		|				ИЛИ ДоступныеТовары.Упаковка = ЦеныНоменклатурыСрезПоследних.Упаковка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка,
		|	0 КАК ВЗадании,
		|	ТоварыСОстатками1С.ВНаличии,
		|	ТоварыСОстатками1С.ВРезерве,
		|	ТоварыСРезервамиТСД.ВРезервеТСД,
		|	ЕСТЬNULL(ТоварыСЦенами.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ДоступныеТовары.Наименование, ДоступныеТовары.Номенклатура.ЕдиницаИзмерения.Наименование) КАК НаименованиеУпаковки,
		|	ЕСТЬNULL(ДоступныеТовары.Коэффициент, 1) КАК Коэффициент,
		|	ВЫБОР
		|		КОГДА &ВключатьАртикул
		|				И ТИПЗНАЧЕНИЯ(ДоступныеТовары.Номенклатура) = ТИП(Справочник.Номенклатура)
		|			ТОГДА ДоступныеТовары.Номенклатура.Артикул + ""-""
		|		ИНАЧЕ """"
		|	КОНЕЦ + ДоступныеТовары.Номенклатура.Наименование + "" "" + ЕСТЬNULL(ДоступныеТовары.Характеристика.Наименование, """") КАК НаименованиеТовара,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ДоступныеТовары.Номенклатура) = ТИП(справочник.номенклатура)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЭтоНовыйТовар
		|ИЗ
		|	ДоступныеТовары КАК ДоступныеТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСРезервамиТСД КАК ТоварыСРезервамиТСД
		|		ПО ДоступныеТовары.Характеристика = ТоварыСРезервамиТСД.Характеристика
		|			И ДоступныеТовары.Номенклатура = ТоварыСРезервамиТСД.Номенклатура
		|			И ДоступныеТовары.Упаковка = ТоварыСРезервамиТСД.Упаковка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСОстатками1С КАК ТоварыСОстатками1С
		|		ПО ДоступныеТовары.Номенклатура = ТоварыСОстатками1С.Номенклатура
		|			И ДоступныеТовары.Характеристика = ТоварыСОстатками1С.Характеристика
		|			И ДоступныеТовары.Упаковка = ТоварыСОстатками1С.Упаковка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСЦенами КАК ТоварыСЦенами
		|		ПО ДоступныеТовары.Номенклатура = ТоварыСЦенами.Номенклатура
		|			И ДоступныеТовары.Характеристика = ТоварыСЦенами.Характеристика
		|			И ДоступныеТовары.Упаковка = ТоварыСЦенами.Упаковка");
		
	ИначеЕсли ДатаМобайл_ОбщийМодуль.ЕстьКТ2000() Тогда
		
		Запрос=Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика,
		|	ШтрихкодыНоменклатуры.Упаковка,
		|	ШтрихкодыНоменклатуры.Штрихкод,
		|	ШтрихкодыНоменклатуры.Упаковка.ЕдиницаИзмерения.Наименование КАК Наименование,
		|	ВЫБОР
		|		КОГДА ШтрихкодыНоменклатуры.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ШтрихкодыНоменклатуры.Упаковка.Числитель
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ШтрихкодыНоменклатуры.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ШтрихкодыНоменклатуры.Упаковка.Знаменатель
		|	КОНЕЦ КАК Коэффициент
		|ПОМЕСТИТЬ ДоступныеТовары
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДатаМобайл_НовыеШтрихкоды.Номенклатура,
		|	ДатаМобайл_НовыеШтрихкоды.Характеристика,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
		|	ДатаМобайл_НовыеШтрихкоды.ШтрихКод,
		|	ДатаМобайл_НовыеШтрихкоды.Наименование,
		|	ДатаМобайл_НовыеШтрихкоды.Коэффициент
		|ИЗ
		|	РегистрСведений.ДатаМобайл_НовыеШтрихкоды КАК ДатаМобайл_НовыеШтрихкоды
		|ГДЕ
		|	ДатаМобайл_НовыеШтрихкоды.ШтрихКод = &Штрихкод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ДокументыСРезервамиТСД
		|ИЗ
		|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
		|ГДЕ	
		|	(ДатаМобайл_ДокументыТСД.Ссылка <> &ИсходноеЗадание)
		|		И (ДатаМобайл_ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1))
		|			И (ДатаМобайл_ДокументыТСД.Шаблон.РезервироватьТовар)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество,0)) КАК Количество
		|ПОМЕСТИТЬ ДанныеДокументыСРезервамиТСД
		|ИЗ
		|	ДокументыСРезервамиТСД КАК ДокументыСРезервамиТСД
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
		|		ПО ДокументыСРезервамиТСД.Ссылка = ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
		|;	
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка,
		|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество*ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель, 0)) КАК ВРезервеТСД
		|ПОМЕСТИТЬ ТоварыСРезервамиТСД
		|ИЗ
		|	ДоступныеТовары КАК ДоступныеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументыСРезервамиТСД КАК ДатаМобайл_ДокументыТСДСобранныеДанные
		|		ПО ДоступныеТовары.Характеристика = ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры
		|			И ДоступныеТовары.Упаковка = ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
		|				И ДоступныеТовары.Номенклатура = ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоступныеТовары.Упаковка,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
		|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.КОтгрузкеОстаток, 0)) КАК ВРезерве,
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка
		|ПОМЕСТИТЬ ТоварыСОстатками1С
		|ИЗ
		|	ДоступныеТовары КАК ДоступныеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				,
		|				(&ВсеСклады
		|					ИЛИ Склад В (&Склады))
		|				И (&ВсеПомещения
		|					ИЛИ Помещение В (&Помещения))) КАК СвободныеОстаткиОстатки
		|		ПО ДоступныеТовары.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
		|			И ДоступныеТовары.Характеристика = СвободныеОстаткиОстатки.Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка,
		|	СУММА(ЕСТЬNULL(ТоварыДокумента.Количество, 0)) КАК ВЗадании
		|ПОМЕСТИТЬ ТоварыСЗаданием
		|ИЗ
		|	ДоступныеТовары КАК ДоступныеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Товары.Номенклатура КАК НоменклатураСоответствие,
		|			Документ1С.Количество КАК Количество
		|		ИЗ
		|			Документ.алкТоварноТранспортнаяНакладнаяЕГАИС.Товары КАК Документ1С
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|					МАКСИМУМ(СоответствиеНоменклатурыЕГАИС.Номенклатура) КАК Номенклатура
		|				ИЗ
		|					РегистрСведений.алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры КАК СоответствиеНоменклатурыЕГАИС
		|				СГРУППИРОВАТЬ ПО
		|					СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция) КАК Товары
		|				ПО (Товары.АлкогольнаяПродукция = Документ1С.АлкогольнаяПродукция)
		|		ГДЕ
		|			Документ1С.Ссылка = &ИсходныйДокумент) КАК ТоварыДокумента
		|		ПО (ТоварыДокумента.НоменклатураСоответствие = ДоступныеТовары.Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыДокумента.НоменклатураСоответствие,
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка,
		|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ВЫБОР
		|				КОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель, 0) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель
		|			КОНЕЦ КАК ЧИСЛО(19, 2))) КАК Цена
		|ПОМЕСТИТЬ ТоварыСЦенами
		|ИЗ
		|	ДоступныеТовары КАК ДоступныеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ВидЦены = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ДоступныеТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ДоступныеТовары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
		|			И (ДоступныеТовары.Номенклатура.ИспользоватьУпаковки
		|				ИЛИ ДоступныеТовары.Упаковка = ЦеныНоменклатурыСрезПоследних.Упаковка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка,
		|	ТоварыСЗаданием.ВЗадании,
		|	ТоварыСОстатками1С.ВНаличии,
		|	ТоварыСОстатками1С.ВРезерве,
		|	ТоварыСРезервамиТСД.ВРезервеТСД,
		|	ЕСТЬNULL(ТоварыСЦенами.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ДоступныеТовары.Наименование, ДоступныеТовары.Номенклатура.ЕдиницаИзмерения.Наименование) КАК НаименованиеУпаковки,
		|	ЕСТЬNULL(ДоступныеТовары.Коэффициент, 1) КАК Коэффициент,
		|	ВЫБОР
		|		КОГДА &ВключатьАртикул
		|				И ТИПЗНАЧЕНИЯ(ДоступныеТовары.Номенклатура) = ТИП(Справочник.Номенклатура)
		|			ТОГДА ДоступныеТовары.Номенклатура.Артикул + ""-""
		|		ИНАЧЕ """"
		|	КОНЕЦ + ДоступныеТовары.Номенклатура.Наименование + "" "" + ЕСТЬNULL(ДоступныеТовары.Характеристика.Наименование, """") КАК НаименованиеТовара,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ДоступныеТовары.Номенклатура) = ТИП(справочник.номенклатура)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЭтоНовыйТовар
		|ИЗ
		|	ДоступныеТовары КАК ДоступныеТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСРезервамиТСД КАК ТоварыСРезервамиТСД
		|		ПО ДоступныеТовары.Характеристика = ТоварыСРезервамиТСД.Характеристика
		|			И ДоступныеТовары.Номенклатура = ТоварыСРезервамиТСД.Номенклатура
		|			И ДоступныеТовары.Упаковка = ТоварыСРезервамиТСД.Упаковка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСОстатками1С КАК ТоварыСОстатками1С
		|		ПО ДоступныеТовары.Номенклатура = ТоварыСОстатками1С.Номенклатура
		|			И ДоступныеТовары.Характеристика = ТоварыСОстатками1С.Характеристика
		|			И ДоступныеТовары.Упаковка = ТоварыСОстатками1С.Упаковка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСЗаданием КАК ТоварыСЗаданием
		|		ПО ДоступныеТовары.Номенклатура = ТоварыСЗаданием.Номенклатура
		|			И ДоступныеТовары.Характеристика = ТоварыСЗаданием.Характеристика
		|			И ДоступныеТовары.Упаковка = ТоварыСЗаданием.Упаковка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСЦенами КАК ТоварыСЦенами
		|		ПО ДоступныеТовары.Номенклатура = ТоварыСЦенами.Номенклатура
		|			И ДоступныеТовары.Характеристика = ТоварыСЦенами.Характеристика
		|			И ДоступныеТовары.Упаковка = ТоварыСЦенами.Упаковка");
		
	Иначе		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика,
		|	ШтрихкодыНоменклатуры.Упаковка,
		|	ШтрихкодыНоменклатуры.Штрихкод,
		|	ШтрихкодыНоменклатуры.Упаковка.ЕдиницаИзмерения.Наименование КАК Наименование,
		|	ВЫБОР
		|		КОГДА ШтрихкодыНоменклатуры.Упаковка.Числитель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ШтрихкодыНоменклатуры.Упаковка.Числитель
		|	КОНЕЦ / ВЫБОР
		|		КОГДА ШтрихкодыНоменклатуры.Упаковка.Знаменатель = 0
		|			ТОГДА 1
		|		ИНАЧЕ ШтрихкодыНоменклатуры.Упаковка.Знаменатель
		|	КОНЕЦ КАК Коэффициент
		|ПОМЕСТИТЬ ДоступныеТовары
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДатаМобайл_НовыеШтрихкоды.Номенклатура,
		|	ДатаМобайл_НовыеШтрихкоды.Характеристика,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
		|	ДатаМобайл_НовыеШтрихкоды.ШтрихКод,
		|	ДатаМобайл_НовыеШтрихкоды.Наименование,
		|	ДатаМобайл_НовыеШтрихкоды.Коэффициент
		|ИЗ
		|	РегистрСведений.ДатаМобайл_НовыеШтрихкоды КАК ДатаМобайл_НовыеШтрихкоды
		|ГДЕ
		|	ДатаМобайл_НовыеШтрихкоды.ШтрихКод = &Штрихкод
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ДокументыСРезервамиТСД
		|ИЗ
		|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
		|ГДЕ	
		|	(ДатаМобайл_ДокументыТСД.Ссылка <> &ИсходноеЗадание)
		|		И (ДатаМобайл_ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1))
		|			И (ДатаМобайл_ДокументыТСД.Шаблон.РезервироватьТовар)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество,0)) КАК Количество
		|ПОМЕСТИТЬ ДанныеДокументыСРезервамиТСД
		|ИЗ
		|	ДокументыСРезервамиТСД КАК ДокументыСРезервамиТСД
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
		|		ПО ДокументыСРезервамиТСД.Ссылка = ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
		|;		
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка,
		|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество*ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель, 0)) КАК ВРезервеТСД
		|ПОМЕСТИТЬ ТоварыСРезервамиТСД
		|ИЗ
		|	ДоступныеТовары КАК ДоступныеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументыСРезервамиТСД КАК ДатаМобайл_ДокументыТСДСобранныеДанные
		|		ПО ДоступныеТовары.Характеристика = ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры
		|			И ДоступныеТовары.Упаковка = ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
		|				И ДоступныеТовары.Номенклатура = ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура
		|СГРУППИРОВАТЬ ПО
		|	ДоступныеТовары.Упаковка,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
		|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.КОтгрузкеОстаток, 0)) КАК ВРезерве,
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка
		|ПОМЕСТИТЬ ТоварыСОстатками1С
		|ИЗ
		|	ДоступныеТовары КАК ДоступныеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				,
		|				(&ВсеСклады
		|					ИЛИ Склад В (&Склады))
		|				И (&ВсеПомещения
		|					ИЛИ Помещение В (&Помещения))) КАК СвободныеОстаткиОстатки
		|		ПО ДоступныеТовары.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
		|			И ДоступныеТовары.Характеристика = СвободныеОстаткиОстатки.Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка,
		|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ВЫБОР
		|				КОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель, 0) = 0
		|					ТОГДА 1
		|				ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель
		|			КОНЕЦ КАК ЧИСЛО(19, 2))) КАК Цена	
		|ПОМЕСТИТЬ ТоварыСЦенами
		|ИЗ
		|	ДоступныеТовары КАК ДоступныеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ВидЦены = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ДоступныеТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И ДоступныеТовары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоступныеТовары.Номенклатура,
		|	ДоступныеТовары.Характеристика,
		|	ДоступныеТовары.Упаковка,
		|	0 КАК ВЗадании,
		|	ТоварыСОстатками1С.ВНаличии,
		|	ТоварыСОстатками1С.ВРезерве,
		|	ТоварыСРезервамиТСД.ВРезервеТСД,
		|	ЕСТЬNULL(ТоварыСЦенами.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ДоступныеТовары.Наименование, ДоступныеТовары.Номенклатура.ЕдиницаИзмерения.Наименование) КАК НаименованиеУпаковки,
		|	ЕСТЬNULL(ДоступныеТовары.Коэффициент, 1) КАК Коэффициент,
		|	ВЫБОР
		|		КОГДА &ВключатьАртикул
		|				И ТИПЗНАЧЕНИЯ(ДоступныеТовары.Номенклатура) = ТИП(Справочник.Номенклатура)
		|			ТОГДА ВЫБОР КОГДА ДоступныеТовары.Номенклатура.Артикул = """" ТОГДА """" ИНАЧЕ ДоступныеТовары.Номенклатура.Артикул + "" "" КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ + ДоступныеТовары.Номенклатура.Наименование + "" "" + ЕСТЬNULL(ДоступныеТовары.Характеристика.Наименование, """") КАК НаименованиеТовара,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ДоступныеТовары.Номенклатура) = ТИП(справочник.номенклатура)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ЭтоНовыйТовар
		|ИЗ
		|	ДоступныеТовары КАК ДоступныеТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСРезервамиТСД КАК ТоварыСРезервамиТСД
		|		ПО ДоступныеТовары.Характеристика = ТоварыСРезервамиТСД.Характеристика
		|			И ДоступныеТовары.Номенклатура = ТоварыСРезервамиТСД.Номенклатура
		|			И ДоступныеТовары.Упаковка = ТоварыСРезервамиТСД.Упаковка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСОстатками1С КАК ТоварыСОстатками1С
		|		ПО ДоступныеТовары.Номенклатура = ТоварыСОстатками1С.Номенклатура
		|			И ДоступныеТовары.Характеристика = ТоварыСОстатками1С.Характеристика
		|			И ДоступныеТовары.Упаковка = ТоварыСОстатками1С.Упаковка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСЦенами КАК ТоварыСЦенами
		|		ПО ДоступныеТовары.Номенклатура = ТоварыСЦенами.Номенклатура
		|			И ДоступныеТовары.Характеристика = ТоварыСЦенами.Характеристика
		|			И ДоступныеТовары.Упаковка = ТоварыСЦенами.Упаковка";
		
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".ПриобретениеТоваровУслуг.","."+Шаблон.ВидДокумента+".");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".Товары КАК","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК");
		
	КонецЕсли;
	
	СкорректироватьЗапросПоЦенообразованию25(Запрос.Текст, "OnArtScan_Select_EGAIS");
	
КонецПроцедуры

Функция OnArtMarkScan(Params, kiz = Неопределено,ТипОперации)
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;
	
	deviceId 		=  Params.device_id;
	UserName 		=  Params.username;
	KM_Barcode 		=  kiz.mark;
	KM_GTIN 		=  kiz.gtin;
	DocOutID 		=  Params.doc_id;
	Cell 			=  Params.cell_barcode;
	KM_SN 			=  kiz.sn;
	EAN 			=  kiz.ean;
	KM_RawBarcode 	=  kiz.raw_barcode;
	GS1 			=  Params.gs1;
			
	KM_GTIN = УдалитьЛидирующиеНули(KM_GTIN);
			
	УзелПО = НайтиУзел(deviceId);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(deviceId, UserName);
	КонецЕсли;
	
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));	
	Исключение		
		СтруктураОтвета.Вставить("Описание", "Не нашли документ. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;
	
	Модуль_ОбщегоНазначения = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначения");
	
	ЗначенияРеквизитовСсылкаНаДок = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДок, "ТСД, ДатаНачалаСбора, ДатаЗавершенияСбора, Шаблон, ИсходныйДокумент, Склад");
	
	ДокТСД = ЗначенияРеквизитовСсылкаНаДок.ТСД;
	ДокДатаНачалаСбора = ЗначенияРеквизитовСсылкаНаДок.ДатаНачалаСбора;
	ДокДатаЗавершенияСбора = ЗначенияРеквизитовСсылкаНаДок.ДатаЗавершенияСбора;
	Шаблон = ЗначенияРеквизитовСсылкаНаДок.Шаблон;
	ИсходныйДокумент = ЗначенияРеквизитовСсылкаНаДок.ИсходныйДокумент;
	Склад  = ЗначенияРеквизитовСсылкаНаДок.Склад;

	Если Шаблон = Неопределено Тогда	
		СтруктураОтвета.Вставить("Описание", "Не нашли запись документа. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;

	Если ЗначениеЗаполнено(ДокТСД) Тогда
		Если ДокТСД <> УзелПО Тогда		
			СтруктураОтвета.Вставить("Описание", "Чужой документ. ");		
			Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
		КонецЕсли;	
	КонецЕсли;
			
	Если ДокДатаЗавершенияСбора <> Дата(1,1,1) Тогда		
		СтруктураОтвета.Вставить("Описание", "Закрытый документ. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;
	
	ЗначениеШтрихкода = "";
	ТаблицаТоваров = ПолучитьТоварыБезЗадания(УзелПО,СсылкаНаДок,KM_Barcode,GS1,ЗначениеШтрихкода);	
	КодМаркировкиНеНайден = Истина;

	Для каждого СтрокаДока ИЗ ТаблицаТоваров Цикл
		
		Если СтрНайти(СтрокаДока.ЗначениеШтрихкода,ЗначениеШтрихкода)=0 или ЗначениеШтрихкода = "" Тогда
			Продолжить;
		Иначе
			КодМаркировкиНеНайден = Ложь;	
		КонецЕсли;
		
		СтрокаДока.Коэффициент=?(СтрокаДока.Коэффициент=0,1,СтрокаДока.Коэффициент);
		СтрокаДока.НаименованиеУпаковки=?(ЗначениеЗаполнено(СтрокаДока.НаименованиеУпаковки),СтрокаДока.НаименованиеУпаковки,"шт.");

				
		СтруктураТекущейСтроки = Новый Структура;

		ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","scan");
		
		ОбъектТовара.name 	   = ЧистаяСтрока(СокрП(СтрокаДока.НаименованиеТовара));
		ОбъектТовара.id 	   = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(СтрокаДока.Характеристика);
		ОбъектТовара.price 	   = СтрокаДока.Цена;
		Попытка	
			DMUseSN = ПолучитьПризнакУчетаСерий(СтрокаДока.Номенклатура.ВидНоменклатуры, Склад);
		Исключение
			DMUseSN = Ложь;
		Конецпопытки;	
		СформироватьЗаголовкиJSONParamsТовара(УзелПО,ОбъектТовара,СтрокаДока.Номенклатура,СтрокаДока.Характеристика, DMUseSN,Шаблон);
		СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);

		
		ОбъектШтрихкода = ПолучитьСтруктуруОбъектаДляHttp("barcode","scan");
		Попытка ОбъектШтрихкода.unit_name = СтрокаДока.НаименованиеУпаковки; Исключение ОбъектШтрихкода.unit_name = "шт."; КонецПопытки;	
		Если УзелПО.НеИспользоватьПересчетУпаковок Тогда
			ОбъектШтрихкода.unit_coef = 1;
		Иначе	
			ОбъектШтрихкода.unit_coef = СтрокаДока.Коэффициент;
		КонецЕсли;
		СтруктураТекущейСтроки.Вставить("barcode", ОбъектШтрихкода);
		
		ЭтоУслуга = Ложь;
		Попытка 
			Если СтрокаДока.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				ЭтоУслуга = Истина;
	       	КонецЕсли;
		Исключение
		КонецПопытки;

		limit_qty=0;
		Если УзелПО.НеОтображатьОстатки Тогда
			limit_qty=0;
		ИначеЕсли ЭтоУслуга Тогда
			limit_qty=999;	
		Иначе
			Итог = (СтрокаДока.ВНаличии-СтрокаДока.ВРезерве-СтрокаДока.ВРезервеТСД);
			limit_qty = Итог;
		КонецЕсли;
		
		СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
		
		Если СокрЛП(ЧистаяСтрока(ОбъектТовара.name)) = "" ИЛИ СокрЛП(ЧистаяСтрока(ОбъектТовара.id)) = "" Тогда
			Продолжить;
		КонецЕсли;


		ОбъектСписка.Добавить(СтруктураТекущейСтроки);

	КонецЦикла;
	
	Если КодМаркировкиНеНайден Тогда	
		Если Не Шаблон.МаркировкаДополнительныйПоискПоКМ Тогда
			Если Лев(KM_GTIN,2) = "29" Тогда
				Возврат ПодготовитьОтветJSON(ОбъектСписка)
			КонецЕсли;

			
			Если ТипОперации = "Select"	Тогда
				Возврат OnArtScanSelect(deviceId,UserName,KM_GTIN,DocOutID,Cell,Params);
			ИначеЕсли ТипОперации = "Insert" Тогда 
				Возврат OnArtScanInsert(deviceId,UserName,KM_GTIN,DocOutID,Cell,Params);
			Иначе
				Возврат ПодготовитьОтветJSON(ОбъектСписка)
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

		
	//ЗАПИСЬ	
	Если НЕ Шаблон.ГрупповаяРабота Тогда
		//ОБЫЧНАЯ ЛОГИКА
		Если Не ЗначениеЗаполнено(ДокДатаНачалаСбора) Или Не ЗначениеЗаполнено(ДокТСД) Тогда
			
			Попытка
				Объект=СсылкаНаДок.ПолучитьОбъект();
				Объект.ДатаНачалаСбора=ТекущаяДата();
				Объект.ТСД=УзелПО;
				
				Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
				Объект.ОбменДанными.Получатели.Очистить();
				Объект.ОбменДанными.Получатели.Заполнить();
				Объект.ОбменДанными.Получатели.Удалить(УзелПО);
				Объект.Записать();
				
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	Иначе
		//ГРУППОВОЙ ДОКУМЕНТ
		
		ДатаСбораПоТСД = ДатаМобайл_ОбщийМодуль.ПолучитьДатуГрупповогоДокумента(deviceId, СсылкаНаДок, "ДатаНачалаСбора");	
		Если Не ЗначениеЗаполнено(ДатаСбораПоТСД) Тогда	
			ДатаМобайл_ОбщийМодуль.СоздатьНачальнуюЗаписьТСДГрупповыхДокументов(deviceId, СсылкаНаДок, UserName);		
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДокДатаНачалаСбора) Тогда
			Попытка
				Объект=СсылкаНаДок.ПолучитьОбъект();
				Объект.ДатаНачалаСбора=ТекущаяДата();
				
				Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
				Объект.ОбменДанными.Получатели.Очистить();
				Объект.ОбменДанными.Получатели.Заполнить();
				Объект.ОбменДанными.Получатели.Удалить(УзелПО);
				Объект.Записать();
			Исключение
			КонецПопытки;	
		КонецЕсли;
	КонецЕсли;	
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);
	
КонецФункции

#КонецОбласти

#Область OnArtEgaisScan

Процедура OnArtEgaisScan_ЗаполнитьОбъектТовара(ВыборкаЕГАИС, ОбъектТовараЕГАИС)
		
	ОбъектТовараЕГАИС.id = "8e-" + XMLСтрока(ВыборкаЕГАИС.Ссылка);
	ЗаполнитьЗначенияСвойств(ОбъектТовараЕГАИС, ВыборкаЕгаис);
	ОбъектТовараЕГАИС.alcocode = ВыборкаЕГАИС.Ссылка.Код;
	ОбъектТовараЕГАИС.name = ЧистаяСтрока(Лев(ВыборкаЕГАИС.name,100));
	ОбъектТовараЕГАИС.manufacturer = ЧистаяСтрока(Лев(ВыборкаЕГАИС.manufacturer,100)); 
	
	ОбъектТовараЕГАИС.is_compared = ТоварСопоставленОдинКОдному(ВыборкаЕГАИС.Ссылка); 
	ОбъектТовараЕГАИС.box_coef = 0; //количество единиц в коробе	
	
КонецПроцедуры

Функция OnArtEgaisScan_ПолучитьЗапросВходящаяТТН(лИсходныйДокумент, PDFBarcode)
	
	ДанныеПроверяемогоДокумента = Документы.ТТНВходящаяЕГАИС.ВходящееДеревоУпаковок(лИсходныйДокумент);
	
	РезультатПоиска = НайтиНоменклатуруЕГАИСпоВходящемуДеревуУпаковок(ДанныеПроверяемогоДокумента.ДеревоУпаковок.Строки, PDFBarcode);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КлассификаторАлкогольнойПродукцииЕГАИС.Ссылка,
	                      |	ЕСТЬNULL(КлассификаторАлкогольнойПродукцииЕГАИС.Наименование, """") КАК ArtName,
	                      |	ЕСТЬNULL(КлассификаторАлкогольнойПродукцииЕГАИС.Производитель.Наименование, """") КАК Manufacturer,
	                      |	ЕСТЬNULL(КлассификаторАлкогольнойПродукцииЕГАИС.Импортер.Наименование, """") КАК Importer,
	                      |	ЕСТЬNULL(КлассификаторАлкогольнойПродукцииЕГАИС.Объем, 0) КАК Capacity,
	                      |	ЕСТЬNULL(КлассификаторАлкогольнойПродукцииЕГАИС.Крепость, 0) КАК PercentAlco,
	                      |	ВЫБОР
	                      |		КОГДА НЕ КлассификаторАлкогольнойПродукцииЕГАИС.ВидПродукции.Код ЕСТЬ NULL
	                      |			ТОГДА КлассификаторАлкогольнойПродукцииЕГАИС.ВидПродукции.Код + "" "" + КлассификаторАлкогольнойПродукцииЕГАИС.ВидПродукции.Наименование
	                      |		ИНАЧЕ ЕСТЬNULL(КлассификаторАлкогольнойПродукцииЕГАИС.ВидПродукции.Код + "" "", """") + ЕСТЬNULL(КлассификаторАлкогольнойПродукцииЕГАИС.ВидПродукции.Наименование + "" "", """")
	                      |	КОНЕЦ КАК TypeAlco
	                      |ИЗ
	                      |		Справочник.КлассификаторАлкогольнойПродукцииЕГАИС КАК КлассификаторАлкогольнойПродукцииЕГАИС
	                      |ГДЕ
	                      |	КлассификаторАлкогольнойПродукцииЕГАИС.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", РезультатПоиска);
	
	Возврат Запрос;

КонецФункции // ()

Функция НайтиНоменклатуруЕГАИСпоВходящемуДеревуУпаковок(КоллекцияСтрок, ДанныеДляПоиска)

	Для Каждого Строка из КоллекцияСтрок Цикл
		
		Если Строка.Строки.Количество() <> 0 Тогда
			Результат = НайтиНоменклатуруЕГАИСпоВходящемуДеревуУпаковок(Строка.Строки, ДанныеДляПоиска);
			Если Результат <> Неопределено Тогда
				Возврат Результат;
			КонецЕсли;
		Иначе
			Если Строка.ЗначениеШтрихкода = ДанныеДляПоиска Тогда
				Возврат Строка.АлкогольнаяПродукция;
			КонецЕсли;
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции // ()
	
#КонецОбласти

#Область GetDocRowsSelect

Процедура GetDocRowsSelectCells(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок)
	
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                    |	ЗапросСЛимитами.Номенклатура,
		                    |	ЗапросСЛимитами.Характеристика,
							|	ЗапросСЛимитами.Серия,
		                    |	СУММА(ЗапросСЛимитами.Количество) КАК Количество,
							|	ЗапросСЛимитами.Ячейка КАК Ячейка,
		                    |	МИНИМУМ(ЗапросСЛимитами.НомерСтроки) КАК НомерСтроки
		                    |ИЗ
		                    |	(ВЫБРАТЬ
		                    |		ТаблицаТоваровВДокументе.Номенклатура КАК Номенклатура,
		                    |		ТаблицаТоваровВДокументе.Характеристика КАК Характеристика,
							|		&УсловиеСерия КАК Серия,
		                    |		СУММА(ТаблицаТоваровВДокументе.Количество) КАК Количество,
		                    |		ТаблицаТоваровВДокументе.Ячейка КАК Ячейка,
		                    |		МИНИМУМ(ТаблицаТоваровВДокументе.НомерСтроки) КАК НомерСтроки
		                    |	ИЗ
		                    |		Документ.ОтборРазмещениеТоваров.ТоварыОтбор КАК ТаблицаТоваровВДокументе
		                    |	ГДЕ
		                    |		ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент
		                    |	
		                    |	СГРУППИРОВАТЬ ПО
		                    |		ТаблицаТоваровВДокументе.Номенклатура,
		                    |		ТаблицаТоваровВДокументе.Характеристика,
							|		&УсловиеСерия,
		                    |		ТаблицаТоваровВДокументе.Ячейка) КАК ЗапросСЛимитами
		                    |
		                    |СГРУППИРОВАТЬ ПО
		                    |	ЗапросСЛимитами.Номенклатура,
		                    |	ЗапросСЛимитами.Характеристика,
							|	ЗапросСЛимитами.Серия,
		                    |	ЗапросСЛимитами.Ячейка
		                    |
		                    |УПОРЯДОЧИТЬ ПО
		                    |	НомерСтроки");
	
		Запрос.УстановитьПараметр("Ссылка",СсылкаНаДок);
		Запрос.УстановитьПараметр("ИсходныйДокумент",СсылкаНаДок.ИсходныйДокумент);
		Запрос.УстановитьПараметр("Документы",СсылкаНаДок.Задания.ВыгрузитьКолонку("Задание"));
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".ОтборРазмещениеТоваров.","."+Шаблон.ВидДокумента+".");  
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".ТоварыОтбор КАК ","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК ");
		
		Если Шаблон.МножествоДокументовКакЗадание Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент", "ТаблицаТоваровВДокументе.Ссылка В(&Документы)");
		КонецЕсли;		


		Попытка
			ЕстьКоличествоУпаковок = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("КоличествоУпаковок")<>Неопределено;
		Исключение
			ЕстьКоличествоУпаковок = Ложь;
		КонецПопытки;
		
		Если УзелПО.НеИспользоватьПересчетУпаковок и ЕстьКоличествоУпаковок Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Количество","ТаблицаТоваровВДокументе.КоличествоУпаковок");
	    КонецЕсли;				
		
		Попытка
			ЕстьСерии = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Серия")<>Неопределено;
		Исключение
			ЕстьСерии = Ложь;
		КонецПопытки;
		
		Если ЕстьСерии Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеСерия","ТаблицаТоваровВДокументе.Серия");
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеСерия","Значение(Справочник.СерииНоменклатуры.ПустаяСсылка)");
		КонецЕсли;
		
		Если Шаблон.ВидДокумента = "ПересчетТоваров" и УзелПО.НеОтображатьОстатки Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.КоличествоУпаковок","0");
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Количество","0");
	    КонецЕсли;	

		Рез=Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаДока из Рез цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаДока.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;

			
			СтруктураТекущейСтроки = Новый Структура;
			
			ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","id");
			ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(СтрокаДока.Характеристика);
			Попытка ОбъектТовара.parent_id = ?(XMLСтрока(СтрокаДока.Характеристика) = "00000000-0000-0000-0000-000000000000", "", "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + "00000000-0000-0000-0000-000000000000"); Исключение КонецПопытки;
			СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
			
			Если ЗначениеЗаполнено(СтрокаДока.Ячейка) тогда
				ОбъектЯчейки = ПолучитьСтруктуруОбъектаДляHttp("cell","barcode");
            	Модуль_ШтрихкодированиеПечатныхФорм = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ШтрихкодированиеПечатныхФорм");
				ОбъектЯчейки.barcode = ?(УзелПО.ВыгружатьВКодЯчейки=1,СтрокаДока.Ячейка.Код, Строка(Модуль_ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(СтрокаДока.Ячейка)));
				СтруктураТекущейСтроки.Вставить("cell", ОбъектЯчейки);
			КонецЕсли;
			
			Попытка
				Если ЗначениеЗаполнено(СтрокаДока.Серия) Тогда
					sn = ПолучитьЗначениеСерии(Шаблон, СтрокаДока.Номенклатура, СтрокаДока.Серия);
					СтруктураТекущейСтроки.Вставить("sn", sn);
				КонецЕсли;
			Исключение
			КонецПопытки;
			

			Попытка
				ДопускВесовогоТовара =  ПолучитьДопускВесовогоТовара(СтрокаДока.Номенклатура, СсылкаНаДок.Клиент);
			Исключение
				ДопускВесовогоТовара = Неопределено;
			КонецПопытки;
			
			Если ДопускВесовогоТовара<>Неопределено тогда
				СтруктураТекущейСтроки.Вставить("weight_task", ДопускВесовогоТовара);
			КонецЕсли;

			ЭтоУслуга = Ложь;
			Попытка 
				Если СтрокаДока.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
					ЭтоУслуга = Истина;
			   	КонецЕсли;
			Исключение
			КонецПопытки;
			
			limit_qty = 0;
			Если УзелПО.НеОтображатьОстатки Тогда
				limit_qty=0;
			ИначеЕсли ЭтоУслуга Тогда
				limit_qty=999;	
			Иначе	
				Попытка 
					ТекущийСклад = СсылкаНаДок.Склад;
				Исключение
					ТекущийСклад = Справочники.Склады.ПустаяСсылка();
				КонецПопытки;

				limit_qty = ПолучитьОстаткиПоЯчейке(УзелПО,ТекущийСклад,СтрокаДока.Номенклатура,СтрокаДока.Характеристика,СтрокаДока.Ячейка);
			КонецЕсли;
				
			qty = СтрокаДока.Количество;
			
			СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
			СтруктураТекущейСтроки.Вставить("qty", qty);
			
			ОбъектСписка.Добавить(СтруктураТекущейСтроки);
			
		КонецЦикла;
		
КонецПроцедуры

Процедура GetDocRowsSelectSN(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок)
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	ЗапросСЛимитами.Номенклатура,
	                    |	ЗапросСЛимитами.Характеристика,
	                    |	ЗапросСЛимитами.Серия,
						|	ЗапросСЛимитами.Цена,
	                    |	СУММА(ЗапросСЛимитами.Количество) КАК Количество,
	                    |	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(РезервыТСД.Количество, 0)) КАК Лимит,
	                    |	МИНИМУМ(ЗапросСЛимитами.НомерСтроки) КАК НомерСтроки
	                    |ИЗ
	                    |	(ВЫБРАТЬ
	                    |		ТаблицаТоваровВДокументе.Номенклатура КАК Номенклатура,
	                    |		ТаблицаТоваровВДокументе.Характеристика КАК Характеристика,
	                    |		ЕСТЬNULL(ТаблицаСерийВДокументе.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
						|		&УсловиеЦена КАК Цена,
	                    |		СУММА(ЕСТЬNULL(ТаблицаСерийВДокументе.Количество, ТаблицаТоваровВДокументе.Количество)) КАК Количество,
	                    |		МИНИМУМ(ТаблицаТоваровВДокументе.НомерСтроки) КАК НомерСтроки
	                    |	ИЗ
	                    |		Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТоваровВДокументе
	                    |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Серии КАК ТаблицаСерийВДокументе
	                    |			ПО ТаблицаТоваровВДокументе.Номенклатура = ТаблицаСерийВДокументе.Номенклатура
						|				И ТаблицаТоваровВДокументе.Характеристика = ТаблицаСерийВДокументе.Характеристика
	                    |					И ТаблицаТоваровВДокументе.Ссылка = ТаблицаСерийВДокументе.Ссылка
	                    |	ГДЕ
	                    |		ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент
	                    |	
	                    |	СГРУППИРОВАТЬ ПО
	                    |		ТаблицаТоваровВДокументе.Номенклатура,
						|		ТаблицаТоваровВДокументе.Характеристика,
	                    |		ЕСТЬNULL(ТаблицаСерийВДокументе.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)),
						|		&УсловиеЦена) КАК ЗапросСЛимитами
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	                    |				,
	                    |				(&ВсеСклады
	                    |					ИЛИ Склад В (&Склады))
						|				И (&ВсеПомещения
	               		|					ИЛИ Помещение В (&Помещения))) КАК СвободныеОстаткиОстатки
	                    |		ПО ЗапросСЛимитами.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
	                    |			И ЗапросСЛимитами.Характеристика = СвободныеОстаткиОстатки.Характеристика
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.СерияСсылка КАК СерияСсылка,
	                    |			СУММА(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество) КАК Количество
	                    |		ИЗ
	                    |			Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	                    |		ГДЕ
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка <> &Ссылка
	                    |			И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.Шаблон.РезервироватьТовар
						|			И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	                    |		
	                    |		СГРУППИРОВАТЬ ПО
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры,
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.СерияСсылка) КАК РезервыТСД
	                    |		ПО ЗапросСЛимитами.Номенклатура = РезервыТСД.Номенклатура
	                    |			И ЗапросСЛимитами.Характеристика = РезервыТСД.ХарактеристикаНоменклатуры
	                    |			И ЗапросСЛимитами.Серия = РезервыТСД.СерияСсылка
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ЗапросСЛимитами.Номенклатура,
	                    |	ЗапросСЛимитами.Характеристика,
	                    |	ЗапросСЛимитами.Серия,
						|	ЗапросСЛимитами.Цена
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	НомерСтроки");
		

		Запрос.УстановитьПараметр("Ссылка",СсылкаНаДок);
		Запрос.УстановитьПараметр("ИсходныйДокумент",СсылкаНаДок.ИсходныйДокумент);
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".РеализацияТоваровУслуг.","."+Шаблон.ВидДокумента+".");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".Товары КАК ","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК ");
		
		//Если у документа есть склад берем остатки по складу документа иначе склады из настроек ТСД
		СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
		Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
			СписокСкладов.Очистить();
			СписокСкладов.Добавить(СсылкаНаДок.Склад);			
		КонецЕсли;
		Запрос.УстановитьПараметр("Склады",СписокСкладов);
		Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
		
		СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
		Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
			СписокПомещений.Очистить();
			СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
		КонецЕсли;
		Запрос.УстановитьПараметр("Помещения",СписокПомещений);
		Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);

	
		Попытка
			ЕстьЦены = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Цена")<>Неопределено;
		Исключение
			ЕстьЦены = Ложь;
		КонецПопытки;

		
		Если ЕстьЦены Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеЦена","ТаблицаТоваровВДокументе.Цена");
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеЦена","0");
		КонецЕсли;
		
		Если Шаблон.ВидДокумента = "ЗаказПоставщику" Тогда
			Попытка
				ЕстьОтменено = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Отменено")<>Неопределено;
			Исключение
				ЕстьОтменено = Ложь;
			КонецПопытки;
			
			Если ЕстьОтменено Тогда
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент","ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент И НЕ ТаблицаТоваровВДокументе.Отменено");
			КонецЕсли;	
		ИначеЕсли Шаблон.ВидДокумента = "ЗаказКлиента" Тогда
			Попытка
				ЕстьОтменено = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Отменено")<>Неопределено и Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("ВариантОбеспечения")<>Неопределено;
			Исключение
				ЕстьОтменено = Ложь;
			КонецПопытки;
			
			Если ЕстьОтменено Тогда
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент","ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент И НЕ ТаблицаТоваровВДокументе.Отменено"); //И ТаблицаТоваровВДокументе.ВариантОбеспечения<>ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)");
			КонецЕсли;		
		КонецЕсли;
		
		Попытка
			ЕстьКоличествоУпаковок = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("КоличествоУпаковок")<>Неопределено;
		Исключение
			ЕстьКоличествоУпаковок = Ложь;
		КонецПопытки;
		
		Если УзелПО.НеИспользоватьПересчетУпаковок и ЕстьКоличествоУпаковок Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Количество","ТаблицаТоваровВДокументе.КоличествоУпаковок");
		КонецЕсли;		
		
		
		Если Шаблон.НеВыгружатьУслуги Тогда
			
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент","ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент 
			|   	И  ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)");			
		КонецЕсли;
		
	Рез=Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаДока из Рез цикл
				
		Если НЕ ЗначениеЗаполнено(СтрокаДока.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураТекущейСтроки = Новый Структура;
		
		ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","id");
		ОбъектТовара.id = "8U-"+XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(СтрокаДока.Характеристика);
		Попытка ОбъектТовара.parent_id = ?(XMLСтрока(СтрокаДока.Характеристика) = "00000000-0000-0000-0000-000000000000", "", "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + "00000000-0000-0000-0000-000000000000"); Исключение КонецПопытки;
		СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
				
		Попытка
			Если ЗначениеЗаполнено(СтрокаДока.Серия) Тогда
				sn = ПолучитьЗначениеСерии(Шаблон, СтрокаДока.Номенклатура, СтрокаДока.Серия);
				СтруктураТекущейСтроки.Вставить("sn", sn);
			КонецЕсли;
		Исключение
		КонецПопытки;
				
		Попытка
			ДопускВесовогоТовара =  ПолучитьДопускВесовогоТовара(СтрокаДока.Номенклатура, СсылкаНаДок.Клиент);
		Исключение
			ДопускВесовогоТовара = Неопределено;
		КонецПопытки;
		
		Если ДопускВесовогоТовара<>Неопределено тогда
			СтруктураТекущейСтроки.Вставить("weight_task", ДопускВесовогоТовара);
		КонецЕсли;
			
		ЭтоУслуга = Ложь;
		Попытка 
			Если СтрокаДока.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				ЭтоУслуга = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
			
		limit_qty = 0;
		Если УзелПО.НеОтображатьОстатки Тогда
			limit_qty = 0;
		ИначеЕсли ЭтоУслуга Тогда
			limit_qty = 999;
		Иначе		
			Попытка
				Итог = СтрокаДока.Лимит;
				limit_qty = Итог;
			Исключение
				limit_qty = 0;
			КонецПопытки;
		КонецЕсли;
		
		qty = СтрокаДока.Количество;
		price = СтрокаДока.Цена;		
		
		СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
		СтруктураТекущейСтроки.Вставить("qty", qty);
		СтруктураТекущейСтроки.Вставить("price", price);
	
		ОбъектСписка.Добавить(СтруктураТекущейСтроки);
	КонецЦикла;			
			
КонецПроцедуры

Процедура GetDocRowsSelectCasual(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок)
	
	Модуль_ОбщегоНазначения = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначения");
	РеквизитыШаблона = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Шаблон,"ВидДокумента,ИмяТабличнойЧастиПодбор,ИмяТабличнойЧастиПриемка,
						|МножествоДокументовКакЗадание,ИспользоватьПодбор,ИспользоватьПриемку,ГрупповойДокумент,ЕГАИС,ИспользоватьМаркировку,
						|МаркировкаЗапретитьПодборНемаркируемыхТоваров,НеВыгружатьУслуги,ПодборУпаковочнымиЛистами");
	
	ВидДокумента 									= РеквизитыШаблона.ВидДокумента;
	ИмяТабличнойЧастиПодбор 						= РеквизитыШаблона.ИмяТабличнойЧастиПодбор;
	ИмяТабличнойЧастиПриемка 						= РеквизитыШаблона.ИмяТабличнойЧастиПриемка;
	МножествоДокументовКакЗадание 					= РеквизитыШаблона.МножествоДокументовКакЗадание;
	ИспользоватьПодбор								= РеквизитыШаблона.ИспользоватьПодбор;
	ИспользоватьПриемку								= РеквизитыШаблона.ИспользоватьПриемку;
	ГрупповойДокумент								= РеквизитыШаблона.ГрупповойДокумент;
	ЕГАИС											= РеквизитыШаблона.ЕГАИС;
	ИспользоватьМаркировку							= РеквизитыШаблона.ИспользоватьМаркировку;
	МаркировкаЗапретитьПодборНемаркируемыхТоваров	= РеквизитыШаблона.МаркировкаЗапретитьПодборНемаркируемыхТоваров;
	НеВыгружатьУслуги								= РеквизитыШаблона.НеВыгружатьУслуги;
	ПодборУпаковочнымиЛистами                       = РеквизитыШаблона.ПодборУпаковочнымиЛистами;
	
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаТоваровВДокументе.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваровВДокументе.Характеристика КАК Характеристика,
	|	&УсловиеСерия КАК Серия,
	|	&УсловиеЦена КАК Цена,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ТаблицаТоваровВДокументе.Количество, 0) = 0
	|				ТОГДА ТаблицаТоваровВДокументе.КоличествоУпаковок
	|			ИНАЧЕ ЕСТЬNULL(ТаблицаТоваровВДокументе.Количество, 0)
	|		КОНЕЦ) КАК Количество,
	|	СУММА(ТаблицаТоваровВДокументе.КоличествоШт) КАК КоличествоМест,
	|	МИНИМУМ(ТаблицаТоваровВДокументе.НомерСтроки) КАК НомерСтроки,
	|	&УсловиеУпаковка КАК Упаковка,
	|	&УсловиеУпакЛист КАК УпаковочныйЛист
	|ПОМЕСТИТЬ ТаблицаТоваровВДокументе1С
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.Товары КАК ТаблицаТоваровВДокументе
	|ГДЕ
	|	ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваровВДокументе.Номенклатура,
	|	ТаблицаТоваровВДокументе.Характеристика,
	|	&УсловиеСерия,
	|	&УсловиеЦена,
	|	&УсловиеУпаковка,
	|	&УсловиеУпакЛист
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК Характеристика,
	|	СУММА(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество) КАК Количество
	|ПОМЕСТИТЬ РезервыТСД
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	|ГДЕ
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка <> &Ссылка
	|		И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.Шаблон.РезервироватьТовар
	|			И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СвободныеОстатки.Номенклатура КАК Номенклатура,
	|	СвободныеОстатки.Характеристика КАК Характеристика,
	|	СвободныеОстатки.Серия КАК Серия,
	|	СУММА(ЕСТЬNULL(СвободныеОстатки.ВНаличииОстаток, 0)) КАК ВНаличииОстатокСерии
	|ПОМЕСТИТЬ ТоварыНаСкладахОстаткиСерии
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ТаблицаТоваровВДокументе.Номенклатура КАК Номенклатура
	|					ИЗ
	|						ТаблицаТоваровВДокументе1С КАК ТаблицаТоваровВДокументе)
	|				И (&ВсеСклады
	|					ИЛИ Склад В (&Склады))
	|				И 1=1) КАК СвободныеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	СвободныеОстатки.Номенклатура,
	|	СвободныеОстатки.Характеристика,
	|	СвободныеОстатки.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстатокСерии, 0)) КАК ВНаличииОстаток
	|ПОМЕСТИТЬ ТоварыНаСкладахОстатки
	|ИЗ
	|	ТоварыНаСкладахОстаткиСерии КАК ТоварыНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ТоварыНаСкладахОстатки.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваровВДокументе1С.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваровВДокументе1С.Характеристика КАК Характеристика,
	|	ТаблицаТоваровВДокументе1С.Цена КАК Цена,
	|	ТаблицаТоваровВДокументе1С.Количество КАК Количество,
	|	ТаблицаТоваровВДокументе1С.КоличествоМест КАК КоличествоМест,
	|	ТаблицаТоваровВДокументе1С.НомерСтроки КАК НомерСтроки,
	|	ТаблицаТоваровВДокументе1С.Серия КАК Серия,
	|	ТаблицаТоваровВДокументе1С.Упаковка КАК Упаковка,
	|	ТаблицаТоваровВДокументе1С.УпаковочныйЛист КАК УпаковочныйЛист,
	|	ТаблицаТоваровВДокументе1С.Номенклатура.ВидНоменклатуры.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТаблицаТоваровВДокументе1С.Номенклатура.ВидНоменклатуры.ИспользоватьСерии КАК ИспользоватьСерии,
	|	ТоварыНаСкладахОстаткиСерии.ВНаличииОстатокСерии КАК ОстатокПоСерии,
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(РезервыТСД.Количество, 0)) КАК Лимит
	|ИЗ
	|	ТаблицаТоваровВДокументе1С КАК ТаблицаТоваровВДокументе1С
	|		ЛЕВОЕ СОЕДИНЕНИЕ РезервыТСД КАК РезервыТСД
	|		ПО ТаблицаТоваровВДокументе1С.Номенклатура = РезервыТСД.Номенклатура
	|			И ТаблицаТоваровВДокументе1С.Характеристика = РезервыТСД.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаСкладахОстаткиСерии КАК ТоварыНаСкладахОстаткиСерии
	|		ПО ТаблицаТоваровВДокументе1С.Номенклатура = ТоварыНаСкладахОстаткиСерии.Номенклатура
	|			И ТаблицаТоваровВДокументе1С.Характеристика = ТоварыНаСкладахОстаткиСерии.Характеристика
	|			И ТаблицаТоваровВДокументе1С.Серия = ТоварыНаСкладахОстаткиСерии.Серия
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаСкладахОстатки КАК ТоварыНаСкладахОстатки
	|		ПО ТаблицаТоваровВДокументе1С.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ТаблицаТоваровВДокументе1С.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваровВДокументе1С.Номенклатура,
	|	ТаблицаТоваровВДокументе1С.Характеристика,
	|	ТаблицаТоваровВДокументе1С.Цена,
	|	ТаблицаТоваровВДокументе1С.Количество,
	|	ТаблицаТоваровВДокументе1С.КоличествоМест,
	|	ТаблицаТоваровВДокументе1С.НомерСтроки,
	|	ТаблицаТоваровВДокументе1С.Серия,
	|	ТаблицаТоваровВДокументе1С.Упаковка,
	|	ТаблицаТоваровВДокументе1С.УпаковочныйЛист,
	|	ТаблицаТоваровВДокументе1С.Номенклатура.ВидНоменклатуры.ТипНоменклатуры,
	|	ТаблицаТоваровВДокументе1С.Номенклатура.ВидНоменклатуры.ИспользоватьСерии,
	|	ТоварыНаСкладахОстаткиСерии.ВНаличииОстатокСерии
	|	
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки");
	
	
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаДок);
	Запрос.УстановитьПараметр("ИсходныйДокумент",СсылкаНаДок.ИсходныйДокумент);
	Запрос.Текст=СтрЗаменить(Запрос.Текст,".ПриходныйОрдерНаТовары.","."+ВидДокумента+".");
	Запрос.Текст=СтрЗаменить(Запрос.Текст,".Товары КАК ","."+ИмяТабличнойЧастиПодбор+" КАК ");
	
	//Если у документа есть склад берем остатки по складу документа иначе склады из настроек ТСД
	СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
	Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
		СписокСкладов.Очистить();
		СписокСкладов.Добавить(СсылкаНаДок.Склад);			
	КонецЕсли;
	Запрос.УстановитьПараметр("Склады",СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
	
	СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
		СписокПомещений.Очистить();
		СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
	КонецЕсли;
	Запрос.УстановитьПараметр("Помещения",СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);

	Запрос.УстановитьПараметр("Документы",СсылкаНаДок.Задания.ВыгрузитьКолонку("Задание"));
	
	Если УзелПО.УчитыватьОстаткиПоРегиструСвободныеОстатки Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТоварыНаСкладах"					, "СвободныеОстатки");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "КОтгрузкеОстаток"					, "ВРезервеСоСкладаОстаток");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СвободныеОстатки.Серия"			, "ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СвободныеОстатки.ВНаличииОстаток"	, "СвободныеОстатки.ВНаличииОстаток - СвободныеОстатки.ВРезервеСоСкладаОстаток");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1=1", "(&ВсеПомещения ИЛИ Помещение В (&Помещения))");
	КонецЕсли;

	Попытка
		ЕстьЦены = Метаданные.Документы[ВидДокумента].ТабличныеЧасти[ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Цена")<>Неопределено;
	Исключение
		ЕстьЦены = Ложь;
	КонецПопытки;	
	
	Если ЕстьЦены тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеЦена","ТаблицаТоваровВДокументе.Цена");
	Иначе
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеЦена","0");
	КонецЕсли;
		
	Попытка
		ЕстьСерии = Метаданные.Документы[ВидДокумента].ТабличныеЧасти[ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Серия")<>Неопределено;
	Исключение
		ЕстьСерии = Ложь;
	КонецПопытки;
	
	Если ЕстьСерии тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеСерия","ТаблицаТоваровВДокументе.Серия");
	Иначе
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеСерия","Значение(Справочник.СерииНоменклатуры.ПустаяСсылка)");
	КонецЕсли;
	
	Попытка
		ЕстьКоличествоМест = Метаданные.Документы[ВидДокумента].ТабличныеЧасти[ИмяТабличнойЧастиПодбор].Реквизиты.Найти("КоличествоШт")<>Неопределено;
	Исключение
		ЕстьКоличествоМест = Ложь;
	КонецПопытки;
	
	Если Не ЕстьКоличествоМест Тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.КоличествоШт",0);		
	КонецЕсли;
	
	Попытка
		ЕстьУпаковка = Метаданные.Документы[ВидДокумента].ТабличныеЧасти[ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Упаковка")<>Неопределено;
	Исключение
		ЕстьУпаковка = Ложь;
	КонецПопытки;
	
	Если ЕстьУпаковка тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеУпаковка","ТаблицаТоваровВДокументе.Упаковка");
	Иначе
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеУпаковка","Значение(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)");
	КонецЕсли;

	Попытка
		ЕстьКоличествоУпаковок = Метаданные.Документы[ВидДокумента].ТабличныеЧасти[ИмяТабличнойЧастиПодбор].Реквизиты.Найти("КоличествоУпаковок")<>Неопределено;
	Исключение
		ЕстьКоличествоУпаковок = Ложь;
	КонецПопытки;
	
	Если ЕстьКоличествоУпаковок тогда
		Если УзелПО.НеИспользоватьПересчетУпаковок тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Количество,","ТаблицаТоваровВДокументе.КоличествоУпаковок,");
		КонецЕсли;			
	Иначе
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.КоличествоУпаковок","ТаблицаТоваровВДокументе.Количество");
	КонецЕсли;
	
	Попытка
		ЕстьКоличество = Метаданные.Документы[ВидДокумента].ТабличныеЧасти[ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Количество")<>Неопределено;
	Исключение
		ЕстьКоличество = Ложь;
	КонецПопытки;
	
	Если Не ЕстьКоличество Тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Количество",0);		
	КонецЕсли;
	
	
Если ВидДокумента = "ЗаказПоставщику" тогда
		Попытка
			ЕстьОтменено = Метаданные.Документы[ВидДокумента].ТабличныеЧасти[ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Отменено")<>Неопределено;
		Исключение
			ЕстьОтменено = Ложь;
		КонецПопытки;
		
		Если ЕстьОтменено тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент","ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент И НЕ ТаблицаТоваровВДокументе.Отменено");
		КонецЕсли;
	ИначеЕсли ВидДокумента = "ЗаказКлиента" тогда
		Попытка
			ЕстьОтменено = Метаданные.Документы[ВидДокумента].ТабличныеЧасти[ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Отменено")<>Неопределено и Метаданные.Документы[ВидДокумента].ТабличныеЧасти[ИмяТабличнойЧастиПодбор].Реквизиты.Найти("ВариантОбеспечения")<>Неопределено;
		Исключение
			ЕстьОтменено = Ложь;
		КонецПопытки;
		
		Если ЕстьОтменено тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент","ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент И НЕ ТаблицаТоваровВДокументе.Отменено"); //И ТаблицаТоваровВДокументе.ВариантОбеспечения<>ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)");
		КонецЕсли;   
	КонецЕсли;

	Попытка
		ЕстьУпаковочныйЛист = Метаданные.Документы[ВидДокумента].ТабличныеЧасти[ИмяТабличнойЧастиПодбор].Реквизиты.Найти("УпаковочныйЛистРодитель")<>Неопределено;
	Исключение
		ЕстьУпаковочныйЛист = Ложь;
	КонецПопытки;
		
	Если ЕстьУпаковочныйЛист И ПодборУпаковочнымиЛистами Тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеУпакЛист","ТаблицаТоваровВДокументе.УпаковочныйЛистРодитель.Код");
	Иначе
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеУпакЛист","""""");
	КонецЕсли;	

	
	Если ВидДокумента = "ПересчетТоваров" и УзелПО.НеОтображатьОстатки тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.КоличествоУпаковок","0");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Количество","0");
	КонецЕсли;	
	
	Если МножествоДокументовКакЗадание Тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент", "ТаблицаТоваровВДокументе.Ссылка В(&Документы)");
	КонецЕсли;		
	
	Если ВидДокумента = "ПеремаркировкаТоваровИСМП" Тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Номенклатура КАК Номенклатура,"	,"ТаблицаТоваровВДокументе.НоваяНоменклатура КАК Номенклатура,");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Номенклатура,"					,"ТаблицаТоваровВДокументе.НоваяНоменклатура,"); 
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Характеристика"					,"ТаблицаТоваровВДокументе.НоваяХарактеристика");
	КонецЕсли; 
	
	Если ИспользоватьМаркировку и МаркировкаЗапретитьПодборНемаркируемыхТоваров тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент","ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент 
		|   	И
		|   	(
		|   	(ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПустаяСсылка) 
		|   	И ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция)
		|   	И ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.СодержитДрагоценныеМатериалы)
		|   	И ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.КиЗГИСМ)
		|   	И ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПодконтрольнаяПродукцияВЕТИС)
		|   	И ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОрганизациейПродавцом)
		|   	И ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОрганизациейПоАгентскойСхеме)
		|   	И ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Партнером)
		|   	И ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета))
		|   	ИЛИ
		|   	(ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПустаяСсылка) 
		|   	И ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция)
		|   	И ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.СодержитДрагоценныеМатериалы)
		|   	И ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.КиЗГИСМ)
		|   	И ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПодконтрольнаяПродукцияВЕТИС)
		|   	И ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОрганизациейПродавцом)
		|   	И ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОрганизациейПоАгентскойСхеме)
		|   	И ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Партнером)
		|   	И ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета))
		|   	)");
		
	КонецЕсли;		
	
	Если НеВыгружатьУслуги Тогда
		
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент","ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент 
		|   	И  ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)");			
	КонецЕсли;
	
	
	Рез=Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаДока из Рез цикл
			
		Если НЕ ЗначениеЗаполнено(СтрокаДока.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураТекущейСтроки = Новый Структура;
		
		ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","id");	
		Если ЗначениеЗаполнено(СтрокаДока.Характеристика) Тогда
			ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(СтрокаДока.Характеристика);
			Попытка ОбъектТовара.parent_id = ?(XMLСтрока(СтрокаДока.Характеристика) = "00000000-0000-0000-0000-000000000000", "", "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + "00000000-0000-0000-0000-000000000000"); Исключение КонецПопытки;
		Иначе
			ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + "00000000-0000-0000-0000-000000000000";
		КонецЕсли;
		СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
		
		
		Попытка
			Если ЗначениеЗаполнено(СтрокаДока.Серия) Тогда
				sn = ПолучитьЗначениеСерии(Шаблон, СтрокаДока.Номенклатура, СтрокаДока.Серия);
				СтруктураТекущейСтроки.Вставить("sn", sn);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Попытка
			ДопускВесовогоТовара =  ПолучитьДопускВесовогоТовара(СтрокаДока.Номенклатура, СсылкаНаДок.Клиент);
		Исключение
			ДопускВесовогоТовара = Неопределено;
		КонецПопытки;
		
		Если ДопускВесовогоТовара<>Неопределено тогда
			СтруктураТекущейСтроки.Вставить("weight_task", ДопускВесовогоТовара);
		КонецЕсли;
				
		ЭтоУслуга = Ложь;
		Попытка 
			Если СтрокаДока.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				ЭтоУслуга = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		limit_qty=0;
		Если УзелПО.НеОтображатьОстатки Тогда
			limit_qty=0;
		ИначеЕсли ЭтоУслуга Тогда
			limit_qty=999;	
		Иначе			
			Попытка
				Итог = СтрокаДока.Лимит;
				limit_qty = Итог;
			Исключение
				limit_qty = 	0;
			КонецПопытки;
		КонецЕсли;
		
		
		qty = СтрокаДока.Количество;

		price = СтрокаДока.Цена;
		
		СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
		СтруктураТекущейСтроки.Вставить("qty", qty);
		СтруктураТекущейСтроки.Вставить("price", price);

		Если ПодборУпаковочнымиЛистами Тогда
			Попытка
				pack = СокрЛП(СтрокаДока.УпаковочныйЛист);
				СтруктураТекущейСтроки.Вставить("pack", pack);
			Исключение 
			КонецПопытки;
		КонецЕсли;	
		
		Если ПодборУпаковочнымиЛистами Тогда
			Попытка
				ТекущийШтрихкод = ПолучитьШтрихкодУпаковки(СтрокаДока.Номенклатура, СтрокаДока.Характеристика, СтрокаДока.Упаковка); 
				Если ЗначениеЗаполнено(ТекущийШтрихкод) тогда					
					ОбъектШтрихкода = ПолучитьСтруктуруОбъектаДляHttp("barcode","value");			
					ОбъектШтрихкода.value = ЧистаяСтрока(ТекущийШтрихкод);			
					СтруктураТекущейСтроки.Вставить("barcode", ОбъектШтрихкода);
				КонецЕсли;
			Исключение 
			КонецПопытки;
			
			Попытка
				pack = СокрЛП(СтрокаДока.УпаковочныйЛист);
				СтруктураТекущейСтроки.Вставить("pack", pack);
			Исключение 
			КонецПопытки;
		КонецЕсли;

		
		ОбъектСписка.Добавить(СтруктураТекущейСтроки);
		
	КонецЦикла;
	
КонецПроцедуры


Процедура GetDocRowsSelectMarking(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок)
	
	Если Шаблон.ВидДокумента = "УведомлениеОПриемкеМДЛП" Тогда
		ПолучитьСтрокиДокументаМДЛП(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок);
	Иначе
		
		ПолучитьСтрокиДокументаМаркировка(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьСтрокиДокументаМаркировка(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок)
	
	Запрос=Новый Запрос;
	
	//ВЫБЕРЕМ ДАННЫЕ ДОКУМЕНТА ПО ТОВАРАМ И ОСТАТКАМ
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЗапросСЛимитами.Номенклатура КАК Номенклатура,
	               |	ЗапросСЛимитами.Характеристика КАК Характеристика,
	               |	ЗапросСЛимитами.Серия КАК Серия,
	               |	МАКСИМУМ(ЗапросСЛимитами.Цена) КАК Цена,
	               |	СУММА(ЗапросСЛимитами.Количество) КАК Количество,
	               |	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0)) КАК Лимит,
	               |	МИНИМУМ(ЗапросСЛимитами.НомерСтроки) КАК НомерСтроки
	               |ПОМЕСТИТЬ ТоварыЗадания
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТаблицаТоваровВДокументе.Номенклатура КАК Номенклатура,
	               |		ТаблицаТоваровВДокументе.Характеристика КАК Характеристика,
	               |		&УсловиеСерия КАК Серия,
	               |		&УсловиеЦена КАК Цена,
	               |		СУММА(ВЫБОР
	               |				КОГДА ЕСТЬNULL(ТаблицаТоваровВДокументе.Количество, 0) = 0
	               |					ТОГДА ТаблицаТоваровВДокументе.КоличествоУпаковок
	               |				ИНАЧЕ ЕСТЬNULL(ТаблицаТоваровВДокументе.Количество, 0)
	               |			КОНЕЦ) КАК Количество,
	               |		МИНИМУМ(ТаблицаТоваровВДокументе.НомерСтроки) КАК НомерСтроки
	               |	ИЗ
	               |		Документ.ПриобретениеТоваровУслуг.Товары КАК ТаблицаТоваровВДокументе
	               |	ГДЕ
	               |		ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ТаблицаТоваровВДокументе.Номенклатура,
	               |		ТаблицаТоваровВДокументе.Характеристика,
				   |		&УсловиеСерия,
				   |		&УсловиеЦена) КАК ЗапросСЛимитами
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |				,
	               |				(&ВсеСклады
	               |					ИЛИ Склад В (&Склады))
				   |				И (&ВсеПомещения
	               |					ИЛИ Помещение В (&Помещения))) КАК СвободныеОстаткиОстатки
	               |		ПО ЗапросСЛимитами.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
	               |			И ЗапросСЛимитами.Характеристика = СвободныеОстаткиОстатки.Характеристика
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗапросСЛимитами.Номенклатура,
	               |	ЗапросСЛимитами.Характеристика,
	               |	ЗапросСЛимитами.Серия
	               |;
	               |
				   
				   //ВЫБЕРЕМ ДАННЫЕ ДОКУМЕНТА ПО СПРАВОЧНИКУ ШТРИХКОДЫ УПАКОВОК, ЕСЛИ ОНИ ЗАГРУЖЕНЫ
				   //ТОЛЬКО ПО ГРУППОВЫМ УПАКОВКАМ, БЛОКИ СИГАРЕТ НЕ УЧИТЫВАЕМ, ПЛЮС ПРЕДПОЛОГАЕМ ЧТО МОГУТ БЫТЬ КОРОБА И ПАЛЕТЫ
				   
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗРЕШЕННЫЕ 
				   |	ПриобретениеТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
				   |	ПриобретениеТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК ЗначениеШтрихкода
				   |ПОМЕСТИТЬ ШтрихкодыУпаковокТоваровКоробаПалеты
				   |ИЗ
				   |	Документ.ПриобретениеТоваровУслуг.ШтрихкодыУпаковок КАК ПриобретениеТоваровУслугШтрихкодыУпаковок
				   |ГДЕ
				   |	ПриобретениеТоваровУслугШтрихкодыУпаковок.Ссылка = &ИсходныйДокумент
				   |	И НЕ ПриобретениеТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
				   |	И (ПриобретениеТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка)
				   |		ИЛИ ПриобретениеТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка))
				   |			И ПриобретениеТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШтрихкода <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.GS1_DataMatrix)
				   |;
				   |
				   
				   //ВЫБЕРЕМ ИЗ ГРУППОВЫХ УПАКОВОК НИЖЕСТОЯЩИЕ, ЕСЛИ ИСПОЛЬЗУЮТСЯ ЕЩЕ И ПАЛЕТЫ
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК ШтрихкодУпаковки,
				   |	СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ЗначениеШтрихкода КАК ЗначениеШтрихкода
				   |ПОМЕСТИТЬ ШтрихкодыУпаковокТоваровКороба
				   |ИЗ
				   |	ШтрихкодыУпаковокТоваровКоробаПалеты КАК ШтрихкодыУпаковокТоваровКоробаПалеты
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды
				   |		ПО СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка = ШтрихкодыУпаковокТоваровКоробаПалеты.ШтрихкодУпаковки
				   |ГДЕ
				   |	НЕ СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
				   |	И (СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка)
				   |		ИЛИ СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка))
				   |			И СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШтрихкода <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.GS1_DataMatrix)
				   |;

				   
				   //ВЫБЕРЕМ ДАННЫЕ ДОКУМЕНТА ПО СПРАВОЧНИКУ ШТРИХКОДЫ УПАКОВОК, ЕСЛИ ОНИ ЗАГРУЖЕНЫ
				   //ТОЛЬКО ПО ТОВАРАМ, БЕЗ ГРУППОВЫХ УПАКОВОК (БЛОКИ СИГАРЕТ, ТОЖЕ ТОВАРЫ)
				   //ОБЪЕДИНИМ СО СПРАВОЧНИКОМ ШТРИХКОДОВ ИЗ ГРУППОВЫХ УПАКОВОК

	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	               |	ПриобретениеТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	               |	ПриобретениеТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК ЗначениеШтрихкода
	               |ПОМЕСТИТЬ ШтрихкодыУпаковокТоваров  
	               |ИЗ
	               |	Документ.ПриобретениеТоваровУслуг.ШтрихкодыУпаковок КАК ПриобретениеТоваровУслугШтрихкодыУпаковок
	               |ГДЕ
	               |	ПриобретениеТоваровУслугШтрихкодыУпаковок.Ссылка = &ИсходныйДокумент
	               |	И НЕ ПриобретениеТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	               |	И (ПриобретениеТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
	               |			ИЛИ (ПриобретениеТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
	               |				И ПриобретениеТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ТипШтрихкода = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.GS1_DataMatrix)))
				   
				   //КОРОБА
				   |ОБЪЕДИНИТЬ  
				   |
				   |ВЫБРАТЬ
				   |	СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК ШтрихкодУпаковки,
				   |	СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ЗначениеШтрихкода КАК ЗначениеШтрихкода
				   |ИЗ
				   |	ШтрихкодыУпаковокТоваровКоробаПалеты КАК ШтрихкодыУпаковокТоваровКоробаПалеты
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды
				   |		ПО СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка = ШтрихкодыУпаковокТоваровКоробаПалеты.ШтрихкодУпаковки
				   |ГДЕ
				   |	НЕ СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
				   |		И (СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
				   |			ИЛИ (СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
				   |				И СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШтрихкода = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.GS1_DataMatrix)))

				   //ПАЛЕТЫ
				   |ОБЪЕДИНИТЬ  
				   |
				   |ВЫБРАТЬ
				   |	СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК ШтрихкодУпаковки,
				   |	СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ЗначениеШтрихкода КАК ЗначениеШтрихкода
				   |ИЗ
				   |	ШтрихкодыУпаковокТоваровКороба КАК ШтрихкодыУпаковокТоваровКороба
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды
				   |		ПО СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка = ШтрихкодыУпаковокТоваровКороба.ШтрихкодУпаковки
				   |ГДЕ
				   |	НЕ СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
				   |		И (СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
				   |			ИЛИ (СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
				   |				И СправочникШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШтрихкода = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.GS1_DataMatrix)))
	               |;
	               |
				   		   
				   
				   //ВЫБЕРЕМ ДАННЫЕ ДОКУМЕНТА ПО ЗНАЧЕНИЯМ ШТРИХКОДОВ, ГДЕ НЕ ЗАПОЛНЕН СПРАВОЧНИК ШТРИХКОДЫ УПАКОВОК 
				   //ТОЛЬКО ПО ТОВАРАМ, БЕЗ ГРУППОВЫХ УПАКОВОК (БЛОКИ СИГАРЕТ, ТОЖЕ ТОВАРЫ)
				   //ПОПРОБУЕМ ОПРЕДЕЛИТЬ GTIN
				   
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПриобретениеТоваровУслугШтрихкодыУпаковок.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
	               |	ВЫБОР
	               |		КОГДА ПОДСТРОКА(ПриобретениеТоваровУслугШтрихкодыУпаковок.ЗначениеШтрихкода, 3, 1) <> ""0""
	               |			ТОГДА ПОДСТРОКА(ПриобретениеТоваровУслугШтрихкодыУпаковок.ЗначениеШтрихкода, 3, 14)
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПОДСТРОКА(ПриобретениеТоваровУслугШтрихкодыУпаковок.ЗначениеШтрихкода, 4, 1) <> ""0""
	               |					ТОГДА ПОДСТРОКА(ПриобретениеТоваровУслугШтрихкодыУпаковок.ЗначениеШтрихкода, 4, 13)
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ПОДСТРОКА(ПриобретениеТоваровУслугШтрихкодыУпаковок.ЗначениеШтрихкода, 5, 1) <> ""0""
	               |							ТОГДА ПОДСТРОКА(ПриобретениеТоваровУслугШтрихкодыУпаковок.ЗначениеШтрихкода, 5, 12)
	               |						ИНАЧЕ ВЫБОР
	               |							КОГДА ПОДСТРОКА(ПриобретениеТоваровУслугШтрихкодыУпаковок.ЗначениеШтрихкода, 6, 1) <> ""0""
	               |								ТОГДА ПОДСТРОКА(ПриобретениеТоваровУслугШтрихкодыУпаковок.ЗначениеШтрихкода, 5, 12)				   
				   |							ИНАЧЕ ПОДСТРОКА(ПриобретениеТоваровУслугШтрихкодыУпаковок.ЗначениеШтрихкода, 9, 8)
				   |							КОНЕЦ	
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК GTIN
	               |ПОМЕСТИТЬ ЗначенияШтрихкодовТоваров
	               |ИЗ
	               |	Документ.ПриобретениеТоваровУслуг.ШтрихкодыУпаковок КАК ПриобретениеТоваровУслугШтрихкодыУпаковок
	               |ГДЕ
	               |	ПриобретениеТоваровУслугШтрихкодыУпаковок.Ссылка = &ИсходныйДокумент
	               |	И ПриобретениеТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	               |	И ПОДСТРОКА(ПриобретениеТоваровУслугШтрихкодыУпаковок.ЗначениеШтрихкода, 1, 2) = ""01""
	               |;
	               |
				   
				   //СФОРМИРУЕМ СОПОСТАВЛЕНИЕ ДАННЫХ С НОМЕНКЛАТУРОЙ
				   //ПО ШТРИХКОДАМ УПАКОВОК ДАННЫЕ БЕРЕМ ИЗ СПРАВОЧНИКА
				   //ПО ЗНАЧЕНИЯМ ШТРИХКОДОВ ДАННЫЕ БЕРЕМ ИЗ РЕГИСТРА
				   //ПЛЮС МОГУТ ОСТАТЬСЯ НЕСОПОСТАВЛЕННЫЕ СТРОКИ (НАПРИМЕР УПРОЩЕНКА)
				   
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	               |	ШтрихкодыУпаковокТоваров.ШтрихкодУпаковки.Номенклатура КАК Номенклатура,
	               |	ШтрихкодыУпаковокТоваров.ШтрихкодУпаковки.Характеристика КАК Характеристика,
	               |	ШтрихкодыУпаковокТоваров.ШтрихкодУпаковки.Серия КАК Серия,
				   |	ВЫБОР
				   |		КОГДА ШтрихкодыУпаковокТоваров.ШтрихкодУпаковки.Количество = 0 
				   |		ТОГДА
				   |			ВЫБОР
				   |				КОГДА ЕСТЬNULL(ШтрихкодыУпаковокТоваров.ШтрихкодУпаковки.Упаковка.Числитель,0) = 0
				   |				ТОГДА 1
				   |				ИНАЧЕ ШтрихкодыУпаковокТоваров.ШтрихкодУпаковки.Упаковка.Числитель
				   |			КОНЕЦ
				   |		ИНАЧЕ ШтрихкодыУпаковокТоваров.ШтрихкодУпаковки.Количество 
				   |	КОНЕЦ КАК Коэффициент,
	               |	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК Марка,
	               |	МАКСИМУМ(ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.ЗначениеШтрихкода, """")) КАК Короб,
				   |	МАКСИМУМ(ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды2.Ссылка.ЗначениеШтрихкода, """")) КАК Палета
	               |ПОМЕСТИТЬ МаркиЗадания
	               |ИЗ
	               |	ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	               |		ПО ШтрихкодыУпаковокТоваров.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды2
	               |		ПО ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.ЗначениеШтрихкода, """") = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды2.Штрихкод.ЗначениеШтрихкода
				   |СГРУППИРОВАТЬ ПО
	               |	ШтрихкодыУпаковокТоваров.ШтрихкодУпаковки.Номенклатура,
	               |	ШтрихкодыУпаковокТоваров.ШтрихкодУпаковки.Характеристика,
	               |	ШтрихкодыУпаковокТоваров.ШтрихкодУпаковки.Серия,
				   |	ШтрихкодыУпаковокТоваров.ШтрихкодУпаковки.Упаковка,
	               |	ШтрихкодыУпаковокТоваров.ШтрихкодУпаковки.Количество, 
	               |	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода	
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ЕСТЬNULL(РегистрСведенийШтрихкодыНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))),
	               |	МАКСИМУМ(ЕСТЬNULL(РегистрСведенийШтрихкодыНоменклатуры.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))),
	               |	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
				   |	ВЫБОР 
				   |		КОГДА МАКСИМУМ(ЕСТЬNULL(РегистрСведенийШтрихкодыНоменклатуры.Упаковка.Числитель,1))=0 
				   |		ТОГДА 1
			   	   |		ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(РегистрСведенийШтрихкодыНоменклатуры.Упаковка.Числитель,1)) 
				   |	КОНЕЦ,
	               |	ЗначенияШтрихкодовТоваров.ЗначениеШтрихкода,
	               |	"""",
				   |	""""
	               |ИЗ
	               |	ЗначенияШтрихкодовТоваров КАК ЗначенияШтрихкодовТоваров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК РегистрСведенийШтрихкодыНоменклатуры
	               |		ПО ЗначенияШтрихкодовТоваров.GTIN = РегистрСведенийШтрихкодыНоменклатуры.Штрихкод
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗначенияШтрихкодовТоваров.ЗначениеШтрихкода
	               |;
	               |
				   
				   //ПОДСЧИТАЕМ КОЛИЧЕСТВО МАРОК КОТОРЫЕ ОПРЕДЕЛЕНЫ (ВОЗМОЖНО ОНИ В ДОКУМЕНТЕ Т0ЛЬКО ЧАСТИЧНО УКАЗАНЫ)
				   
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МаркиЗадания.Номенклатура КАК Номенклатура,
	               |	МаркиЗадания.Характеристика КАК Характеристика,
	               |	МаркиЗадания.Серия КАК Серия,
	               |	СУММА(МаркиЗадания.Коэффициент) КАК Количество
	               |ПОМЕСТИТЬ КоличествоМарокЗадания
	               |ИЗ
	               |	МаркиЗадания КАК МаркиЗадания
	               |ГДЕ
	               |	НЕ МаркиЗадания.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	МаркиЗадания.Номенклатура,
	               |	МаркиЗадания.Характеристика,
	               |	МаркиЗадания.Серия
	               |;
	               |
				   
				   //РАСПРЕДЕЛИМ МАРКИ ПО ЗАДАНИЮ
				   //ТО ЧТО НЕ РАСПРЕДЕЛИЛОСЬ ДОБАВИМ ОТДЕЛЬНО
				   //ПРИ ЭТОМ МОГУТ БЫТЬ КАК ЛИШНИЕ МАРКИ, ТАК И ЛИШНИЕ ТОВАРЫ

	               |////////////////////////////////////////////////////////////////////////////////
				   //1) СОПОСТАВЛЕНО ПОЛНОСТЬЮ
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МаркиЗадания.Номенклатура КАК Номенклатура,
	               |	МаркиЗадания.Характеристика КАК Характеристика,
	               |	МаркиЗадания.Серия КАК Серия,
	               |	МаркиЗадания.Коэффициент КАК Количество,
	               |	МаркиЗадания.Марка КАК Марка,
	               |	МаркиЗадания.Короб КАК Короб,
				   |	МаркиЗадания.Палета КАК Палета,
	               |	ТоварыЗадания.Цена КАК Цена,
	               |	ТоварыЗадания.Лимит КАК Лимит,
	               |	ТоварыЗадания.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ИтоговыеДанные
	               |ИЗ
	               |	МаркиЗадания КАК МаркиЗадания
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыЗадания КАК ТоварыЗадания
	               |		ПО МаркиЗадания.Номенклатура = ТоварыЗадания.Номенклатура
	               |			И МаркиЗадания.Характеристика = ТоварыЗадания.Характеристика
				   |				И  МаркиЗадания.Серия = ТоварыЗадания.Серия
	               |ГДЕ
	               |	НЕ ТоварыЗадания.Номенклатура ЕСТЬ NULL
	               |	И НЕ МаркиЗадания.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |
				   |ОБЪЕДИНИТЬ
	               |
				   //2) МАРКИ С НЕОПРЕДЕЛЕННОЙ НОМЕНКЛАТУРОЙ (НЕУНИКАЛЬНЫЕ ШТРИХКОДЫ)
				   |ВЫБРАТЬ
	               |	ЕСТЬNULL(МаркиЗадания.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	               |	ЕСТЬNULL(МаркиЗадания.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	               |	ЕСТЬNULL(МаркиЗадания.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	               |	МаркиЗадания.Коэффициент КАК Количество,
	               |	МаркиЗадания.Марка КАК Марка,
	               |	МаркиЗадания.Короб КАК Короб,
				   |	МаркиЗадания.Палета КАК Палета,
	               |	0 КАК Цена,
	               |	0 КАК Лимит,
	               |	77777 КАК НомерСтроки
	               |ИЗ
	               |	МаркиЗадания КАК МаркиЗадания
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыЗадания КАК ТоварыЗадания
	               |		ПО МаркиЗадания.Номенклатура = ТоварыЗадания.Номенклатура
	               |			И МаркиЗадания.Характеристика = ТоварыЗадания.Характеристика
				   |				И  МаркиЗадания.Серия = ТоварыЗадания.Серия
	               |ГДЕ
	               |	ТоварыЗадания.Номенклатура ЕСТЬ NULL
	               |	И НЕ МаркиЗадания.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
				   |
	               |ОБЪЕДИНИТЬ
	               |
				   //3) МАРКИ С НЕОПРЕДЕЛЕННОЙ НОМЕНКЛАТУРОЙ (УПРОЩЕНКА)
	               |ВЫБРАТЬ
	               |	МаркиЗадания.Номенклатура,
	               |	МаркиЗадания.Характеристика,
	               |	МаркиЗадания.Серия,
	               |	МаркиЗадания.Коэффициент,
	               |	МаркиЗадания.Марка,
	               |	МаркиЗадания.Короб,
				   |	МаркиЗадания.Палета,
	               |	0,
	               |	0,
	               |	99999
	               |ИЗ
	               |	МаркиЗадания КАК МаркиЗадания
	               |ГДЕ
	               |	МаркиЗадания.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ
	               |				      
				   //4) СТРОКИ ЗАДАНИЯ БЕЗ МАРОК (ВРЕМЕННО ВОЗМОЖНО ЧАСТИЧНОЕ УКАЗАНИЕ МАРОК)
	               |ВЫБРАТЬ
	               |	ТоварыЗадания.Номенклатура,
	               |	ТоварыЗадания.Характеристика,
	               |	ТоварыЗадания.Серия,
	               |	ТоварыЗадания.Количество - ЕСТЬNULL(КоличествоМарокЗадания.Количество, 0),
	               |	"""",
	               |	"""",
				   |	"""",
	               |	ТоварыЗадания.Цена,
	               |	ТоварыЗадания.Лимит,
	               |	ТоварыЗадания.НомерСтроки
	               |ИЗ
	               |	ТоварыЗадания КАК ТоварыЗадания
	               |		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоМарокЗадания КАК КоличествоМарокЗадания
	               |		ПО ТоварыЗадания.Номенклатура = КоличествоМарокЗадания.Номенклатура
	               |			И ТоварыЗадания.Характеристика = КоличествоМарокЗадания.Характеристика
				   |				И  ТоварыЗадания.Серия = КоличествоМарокЗадания.Серия
	               |ГДЕ
	               |	ТоварыЗадания.Количество - ЕСТЬNULL(КоличествоМарокЗадания.Количество, 0) > 0
	               |;
	               |
				   
				   //ИТОГ
				   
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИтоговыеДанные.Номенклатура КАК Номенклатура,
	               |	ИтоговыеДанные.Характеристика КАК Характеристика,
	               |	ИтоговыеДанные.Серия КАК Серия,
	               |	ИтоговыеДанные.Количество КАК Количество,
	               |	ИтоговыеДанные.Марка КАК Марка,
	               |	ИтоговыеДанные.Короб КАК Короб,
				   |	ИтоговыеДанные.Палета КАК Палета,
	               |	ИтоговыеДанные.Цена КАК Цена,
	               |	ИтоговыеДанные.Лимит КАК Лимит,
	               |	ИтоговыеДанные.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	ИтоговыеДанные КАК ИтоговыеДанные
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИтоговыеДанные.НомерСтроки УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ТоварыЗадания
	               |;
	               |
				   |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ШтрихкодыУпаковокТоваровКоробаПалеты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ШтрихкодыУпаковокТоваровКороба
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ШтрихкодыУпаковокТоваров
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ЗначенияШтрихкодовТоваров
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ МаркиЗадания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ КоличествоМарокЗадания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ИтоговыеДанные";

	
	
	
	
		Запрос.УстановитьПараметр("Ссылка",СсылкаНаДок);
		Запрос.УстановитьПараметр("ИсходныйДокумент",СсылкаНаДок.ИсходныйДокумент);
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".ПриобретениеТоваровУслуг.","."+Шаблон.ВидДокумента+".");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".Товары КАК ","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК ");
		
		//Если у документа есть склад берем остатки по складу документа иначе склады из настроек ТСД
		СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
		Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
			СписокСкладов.Очистить();
			СписокСкладов.Добавить(СсылкаНаДок.Склад);			
		КонецЕсли;
		Запрос.УстановитьПараметр("Склады",СписокСкладов);
		Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
		
		СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
		Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
			СписокПомещений.Очистить();
			СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
		КонецЕсли;
		Запрос.УстановитьПараметр("Помещения",СписокПомещений);
		Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);

		Попытка
			ЕстьЦены = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Цена")<>Неопределено;
		Исключение
			ЕстьЦены = Ложь;
		КонецПопытки;

		
		Если ЕстьЦены Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеЦена","ТаблицаТоваровВДокументе.Цена");
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеЦена","0");
		КонецЕсли;
		
		
		Попытка
			ЕстьСерии = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Серия")<>Неопределено;
		Исключение
			ЕстьСерии = Ложь;
		КонецПопытки;
		
		Если ЕстьСерии Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеСерия","ТаблицаТоваровВДокументе.Серия");
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеСерия","Значение(Справочник.СерииНоменклатуры.ПустаяСсылка)");
		КонецЕсли;

		
		Попытка
			ЕстьКоличествоУпаковок = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("КоличествоУпаковок")<>Неопределено;
		Исключение
			ЕстьКоличествоУпаковок = Ложь;
		КонецПопытки;

		Если ЕстьКоличествоУпаковок Тогда
			Если УзелПО.НеИспользоватьПересчетУпаковок Тогда
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Количество,","ТаблицаТоваровВДокументе.КоличествоУпаковок,");
			КонецЕсли;
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.КоличествоУпаковок","ТаблицаТоваровВДокументе.Количество");
		КонецЕсли;
			
				
		Если Шаблон.ВидДокумента = "ЗаказПоставщику" Тогда
			Попытка
				ЕстьОтменено = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Отменено")<>Неопределено;
			Исключение
				ЕстьОтменено = Ложь;
			КонецПопытки;
			
			Если ЕстьОтменено Тогда
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент","ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент И НЕ ТаблицаТоваровВДокументе.Отменено");
			КонецЕсли;	
		ИначеЕсли Шаблон.ВидДокумента = "ЗаказКлиента" Тогда
			Попытка
				ЕстьОтменено = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Отменено")<>Неопределено и Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("ВариантОбеспечения")<>Неопределено;
			Исключение
				ЕстьОтменено = Ложь;
			КонецПопытки;
			
			Если ЕстьОтменено Тогда
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент","ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент И НЕ ТаблицаТоваровВДокументе.Отменено"); //И ТаблицаТоваровВДокументе.ВариантОбеспечения<>ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)");
			КонецЕсли;		
		КонецЕсли;
		
		
	//СОПОСТАВЛЕНИЕ ЭДО
	Если Шаблон.ВидДокумента = "ПриобретениеТоваровУслуг" Тогда	
		Модуь_ШтрихкодированиеИСМПСлужебный = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ШтрихкодированиеИСМПСлужебный");
		ДанныеНоменклатурыПоДаннымУПД = Модуь_ШтрихкодированиеИСМПСлужебный.ДанныеМаркируемойНоменклатурыПоДаннымУПД(СсылкаНаДок.ИсходныйДокумент);
	КонецЕсли;
	
	//СОПОСТАВЛЕНИЕ ФОРМЫ ПРОВЕРКИ И ПОДБОРА
	Попытка 
		ДанныеНоменклатурыПоДаннымСтатусовПроверкиИПодбора = ДатаМобайл_Маркировка.ДанныеНоменклатурыПоДаннымСтатусовПроверкиИПодбора(СсылкаНаДок.ИсходныйДокумент);
	Исключение
		ДанныеНоменклатурыПоДаннымСтатусовПроверкиИПодбора = Неопределено; 
	КонецПопытки;	
	СведенияПоEAN = Неопределено;
	
	ТЗКМРаспределить = Новый ТаблицаЗначений;
	ТЗКМРаспределить.Колонки.Добавить("Номенклатура");
	ТЗКМРаспределить.Колонки.Добавить("Характеристика");
	ТЗКМРаспределить.Колонки.Добавить("Количество");

		
	Рез=Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаДока из Рез цикл
		
		СтруктураТекущейСтроки = Новый Структура;	
				
		ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","id");

		Если ЗначениеЗаполнено(СтрокаДока.Номенклатура) Тогда
			Если ЗначениеЗаполнено(СтрокаДока.Характеристика) Тогда
				ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(СтрокаДока.Характеристика);
				Попытка ОбъектТовара.parent_id = ?(XMLСтрока(СтрокаДока.Характеристика) = "00000000-0000-0000-0000-000000000000", "", "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + "00000000-0000-0000-0000-000000000000"); Исключение КонецПопытки;
			Иначе
				ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + "00000000-0000-0000-0000-000000000000";
			КонецЕсли;
			
		Иначе
			
			Если НЕ ЗначениеЗаполнено(СтрокаДока.Марка) Тогда
				Продолжить;
			КонецЕсли;
			
			//Попробовать найти номенклатуру из сопоставления документа ЭДО
			Если Шаблон.ВидДокумента = "ПриобретениеТоваровУслуг" Тогда
				СведенияПоEAN = ДанныеНоменклатурыПоДаннымУПД.Получить(СтрокаДока.Марка);
			КонецЕсли;
	        //Попробовать найти номенклатуру из сопоставления формы проверки и подбора
			Если СведенияПоEAN = Неопределено и ДанныеНоменклатурыПоДаннымСтатусовПроверкиИПодбора<>Неопределено Тогда
				СведенияПоEAN = ДанныеНоменклатурыПоДаннымСтатусовПроверкиИПодбора.Получить(СтрокаДока.Марка);
			КонецЕсли;
			
			Если СведенияПоEAN <> Неопределено Тогда
				Если ЗначениеЗаполнено(СведенияПоEAN.Номенклатура) Тогда
					
					Если ЗначениеЗаполнено(СведенияПоEAN.Характеристика) Тогда
						ОбъектТовара.id = "8U-" + СокрЛП(СведенияПоEAN.Номенклатура.УникальныйИдентификатор()) + СокрЛП(СведенияПоEAN.Характеристика.УникальныйИдентификатор());
						Попытка ОбъектТовара.parent_id = ?(СокрЛП(СведенияПоEAN.Характеристика.УникальныйИдентификатор()) = "00000000-0000-0000-0000-000000000000", "", "8U-" + СокрЛП(СведенияПоEAN.Номенклатура.УникальныйИдентификатор()) + "00000000-0000-0000-0000-000000000000"); Исключение КонецПопытки;
					Иначе
						ОбъектТовара.id = "8U-" + СокрЛП(СведенияПоEAN.Номенклатура.УникальныйИдентификатор()) + "00000000-0000-0000-0000-000000000000";
					КонецЕсли;
					
					СтрокаРаспределения = ТЗКМРаспределить.Добавить();
					СтрокаРаспределения.Номенклатура = СведенияПоEAN.Номенклатура;
					СтрокаРаспределения.Характеристика = СведенияПоEAN.Характеристика;
					СтрокаРаспределения.Количество = 1;
									
				Иначе			
					ОбъектТовара.id = "00000000-0000-0000-0000-000000000000";	
				КонецЕсли;	
			Иначе			
				ОбъектТовара.id = "00000000-0000-0000-0000-000000000000";	
			КонецЕсли;		
		КонецЕсли;
		
		СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);

		ТекущееКоличество = СтрокаДока.Количество;
		Если ТЗКМРаспределить.Количество()>0 и НЕ ЗначениеЗаполнено(СтрокаДока.Марка) Тогда			
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", СтрокаДока.Номенклатура);
			Отбор.Вставить("Характеристика", СтрокаДока.Характеристика);

			ТЗКМРаспределить.Свернуть("Номенклатура,Характеристика","Количество");
    		Строки = ТЗКМРаспределить.НайтиСтроки(Отбор);
			Для Каждого Стр Из Строки Цикл
				Если ТекущееКоличество>0 Тогда
					ТекущееКоличество = ТекущееКоличество - Стр.Количество;	
        			ТЗКМРаспределить.Удалить(Стр);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
				
		Попытка
			Если ЗначениеЗаполнено(СтрокаДока.Серия) Тогда
				sn = ПолучитьЗначениеСерии(Шаблон, СтрокаДока.Номенклатура, СтрокаДока.Серия);
				СтруктураТекущейСтроки.Вставить("sn", sn);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Попытка
			ДопускВесовогоТовара =  ПолучитьДопускВесовогоТовара(СтрокаДока.Номенклатура, СсылкаНаДок.Клиент);
		Исключение
			ДопускВесовогоТовара = Неопределено;
		КонецПопытки;
		
		Если ДопускВесовогоТовара<>Неопределено тогда
			СтруктураТекущейСтроки.Вставить("weight_task", ДопускВесовогоТовара);
		КонецЕсли;
		
			
		ЭтоУслуга = Ложь;
		Попытка 
			Если СтрокаДока.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				ЭтоУслуга = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;

		limit_qty = 0;
		Если УзелПО.НеОтображатьОстатки Тогда
			limit_qty = 0;
		ИначеЕсли ЭтоУслуга Тогда
	        limit_qty = 999;
		Иначе			
			Попытка
				Итог = СтрокаДока.Лимит;
				limit_qty = Итог;
			Исключение
				limit_qty = 0;
			КонецПопытки;
		КонецЕсли;
		
		qty = ТекущееКоличество;
		
		price = СтрокаДока.Цена;
		
		СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
		СтруктураТекущейСтроки.Вставить("qty", qty);
		СтруктураТекущейСтроки.Вставить("price", price);
			
		ОбъектМаркировка = ПолучитьСтруктуруОбъектаДляHttp("marking");
		ТипПродукции = ДатаМобайл_Маркировка.ПолучитьТипМаркированнойПродукции(СтрокаДока.Номенклатура); 
		ОбъектМаркировка.mark = ДатаМобайл_Маркировка.УбратьСкобкиТеговМарка(СтрокаДока.Марка,ТипПродукции);
		
		Если ЗначениеЗаполнено(ОбъектМаркировка.mark) Тогда
			СтруктураТекущейСтроки.Вставить("marking", ОбъектМаркировка);
		КонецЕсли;
		
		box_pack = ДатаМобайл_Маркировка.УбратьСкобкиТеговУпаковка(СтрокаДока.Короб);
		Если ЗначениеЗаполнено(box_pack) Тогда
			СтруктураТекущейСтроки.Вставить("box_pack", box_pack);
		КонецЕсли;
		
		pack = ДатаМобайл_Маркировка.УбратьСкобкиТеговУпаковка(СтрокаДока.Палета);
		Если ЗначениеЗаполнено(pack) Тогда
			СтруктураТекущейСтроки.Вставить("pack", pack);
		КонецЕсли;
		
		ОбъектСписка.Добавить(СтруктураТекущейСтроки);		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьСтрокиДокументаМДЛП(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок)
		
	МаркировкаОнлайнПроверкаВложенностиУпаковок = Шаблон.МаркировкаОнлайнПроверкаВложенностиУпаковок;
	
	Если МаркировкаОнлайнПроверкаВложенностиУпаковок Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК ВНаличииОстаток,
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ТоварыНаСкладахОстатки
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УведомлениеОПриемкеМДЛПТовары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(УведомлениеОПриемкеМДЛПТовары.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
		|	УведомлениеОПриемкеМДЛПТовары.Серия КАК Серия,
		|	УведомлениеОПриемкеМДЛПТовары.GTIN КАК GTIN,
		|	УведомлениеОПриемкеМДЛПТовары.НомерСерии КАК НомерСерии,
		|	УведомлениеОПриемкеМДЛПТовары.Цена КАК Цена,
		|	"""" КАК Короб,
		|	УведомлениеОПриемкеМДЛПТовары.КоличествоУпаковок КАК Количество,
		|	УведомлениеОПриемкеМДЛПТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК Остаток
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	Документ.УведомлениеОПриемкеМДЛП.Товары КАК УведомлениеОПриемкеМДЛПТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаСкладахОстатки КАК ТоварыНаСкладахОстатки
		|		ПО УведомлениеОПриемкеМДЛПТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И (ЕСТЬNULL(УведомлениеОПриемкеМДЛПТовары.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) = ТоварыНаСкладахОстатки.Характеристика)
		|ГДЕ
		|	УведомлениеОПриемкеМДЛПТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УведомлениеОПриемкеМДЛПНомераУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	УведомлениеОПриемкеМДЛПНомераУпаковок.НомерКИЗ КАК НомерКИЗ,
		|	УведомлениеОПриемкеМДЛПНомераУпаковок.НомерРодительскойУпаковки КАК НомерКороба
		|ПОМЕСТИТЬ Марки
		|ИЗ
		|	Документ.УведомлениеОПриемкеМДЛП.НомераУпаковок КАК УведомлениеОПриемкеМДЛПНомераУпаковок
		|ГДЕ
		|	УведомлениеОПриемкеМДЛПНомераУпаковок.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УведомлениеОПриемкеМДЛПТранспортныеУпаковки.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	УведомлениеОПриемкеМДЛПТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки
		|ПОМЕСТИТЬ Упаковки
		|ИЗ
		|	Документ.УведомлениеОПриемкеМДЛП.ТранспортныеУпаковки КАК УведомлениеОПриемкеМДЛПТранспортныеУпаковки
		|ГДЕ
		|	УведомлениеОПриемкеМДЛПТранспортныеУпаковки.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УведомлениеОПриемкеМДЛПТовары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(УведомлениеОПриемкеМДЛПТовары.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
		|	УведомлениеОПриемкеМДЛПТовары.Серия КАК Серия,
		|	УведомлениеОПриемкеМДЛПТовары.GTIN КАК GTIN,
		|	УведомлениеОПриемкеМДЛПТовары.НомерСерии КАК НомерСерии,
		|	УведомлениеОПриемкеМДЛПТовары.Цена КАК Цена,
		|	УведомлениеОПриемкеМДЛПТовары.Количество КАК Количество,
		|	УведомлениеОПриемкеМДЛПТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	УведомлениеОПриемкеМДЛПТовары.ИдентификаторСтрокиУпаковки КАК ИдентификаторСтрокиУпаковки,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) КАК Остаток
		|ПОМЕСТИТЬ ТоварыУпаковок
		|ИЗ
		|	Документ.УведомлениеОПриемкеМДЛП.СоставТранспортныхУпаковок КАК УведомлениеОПриемкеМДЛПТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаСкладахОстатки КАК ТоварыНаСкладахОстатки
		|		ПО УведомлениеОПриемкеМДЛПТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И (ЕСТЬNULL(УведомлениеОПриемкеМДЛПТовары.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) = ТоварыНаСкладахОстатки.Характеристика)
		|ГДЕ
		|	УведомлениеОПриемкеМДЛПТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Серия КАК Серия,
		|	ЕСТЬNULL(Товары.GTIN, """") КАК GTIN,
		|	ЕСТЬNULL(Товары.НомерСерии, """") КАК НомерСерии,
		|	Товары.Цена КАК Цена,
		|	1 КАК Количество,
		|	ЕСТЬNULL(Товары.Остаток, 0) КАК Остаток,
		|	ЕСТЬNULL(Марки.НомерКИЗ, """") КАК Марка,
		|	"""" КАК Короб,
		|	"""" КАК Палета
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Марки КАК Марки
		|		ПО Товары.ИдентификаторСтроки = Марки.ИдентификаторСтроки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Товары.Номенклатура,
		|	Товары.Характеристика,
		|	Товары.Серия,
		|	ЕСТЬNULL(Товары.GTIN, """"),
		|	ЕСТЬNULL(Товары.НомерСерии, """"),
		|	Товары.Цена,
		|	1,
		|	ЕСТЬNULL(Товары.Остаток, 0),
		|	ЕСТЬNULL(Марки.НомерКИЗ, """"),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Марки.НомерКороба, """") = """"
		|			ТОГДА ЕСТЬNULL(Упаковки.НомерУпаковки, """")
		|		ИНАЧЕ ЕСТЬNULL(Марки.НомерКороба, """")
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Марки.НомерКороба, """") = """"
		|			ТОГДА """"
		|		ИНАЧЕ ЕСТЬNULL(Упаковки.НомерУпаковки, """")
		|	КОНЕЦ
		|ИЗ
		|	ТоварыУпаковок КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Марки КАК Марки
		|		ПО Товары.ИдентификаторСтрокиУпаковки = Марки.ИдентификаторСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Упаковки КАК Упаковки
		|		ПО Товары.ИдентификаторСтроки = Упаковки.ИдентификаторСтроки
		|			И (Упаковки.НомерУпаковки <> ЕСТЬNULL(Марки.НомерКороба, """"))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.Номенклатура КАК Номенклатура,
		|	ВременнаяТаблица.Характеристика КАК Характеристика,
		|	ВременнаяТаблица.Серия КАК Серия,
		|	ВременнаяТаблица.GTIN КАК GTIN,
		|	ВременнаяТаблица.НомерСерии КАК НомерСерии,
		|	СРЕДНЕЕ(ВременнаяТаблица.Цена) КАК Цена,
		|	СУММА(ВременнаяТаблица.Количество) КАК Количество,
		|	СУММА(ВременнаяТаблица.Остаток) КАК Остаток,
		|	ВременнаяТаблица.Короб КАК Короб,
		|	ВременнаяТаблица.Палета КАК Палета,
		|	"""" КАК Марка
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|
		|СГРУППИРОВАТЬ ПО
		|	ВременнаяТаблица.Номенклатура,
		|	ВременнаяТаблица.Характеристика,
		|	ВременнаяТаблица.Серия,
		|	ВременнаяТаблица.GTIN,
		|	ВременнаяТаблица.НомерСерии,
		|	ВременнаяТаблица.Короб,
		|	ВременнаяТаблица.Палета";
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаДок.ИсходныйДокумент);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл			
			ЗаполнитьСтрокуДокаМаркировкаМДЛП(ОбъектСписка, Выборка, Выборка.Количество, Истина);						
		КонецЦикла;
		
		Возврат;
		
	Иначе
		
		//МАРКИ
		ЗапросТоваров = Новый Запрос;
		ЗапросТоваров.Текст =
		
		"ВЫБРАТЬ
		|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) КАК ВНаличииОстаток,
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ТоварыНаСкладахОстатки
		|ИЗ
		|  РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика	
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////	
		|ВЫБРАТЬ
		|	УведомлениеОПриемкеМДЛПТовары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(УведомлениеОПриемкеМДЛПТовары.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
		|	УведомлениеОПриемкеМДЛПТовары.Серия КАК Серия,
		|	УведомлениеОПриемкеМДЛПТовары.GTIN КАК GTIN,
		|	УведомлениеОПриемкеМДЛПТовары.НомерСерии КАК НомерСерии,
		|	УведомлениеОПриемкеМДЛПТовары.Цена КАК Цена,
		|	"""" КАК Короб,
		|	УведомлениеОПриемкеМДЛПТовары.КоличествоУпаковок КАК Количество,
		|	УведомлениеОПриемкеМДЛПТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток,0) КАК Остаток
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	Документ.УведомлениеОПриемкеМДЛП.Товары КАК УведомлениеОПриемкеМДЛПТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаСкладахОстатки КАК ТоварыНаСкладахОстатки
		|		ПО УведомлениеОПриемкеМДЛПТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И (ЕСТЬNULL(УведомлениеОПриемкеМДЛПТовары.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) = ТоварыНаСкладахОстатки.Характеристика)
		|ГДЕ
		|	УведомлениеОПриемкеМДЛПТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УведомлениеОПриемкеМДЛПНомераУпаковок.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	УведомлениеОПриемкеМДЛПНомераУпаковок.НомерКИЗ КАК НомерКИЗ,
		|	УведомлениеОПриемкеМДЛПНомераУпаковок.НомерРодительскойУпаковки КАК НомерКороба
		|ПОМЕСТИТЬ Марки
		|ИЗ
		|	Документ.УведомлениеОПриемкеМДЛП.НомераУпаковок КАК УведомлениеОПриемкеМДЛПНомераУпаковок
		|ГДЕ
		|	УведомлениеОПриемкеМДЛПНомераУпаковок.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УведомлениеОПриемкеМДЛПТранспортныеУпаковки.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	УведомлениеОПриемкеМДЛПТранспортныеУпаковки.НомерУпаковки КАК НомерУпаковки
		|ПОМЕСТИТЬ Упаковки
		|ИЗ
		|	Документ.УведомлениеОПриемкеМДЛП.ТранспортныеУпаковки КАК УведомлениеОПриемкеМДЛПТранспортныеУпаковки
		|ГДЕ
		|	УведомлениеОПриемкеМДЛПТранспортныеУпаковки.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УведомлениеОПриемкеМДЛПТовары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(УведомлениеОПриемкеМДЛПТовары.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
		|	УведомлениеОПриемкеМДЛПТовары.Серия КАК Серия,
		|	УведомлениеОПриемкеМДЛПТовары.GTIN КАК GTIN,
		|	УведомлениеОПриемкеМДЛПТовары.НомерСерии КАК НомерСерии,
		|	УведомлениеОПриемкеМДЛПТовары.Цена КАК Цена,
		|	УведомлениеОПриемкеМДЛПТовары.Количество КАК Количество,
		|	УведомлениеОПриемкеМДЛПТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	УведомлениеОПриемкеМДЛПТовары.ИдентификаторСтрокиУпаковки КАК ИдентификаторСтрокиУпаковки,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток,0) КАК Остаток
		|ПОМЕСТИТЬ ТоварыУпаковок
		|ИЗ
		|	Документ.УведомлениеОПриемкеМДЛП.СоставТранспортныхУпаковок КАК УведомлениеОПриемкеМДЛПТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаСкладахОстатки КАК ТоварыНаСкладахОстатки
		|		ПО УведомлениеОПриемкеМДЛПТовары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|			И (ЕСТЬNULL(УведомлениеОПриемкеМДЛПТовары.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) = ТоварыНаСкладахОстатки.Характеристика)
		|ГДЕ
		|	УведомлениеОПриемкеМДЛПТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Серия КАК Серия,
		|	ЕСТЬNULL(Товары.GTIN, """") КАК GTIN,
		|	ЕСТЬNULL(Товары.НомерСерии, """") КАК НомерСерии,
		|	Товары.Цена КАК Цена,
		|	Товары.Количество КАК Количество,
		|	ЕСТЬNULL(Товары.Остаток, 0) КАК Остаток,
		|	ЕСТЬNULL(Марки.НомерКИЗ, """") КАК Марка,
		|	"""" КАК Короб,
		|	"""" КАК Палета
		|ИЗ
		|	Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Марки КАК Марки
		|		ПО Товары.ИдентификаторСтроки = Марки.ИдентификаторСтроки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Товары.Номенклатура,
		|	Товары.Характеристика,
		|	Товары.Серия,
		|	ЕСТЬNULL(Товары.GTIN, """"),
		|	ЕСТЬNULL(Товары.НомерСерии, """"),
		|	Товары.Цена,
		|	Товары.Количество,
		|	ЕСТЬNULL(Товары.Остаток, 0),
		|	ЕСТЬNULL(Марки.НомерКИЗ, """"),
		|	ВЫБОР КОГДА ЕСТЬNULL(Марки.НомерКороба, """") ="""" ТОГДА ЕСТЬNULL(Упаковки.НомерУпаковки, """") ИНАЧЕ ЕСТЬNULL(Марки.НомерКороба, """") КОНЕЦ,
		|	ВЫБОР КОГДА ЕСТЬNULL(Марки.НомерКороба, """") ="""" ТОГДА """" ИНАЧЕ ЕСТЬNULL(Упаковки.НомерУпаковки, """") КОНЕЦ
		|ИЗ
		|	ТоварыУпаковок КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Марки КАК Марки
		|		ПО Товары.ИдентификаторСтрокиУпаковки = Марки.ИдентификаторСтроки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Упаковки КАК Упаковки
		|		ПО Товары.ИдентификаторСтроки = Упаковки.ИдентификаторСтроки
		|		И  Упаковки.НомерУпаковки<>ЕСТЬNULL(Марки.НомерКороба,"""")
		|ИТОГИ
		|	СРЕДНЕЕ(Цена),
		|	СРЕДНЕЕ(Количество),
		|	СРЕДНЕЕ(Остаток)
		|ПО
		|	Номенклатура,
		|	Характеристика";
		
	КонецЕсли;

	ЗапросТоваров.УстановитьПараметр("Ссылка", СсылкаНаДок.ИсходныйДокумент); 
	
	ВыборкаТоваров = ЗапросТоваров.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	Пока ВыборкаТоваров.Следующий() Цикл
		
		ВыборкаХарактеристик = ВыборкаТоваров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаХарактеристик.Следующий() Цикл
			
			ВыборкаМарок = ВыборкаХарактеристик.Выбрать();
			
			Пока ВыборкаМарок.Следующий() Цикл
				ЗаполнитьСтрокуДокаМаркировкаМДЛП(ОбъектСписка, ВыборкаМарок, 1);			
			КонецЦикла;
			
			//Если ВыборкаМарок.Количество() < ВыборкаХарактеристик.Количество Тогда
			//	ЗаполнитьСтрокуДокаМаркировкаМДЛП(ОбъектСписка, 
			//	ВыборкаХарактеристик, (ВыборкаХарактеристик.Количество - ВыборкаМарок.Количество()), Истина);		
			//КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	
	
		
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуДокаМаркировкаМДЛП(ОбъектСписка, ВыборкаТоваров, Количество, БезМарок = Ложь)
	
	СтруктураТекущейСтроки = Новый Структура;
	
	ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","id");
	Если ЗначениеЗаполнено(ВыборкаТоваров.Характеристика) Тогда
		ОбъектТовара.id = "8U-" + XMLСтрока(ВыборкаТоваров.Номенклатура) + XMLСтрока(ВыборкаТоваров.Характеристика);
		Попытка ОбъектТовара.parent_id = ?(XMLСтрока(ВыборкаТоваров.Характеристика) = "00000000-0000-0000-0000-000000000000", "", "8U-" + XMLСтрока(ВыборкаТоваров.Номенклатура) + "00000000-0000-0000-0000-000000000000"); Исключение КонецПопытки;
	Иначе
		ОбъектТовара.id = "8U-" + XMLСтрока(ВыборкаТоваров.Номенклатура) + "00000000-0000-0000-0000-000000000000";
	КонецЕсли;
			
	СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
	
	
	
	Попытка
		Если БезМарок Тогда
			sn = "";
		Иначе
			sn = ВыборкаТоваров.НомерСерии;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(sn) Тогда
			СтруктураТекущейСтроки.Вставить("sn", sn);
		КонецЕсли;
	Исключение
	КонецПопытки;
			
			
	limit_qty = ВыборкаТоваров.Остаток;
	
	Если БезМарок Тогда
		qty = Количество;	
	Иначе
		qty = 1;
	КонецЕсли;
	
	price = ВыборкаТоваров.Цена;
		
	СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
	СтруктураТекущейСтроки.Вставить("qty", qty);
	
	
	
	Если БезМарок Тогда
	Иначе	
				
		ОбъектМаркировка = ПолучитьСтруктуруОбъектаДляHttp("marking");
		ЧистаяМарка = "";
		Если ВыборкаТоваров.Марка <> "" Тогда
			ЧистаяМарка = ДатаМобайл_МДЛП.ДобавитьВМаркуУпрСимволы(ВыборкаТоваров.Марка);
		КонецЕсли;
		ОбъектМаркировка.mark = ЧистаяМарка;
		
		Если ЗначениеЗаполнено(ОбъектМаркировка.mark) Тогда
			СтруктураТекущейСтроки.Вставить("marking", ОбъектМаркировка);
		КонецЕсли;
		
		
		Если СтрДлина(ВыборкаТоваров.Короб)=18 Тогда
			box_pack = "00"+ВыборкаТоваров.Короб;
		Иначе
			box_pack = ВыборкаТоваров.Короб;
		КонецЕсли;
		Если ЗначениеЗаполнено(box_pack) Тогда
			СтруктураТекущейСтроки.Вставить("box_pack", box_pack);
		КонецЕсли;
		
		
		Если СтрДлина(ВыборкаТоваров.Палета)=18 Тогда
			pack = "00"+ВыборкаТоваров.Палета;
		Иначе
			pack = ВыборкаТоваров.Палета;
		КонецЕсли;
		Если ЗначениеЗаполнено(pack) Тогда
			СтруктураТекущейСтроки.Вставить("pack", pack);
		КонецЕсли;
		
	КонецЕсли;
	

	
	ОбъектСписка.Добавить(СтруктураТекущейСтроки);
	
КонецПроцедуры

Процедура GetDocRowsSelectOrderToReplace(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок)   //!!!
	
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	ТаблицаТоваровВДокументе.Номенклатура КАК Номенклатура,
	                    |	ТаблицаТоваровВДокументе.Характеристика КАК Характеристика,
	                    |	&УсловиеСерия КАК Серия,
	                    |	&УсловиеЦена КАК Цена,
	                    |	СУММА(ВЫБОР
	                    |			КОГДА ЕСТЬNULL(ТаблицаТоваровВДокументе.Количество, 0) = 0
	                    |				ТОГДА ТаблицаТоваровВДокументе.КоличествоУпаковок
	                    |			ИНАЧЕ ЕСТЬNULL(ТаблицаТоваровВДокументе.Количество, 0)
	                    |		КОНЕЦ) КАК Количество,
	                    |	МИНИМУМ(ТаблицаТоваровВДокументе.НомерСтроки) КАК НомерСтроки
	                    |ПОМЕСТИТЬ ТаблицаТоваровВДокументе1С
	                    |ИЗ
	                    |	Документ.ПриходныйОрдерНаТовары.Товары КАК ТаблицаТоваровВДокументе
	                    |ГДЕ
	                    |	ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ТаблицаТоваровВДокументе.Номенклатура,
	                    |	ТаблицаТоваровВДокументе.Характеристика,
						|	&УсловиеСерия
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
	                    |	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК Характеристика,
	                    |	СУММА(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество) КАК Количество
	                    |ПОМЕСТИТЬ РезервыТСД
	                    |ИЗ
	                    |	Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	                    |ГДЕ
	                    |	ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка <> &Ссылка
	                    |	И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.Шаблон.РезервироватьТовар
	                    |	И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
	                    |	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	СвободныеОстатки.Номенклатура КАК Номенклатура,
	                    |	СвободныеОстатки.Характеристика КАК Характеристика,
	                    |	СвободныеОстатки.Серия КАК Серия,
	                    |	СУММА(ЕСТЬNULL(СвободныеОстатки.ВНаличииОстаток, 0)) КАК ВНаличииОстатокСерии
	                    |ПОМЕСТИТЬ ТоварыНаСкладахОстаткиСерии
	                    |ИЗ
	                    |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	                    |			,
	                    |			Номенклатура В
	                    |					(ВЫБРАТЬ
	                    |						ТаблицаТоваровВДокументе.Номенклатура КАК Номенклатура
	                    |					ИЗ
	                    |						ТаблицаТоваровВДокументе1С КАК ТаблицаТоваровВДокументе)
	                    |				И (&ВсеСклады
	                    |					ИЛИ Склад В (&Склады))
						|				И (&ВсеПомещения
	              		|					ИЛИ Помещение В (&Помещения))) КАК СвободныеОстатки
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	СвободныеОстатки.Номенклатура,
	                    |	СвободныеОстатки.Характеристика,
	                    |	СвободныеОстатки.Серия
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	                    |	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
	                    |	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстатокСерии, 0)) КАК ВНаличииОстаток
	                    |ПОМЕСТИТЬ ТоварыНаСкладахОстатки
	                    |ИЗ
	                    |	ТоварыНаСкладахОстаткиСерии КАК ТоварыНаСкладахОстатки
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ТоварыНаСкладахОстатки.Номенклатура,
	                    |	ТоварыНаСкладахОстатки.Характеристика
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ЗаказыНаПеремещениеОстатки.Номенклатура КАК Номенклатура,
	                    |	ЗаказыНаПеремещениеОстатки.Характеристика КАК Характеристика,
	                    |	ЗаказыНаПеремещениеОстатки.Серия КАК Серия,
	                    |	ЗаказыНаПеремещениеОстатки.ЗаказаноОстаток КАК ОстатокНаПеремещение
	                    |ПОМЕСТИТЬ ОстаткиЗаказовНаПеремещение
	                    |ИЗ
	                    |	РегистрНакопления.ЗаказыНаПеремещение.Остатки(&ДатаКонтроля, ЗаказНаПеремещение = &ИсходныйДокумент) КАК ЗаказыНаПеремещениеОстатки
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ТаблицаТоваровВДокументе1С.Номенклатура КАК Номенклатура,
	                    |	ТаблицаТоваровВДокументе1С.Характеристика КАК Характеристика,
	                    |	ТаблицаТоваровВДокументе1С.Цена КАК Цена,
	                    |	СУММА(ЕСТЬNULL(ОстаткиЗаказовНаПеремещение.ОстатокНаПеремещение,0)) КАК Количество,
	                    |	ТаблицаТоваровВДокументе1С.НомерСтроки КАК НомерСтроки,
	                    |	ТаблицаТоваровВДокументе1С.Серия КАК Серия,
	                    |	СУММА(ТоварыНаСкладахОстаткиСерии.ВНаличииОстатокСерии) КАК ОстатокПоСерии,
	                    |	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(РезервыТСД.Количество, 0)) КАК Лимит
	                    |ИЗ
	                    |	ТаблицаТоваровВДокументе1С КАК ТаблицаТоваровВДокументе1С
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ РезервыТСД КАК РезервыТСД
	                    |		ПО ТаблицаТоваровВДокументе1С.Номенклатура = РезервыТСД.Номенклатура
	                    |			И ТаблицаТоваровВДокументе1С.Характеристика = РезервыТСД.Характеристика
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаСкладахОстаткиСерии КАК ТоварыНаСкладахОстаткиСерии
	                    |		ПО ТаблицаТоваровВДокументе1С.Номенклатура = ТоварыНаСкладахОстаткиСерии.Номенклатура
	                    |			И ТаблицаТоваровВДокументе1С.Характеристика = ТоварыНаСкладахОстаткиСерии.Характеристика
	                    |			И ТаблицаТоваровВДокументе1С.Серия = ТоварыНаСкладахОстаткиСерии.Серия
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаСкладахОстатки КАК ТоварыНаСкладахОстатки
	                    |		ПО ТаблицаТоваровВДокументе1С.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	                    |			И ТаблицаТоваровВДокументе1С.Характеристика = ТоварыНаСкладахОстатки.Характеристика
						|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиЗаказовНаПеремещение КАК ОстаткиЗаказовНаПеремещение
	                    |			ПО ТаблицаТоваровВДокументе1С.Номенклатура = ОстаткиЗаказовНаПеремещение.Номенклатура
	                    |			И ТаблицаТоваровВДокументе1С.Характеристика = ОстаткиЗаказовНаПеремещение.Характеристика
	                    |			И ТаблицаТоваровВДокументе1С.Серия = ОстаткиЗаказовНаПеремещение.Серия
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ТаблицаТоваровВДокументе1С.Номенклатура,
	                    |	ТаблицаТоваровВДокументе1С.Характеристика,
	                    |	ТаблицаТоваровВДокументе1С.Цена,
	                    |	ТаблицаТоваровВДокументе1С.Количество,
	                    |	ТаблицаТоваровВДокументе1С.НомерСтроки,
	                    |	ТаблицаТоваровВДокументе1С.Серия
	                    |
						//|ИМЕЮЩИЕ
						//|	ТаблицаТоваровВДокументе1С.Количество - СУММА(ОстаткиЗаказовНаПеремещение.ОстатокНаПеремещение) > 0
						|
	                    |УПОРЯДОЧИТЬ ПО
	                    |	НомерСтроки");


	
		Запрос.УстановитьПараметр("ДатаКонтроля",СсылкаНаДок.ДатаСоздания);
		Запрос.УстановитьПараметр("Ссылка",СсылкаНаДок);
		Запрос.УстановитьПараметр("ИсходныйДокумент",СсылкаНаДок.ИсходныйДокумент);
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".ПриходныйОрдерНаТовары.","."+Шаблон.ВидДокумента+".");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".Товары КАК ","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК ");
		
		//Если у документа есть склад берем остатки по складу документа иначе склады из настроек ТСД
		СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
		Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
			СписокСкладов.Очистить();
			СписокСкладов.Добавить(СсылкаНаДок.Склад);			
		КонецЕсли;
		Запрос.УстановитьПараметр("Склады",СписокСкладов);
		Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
		
		СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
		Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
			СписокПомещений.Очистить();
			СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
		КонецЕсли;
		Запрос.УстановитьПараметр("Помещения",СписокПомещений);
		Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);

		Запрос.УстановитьПараметр("Документы",СсылкаНаДок.Задания.ВыгрузитьКолонку("Задание"));

		
		Попытка
			ЕстьЦены = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Цена")<>Неопределено;
		Исключение
			ЕстьЦены = Ложь;
		КонецПопытки;

		
		Если ЕстьЦены Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеЦена","ТаблицаТоваровВДокументе.Цена");
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеЦена","0");
		КонецЕсли;
		
		
		Попытка
			ЕстьСерии = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Серия")<>Неопределено;
		Исключение
			ЕстьСерии = Ложь;
		КонецПопытки;
		
		Если ЕстьСерии Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеСерия","ТаблицаТоваровВДокументе.Серия");
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеСерия","Значение(Справочник.СерииНоменклатуры.ПустаяСсылка)");
		КонецЕсли;

		
		Попытка
			ЕстьКоличествоУпаковок = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("КоличествоУпаковок")<>Неопределено;
		Исключение
			ЕстьКоличествоУпаковок = Ложь;
		КонецПопытки;

		Если ЕстьКоличествоУпаковок Тогда
			Если УзелПО.НеИспользоватьПересчетУпаковок Тогда
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Количество,","ТаблицаТоваровВДокументе.КоличествоУпаковок,");
			КонецЕсли;			
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.КоличествоУпаковок","ТаблицаТоваровВДокументе.Количество");
		КонецЕсли;
		
			
		Если Шаблон.ВидДокумента = "ЗаказПоставщику" Тогда
			Попытка
				ЕстьОтменено = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Отменено")<>Неопределено;
			Исключение
				ЕстьОтменено = Ложь;
			КонецПопытки;
			
			Если ЕстьОтменено Тогда
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент","ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент И НЕ ТаблицаТоваровВДокументе.Отменено");
			КонецЕсли;	
		ИначеЕсли Шаблон.ВидДокумента = "ЗаказКлиента" Тогда
			Попытка
				ЕстьОтменено = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Отменено")<>Неопределено и Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("ВариантОбеспечения")<>Неопределено;
			Исключение
				ЕстьОтменено = Ложь;
			КонецПопытки;
			
			Если ЕстьОтменено Тогда
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент","ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент И НЕ ТаблицаТоваровВДокументе.Отменено"); //И ТаблицаТоваровВДокументе.ВариантОбеспечения<>ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)");
			КонецЕсли;		
		КонецЕсли;

		Если Шаблон.ВидДокумента = "ПересчетТоваров" и УзелПО.НеОтображатьОстатки Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.КоличествоУпаковок","0");
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Количество","0");
		КонецЕсли;	
		
		Если Шаблон.МножествоДокументовКакЗадание Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент", "ТаблицаТоваровВДокументе.Ссылка В(&Документы)");
	    КонецЕсли;		

		Если Шаблон.ИспользоватьМаркировку и Шаблон.МаркировкаЗапретитьПодборНемаркируемыхТоваров Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент","ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент 
													|   	И
													|   	(
													|   	(ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПустаяСсылка) 
													|   	И ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция)
													|   	И ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.СодержитДрагоценныеМатериалы)
													|   	И ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.КиЗГИСМ)
													|   	И ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПодконтрольнаяПродукцияВЕТИС)
													|   	И ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОрганизациейПродавцом)
													|   	И ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОрганизациейПоАгентскойСхеме)
													|   	И ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Партнером)
													|   	И ТаблицаТоваровВДокументе.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета))
													|   	ИЛИ
													|   	(ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПустаяСсылка) 
													|   	И ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция)
													|   	И ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.СодержитДрагоценныеМатериалы)
													|   	И ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.КиЗГИСМ)
													|   	И ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ПодконтрольнаяПродукцияВЕТИС)
													|   	И ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОрганизациейПродавцом)
													|   	И ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОрганизациейПоАгентскойСхеме)
													|   	И ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Партнером)
													|   	И ТаблицаТоваровВДокументе.Номенклатура.ВидНоменклатуры.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета))
													|   	)");
			
		КонецЕсли;	
		
		
	Рез=Запрос.Выполнить().Выгрузить();
		
	Для Каждого СтрокаДока из Рез цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаДока.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураТекущейСтроки = Новый Структура;

		ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","id");
		Если ЗначениеЗаполнено(СтрокаДока.Характеристика) Тогда
			ОбъектТовара.id  = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(СтрокаДока.Характеристика);
			Попытка ОбъектТовара.parent_id = ?(XMLСтрока(СтрокаДока.Характеристика) = "00000000-0000-0000-0000-000000000000", "", "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + "00000000-0000-0000-0000-000000000000"); Исключение КонецПопытки;
		Иначе
			ОбъектТовара.id  = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + "00000000-0000-0000-0000-000000000000";
		КонецЕсли;
		СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
		
			
		Попытка
			Если ЗначениеЗаполнено(СтрокаДока.Серия) Тогда
				sn = ПолучитьЗначениеСерии(Шаблон, СтрокаДока.Номенклатура, СтрокаДока.Серия);
				СтруктураТекущейСтроки.Вставить("sn", sn);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Попытка
			ДопускВесовогоТовара =  ПолучитьДопускВесовогоТовара(СтрокаДока.Номенклатура, СсылкаНаДок.Клиент);
		Исключение
			ДопускВесовогоТовара = Неопределено;
		КонецПопытки;
		
		Если ДопускВесовогоТовара<>Неопределено тогда
			СтруктураТекущейСтроки.Вставить("weight_task", ДопускВесовогоТовара);
		КонецЕсли;		
		
		ЭтоУслуга = Ложь;
		Попытка 
			Если СтрокаДока.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				ЭтоУслуга = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
			
		limit_qty=0;	
		Если УзелПО.НеОтображатьОстатки Тогда
			limit_qty=0;
		ИначеЕсли ЭтоУслуга Тогда
			limit_qty=999;	
		Иначе	
			Попытка
				Итог = СтрокаДока.Лимит;
				limit_qty=Итог;
			Исключение
				limit_qty=0;
			КонецПопытки;
		КонецЕсли;
		
		qty=СтрокаДока.Количество;
		
		price=СтрокаДока.Цена;
		
		
		СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
		СтруктураТекущейСтроки.Вставить("qty", qty);
		СтруктураТекущейСтроки.Вставить("price", price);
	
		ОбъектСписка.Добавить(СтруктураТекущейСтроки);
			
	КонецЦикла;
	
КонецПроцедуры

Процедура GetDocRowsSborka_Select(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок)

	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	ЗапросСЛимитами.Номенклатура КАК Номенклатура,
	                    |	ЗапросСЛимитами.Характеристика КАК Характеристика,
	                    |	ЗапросСЛимитами.Серия КАК Серия,
	                    |	ЗапросСЛимитами.Цена КАК Цена,
	                    |	СУММА(ЗапросСЛимитами.Количество) КАК Количество,
	                    |	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(РезервыТСД.Количество, 0)) КАК Лимит,
	                    |	МИНИМУМ(ЗапросСЛимитами.НомерСтроки) КАК НомерСтроки
	                    |ПОМЕСТИТЬ ТоварыОстатки
	                    |ИЗ
	                    |	(ВЫБРАТЬ
	                    |		ТаблицаТоваровВДокументе.Номенклатура КАК Номенклатура,
	                    |		ТаблицаТоваровВДокументе.Характеристика КАК Характеристика,
	                    |		&УсловиеСерия КАК Серия,
	                    |		&УсловиеЦена КАК Цена,
	                    |		СУММА(ВЫБОР
	                    |				КОГДА ЕСТЬNULL(ТаблицаТоваровВДокументе.Количество, 0) = 0
	                    |					ТОГДА ТаблицаТоваровВДокументе.КоличествоУпаковок
	                    |				ИНАЧЕ ЕСТЬNULL(ТаблицаТоваровВДокументе.Количество, 0)
	                    |			КОНЕЦ) КАК Количество,
	                    |		МИНИМУМ(ТаблицаТоваровВДокументе.НомерСтроки) КАК НомерСтроки
	                    |	ИЗ
	                    |		Документ.СборкаТоваров.Товары КАК ТаблицаТоваровВДокументе
	                    |	ГДЕ
	                    |		ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент
	                    |	
	                    |	СГРУППИРОВАТЬ ПО
	                    |		ТаблицаТоваровВДокументе.Номенклатура,
	                    |		ТаблицаТоваровВДокументе.Характеристика,
						|		&УсловиеСерия,
						|		&УсловиеЦена) КАК ЗапросСЛимитами
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	                    |				,
	                    |				&ВсеСклады
	                    |					ИЛИ Склад В (&Склады)
	                    |					ИЛИ Помещение В (&Склады)) КАК СвободныеОстаткиОстатки
	                    |		ПО ЗапросСЛимитами.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
	                    |			И ЗапросСЛимитами.Характеристика = СвободныеОстаткиОстатки.Характеристика
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                    |			СУММА(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество) КАК Количество
	                    |		ИЗ
	                    |			Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	                    |		ГДЕ
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка <> &Ссылка
	                    |			И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.Шаблон.РезервироватьТовар
	                    |			И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	                    |		
	                    |		СГРУППИРОВАТЬ ПО
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры) КАК РезервыТСД
	                    |		ПО ЗапросСЛимитами.Номенклатура = РезервыТСД.Номенклатура
	                    |			И ЗапросСЛимитами.Характеристика = РезервыТСД.ХарактеристикаНоменклатуры
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ЗапросСЛимитами.Номенклатура,
	                    |	ЗапросСЛимитами.Характеристика,
	                    |	ЗапросСЛимитами.Серия,
	                    |	ЗапросСЛимитами.Цена
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	СУММА(ЕСТЬNULL(СвободныеОстатки.ВНаличииОстаток, 0)) КАК ВНаличииОстаток,
	                    |	СвободныеОстатки.Номенклатура КАК Номенклатура,
	                    |	СвободныеОстатки.Характеристика КАК Характеристика,
	                    |	СвободныеОстатки.Серия КАК Серия
	                    |ПОМЕСТИТЬ ТоварыНаСкладахОстатки
	                    |ИЗ
	                    |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	                    |			,
	                    |			Номенклатура В
	                    |					(ВЫБРАТЬ
	                    |						ТоварыОстатки.Номенклатура КАК Номенклатура
	                    |					ИЗ
	                    |						ТоварыОстатки КАК ТоварыОстатки)
	                    |				И (&ВсеСклады
	                    |					ИЛИ Склад В (&Склады)
	                    |					ИЛИ Помещение В (&Склады))) КАК СвободныеОстатки
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	СвободныеОстатки.Номенклатура,
	                    |	СвободныеОстатки.Характеристика,
	                    |	СвободныеОстатки.Серия
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ТоварыОстатки.Номенклатура КАК Номенклатура,
	                    |	ТоварыОстатки.Характеристика КАК Характеристика,
	                    |	ТоварыОстатки.Серия КАК Серия,
	                    |	ТоварыОстатки.Цена КАК Цена,
	                    |	ТоварыОстатки.Количество КАК Количество,
	                    |	ТоварыОстатки.Лимит КАК Лимит,
	                    |	ТоварыОстатки.НомерСтроки КАК НомерСтроки,
	                    |	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)) КАК ОстатокПоСерии
	                    |ИЗ
	                    |	ТоварыОстатки КАК ТоварыОстатки
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаСкладахОстатки КАК ТоварыНаСкладахОстатки
	                    |		ПО ТоварыОстатки.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	                    |			И ТоварыОстатки.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	                    |			И ТоварыОстатки.Серия = ТоварыНаСкладахОстатки.Серия
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ТоварыОстатки.Номенклатура,
	                    |	ТоварыОстатки.Характеристика,
	                    |	ТоварыОстатки.Серия,
	                    |	ТоварыОстатки.Цена,
	                    |	ТоварыОстатки.Количество,
	                    |	ТоварыОстатки.Лимит,
	                    |	ТоварыОстатки.НомерСтроки");


		Запрос.УстановитьПараметр("Ссылка",СсылкаНаДок);
		Запрос.УстановитьПараметр("ИсходныйДокумент",СсылкаНаДок.ИсходныйДокумент);
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".ПриходныйОрдерНаТовары.","."+Шаблон.ВидДокумента+".");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".Товары КАК ","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК ");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".ТТНВходящаяЕГАИС.","."+Шаблон.ВидДокумента+".");
		
		//Если у документа есть склад берем остатки по складу документа иначе склады из настроек ТСД
		СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
		Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
			СписокСкладов.Очистить();
			СписокСкладов.Добавить(СсылкаНаДок.Склад);			
		КонецЕсли;
		Запрос.УстановитьПараметр("Склады",СписокСкладов);
		Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
		
		СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
		Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
			СписокПомещений.Очистить();
			СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
		КонецЕсли;
		Запрос.УстановитьПараметр("Помещения",СписокПомещений);
		Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);

		
		
		Попытка
			ЕстьЦены = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Цена")<>Неопределено;
		Исключение
			ЕстьЦены = Ложь;
		КонецПопытки;
		
	
		Если ЕстьЦены Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеЦена","ТаблицаТоваровВДокументе.Цена");
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеЦена","0");
		КонецЕсли;
		
		
		Попытка
			ЕстьСерии = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Серия")<>Неопределено;
		Исключение
			ЕстьСерии = Ложь;
		КонецПопытки;
		
		Если ЕстьСерии Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеСерия","ТаблицаТоваровВДокументе.Серия");
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеСерия","Значение(Справочник.СерииНоменклатуры.ПустаяСсылка)");
		КонецЕсли;

		
		Попытка
			ЕстьКоличествоУпаковок = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("КоличествоУпаковок")<>Неопределено;
		Исключение
			ЕстьКоличествоУпаковок = Ложь;
		КонецПопытки;

		Если ЕстьКоличествоУпаковок Тогда
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.КоличествоУпаковок","ТаблицаТоваровВДокументе.Количество");
		КонецЕсли;
			
		
		Если Шаблон.ВидДокумента = "ЗаказПоставщику" Тогда
			Попытка
				ЕстьОтменено = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Отменено")<>Неопределено;
			Исключение
				ЕстьОтменено = Ложь;
			КонецПопытки;
			
			Если ЕстьОтменено Тогда
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент","ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент И НЕ ТаблицаТоваровВДокументе.Отменено");
			КонецЕсли;	
		ИначеЕсли Шаблон.ВидДокумента = "ЗаказКлиента" Тогда
			Попытка
				ЕстьОтменено = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Отменено")<>Неопределено и Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("ВариантОбеспечения")<>Неопределено;
			Исключение
				ЕстьОтменено = Ложь;
			КонецПопытки;
			
			Если ЕстьОтменено Тогда
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент","ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент И НЕ ТаблицаТоваровВДокументе.Отменено И ТаблицаТоваровВДокументе.ВариантОбеспечения<>ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)");
			КонецЕсли;		
		КонецЕсли;



		Если УзелПО.ПоСвободнымОстаткам Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"РегистрНакопления.ТоварыНаСкладах.Остатки","РегистрНакопления.СвободныеОстатки.Остатки");
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"СвободныеОстаткиОстатки.КОтгрузкеОстаток","СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток+СвободныеОстаткиОстатки.ВРезервеПодЗаказОстаток");
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ИЛИ Помещение В (&Склады)","");
		КонецЕсли;	
		
	Рез=Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаДока из Рез цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаДока.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураТекущейСтроки = Новый Структура;
		
		ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","id");
		Если ЗначениеЗаполнено(СтрокаДока.Характеристика) Тогда
			ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(СтрокаДока.Характеристика);
			Попытка ОбъектТовара.parent_id = ?(XMLСтрока(СтрокаДока.Характеристика) = "00000000-0000-0000-0000-000000000000", "", "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + "00000000-0000-0000-0000-000000000000"); Исключение КонецПопытки;
		Иначе
			ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + "00000000-0000-0000-0000-000000000000";
		КонецЕсли;
			
		СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
		
		Попытка
			Если ЗначениеЗаполнено(СтрокаДока.Серия) Тогда
				sn = ПолучитьЗначениеСерии(Шаблон, СтрокаДока.Номенклатура, СтрокаДока.Серия);
				СтруктураТекущейСтроки.Вставить("sn", sn);
			КонецЕсли;
		Исключение
		КонецПопытки;	
		
		Попытка
			ДопускВесовогоТовара =  ПолучитьДопускВесовогоТовара(СтрокаДока.Номенклатура, СсылкаНаДок.Клиент);
		Исключение
			ДопускВесовогоТовара = Неопределено;
		КонецПопытки;
		
		Если ДопускВесовогоТовара<>Неопределено тогда
			СтруктураТекущейСтроки.Вставить("weight_task", ДопускВесовогоТовара);
		КонецЕсли;
		
		limit_qty=0;
		Если УзелПО.НеОтображатьОстатки Тогда
			limit_qty=0;
		Иначе	
			Попытка
				Итог = СтрокаДока.Лимит;
				limit_qty=Итог;
			Исключение
				limit_qty=0;
			КонецПопытки;
		КонецЕсли;
		
		qty=СтрокаДока.Количество;
		
		price=СтрокаДока.Цена;
		
		СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
		СтруктураТекущейСтроки.Вставить("qty", qty);
		СтруктураТекущейСтроки.Вставить("price", price);
		
		ОбъектСписка.Добавить(СтруктураТекущейСтроки);
			
	КонецЦикла;

	
КонецПроцедуры

Процедура GetDocRowsSborka_Insert(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок)

	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                    |	ЗапросСЛимитами.Номенклатура КАК Номенклатура,
	                    |	ЗапросСЛимитами.Характеристика КАК Характеристика,
	                    |	ЗапросСЛимитами.Серия КАК Серия,
	                    |	ЗапросСЛимитами.Цена КАК Цена,
	                    |	СУММА(ЗапросСЛимитами.Количество) КАК Количество,
	                    |	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(РезервыТСД.Количество, 0)) КАК Лимит,
	                    |	МИНИМУМ(ЗапросСЛимитами.НомерСтроки) КАК НомерСтроки
	                    |ПОМЕСТИТЬ ТоварыОстатки
	                    |ИЗ
	                    |	(ВЫБРАТЬ
	                    |		ТаблицаТоваровВДокументе.Номенклатура КАК Номенклатура,
	                    |		ТаблицаТоваровВДокументе.Характеристика КАК Характеристика,
	                    |		&УсловиеСерия КАК Серия,
	                    |		&УсловиеЦена КАК Цена,
	                    |		СУММА(ВЫБОР
	                    |				КОГДА ЕСТЬNULL(ТаблицаТоваровВДокументе.Количество, 0) = 0
	                    |					ТОГДА ТаблицаТоваровВДокументе.КоличествоУпаковок
	                    |				ИНАЧЕ ЕСТЬNULL(ТаблицаТоваровВДокументе.Количество, 0)
	                    |			КОНЕЦ) КАК Количество,
	                    |		1 КАК НомерСтроки
	                    |	ИЗ
	                    |		Документ.СборкаТоваров КАК ТаблицаТоваровВДокументе
	                    |	ГДЕ
	                    |		ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент
	                    |	
	                    |	СГРУППИРОВАТЬ ПО
	                    |		ТаблицаТоваровВДокументе.Номенклатура,
	                    |		ТаблицаТоваровВДокументе.Характеристика,
						|		&УсловиеСерия) КАК ЗапросСЛимитами
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	                    |				,
	                    |				&ВсеСклады
	                    |					ИЛИ Склад В (&Склады)
	                    |					ИЛИ Помещение В (&Склады)) КАК СвободныеОстаткиОстатки
	                    |		ПО ЗапросСЛимитами.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
	                    |			И ЗапросСЛимитами.Характеристика = СвободныеОстаткиОстатки.Характеристика
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	                    |			СУММА(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество) КАК Количество,
	                    |			1 КАК Поле1
	                    |		ИЗ
	                    |			Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	                    |		ГДЕ
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка <> &Ссылка
	                    |			И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.Шаблон.РезервироватьТовар
	                    |			И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	                    |		
	                    |		СГРУППИРОВАТЬ ПО
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
	                    |			ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры) КАК РезервыТСД
	                    |		ПО ЗапросСЛимитами.Номенклатура = РезервыТСД.Номенклатура
	                    |			И ЗапросСЛимитами.Характеристика = РезервыТСД.ХарактеристикаНоменклатуры
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ЗапросСЛимитами.Номенклатура,
	                    |	ЗапросСЛимитами.Характеристика,
	                    |	ЗапросСЛимитами.Серия,
	                    |	ЗапросСЛимитами.Цена
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	СУММА(ЕСТЬNULL(СвободныеОстатки.ВНаличииОстаток, 0)) КАК ВНаличииОстаток,
	                    |	СвободныеОстатки.Номенклатура КАК Номенклатура,
	                    |	СвободныеОстатки.Характеристика КАК Характеристика,
	                    |	СвободныеОстатки.Серия КАК Серия
	                    |ПОМЕСТИТЬ ТоварыНаСкладахОстатки
	                    |ИЗ
	                    |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	                    |			,
	                    |			Номенклатура В
	                    |					(ВЫБРАТЬ
	                    |						ТоварыОстатки.Номенклатура КАК Номенклатура
	                    |					ИЗ
	                    |						ТоварыОстатки КАК ТоварыОстатки)
	                    |				И (&ВсеСклады
	                    |					ИЛИ Склад В (&Склады)
	                    |					ИЛИ Помещение В (&Склады))) КАК СвободныеОстатки
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	СвободныеОстатки.Номенклатура,
	                    |	СвободныеОстатки.Характеристика,
	                    |	СвободныеОстатки.Серия
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ТоварыОстатки.Номенклатура КАК Номенклатура,
	                    |	ТоварыОстатки.Характеристика КАК Характеристика,
	                    |	ТоварыОстатки.Серия КАК Серия,
	                    |	ТоварыОстатки.Цена КАК Цена,
	                    |	ТоварыОстатки.Количество КАК Количество,
	                    |	ТоварыОстатки.Лимит КАК Лимит,
	                    |	ТоварыОстатки.НомерСтроки КАК НомерСтроки,
	                    |	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0)) КАК ОстатокПоСерии
	                    |ИЗ
	                    |	ТоварыОстатки КАК ТоварыОстатки
	                    |		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаСкладахОстатки КАК ТоварыНаСкладахОстатки
	                    |		ПО ТоварыОстатки.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	                    |			И ТоварыОстатки.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	                    |			И ТоварыОстатки.Серия = ТоварыНаСкладахОстатки.Серия
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ТоварыОстатки.Номенклатура,
	                    |	ТоварыОстатки.Характеристика,
	                    |	ТоварыОстатки.Серия,
	                    |	ТоварыОстатки.Цена,
	                    |	ТоварыОстатки.Количество,
	                    |	ТоварыОстатки.Лимит,
	                    |	ТоварыОстатки.НомерСтроки");


		Запрос.УстановитьПараметр("Ссылка",СсылкаНаДок);
		Запрос.УстановитьПараметр("ИсходныйДокумент",СсылкаНаДок.ИсходныйДокумент);
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".ПриходныйОрдерНаТовары.","."+Шаблон.ВидДокумента+".");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".Товары КАК ","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК ");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".ТТНВходящаяЕГАИС.","."+Шаблон.ВидДокумента+".");
		
		//Если у документа есть склад берем остатки по складу документа иначе склады из настроек ТСД
		СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
		Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
			СписокСкладов.Очистить();
			СписокСкладов.Добавить(СсылкаНаДок.Склад);			
		КонецЕсли;
		Запрос.УстановитьПараметр("Склады",СписокСкладов);
		Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
		
		СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
		Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
			СписокПомещений.Очистить();
			СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
		КонецЕсли;
		Запрос.УстановитьПараметр("Помещения",СписокПомещений);
		Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);

		
		
		Попытка
			ЕстьЦены = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Цена")<>Неопределено;
		Исключение
			ЕстьЦены = Ложь;
		КонецПопытки;

		
		Если ЕстьЦены Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеЦена","ТаблицаТоваровВДокументе.Цена");
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеЦена","0");
		КонецЕсли;
		
		
		Попытка
			ЕстьСерии = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Серия")<>Неопределено;
		Исключение
			ЕстьСерии = Ложь;
		КонецПопытки;
		
		Если ЕстьСерии Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеСерия","ТаблицаТоваровВДокументе.Серия");
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеСерия","Значение(Справочник.СерииНоменклатуры.ПустаяСсылка)");
		КонецЕсли;

		
		Попытка
			ЕстьКоличествоУпаковок = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("КоличествоУпаковок")<>Неопределено;
		Исключение
			ЕстьКоличествоУпаковок = Ложь;
		КонецПопытки;

		Если ЕстьКоличествоУпаковок Тогда
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.КоличествоУпаковок","ТаблицаТоваровВДокументе.Количество");
		КонецЕсли;
			
		
		Если Шаблон.ВидДокумента = "ЗаказПоставщику" Тогда
			Попытка
				ЕстьОтменено = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Отменено")<>Неопределено;
			Исключение
				ЕстьОтменено = Ложь;
			КонецПопытки;
			
			Если ЕстьОтменено Тогда
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент","ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент И НЕ ТаблицаТоваровВДокументе.Отменено");
			КонецЕсли;	
		ИначеЕсли Шаблон.ВидДокумента = "ЗаказКлиента" Тогда
			Попытка
				ЕстьОтменено = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Отменено")<>Неопределено и Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("ВариантОбеспечения")<>Неопределено;
			Исключение
				ЕстьОтменено = Ложь;
			КонецПопытки;
			
			Если ЕстьОтменено Тогда
				Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент","ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент И НЕ ТаблицаТоваровВДокументе.Отменено И ТаблицаТоваровВДокументе.ВариантОбеспечения<>ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)");
			КонецЕсли;		
		КонецЕсли;



		Если УзелПО.ПоСвободнымОстаткам Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"РегистрНакопления.ТоварыНаСкладах.Остатки","РегистрНакопления.СвободныеОстатки.Остатки");
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"СвободныеОстаткиОстатки.КОтгрузкеОстаток","СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток+СвободныеОстаткиОстатки.ВРезервеПодЗаказОстаток");
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"ИЛИ Помещение В (&Склады)","");
		КонецЕсли;	
		
	Рез=Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаДока из Рез цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаДока.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураТекущейСтроки = Новый Структура;
		
		ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","id");	
		Если ЗначениеЗаполнено(СтрокаДока.Характеристика) Тогда
			ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + СокрЛП(СтрокаДока.Характеристика);
			Попытка ОбъектТовара.parent_id = ?(XMLСтрока(СтрокаДока.Характеристика) = "00000000-0000-0000-0000-000000000000", "", "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + "00000000-0000-0000-0000-000000000000"); Исключение КонецПопытки;
		Иначе
			ОбъектТовара.id = "8U-" + СокрЛП(СтрокаДока.Номенклатура) + "00000000-0000-0000-0000-000000000000";
		КонецЕсли;
				
		СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
		
		Попытка
			Если ЗначениеЗаполнено(СтрокаДока.Серия) Тогда
				sn = ПолучитьЗначениеСерии(Шаблон, СтрокаДока.Номенклатура, СтрокаДока.Серия, Истина);
				СтруктураТекущейСтроки.Вставить("sn", sn);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Попытка
			ДопускВесовогоТовара =  ПолучитьДопускВесовогоТовара(СтрокаДока.Номенклатура, СсылкаНаДок.Клиент);
		Исключение
			ДопускВесовогоТовара = Неопределено;
		КонецПопытки;
		
		Если ДопускВесовогоТовара<>Неопределено тогда
			СтруктураТекущейСтроки.Вставить("weight_task", ДопускВесовогоТовара);
		КонецЕсли;
		
		limit_qty = 0;
		Если УзелПО.НеОтображатьОстатки Тогда
			limit_qty=0;
		Иначе		
			Попытка
				Итог = СтрокаДока.Лимит;
				limit_qty=Итог;
			Исключение
				limit_qty=0;
			КонецПопытки;
		КонецЕсли;
		
		qty=СтрокаДока.Количество;
		
		price=СтрокаДока.Цена;
	
		СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
		СтруктураТекущейСтроки.Вставить("qty", qty);
		СтруктураТекущейСтроки.Вставить("price", price);
		
		ОбъектСписка.Добавить(СтруктураТекущейСтроки);
	КонецЦикла;

	
КонецПроцедуры

Процедура GetDocRowsSelectEGAIS(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок)
	Запрос=Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапросСЛимитами.Номенклатура,
	|	ЛОЖЬ КАК ЭтоХарактеристика,
	|	ЗапросСЛимитами.Цена,
	|	СУММА(ЗапросСЛимитами.Количество) КАК Количество,
	|   СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(РезервыТСД.Количество, 0)) КАК Лимит, 
	|	ЗапросСЛимитами.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗапросСЛимитами.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаТоваровВДокументе.АлкогольнаяПродукция КАК Номенклатура,
	|		&УсловиеЦена КАК Цена,
	|		СУММА(ТаблицаТоваровВДокументе.Количество) КАК Количество,
	|		МИНИМУМ(ТаблицаТоваровВДокументе.НомерСтроки) КАК НомерСтроки,
	|		ТаблицаТоваровВДокументе.Справка2 КАК ИдентификаторСтроки
	|	ИЗ
	|		Документ.ТТНВходящаяЕГАИС.Товары КАК ТаблицаТоваровВДокументе
	|	ГДЕ
	|		ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаТоваровВДокументе.АлкогольнаяПродукция,
	|		ТаблицаТоваровВДокументе.Справка2,
	|		&УсловиеЦена) КАК ЗапросСЛимитами
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|			МАКСИМУМ(СоответствиеНоменклатурыЕГАИС.Номенклатура) КАК Номенклатура
	|		ИЗ
	|			РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция) КАК Товары
	|		ПО (Товары.АлкогольнаяПродукция = ЗапросСЛимитами.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				(&ВсеСклады
	|					ИЛИ Склад В (&Склады))
	|				И (&ВсеПомещения
	|					ИЛИ Помещение В (&Помещения))) КАК ТоварыНаСкладахОстатки
	|		ПО ЗапросСЛимитами.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
	|			СУММА(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество) КАК Количество
	|		ИЗ
	|			Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	|		ГДЕ
	|			ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка <> &Ссылка
	|			И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.Шаблон.РезервироватьТовар
	|			И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)					
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура) КАК РезервыТСД
	|		ПО (Товары.Номенклатура = РезервыТСД.Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапросСЛимитами.Номенклатура,
	|	ЗапросСЛимитами.Цена,
	|	ЗапросСЛимитами.НомерСтроки,
	|	ЗапросСЛимитами.ИдентификаторСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки");
	
	
	Если ДатаМобайл_ОбщийМодуль.ЕстьАСТ() Тогда
		
		ДатаМобайл_ОбщийМодуль.астЗаменитьРегистрНоменклатурыЕГАИС(Запрос.Текст);
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТТНВходящаяЕГАИС", Шаблон.ВидДокумента);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаТоваровВДокументе.АлкогольнаяПродукция", "ТаблицаТоваровВДокументе.НоменклатураЕГАИС");
		
		Если Шаблон.ВидДокумента = "астСписаниеТоваровЕГАИС" или Шаблон.ВидДокумента = "астАктФиксацииШтрихкодовНаБалансеОрганизации" Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаТоваровВДокументе.Справка2", "ТаблицаТоваровВДокументе.СправкаБ");	
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаТоваровВДокументе.Справка2", "ТаблицаТоваровВДокументе.ИдСправкиБ");
		КонецЕсли;
		
		Если Шаблон.ВидДокумента = "астАктФиксацииШтрихкодовНаБалансеОрганизации" Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТаблицаТоваровВДокументе.Количество", "ТаблицаТоваровВДокументе.КоличествоМарок");				
		КонецЕсли;
	КонецЕсли;
	
		Попытка
			ЕстьЦены = Метаданные.Документы[Шаблон.ВидДокумента].ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Цена")<>Неопределено;
		Исключение
			ЕстьЦены = Ложь;
		КонецПопытки;

		
		Если ЕстьЦены Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеЦена","ТаблицаТоваровВДокументе.Цена");
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"&УсловиеЦена","0");
		КонецЕсли;

	Запрос.УстановитьПараметр("Ссылка",СсылкаНаДок);
	Запрос.УстановитьПараметр("ИсходныйДокумент",СсылкаНаДок.ИсходныйДокумент);
	Запрос.Текст=СтрЗаменить(Запрос.Текст,".ПриходныйОрдерНаТовары.","."+Шаблон.ВидДокумента+".");
	Запрос.Текст=СтрЗаменить(Запрос.Текст,".ТТНВходящаяЕГАИС.","."+Шаблон.ВидДокумента+".");
	Запрос.Текст=СтрЗаменить(Запрос.Текст,".Товары КАК ","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК ");
	
	
	//Если у документа есть склад берем остатки по складу документа иначе склады из настроек ТСД
	СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
	Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
		СписокСкладов.Очистить();
		СписокСкладов.Добавить(СсылкаНаДок.Склад);			
	КонецЕсли;
	Запрос.УстановитьПараметр("Склады",СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
	
	СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
		СписокПомещений.Очистить();
		СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
	КонецЕсли;
	Запрос.УстановитьПараметр("Помещения",СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);

	
	Если Шаблон.ВидДокумента = "УстановкаЦенНоменклатуры" или Шаблон.ВидДокумента = "ПрименениеЦенНоменклатуры" Тогда
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Количество",999);
	КонецЕсли;	
	
	Попытка
		ЕстьТЧМарок = СсылкаНаДок.ИсходныйДокумент.метаданные().ТабличныеЧасти.Найти("АкцизныеМарки") <> Неопределено;
		ЕстьРеквизитИдентификаторСтроки = СсылкаНаДок.ИсходныйДокумент.метаданные().ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("Справка2") <> Неопределено;
	Исключение
		ЕстьТЧМарок = Ложь;
		ЕстьРеквизитИдентификаторСтроки = Ложь;
	КонецПопытки;
	
	Если ЕстьРеквизитИдентификаторСтроки Тогда
	Иначе
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Справка2","0");
	КонецЕсли;
	
	
	Рез=Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаДока из Рез цикл
		
		ТекущийИдентификаторСтроки = СтрокаДока.ИдентификаторСтроки;

		
		СтруктураТекущейСтроки = Новый Структура;		
		ОбъектТовара = Неопределено;
		ОбъектТовараЕГАИС = Неопределено;

		СписокМарок = ДатаМобайл_ОбщийМодуль.СформироватьСписокНепроверяемыхМарокЕГАИС();  
		Если СписокМарок.НайтиПоЗначению(СтрокаДока.Номенклатура.ВидПродукции)<>Неопределено  Тогда
			ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","id");
			лТекущаяНоменклатура = ДатаМобайл_ОбщийМодуль.ПолучитьНоменклатуруПоЕГАИС(СтрокаДока.Номенклатура);
			ОбъектТовара.id = "8U-" + XMLСтрока(лТекущаяНоменклатура) + XMLСтрока(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()); 
			СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
		Иначе	
			ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","id");
			ОбъектТовара.id = "8e-" + XMLСтрока(СтрокаДока.Номенклатура);
			СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);

			ОбъектТовараЕГАИС = ПолучитьСтруктуруОбъектаДляHttp("egais_art","id");
			ОбъектТовараЕГАИС.id = "8e-" + XMLСтрока(СтрокаДока.Номенклатура);
			СтруктураТекущейСтроки.Вставить("egais_art", ОбъектТовараЕГАИС);		
		КонецЕсли;	
		

		limit_qty=0;		
		Если УзелПО.НеОтображатьОстатки Тогда
			limit_qty=0;
		Иначе		
			Попытка
				Итог = СтрокаДока.Лимит;
				limit_qty=Итог;
			Исключение
				limit_qty=0;
			КонецПопытки;
		КонецЕсли;	
		

		price=СтрокаДока.Цена;
		
		
		
		//Марки формат 3.0
		Если Шаблон.ВидДокумента = "ТТНВходящаяЕГАИС" ИЛИ Шаблон.ВидДокумента = "астТоварноТранспортныеНакладныеИзЕГАИС" Тогда
			КоличествоБезМарок = СтрокаДока.Количество;
			
			ТЗМарок = ДатаМобайл_ОбщийМодуль.ПолучитьМаркиВходящейТТН_ЕГАИС(СсылкаНаДок.ИсходныйДокумент);
			СтруктураПоискаМарок = Новый Структура("АлкогольнаяПродукция,Справка2",СтрокаДока.Номенклатура,ТекущийИдентификаторСтроки);
			СтрокиПоискаМарок = ТЗМарок.НайтиСтроки(СтруктураПоискаМарок);		
			
			Для Каждого СтрокаМарок из СтрокиПоискаМарок цикл				
				Если КоличествоБезМарок > 0 Тогда
					
					СтруктураТекущейСтрокиМарки = Новый Структура;
					
					Если ОбъектТовара <> Неопределено тогда
						СтруктураТекущейСтрокиМарки.Вставить("art", ОбъектТовара);		
					КонецЕсли;
					
					Если ОбъектТовараЕГАИС <> Неопределено тогда		
						СтруктураТекущейСтрокиМарки.Вставить("egais_art", ОбъектТовараЕГАИС);	
					КонецЕсли;
					
					qty = 1;

					СтруктураТекущейСтрокиМарки.Вставить("limit_qty", limit_qty);
					СтруктураТекущейСтрокиМарки.Вставить("qty", qty);
					СтруктураТекущейСтрокиМарки.Вставить("price", price);
					
					ОбъектЕГАИС = ПолучитьСтруктуруОбъектаДляHttp("egais");
					ОбъектЕГАИС.mark = СтрокаМарок.Марка;	
					
					Если ЗначениеЗаполнено(ОбъектЕГАИС.mark) Тогда				
						СтруктураТекущейСтрокиМарки.Вставить("egais", ОбъектЕГАИС);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаМарок.Короб) Тогда
						СтруктураТекущейСтрокиМарки.Вставить("box_pack", СтрокаМарок.Короб);
					КонецЕсли; 
					Если ЗначениеЗаполнено(СтрокаМарок.Палета) Тогда
						СтруктураТекущейСтрокиМарки.Вставить("pack", СтрокаМарок.Палета);
					КонецЕсли; 
					
					ОбъектСписка.Добавить(СтруктураТекущейСтрокиМарки); 
					
					КоличествоБезМарок = КоличествоБезМарок-1;
				Иначе
					Продолжить;
				КонецЕсли; 
				
			КонецЦикла;
		КонецЕсли;
		
		
		
		Если Шаблон.ВидДокумента = "ТТНВходящаяЕГАИС" ИЛИ Шаблон.ВидДокумента = "астТоварноТранспортныеНакладныеИзЕГАИС" Тогда
			Если КоличествоБезМарок > 0 Тогда
				qty = КоличествоБезМарок;
				
				СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
				СтруктураТекущейСтроки.Вставить("qty", qty);
				СтруктураТекущейСтроки.Вставить("price", price);

				ОбъектСписка.Добавить(СтруктураТекущейСтроки);
			КонецЕсли;	
		Иначе
			qty = СтрокаДока.Количество;
			
			СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
			СтруктураТекущейСтроки.Вставить("qty", qty);
			СтруктураТекущейСтроки.Вставить("price", price);
			
			ОбъектСписка.Добавить(СтруктураТекущейСтроки);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область OnPalletScan

Процедура ПолучитьСодержимоеУпаковки_НашУпаковочныйЛист(УзелПО,СсылкаНаДок,ОбъектСписка,Barcode)
	
	Шаблон=СсылкаНаДок.Шаблон;
	ТипЦен=УзелПО.ТипЦен;
	ВключатьАртикул=УзелПО.ДобавлятьАртикулВНаименование;
		
	
	Запрос = Новый Запрос; 	 
	Запрос.Текст = "ВЫБРАТЬ 
	|     ДатаМобайл_УпаковочныйЛистТовары.Штрихкод, 
	|     ДатаМобайл_УпаковочныйЛистТовары.Номенклатура,
	|	  ДатаМобайл_УпаковочныйЛистТовары.Характеристика,
	|     ДатаМобайл_УпаковочныйЛистТовары.Серия,
	|     СУММА(ДатаМобайл_УпаковочныйЛистТовары.КоличествоУпаковок) КАК Количество,
	|	  ДатаМобайл_УпаковочныйЛистТовары.Упаковка КАК Упаковка,
	|	  ДатаМобайл_УпаковочныйЛистТовары.Серия КАК Серия
	|ПОМЕСТИТЬ ДоступныеТовары
	|ИЗ 
	|     Документ.ДатаМобайл_УпаковочныйЛист.Товары КАК ДатаМобайл_УпаковочныйЛистТовары 
	|ГДЕ 
	|	(ДатаМобайл_УпаковочныйЛистТовары.Ссылка.Номер = &КодУпакЛиста
	|			ИЛИ ДатаМобайл_УпаковочныйЛистТовары.Ссылка.Код = &КодУпакЛиста) И НЕ ДатаМобайл_УпаковочныйЛистТовары.Ссылка.ПометкаУдаления 
	| 
	|СГРУППИРОВАТЬ ПО 
	|     ДатаМобайл_УпаковочныйЛистТовары.Номенклатура,
	|	  ДатаМобайл_УпаковочныйЛистТовары.Характеристика,
	|     ДатаМобайл_УпаковочныйЛистТовары.Штрихкод,
	|	  ДатаМобайл_УпаковочныйЛистТовары.Упаковка,
	|	  ДатаМобайл_УпаковочныйЛистТовары.Серия
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДокументыСРезервамиТСД
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
	|ГДЕ	
	|	(ДатаМобайл_ДокументыТСД.Ссылка <> &ИсходноеЗадание)
	|		И (ДатаМобайл_ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1))
	|			И (ДатаМобайл_ДокументыТСД.Шаблон.РезервироватьТовар)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество,0)) КАК Количество
	|ПОМЕСТИТЬ ДанныеДокументыСРезервамиТСД
	|ИЗ
	|	ДокументыСРезервамиТСД КАК ДокументыСРезервамиТСД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	|		ПО ДокументыСРезервамиТСД.Ссылка = ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеТовары.Номенклатура КАК Номенклатура,
	|	ДоступныеТовары.Характеристика КАК Характеристика,
	|	ДоступныеТовары.Упаковка КАК Упаковка,
	|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество * (ВЫБОР
	|							КОГДА ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель = 0
	|									ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель ЕСТЬ NULL
	|								ТОГДА 1
	|							ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель
	|						КОНЕЦ / ВЫБОР
	|							КОГДА ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель = 0
	|									ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель ЕСТЬ NULL
	|								ТОГДА 1
	|							ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель
	|						КОНЕЦ), 0)) КАК ВРезервеТСД
	|ПОМЕСТИТЬ ТоварыСРезервамиТСД
	|ИЗ
	|	ДоступныеТовары КАК ДоступныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументыСРезервамиТСД КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	|		ПО ДоступныеТовары.Характеристика = ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры
	|			И ДоступныеТовары.Упаковка = ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
	|				И ДоступныеТовары.Номенклатура = ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоступныеТовары.Упаковка,
	|	ДоступныеТовары.Характеристика,
	|	ДоступныеТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
	|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.КОтгрузкеОстаток, 0)) КАК ВРезерве,
	|	ДоступныеТовары.Номенклатура КАК Номенклатура,
	|	ДоступныеТовары.Характеристика КАК Характеристика,
	|	ДоступныеТовары.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ ТоварыСОстатками1С
	|ИЗ
	|	ДоступныеТовары КАК ДоступныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				(&ВсеСклады
	|					ИЛИ Склад В (&Склады))
	|				И (&ВсеПомещения
	|					ИЛИ Помещение В (&Помещения))) КАК СвободныеОстаткиОстатки
	|		ПО ДоступныеТовары.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
	|			И ДоступныеТовары.Характеристика = СвободныеОстаткиОстатки.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоступныеТовары.Характеристика,
	|	ДоступныеТовары.Номенклатура,
	|	ДоступныеТовары.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеТовары.Номенклатура КАК Номенклатура,
	|	ДоступныеТовары.Характеристика КАК Характеристика,
	|	ДоступныеТовары.Упаковка КАК Упаковка,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ВЫБОР
	|				КОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель, 0) = 0
	|					ТОГДА 1
	|				ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель
	|			КОНЕЦ КАК ЧИСЛО(19, 2))) КАК Цена				   
	|ПОМЕСТИТЬ ТоварыСЦенами
	|ИЗ
	|	ДоступныеТовары КАК ДоступныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ВидЦены = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ДоступныеТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ДоступныеТовары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоступныеТовары.Номенклатура,
	|	ДоступныеТовары.Характеристика,
	|	ДоступныеТовары.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеТовары.Номенклатура КАК Номенклатура,
	|	ДоступныеТовары.Характеристика КАК Характеристика,
	|    ДоступныеТовары.Серия КАК Серия,
	|	ДоступныеТовары.Упаковка КАК Упаковка,
	|	ДоступныеТовары.Штрихкод КАК Штрихкод,
	|    ДоступныеТовары.Количество КАК Количество,
	|	ТоварыСОстатками1С.ВНаличии КАК ВНаличии,
	|	ТоварыСОстатками1С.ВРезерве КАК ВРезерве,
	|	ТоварыСРезервамиТСД.ВРезервеТСД КАК ВРезервеТСД,
	|	ЕСТЬNULL(ТоварыСЦенами.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ДоступныеТовары.Упаковка.Наименование, ДоступныеТовары.Номенклатура.ЕдиницаИзмерения.Наименование) КАК НаименованиеУпаковки,
	|	ЕСТЬNULL(ДоступныеТовары.Упаковка.Числитель, 1) КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА &ВключатьАртикул
	|				И ТИПЗНАЧЕНИЯ(ДоступныеТовары.Номенклатура) = ТИП(Справочник.Номенклатура)
	|			ТОГДА ВЫБОР
	|					КОГДА ДоступныеТовары.Номенклатура.Артикул = """"
	|						ТОГДА """"
	|					ИНАЧЕ ДоступныеТовары.Номенклатура.Артикул + "" ""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ + ДоступныеТовары.Номенклатура.Наименование + "" "" + ЕСТЬNULL(ДоступныеТовары.Характеристика.Наименование, """") КАК НаименованиеТовара,
	|	ЛОЖЬ КАК ЭтоНовыйТовар
	|ИЗ
	|	ДоступныеТовары КАК ДоступныеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСРезервамиТСД КАК ТоварыСРезервамиТСД
	|		ПО ДоступныеТовары.Характеристика = ТоварыСРезервамиТСД.Характеристика
	|			И ДоступныеТовары.Номенклатура = ТоварыСРезервамиТСД.Номенклатура
	|			И ДоступныеТовары.Упаковка = ТоварыСРезервамиТСД.Упаковка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСОстатками1С КАК ТоварыСОстатками1С
	|		ПО ДоступныеТовары.Номенклатура = ТоварыСОстатками1С.Номенклатура
	|			И ДоступныеТовары.Характеристика = ТоварыСОстатками1С.Характеристика
	|			И ДоступныеТовары.Упаковка = ТоварыСОстатками1С.Упаковка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСЦенами КАК ТоварыСЦенами
	|		ПО ДоступныеТовары.Номенклатура = ТоварыСЦенами.Номенклатура
	|			И ДоступныеТовары.Характеристика = ТоварыСЦенами.Характеристика
	|			И ДоступныеТовары.Упаковка = ТоварыСЦенами.Упаковка
	|";
	
	СкорректироватьЗапросПоЦенообразованию25(Запрос.Текст, "ПолучитьСодержимоеУпаковки_НашУпаковочныйЛист");
	
	Если Лев(Barcode,3) = "UPL" Тогда 
		КодУпакЛиста = Прав(Barcode,СтрДлина(Barcode)-3); 
	Иначе     
		КодУпакЛиста = Barcode; 
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("КодУпакЛиста", КодУпакЛиста); 
	Запрос.УстановитьПараметр("ТипЦен",ТипЦен);
	Запрос.УстановитьПараметр("ИсходныйДокумент",СсылкаНаДок.ИсходныйДокумент);
	Запрос.УстановитьПараметр("ИсходноеЗадание",СсылкаНаДок);          	
	Запрос.УстановитьПараметр("ВсеУпаковки",Шаблон.ВсеШтрихкодыТовара);
	
	СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
	Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
		СписокСкладов.Очистить();
		СписокСкладов.Добавить(СсылкаНаДок.Склад);			
	КонецЕсли;
	Запрос.УстановитьПараметр("Склады",СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
	
	СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
		СписокПомещений.Очистить();
		СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
	КонецЕсли;
	Запрос.УстановитьПараметр("Помещения",СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);

	
	Запрос.УстановитьПараметр("ВключатьАртикул",ВключатьАртикул);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Рез = Запрос.Выполнить().Выгрузить(); 	
	Для Каждого СтрокаДока ИЗ Рез Цикл 
		
		Итог = (СтрокаДока.ВНаличии-СтрокаДока.ВРезерве-СтрокаДока.ВРезервеТСД);	
		СтрокаДока.Коэффициент=?(СтрокаДока.Коэффициент=0,1,СтрокаДока.Коэффициент);
		СтрокаДока.НаименованиеУпаковки=?(ЗначениеЗаполнено(СтрокаДока.НаименованиеУпаковки),СтрокаДока.НаименованиеУпаковки,"шт.");
		
		
		СтруктураТекущейСтроки = Новый Структура;

		ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","scan"); 	
		ОбъектТовара.name = ЧистаяСтрока(СокрП(СтрокаДока.НаименованиеТовара));
		ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.Номенклатура)+XMLСтрока(СтрокаДока.Характеристика);
		ОбъектТовара.price = СтрокаДока.Цена;	
		Попытка	
			DMUseSN = ПолучитьПризнакУчетаСерий(СтрокаДока.Номенклатура.ВидНоменклатуры,СсылкаНаДок.Склад);
		Исключение
			DMUseSN = Ложь;
		Конецпопытки;
		СформироватьЗаголовкиJSONParamsТовара(УзелПО,ОбъектТовара,СтрокаДока.Номенклатура,СтрокаДока.Характеристика, DMUseSN,Шаблон); 
		СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
		
		Если ЗначениеЗаполнено(СтрокаДока.Штрихкод) тогда	
			ОбъектШтрихкода = ПолучитьСтруктуруОбъектаДляHttp("barcode","unit_value");
			ОбъектШтрихкода.value = ЧистаяСтрока(СтрокаДока.Штрихкод);	
			Попытка ОбъектШтрихкода.unit_name = СтрокаДока.НаименованиеУпаковки; Исключение ОбъектШтрихкода.unit_name = "шт."; КонецПопытки;	
			Если УзелПО.НеИспользоватьПересчетУпаковок Тогда
				ОбъектШтрихкода.unit_coef = 1;
			Иначе	
				ОбъектШтрихкода.unit_coef = СтрокаДока.Коэффициент;
			КонецЕсли;
			СтруктураТекущейСтроки.Вставить("barcode", ОбъектШтрихкода);
		КонецЕсли;

			
		//Серия 
		Попытка
			Если ЗначениеЗаполнено(СтрокаДока.Серия) Тогда 
				sn = ПолучитьЗначениеСерии(Шаблон,СтрокаДока.Номенклатура,СтрокаДока.Серия);
				СтруктураТекущейСтроки.Вставить("sn", sn);
			КонецЕсли;	
		Исключение
		КонецПопытки;
		
		ЭтоУслуга = Ложь;
		Попытка 
			Если СтрокаДока.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				ЭтоУслуга = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		limit_qty = 0;
		Если УзелПО.НеОтображатьОстатки Тогда
			limit_qty = 0;
		ИначеЕсли ЭтоУслуга Тогда
			limit_qty = 999;	
		Иначе
			limit_qty = Итог;
		КонецЕсли;
	
		//Количество в базовых
		qty = СтрокаДока.Количество*СтрокаДока.Коэффициент;			
		
		СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
		СтруктураТекущейСтроки.Вставить("qty", qty);
		
		
		ОбъектСписка.Добавить(СтруктураТекущейСтроки);
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПолучитьСодержимоеУпаковки_ТиповойУпаковочныйЛист(УзелПО,СсылкаНаДок,ОбъектСписка,Barcode)

	Шаблон=СсылкаНаДок.Шаблон;
	ТипЦен=УзелПО.ТипЦен;
	ВключатьАртикул=УзелПО.ДобавлятьАртикулВНаименование;
		
	
	Запрос = Новый Запрос; 	 
	Запрос.Текст = "ВЫБРАТЬ 
	|     """" КАК Штрихкод, 
	|     УпаковочныйЛистТовары.Номенклатура,
	|	  УпаковочныйЛистТовары.Характеристика,
	|     УпаковочныйЛистТовары.Серия,
	|     СУММА(УпаковочныйЛистТовары.КоличествоУпаковок) КАК Количество,
	|	  УпаковочныйЛистТовары.Упаковка КАК Упаковка,
	|	  УпаковочныйЛистТовары.Серия КАК Серия
	|ПОМЕСТИТЬ ДоступныеТовары
	|ИЗ 
	|     Документ.УпаковочныйЛист.Товары КАК УпаковочныйЛистТовары 
	|ГДЕ 
	|	(УпаковочныйЛистТовары.Ссылка.Код = &КодУпакЛиста)  И НЕ УпаковочныйЛистТовары.Ссылка.ПометкаУдаления 
	| 
	|СГРУППИРОВАТЬ ПО 
	|     УпаковочныйЛистТовары.Номенклатура,
	|	  УпаковочныйЛистТовары.Характеристика,
	|	  УпаковочныйЛистТовары.Упаковка,
	|	  УпаковочныйЛистТовары.Серия
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДокументыСРезервамиТСД
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
	|ГДЕ	
	|	(ДатаМобайл_ДокументыТСД.Ссылка <> &ИсходноеЗадание)
	|		И (ДатаМобайл_ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1))
	|			И (ДатаМобайл_ДокументыТСД.Шаблон.РезервироватьТовар)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество,0)) КАК Количество
	|ПОМЕСТИТЬ ДанныеДокументыСРезервамиТСД
	|ИЗ
	|	ДокументыСРезервамиТСД КАК ДокументыСРезервамиТСД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	|		ПО ДокументыСРезервамиТСД.Ссылка = ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеТовары.Номенклатура КАК Номенклатура,
	|	ДоступныеТовары.Характеристика КАК Характеристика,
	|	ДоступныеТовары.Упаковка КАК Упаковка,
	|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество * (ВЫБОР
	|							КОГДА ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель = 0
	|									ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель ЕСТЬ NULL
	|								ТОГДА 1
	|							ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель
	|						КОНЕЦ / ВЫБОР
	|							КОГДА ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель = 0
	|									ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель ЕСТЬ NULL
	|								ТОГДА 1
	|							ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель
	|						КОНЕЦ), 0)) КАК ВРезервеТСД
	|ПОМЕСТИТЬ ТоварыСРезервамиТСД
	|ИЗ
	|	ДоступныеТовары КАК ДоступныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументыСРезервамиТСД КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	|		ПО ДоступныеТовары.Характеристика = ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры
	|			И ДоступныеТовары.Упаковка = ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
	|				И ДоступныеТовары.Номенклатура = ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура



	|
	|СГРУППИРОВАТЬ ПО
	|	ДоступныеТовары.Упаковка,
	|	ДоступныеТовары.Характеристика,
	|	ДоступныеТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
	|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.КОтгрузкеОстаток, 0)) КАК ВРезерве,
	|	ДоступныеТовары.Номенклатура КАК Номенклатура,
	|	ДоступныеТовары.Характеристика КАК Характеристика,
	|	ДоступныеТовары.Упаковка КАК Упаковка
	|ПОМЕСТИТЬ ТоварыСОстатками1С
	|ИЗ
	|	ДоступныеТовары КАК ДоступныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				(&ВсеСклады
	|					ИЛИ Склад В (&Склады))
	|				И (&ВсеПомещения
	|					ИЛИ Помещение В (&Помещения))) КАК СвободныеОстаткиОстатки
	|		ПО ДоступныеТовары.Номенклатура = СвободныеОстаткиОстатки.Номенклатура
	|			И ДоступныеТовары.Характеристика = СвободныеОстаткиОстатки.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоступныеТовары.Характеристика,
	|	ДоступныеТовары.Номенклатура,
	|	ДоступныеТовары.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеТовары.Номенклатура КАК Номенклатура,
	|	ДоступныеТовары.Характеристика КАК Характеристика,
	|	ДоступныеТовары.Упаковка КАК Упаковка,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ВЫБОР
	|				КОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель, 0) = 0
	|					ТОГДА 1
	|				ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель
	|			КОНЕЦ КАК ЧИСЛО(19, 2))) КАК Цена				   
	|ПОМЕСТИТЬ ТоварыСЦенами
	|ИЗ
	|	ДоступныеТовары КАК ДоступныеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ВидЦены = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ДоступныеТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ДоступныеТовары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоступныеТовары.Номенклатура,
	|	ДоступныеТовары.Характеристика,
	|	ДоступныеТовары.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеТовары.Номенклатура КАК Номенклатура,
	|	ДоступныеТовары.Характеристика КАК Характеристика,
	|    ДоступныеТовары.Серия КАК Серия,
	|	ДоступныеТовары.Упаковка КАК Упаковка,
	|	ДоступныеТовары.Штрихкод КАК Штрихкод,
	|    ДоступныеТовары.Количество КАК Количество,
	|	ТоварыСОстатками1С.ВНаличии КАК ВНаличии,
	|	ТоварыСОстатками1С.ВРезерве КАК ВРезерве,
	|	ТоварыСРезервамиТСД.ВРезервеТСД КАК ВРезервеТСД,
	|	ЕСТЬNULL(ТоварыСЦенами.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ДоступныеТовары.Упаковка.Наименование, ДоступныеТовары.Номенклатура.ЕдиницаИзмерения.Наименование) КАК НаименованиеУпаковки,
	|	ЕСТЬNULL(ДоступныеТовары.Упаковка.Числитель, 1) КАК Коэффициент,
	|	ВЫБОР
	|		КОГДА &ВключатьАртикул
	|				И ТИПЗНАЧЕНИЯ(ДоступныеТовары.Номенклатура) = ТИП(Справочник.Номенклатура)
	|			ТОГДА ВЫБОР
	|					КОГДА ДоступныеТовары.Номенклатура.Артикул = """"
	|						ТОГДА """"
	|					ИНАЧЕ ДоступныеТовары.Номенклатура.Артикул + "" ""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ + ДоступныеТовары.Номенклатура.Наименование + "" "" + ЕСТЬNULL(ДоступныеТовары.Характеристика.Наименование, """") КАК НаименованиеТовара,
	|	ЛОЖЬ КАК ЭтоНовыйТовар
	|ИЗ
	|	ДоступныеТовары КАК ДоступныеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСРезервамиТСД КАК ТоварыСРезервамиТСД
	|		ПО ДоступныеТовары.Характеристика = ТоварыСРезервамиТСД.Характеристика
	|			И ДоступныеТовары.Номенклатура = ТоварыСРезервамиТСД.Номенклатура
	|			И ДоступныеТовары.Упаковка = ТоварыСРезервамиТСД.Упаковка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСОстатками1С КАК ТоварыСОстатками1С
	|		ПО ДоступныеТовары.Номенклатура = ТоварыСОстатками1С.Номенклатура
	|			И ДоступныеТовары.Характеристика = ТоварыСОстатками1С.Характеристика
	|			И ДоступныеТовары.Упаковка = ТоварыСОстатками1С.Упаковка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСЦенами КАК ТоварыСЦенами
	|		ПО ДоступныеТовары.Номенклатура = ТоварыСЦенами.Номенклатура
	|			И ДоступныеТовары.Характеристика = ТоварыСЦенами.Характеристика
	|			И ДоступныеТовары.Упаковка = ТоварыСЦенами.Упаковка
	|";
	
	СкорректироватьЗапросПоЦенообразованию25(Запрос.Текст, "ПолучитьСодержимоеУпаковки_ТиповойУпаковочныйЛист");
	
	Если Лев(Barcode,3) = "UPL" Тогда 
		КодУпакЛиста = Прав(Barcode,СтрДлина(Barcode)-3); 
	Иначе     
		КодУпакЛиста = Barcode; 
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("КодУпакЛиста", КодУпакЛиста); 
	Запрос.УстановитьПараметр("ТипЦен",ТипЦен);
	Запрос.УстановитьПараметр("ИсходныйДокумент",СсылкаНаДок.ИсходныйДокумент);
	Запрос.УстановитьПараметр("ИсходноеЗадание",СсылкаНаДок);          	
	Запрос.УстановитьПараметр("ВсеУпаковки",Шаблон.ВсеШтрихкодыТовара);
	
	СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
	Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
		СписокСкладов.Очистить();
		СписокСкладов.Добавить(СсылкаНаДок.Склад);			
	КонецЕсли;
	Запрос.УстановитьПараметр("Склады",СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
	
	СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
		СписокПомещений.Очистить();
		СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
	КонецЕсли;
	Запрос.УстановитьПараметр("Помещения",СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);
	
	Запрос.УстановитьПараметр("ВключатьАртикул",ВключатьАртикул);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Рез = Запрос.Выполнить().Выгрузить(); 	
	Для Каждого СтрокаДока ИЗ Рез Цикл 
		
		Итог = (СтрокаДока.ВНаличии-СтрокаДока.ВРезерве-СтрокаДока.ВРезервеТСД);
		СтрокаДока.Коэффициент=?(СтрокаДока.Коэффициент=0,1,СтрокаДока.Коэффициент);
		СтрокаДока.НаименованиеУпаковки=?(ЗначениеЗаполнено(СтрокаДока.НаименованиеУпаковки),СтрокаДока.НаименованиеУпаковки,"шт.");

		СтруктураТекущейСтроки = Новый Структура;

		ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","scan");
		ОбъектТовара.name=ЧистаяСтрока(СокрП(СтрокаДока.НаименованиеТовара));
		ОбъектТовара.id="8U-" + XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(СтрокаДока.Характеристика);
		ОбъектТовара.price=СтрокаДока.Цена;
		Попытка	
			DMUseSN = ПолучитьПризнакУчетаСерий(СтрокаДока.Номенклатура.ВидНоменклатуры,СсылкаНаДок.Склад);
		Исключение
			DMUseSN = Ложь;
		Конецпопытки;
		СформироватьЗаголовкиJSONParamsТовара(УзелПО,ОбъектТовара,СтрокаДока.Номенклатура,СтрокаДока.Характеристика, DMUseSN,Шаблон);
		СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);

		ТекущийШтрихкод = ПолучитьШтрихкодУпаковки(СтрокаДока.Номенклатура, СтрокаДока.Характеристика, СтрокаДока.Упаковка);
		Если ЗначениеЗаполнено(ТекущийШтрихкод) тогда	
			ОбъектШтрихкода = ПолучитьСтруктуруОбъектаДляHttp("barcode","unit_value");
			ОбъектШтрихкода.value = ЧистаяСтрока(ТекущийШтрихкод);
			Попытка ОбъектШтрихкода.unit_name = СтрокаДока.НаименованиеУпаковки; Исключение ОбъектШтрихкода.unit_name = "шт."; КонецПопытки;	
			Если УзелПО.НеИспользоватьПересчетУпаковок Тогда
				ОбъектШтрихкода.unit_coef = 1;
			Иначе	
				ОбъектШтрихкода.unit_coef = СтрокаДока.Коэффициент;
			КонецЕсли;
			СтруктураТекущейСтроки.Вставить("barcode", ОбъектШтрихкода);
		КонецЕсли;
		
		//Серия 
		Попытка 
			Если ЗначениеЗаполнено(СтрокаДока.Серия) Тогда 
				sn = ПолучитьЗначениеСерии(Шаблон,СтрокаДока.Номенклатура,СтрокаДока.Серия);
				СтруктураТекущейСтроки.Вставить("sn", sn);
			КонецЕсли;
		Исключение		 
		КонецПопытки;
		
		ЭтоУслуга = Ложь;
		Попытка 
			Если СтрокаДока.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				ЭтоУслуга = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		limit_qty=0;
		Если УзелПО.НеОтображатьОстатки Тогда
			limit_qty=0;
		ИначеЕсли ЭтоУслуга Тогда
			limit_qty=999;	
		Иначе
			limit_qty=Итог;
		КонецЕсли;
				
		//Количество в базовых
		qty = СтрокаДока.Количество*СтрокаДока.Коэффициент; 		

						
		СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
		СтруктураТекущейСтроки.Вставить("qty", qty);
			
		ОбъектСписка.Добавить(СтруктураТекущейСтроки); 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьНоменклатуруУпаковкиМДЛП(УзелПО,СсылкаНаДок,ОбъектСписка, Barcode,ЭтоДокументМДЛП)
	
	
	Если Лев(Barcode, 2) = "00" И (СтрДлина(Barcode) = 20 ИЛИ Найти(Barcode, "/") = 21) Тогда
		Barcode1 = "(00)" + Сред(Barcode, 3, 18);
		Barcode2 = Сред(Barcode, 3, 18);
	ИначеЕсли Лев(Barcode, 4) = "(00)" И (СтрДлина(Barcode) = 22 ИЛИ Найти(Barcode, "/") = 23) Тогда
		Barcode1 = "(00)" + Сред(Barcode, 5, 18);
		Barcode2 = Сред(Barcode, 5, 18);
	Иначе 
		Barcode1 = Barcode;
		Barcode2 = Barcode;		
	КонецЕсли;
	
	
	Шаблон = СсылкаНаДок.Шаблон;
	
	//КОРОБА
	Запрос = Новый Запрос;	
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Марка
	|ПОМЕСТИТЬ Марки
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	(ШтрихкодыУпаковокТоваров.Ссылка.ЗначениеШтрихкода = &ЗначениеШтрихкода1
	|		ИЛИ ШтрихкодыУпаковокТоваров.Ссылка.ЗначениеШтрихкода = &ЗначениеШтрихкода2)
	|	И ШтрихкодыУпаковокТоваров.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И (ШтрихкодыУпаковокТоваров.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
	|		ИЛИ (ШтрихкодыУпаковокТоваров.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
	|			И ШтрихкодыУпаковокТоваров.ТипШтрихкода <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.GS1_DataMatrix)))
	|;
	|////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК Марка,
	|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА &ВключатьАртикул
	|			ТОГДА ВЫБОР
	|					КОГДА ШтрихкодыУпаковокТоваров.Номенклатура.Артикул = """"
	|						ТОГДА """"
	|					ИНАЧЕ ШтрихкодыУпаковокТоваров.Номенклатура.Артикул + "" ""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ + ШтрихкодыУпаковокТоваров.Номенклатура.Наименование + "" "" + ЕСТЬNULL(ШтрихкодыУпаковокТоваров.Характеристика.Наименование, """") КАК НаименованиеТовара,
	|	ЕСТЬNULL(ШтрихкодыУпаковокТоваров.Упаковка.Наименование, ШтрихкодыУпаковокТоваров.Номенклатура.ЕдиницаИзмерения.Наименование) КАК НаименованиеУпаковки,
	|	ШтрихкодыУпаковокТоваров.Номенклатура.ВидНоменклатуры.ИспользоватьСерии КАК ИспользоватьСерии,
	|	ВЫБОР
	|		КОГДА ШтрихкодыУпаковокТоваров.Количество = 0 
	|		ТОГДА
	|			ВЫБОР
	|				КОГДА ЕСТЬNULL(ШтрихкодыУпаковокТоваров.Упаковка.Числитель,0) = 0
	|				ТОГДА 1
	|				ИНАЧЕ ШтрихкодыУпаковокТоваров.Упаковка.Числитель
	|			КОНЕЦ
	|		ИНАЧЕ ШтрихкодыУпаковокТоваров.Количество 
	|	КОНЕЦ КАК Коэффициент
	|ПОМЕСТИТЬ ИтоговыеДанныеУпаковки
	|ИЗ
	|	Марки КАК Марки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|			ПО Марки.Марка = ШтрихкодыУпаковокТоваров.Ссылка	
	|;
	|////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИтоговыеДанныеУпаковки.Номенклатура КАК Номенклатура,
	|	ИтоговыеДанныеУпаковки.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ НайденныеТовары
	|ИЗ
	|	ИтоговыеДанныеУпаковки КАК ИтоговыеДанныеУпаковки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
	|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.КОтгрузкеОстаток, 0)) КАК ВРезерве,
	|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
	|	СвободныеОстаткиОстатки.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ТоварыСОстатками1С
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&ТекущаяДата,
	|			Номенклатура В (ВЫБРАТЬ
	|									НайденныеТовары.Номенклатура КАК Номенклатура
	|								ИЗ 
	|									НайденныеТовары КАК НайденныеТовары)						
	|			И (&ВсеСклады ИЛИ Склад В (&Склады))
	|			И (&ВсеПомещения ИЛИ Помещение В (&Помещения))) КАК СвободныеОстаткиОстатки
	|СГРУППИРОВАТЬ ПО
	|	СвободныеОстаткиОстатки.Номенклатура,
	|	СвободныеОстаткиОстатки.Характеристика
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДокументыСРезервамиТСД
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
	|ГДЕ	
	|	(ДатаМобайл_ДокументыТСД.Ссылка <> &ИсходноеЗадание)
	|		И (ДатаМобайл_ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1))
	|			И (ДатаМобайл_ДокументыТСД.Шаблон.РезервироватьТовар)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество,0)) КАК Количество
	|ПОМЕСТИТЬ ДанныеДокументыСРезервамиТСД
	|ИЗ
	|	ДокументыСРезервамиТСД КАК ДокументыСРезервамиТСД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	|		ПО ДокументыСРезервамиТСД.Ссылка = ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК Характеристика,
	|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество * (ВЫБОР
	|				КОГДА ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель = 0
	|						ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель ЕСТЬ NULL
	|					ТОГДА 1
	|				ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель
	|			КОНЕЦ / ВЫБОР
	|				КОГДА ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель = 0
	|						ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель ЕСТЬ NULL
	|					ТОГДА 1
	|				ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель
	|			КОНЕЦ), 0)) КАК ВРезервеТСД
	|ПОМЕСТИТЬ ТоварыСРезервамиТСД
	|ИЗ
	|	НайденныеТовары КАК НайденныеТовары
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументыСРезервамиТСД КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	|	ПО НайденныеТовары.Номенклатура = ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура
	| 		И НайденныеТовары.Характеристика = ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры



	|СГРУППИРОВАТЬ ПО
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК ЧИСЛО(19, 2))) КАК Цена
	|ПОМЕСТИТЬ ТоварыСЦенами
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ТекущаяДата, 
	|			Номенклатура В (ВЫБРАТЬ
	|									НайденныеТовары.Номенклатура КАК Номенклатура
	|								ИЗ 
	|									НайденныеТовары КАК НайденныеТовары)			
	|			И ВидЦены = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИтоговыеДанныеУпаковки.Марка КАК Марка,
	|	ИтоговыеДанныеУпаковки.Номенклатура КАК Номенклатура,
	|	ИтоговыеДанныеУпаковки.Характеристика КАК Характеристика,
	|	ИтоговыеДанныеУпаковки.НаименованиеТовара КАК НаименованиеТовара,
	|	ИтоговыеДанныеУпаковки.НаименованиеУпаковки КАК НаименованиеУпаковки,
	|	ИтоговыеДанныеУпаковки.ИспользоватьСерии КАК ИспользоватьСерии,
	|	ИтоговыеДанныеУпаковки.Коэффициент КАК Коэффициент,
	|	ЕСТЬNULL(ТоварыСОстатками1С.ВНаличии, 0) КАК ВНаличии,
	|	ЕСТЬNULL(ТоварыСОстатками1С.ВРезерве, 0) КАК ВРезерве,
	|	ЕСТЬNULL(ТоварыСРезервамиТСД.ВРезервеТСД, 0) КАК ВРезервеТСД,
	|	ЕСТЬNULL(ТоварыСЦенами.Цена, 0) КАК Цена
	|ПОМЕСТИТЬ ИтоговыеДанные
	|ИЗ
	|	ИтоговыеДанныеУпаковки КАК ИтоговыеДанныеУпаковки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСОстатками1С КАК ТоварыСОстатками1С
	|		ПО (ИтоговыеДанныеУпаковки.Номенклатура = ТоварыСОстатками1С.Номенклатура)
	|			И (ИтоговыеДанныеУпаковки.Характеристика = ТоварыСОстатками1С.Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСРезервамиТСД КАК ТоварыСРезервамиТСД
	|		ПО (ИтоговыеДанныеУпаковки.Номенклатура = ТоварыСРезервамиТСД.Номенклатура)
	|			И (ИтоговыеДанныеУпаковки.Характеристика = ТоварыСРезервамиТСД.Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСЦенами КАК ТоварыСЦенами
	|		ПО (ИтоговыеДанныеУпаковки.Номенклатура = ТоварыСЦенами.Номенклатура)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИтоговыеДанные.Марка КАК Марка,
	|	ИтоговыеДанные.Номенклатура КАК Номенклатура,
	|	ИтоговыеДанные.Характеристика КАК Характеристика,
	|	ИтоговыеДанные.НаименованиеТовара КАК НаименованиеТовара,
	|	ИтоговыеДанные.НаименованиеУпаковки КАК НаименованиеУпаковки,
	|	ИтоговыеДанные.ИспользоватьСерии КАК ИспользоватьСерии,
	|	СУММА(ИтоговыеДанные.Коэффициент) КАК Коэффициент,
	|	ИтоговыеДанные.ВНаличии КАК ВНаличии,
	|	ИтоговыеДанные.ВРезерве КАК ВРезерве,
	|	ИтоговыеДанные.ВРезервеТСД КАК ВРезервеТСД,
	|	ИтоговыеДанные.Цена КАК Цена
	|ИЗ
	|	ИтоговыеДанные КАК ИтоговыеДанные
	|СГРУППИРОВАТЬ ПО
	|	ИтоговыеДанные.Марка,
	|	ИтоговыеДанные.Номенклатура,
	|	ИтоговыеДанные.Характеристика,
	|	ИтоговыеДанные.НаименованиеТовара,
	|	ИтоговыеДанные.НаименованиеУпаковки,
	|	ИтоговыеДанные.ИспользоватьСерии,
	|	ИтоговыеДанные.ВНаличии,
	|	ИтоговыеДанные.ВРезерве,
	|	ИтоговыеДанные.ВРезервеТСД,
	|	ИтоговыеДанные.Цена
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыСОстатками1С
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыСРезервамиТСД
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеДокументыСРезервамиТСД
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыСРезервамиТСД
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыСЦенами
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Марки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НайденныеТовары
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИтоговыеДанныеУпаковки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИтоговыеДанные";

	СкорректироватьЗапросПоЦенообразованию25(Запрос.Текст, "ПолучитьНоменклатуруУпаковкиМДЛП");
	
	Запрос.УстановитьПараметр("ЗначениеШтрихкода1", Barcode1);
	Запрос.УстановитьПараметр("ЗначениеШтрихкода2", Barcode2);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, ".РеализацияТоваровУслуг.", "."+Шаблон.ВидДокумента+".");	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Товары КАК", "." + Шаблон.ИмяТабличнойЧастиПодбор + " КАК");	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИтоговыеДанныеУпаковки.Марка", """""");	
	
	СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
	Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
		СписокСкладов.Очистить();
		СписокСкладов.Добавить(СсылкаНаДок.Склад);			
	КонецЕсли;
	Запрос.УстановитьПараметр("Склады",СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
	
	СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
		СписокПомещений.Очистить();
		СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
	КонецЕсли;
	Запрос.УстановитьПараметр("Помещения",СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);

	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДок.ИсходныйДокумент);
	Запрос.УстановитьПараметр("ВключатьАртикул", УзелПО.ДобавлятьАртикулВНаименование);

	
	Запрос.УстановитьПараметр("ТипЦен",УзелПО.ТипЦен);
	Запрос.УстановитьПараметр("ИсходноеЗадание",СсылкаНаДок);

	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();		
	
	Для каждого СтрокаДока ИЗ ТаблицаТоваров Цикл
		
		Итог = (СтрокаДока.ВНаличии-СтрокаДока.ВРезерве-СтрокаДока.ВРезервеТСД);
		СтрокаДока.Коэффициент=?(СтрокаДока.Коэффициент=0,1,СтрокаДока.Коэффициент);
		СтрокаДока.НаименованиеУпаковки=?(ЗначениеЗаполнено(СтрокаДока.НаименованиеУпаковки),СтрокаДока.НаименованиеУпаковки,"шт.");

		СтруктураТекущейСтроки = Новый Структура;

		ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","scan");		
		ОбъектТовара.name = ЧистаяСтрока(СокрП(СтрокаДока.НаименованиеТовара));
		ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(СтрокаДока.Характеристика);	
		ОбъектТовара.price = СтрокаДока.Цена;
		Попытка	
			DMUseSN = ПолучитьПризнакУчетаСерий(СтрокаДока.Номенклатура.ВидНоменклатуры,СсылкаНаДок.Склад);
		Исключение
			DMUseSN = Ложь;
		Конецпопытки;
		СформироватьЗаголовкиJSONParamsТовара(УзелПО,ОбъектТовара,СтрокаДока.Номенклатура,СтрокаДока.Характеристика, DMUseSN,Шаблон);
		СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);

		
		ОбъектШтрихкода = ПолучитьСтруктуруОбъектаДляHttp("barcode","scan");
		Попытка ОбъектШтрихкода.unit_name = СтрокаДока.НаименованиеУпаковки; Исключение ОбъектШтрихкода.unit_name = "шт."; КонецПопытки;	
		Если УзелПО.НеИспользоватьПересчетУпаковок Тогда
			ОбъектШтрихкода.unit_coef = 1;
		Иначе	
			ОбъектШтрихкода.unit_coef = СтрокаДока.Коэффициент;
		КонецЕсли;
		СтруктураТекущейСтроки.Вставить("barcode", ОбъектШтрихкода);
		
		ЭтоУслуга = Ложь;
		Попытка 
			Если СтрокаДока.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				ЭтоУслуга = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		limit_qty=0;
		Если УзелПО.НеОтображатьОстатки Тогда
			limit_qty=0;
		ИначеЕсли ЭтоУслуга Тогда
			limit_qty=999;	
		Иначе
			limit_qty=Итог;
		КонецЕсли;

		//Количество в базовых
		qty = СтрокаДока.Коэффициент;	
		
		
	
		Если ЭтоДокументМДЛП тогда 
			ЧистаяМарка = ДатаМобайл_МДЛП.ДобавитьВМаркуУпрСимволы(СтрокаДока.Марка);	
		Иначе
			ЧистаяМарка = ДатаМобайл_Маркировка.УбратьСкобкиТеговМарка(СтрокаДока.Марка,ОбъектТовара.mark_type);
		КонецЕсли;
		
		ОбъектМаркировка = ПолучитьСтруктуруОбъектаДляHttp("marking");	
		ОбъектМаркировка.mark = ЧистаяМарка;	
		
		СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
		СтруктураТекущейСтроки.Вставить("qty", qty);	
		СтруктураТекущейСтроки.Вставить("marking", ОбъектМаркировка);
				
		Если ЗначениеЗаполнено(ОбъектМаркировка.mark) Тогда 
			ОбъектСписка.Добавить(СтруктураТекущейСтроки);
		КонецЕсли;   	
		
	КонецЦикла;

КонецПроцедуры

Процедура ПолучитьСодержимоеУпаковки_Маркировка(УзелПО,СсылкаНаДок,ОбъектСписка, Barcode,ЭтоДокументМДЛП,ТолькоТовары = Ложь)
		
	Barcode = СтрЗаменить(Barcode,"[","(");
	Barcode = СтрЗаменить(Barcode,"]",")");

	
	Если ЭтоДокументМДЛП Тогда
		Если Лев(Barcode, 2) = "00" И (СтрДлина(Barcode) = 20 ИЛИ Найти(Barcode, "/") = 21) Тогда
			Barcode1 = "(00)" + Сред(Barcode, 3, 18);
			Barcode2 = Сред(Barcode, 3, 18);
		ИначеЕсли Лев(Barcode, 4) = "(00)" И (СтрДлина(Barcode) = 22 ИЛИ Найти(Barcode, "/") = 23) Тогда
			Barcode1 = "(00)" + Сред(Barcode, 5, 18);
			Barcode2 = Сред(Barcode, 5, 18);
		Иначе 
			Barcode1 = Barcode;
			Barcode2 = Barcode;		
		КонецЕсли;
	Иначе
		Если Лев(Barcode, 2) = "00" И (СтрДлина(Barcode) = 20 ИЛИ Найти(Barcode, "/") = 21) Тогда
			Barcode1 = "(00)" + Сред(Barcode, 3, 18);
			Barcode2 = Сред(Barcode,1,20);
		ИначеЕсли Лев(Barcode, 4) = "(00)" И (СтрДлина(Barcode) = 22 ИЛИ Найти(Barcode, "/") = 23) Тогда
			Barcode1 = Сред(Barcode, 1, 22);
			Barcode2 = "00" + Сред(Barcode,5,18);
		ИначеЕсли СтрДлина(Barcode) = 18 Тогда
			Barcode1 = "(00)" + Barcode;
			Barcode2 = "00" + Barcode;
		//ИначеЕсли Лев(Barcode, 2) = "01" и Сред(Barcode,17,2) = "21" Тогда   //0104850030002415219RK4BHNKNXWP240GTRU78838001 =>(01)04850030002415(21)9RK4BHNKNXWP
		//	Barcode1 = "(01)" + Сред(Barcode, 3, 14)+"(21)" + Сред(Barcode, 19, 12);
		//	Barcode2 = "01" + Сред(Barcode, 3, 14)+"21" + Сред(Barcode, 19, 12);
		Иначе 
			Barcode1 = Barcode;
			Barcode2 = Barcode;	
		КонецЕсли;	
	КонецЕсли;
	
	
	Шаблон = СсылкаНаДок.Шаблон;
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК Короб
	|ПОМЕСТИТЬ КоробаПалеты	
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|ГДЕ
	|	(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.ЗначениеШтрихкода = &ЗначениеШтрихкода1
	|		ИЛИ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.ЗначениеШтрихкода = &ЗначениеШтрихкода2)
	|	И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
	|		ИЛИ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка))
	|	И ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШтрихкода <> ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.GS1_DataMatrix)
	|;
	|////////////////////////////////////////////////////////////
	|
	//КОРОБА ИЗ ПАЛЕТЫ
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод КАК Марка,
	|	ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.Номенклатура,ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК НоменклатураКороба,
	|	ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.Характеристика,ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаКороба,
	|	ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.Упаковка,ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК УпаковкаКороба,
	|	ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.Упаковка.Числитель,0) КАК КоэффициентУпаковкиКороба
	|ПОМЕСТИТЬ Марки
	|ИЗ
	|	КоробаПалеты КАК КоробаПалеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|		ПО КоробаПалеты.Короб = ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка
	|ГДЕ
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
	|		ИЛИ (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
	|			И ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШтрихкода = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.GS1_DataMatrix)))
	|
	|ОБЪЕДИНИТЬ
	|
	//КОРОБА БЕЗ ПАЛЕТ
	|ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод,
	|	ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.Номенклатура,ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|	ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.Характеристика,ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	|	ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.Упаковка,ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)),
	|	ЕСТЬNULL(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.Упаковка.Числитель,0) КАК КоэффициентУпаковкиКороба
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
	|ГДЕ
	|	(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.ЗначениеШтрихкода = &ЗначениеШтрихкода1
	|		ИЛИ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.ЗначениеШтрихкода = &ЗначениеШтрихкода2)
	|	И ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)	
	|	И (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
	|		ИЛИ (ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
	|			И ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод.ТипШтрихкода = ЗНАЧЕНИЕ(Перечисление.ТипыШтрихкодов.GS1_DataMatrix)))
	|;
	|////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК Марка,
	|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
	|	ВЫБОР
	|		КОГДА &ВключатьАртикул
	|			ТОГДА ВЫБОР
	|					КОГДА ШтрихкодыУпаковокТоваров.Номенклатура.Артикул = """"
	|						ТОГДА """"
	|					ИНАЧЕ ШтрихкодыУпаковокТоваров.Номенклатура.Артикул + "" ""
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ + ШтрихкодыУпаковокТоваров.Номенклатура.Наименование + "" "" + ЕСТЬNULL(ШтрихкодыУпаковокТоваров.Характеристика.Наименование, """") КАК НаименованиеТовара,
	|	ЕСТЬNULL(ШтрихкодыУпаковокТоваров.Упаковка.Наименование, ШтрихкодыУпаковокТоваров.Номенклатура.ЕдиницаИзмерения.Наименование) КАК НаименованиеУпаковки,
	|	ШтрихкодыУпаковокТоваров.Номенклатура.ВидНоменклатуры.ИспользоватьСерии КАК ИспользоватьСерии,
	|	ВЫБОР
	|		КОГДА ШтрихкодыУпаковокТоваров.Количество = 0 
	|		ТОГДА
	|			ВЫБОР
	|				КОГДА ЕСТЬNULL(ШтрихкодыУпаковокТоваров.Упаковка.Числитель,0) = 0
	|				ТОГДА 1
	|				ИНАЧЕ ШтрихкодыУпаковокТоваров.Упаковка.Числитель
	|			КОНЕЦ
	|		ИНАЧЕ ШтрихкодыУпаковокТоваров.Количество 
	|	КОНЕЦ КАК Коэффициент,
	|	Марки.НоменклатураКороба КАК НоменклатураКороба,
	|	Марки.ХарактеристикаКороба КАК ХарактеристикаКороба,
	|	Марки.УпаковкаКороба КАК УпаковкаКороба,
	|	Марки.КоэффициентУпаковкиКороба КАК КоэффициентУпаковкиКороба
	|ПОМЕСТИТЬ ИтоговыеДанныеУпаковки
	|ИЗ
	|	Марки КАК Марки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|			ПО Марки.Марка = ШтрихкодыУпаковокТоваров.Ссылка	
	|;
	|////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ИтоговыеДанныеУпаковки.Номенклатура КАК Номенклатура,
	|	ИтоговыеДанныеУпаковки.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ НайденныеТовары
	|ИЗ
	|	ИтоговыеДанныеУпаковки КАК ИтоговыеДанныеУпаковки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
	|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.КОтгрузкеОстаток, 0)) КАК ВРезерве,
	|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
	|	СвободныеОстаткиОстатки.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ТоварыСОстатками1С
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&ТекущаяДата,
	|			Номенклатура В (ВЫБРАТЬ
	|									НайденныеТовары.Номенклатура КАК Номенклатура
	|								ИЗ 
	|									НайденныеТовары КАК НайденныеТовары)						
	|			И (&ВсеСклады ИЛИ Склад В (&Склады))
	|			И (&ВсеПомещения ИЛИ Помещение В (&Помещения))) КАК СвободныеОстаткиОстатки
	|СГРУППИРОВАТЬ ПО
	|	СвободныеОстаткиОстатки.Номенклатура,
	|	СвободныеОстаткиОстатки.Характеристика
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДокументыСРезервамиТСД
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
	|ГДЕ	
	|	(ДатаМобайл_ДокументыТСД.Ссылка <> &ИсходноеЗадание)
	|		И (ДатаМобайл_ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1))
	|			И (ДатаМобайл_ДокументыТСД.Шаблон.РезервироватьТовар)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество,0)) КАК Количество
	|ПОМЕСТИТЬ ДанныеДокументыСРезервамиТСД
	|ИЗ
	|	ДокументыСРезервамиТСД КАК ДокументыСРезервамиТСД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	|		ПО ДокументыСРезервамиТСД.Ссылка = ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК Характеристика,
	|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество * (ВЫБОР
	|				КОГДА ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель = 0
	|						ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель ЕСТЬ NULL
	|					ТОГДА 1
	|				ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель
	|			КОНЕЦ / ВЫБОР
	|				КОГДА ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель = 0
	|						ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель ЕСТЬ NULL
	|					ТОГДА 1
	|				ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель
	|			КОНЕЦ), 0)) КАК ВРезервеТСД
	|ПОМЕСТИТЬ ТоварыСРезервамиТСД
	|ИЗ
	|	НайденныеТовары КАК НайденныеТовары
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументыСРезервамиТСД КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	|	ПО НайденныеТовары.Номенклатура = ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура
	| 		И НайденныеТовары.Характеристика = ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры
	|СГРУППИРОВАТЬ ПО
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
	|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК ЧИСЛО(19, 2))) КАК Цена
	|ПОМЕСТИТЬ ТоварыСЦенами
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ТекущаяДата, 
	|			Номенклатура В (ВЫБРАТЬ
	|									НайденныеТовары.Номенклатура КАК Номенклатура
	|								ИЗ 
	|									НайденныеТовары КАК НайденныеТовары)			
	|			И ВидЦены = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИтоговыеДанныеУпаковки.Марка КАК Марка,
	|	ИтоговыеДанныеУпаковки.Номенклатура КАК Номенклатура,
	|	ИтоговыеДанныеУпаковки.Характеристика КАК Характеристика,
	|	ИтоговыеДанныеУпаковки.НаименованиеТовара КАК НаименованиеТовара,
	|	ИтоговыеДанныеУпаковки.НаименованиеУпаковки КАК НаименованиеУпаковки,
	|	ИтоговыеДанныеУпаковки.ИспользоватьСерии КАК ИспользоватьСерии,
	|	ИтоговыеДанныеУпаковки.Коэффициент КАК Коэффициент,
	|	ИтоговыеДанныеУпаковки.НоменклатураКороба КАК НоменклатураКороба,
	|	ИтоговыеДанныеУпаковки.ХарактеристикаКороба КАК ХарактеристикаКороба,
	|	ИтоговыеДанныеУпаковки.УпаковкаКороба КАК УпаковкаКороба,
	|	ИтоговыеДанныеУпаковки.КоэффициентУпаковкиКороба КАК КоэффициентУпаковкиКороба,
	|	ЕСТЬNULL(ТоварыСОстатками1С.ВНаличии, 0) КАК ВНаличии,
	|	ЕСТЬNULL(ТоварыСОстатками1С.ВРезерве, 0) КАК ВРезерве,
	|	ЕСТЬNULL(ТоварыСРезервамиТСД.ВРезервеТСД, 0) КАК ВРезервеТСД,
	|	ЕСТЬNULL(ТоварыСЦенами.Цена, 0) КАК Цена
	|ПОМЕСТИТЬ ИтоговыеДанные
	|ИЗ
	|	ИтоговыеДанныеУпаковки КАК ИтоговыеДанныеУпаковки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСОстатками1С КАК ТоварыСОстатками1С
	|		ПО (ИтоговыеДанныеУпаковки.Номенклатура = ТоварыСОстатками1С.Номенклатура)
	|			И (ИтоговыеДанныеУпаковки.Характеристика = ТоварыСОстатками1С.Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСРезервамиТСД КАК ТоварыСРезервамиТСД
	|		ПО (ИтоговыеДанныеУпаковки.Номенклатура = ТоварыСРезервамиТСД.Номенклатура)
	|			И (ИтоговыеДанныеУпаковки.Характеристика = ТоварыСРезервамиТСД.Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСЦенами КАК ТоварыСЦенами
	|		ПО (ИтоговыеДанныеУпаковки.Номенклатура = ТоварыСЦенами.Номенклатура)
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИтоговыеДанные.Марка КАК Марка,
	|	ИтоговыеДанные.Номенклатура КАК Номенклатура,
	|	ИтоговыеДанные.Характеристика КАК Характеристика,
	|	ИтоговыеДанные.НаименованиеТовара КАК НаименованиеТовара,
	|	ИтоговыеДанные.НаименованиеУпаковки КАК НаименованиеУпаковки,
	|	ИтоговыеДанные.ИспользоватьСерии КАК ИспользоватьСерии,
	|	СУММА(ИтоговыеДанные.Коэффициент) КАК Коэффициент,
	|	ИтоговыеДанные.НоменклатураКороба КАК НоменклатураКороба,
	|	ИтоговыеДанные.ХарактеристикаКороба КАК ХарактеристикаКороба,
	|	ИтоговыеДанные.УпаковкаКороба КАК УпаковкаКороба,
	|	ИтоговыеДанные.КоэффициентУпаковкиКороба КАК КоэффициентУпаковкиКороба,
	|	ИтоговыеДанные.ВНаличии КАК ВНаличии,
	|	ИтоговыеДанные.ВРезерве КАК ВРезерве,
	|	ИтоговыеДанные.ВРезервеТСД КАК ВРезервеТСД,
	|	ИтоговыеДанные.Цена КАК Цена
	|ИЗ
	|	ИтоговыеДанные КАК ИтоговыеДанные
	|СГРУППИРОВАТЬ ПО
	|	ИтоговыеДанные.Марка,
	|	ИтоговыеДанные.Номенклатура,
	|	ИтоговыеДанные.Характеристика,
	|	ИтоговыеДанные.НаименованиеТовара,
	|	ИтоговыеДанные.НаименованиеУпаковки,
	|	ИтоговыеДанные.ИспользоватьСерии,
	|	ИтоговыеДанные.НоменклатураКороба,
	|	ИтоговыеДанные.ХарактеристикаКороба,
	|	ИтоговыеДанные.УпаковкаКороба,
	|	ИтоговыеДанные.КоэффициентУпаковкиКороба,
	|	ИтоговыеДанные.ВНаличии,
	|	ИтоговыеДанные.ВРезерве,
	|	ИтоговыеДанные.ВРезервеТСД,
	|	ИтоговыеДанные.Цена
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыСОстатками1С
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыСРезервамиТСД
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеДокументыСРезервамиТСД
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыСРезервамиТСД
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыСЦенами
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Марки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НайденныеТовары
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИтоговыеДанныеУпаковки
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИтоговыеДанные";

    СкорректироватьЗапросПоЦенообразованию25(Запрос.Текст, "ПолучитьСодержимоеУпаковки_Маркировка");
		
	Запрос.УстановитьПараметр("ЗначениеШтрихкода1", Barcode1);
	Запрос.УстановитьПараметр("ЗначениеШтрихкода2", Barcode2);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, ".РеализацияТоваровУслуг.", "."+Шаблон.ВидДокумента+".");	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, ".Товары КАК", "." + Шаблон.ИмяТабличнойЧастиПодбор + " КАК");	
	
	Если Шаблон.МаркировкаОнлайнПроверкаВложенностиУпаковок или ТолькоТовары Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИтоговыеДанныеУпаковки.Марка", """""");	
	КонецЕсли;		

	СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
	Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
		СписокСкладов.Очистить();
		СписокСкладов.Добавить(СсылкаНаДок.Склад);			
	КонецЕсли;
	Запрос.УстановитьПараметр("Склады",СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
	
	СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
		СписокПомещений.Очистить();
		СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
	КонецЕсли;
	Запрос.УстановитьПараметр("Помещения",СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);
		
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДок.ИсходныйДокумент);
	Запрос.УстановитьПараметр("ВключатьАртикул", УзелПО.ДобавлятьАртикулВНаименование);
	
	Запрос.УстановитьПараметр("ТипЦен",УзелПО.ТипЦен);
	Запрос.УстановитьПараметр("ИсходноеЗадание",СсылкаНаДок);
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	ТаблицаТоваров = Запрос.Выполнить().Выгрузить();	
	
	УпаковкиМДЛП = Ложь;
	МаркированныеТоварыВУпаковкиМДЛП = Ложь;
	Если ЭтоДокументМДЛП тогда
		Если ТаблицаТоваров.Количество() = 0 тогда
			ПолучитьНоменклатуруУпаковкиМДЛП(УзелПО,СсылкаНаДок,ОбъектСписка, Barcode,ЭтоДокументМДЛП);
		КонецЕсли;
		
		
		Если ТаблицаТоваров.Количество() = 0 тогда
			Если Метаданные.НайтиПоПолномуИмени("РегистрСведений.УпаковкиМДЛП") <> Неопределено Тогда
				УпаковкиМДЛП = Истина;
				ТаблицаТоваров = ПолучитьТоварыБезЗаданияПоУпаковкамМДЛП(Barcode, Запрос, УзелПО, СсылкаНаДок, МаркированныеТоварыВУпаковкиМДЛП);		
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	
	ПолучениеШапкиУпаковки = Ложь;

	Для каждого СтрокаДока ИЗ ТаблицаТоваров Цикл
		
		СтруктураТекущейСтроки = Новый Структура;
		
		Итог = (СтрокаДока.ВНаличии-СтрокаДока.ВРезерве-СтрокаДока.ВРезервеТСД);
		СтрокаДока.Коэффициент=?(СтрокаДока.Коэффициент=0,1,СтрокаДока.Коэффициент);
		СтрокаДока.НаименованиеУпаковки=?(ЗначениеЗаполнено(СтрокаДока.НаименованиеУпаковки),СтрокаДока.НаименованиеУпаковки,"шт.");	
				
		Если МаркированныеТоварыВУпаковкиМДЛП Тогда
			СтрокаДока.НоменклатураКороба 	= СтрокаДока.Номенклатура;
			СтрокаДока.ХарактеристикаКороба = СтрокаДока.Характеристика;
			СтрокаДока.Марка 				= СтрокаДока.ЗначениеШтрихкода;
		КонецЕсли;
		
		ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","scan");
		Если ((ЗначениеЗаполнено(СтрокаДока.НоменклатураКороба) и ЗначениеЗаполнено(СтрокаДока.Номенклатура) и СтрокаДока.НоменклатураКороба <> СтрокаДока.Номенклатура)
			или (ЗначениеЗаполнено(СтрокаДока.ХарактеристикаКороба) и ЗначениеЗаполнено(СтрокаДока.Характеристика) и СтрокаДока.ХарактеристикаКороба <> СтрокаДока.Характеристика))
			и Шаблон.МаркировкаОнлайнПроверкаВложенностиУпаковок Тогда
			
			//ПОЛУЧЕНИЕ ДАННЫХ ИЗ УПАКОВКИ
			
			ПолучениеШапкиУпаковки = Истина;
			
			СтрокаДока.Коэффициент=?(СтрокаДока.КоэффициентУпаковкиКороба=0,?(СтрокаДока.Коэффициент=0,1,СтрокаДока.Коэффициент),СтрокаДока.КоэффициентУпаковкиКороба);
			

			НаименованиеТовара="";
			НаименованиеТовара = ?(УзелПО.ДобавлятьАртикулВНаименование,?(СтрокаДока.НоменклатураКороба.Артикул="","",СтрокаДока.НоменклатураКороба.Артикул+" "),НаименованиеТовара);
			НаименованиеТовара = НаименованиеТовара + СтрокаДока.НоменклатураКороба.Наименование + СтрокаДока.ХарактеристикаКороба.Наименование;
			
			
			ОбъектТовара.name = ЧистаяСтрока(СокрП(НаименованиеТовара));
			ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.НоменклатураКороба) + XMLСтрока(СтрокаДока.ХарактеристикаКороба);	
			ОбъектТовара.price = СтрокаДока.Цена;
			
			Попытка	
				DMUseSN = ПолучитьПризнакУчетаСерий(СтрокаДока.НоменклатураКороба.ВидНоменклатуры,СсылкаНаДок.Склад);
			Исключение
				DMUseSN = Ложь;
			Конецпопытки;		

			СформироватьЗаголовкиJSONParamsТовара(УзелПО,ОбъектТовара,СтрокаДока.НоменклатураКороба,СтрокаДока.ХарактеристикаКороба, DMUseSN,Шаблон);
 		

		Иначе
			
			//ОБЫЧНАЯ ЛОГИКА
			
			ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","scan"); 
			ОбъектТовара.name = ЧистаяСтрока(СокрП(СтрокаДока.НаименованиеТовара));				
			ОбъектТовара.id = "8U-" + XMLСтрока(СтрокаДока.Номенклатура) + XMLСтрока(СтрокаДока.Характеристика);
			ОбъектТовара.price = СтрокаДока.Цена;
			
			Попытка	
				DMUseSN = ПолучитьПризнакУчетаСерий(СтрокаДока.Номенклатура.ВидНоменклатуры,СсылкаНаДок.Склад);
			Исключение
				DMUseSN = Ложь;
			Конецпопытки;

			СформироватьЗаголовкиJSONParamsТовара(УзелПО,ОбъектТовара,СтрокаДока.НоменклатураКороба,СтрокаДока.ХарактеристикаКороба, DMUseSN,Шаблон);

						
		КонецЕсли;	
		СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);

		
		ОбъектШтрихкода = ПолучитьСтруктуруОбъектаДляHttp("barcode","scan");
		Попытка ОбъектШтрихкода.unit_name = СтрокаДока.НаименованиеУпаковки; Исключение ОбъектШтрихкода.unit_name = "шт."; КонецПопытки;	
		Если УзелПО.НеИспользоватьПересчетУпаковок Тогда
			ОбъектШтрихкода.unit_coef = 1;
		Иначе	
			ОбъектШтрихкода.unit_coef = СтрокаДока.Коэффициент;
		КонецЕсли;
		СтруктураТекущейСтроки.Вставить("barcode", ОбъектШтрихкода);

		ЭтоУслуга = Ложь;
		Попытка 
			Если СтрокаДока.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				ЭтоУслуга = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		limit_qty=0;
		Если УзелПО.НеОтображатьОстатки Тогда
			limit_qty=0;
		ИначеЕсли ЭтоУслуга Тогда
			limit_qty=999;	
		Иначе
			limit_qty=Итог;
		КонецЕсли;
				
		qty = СтрокаДока.Коэффициент;
		
		СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
		СтруктураТекущейСтроки.Вставить("qty", qty);	
		
		
		Если ЭтоДокументМДЛП Или УпаковкиМДЛП Тогда 
			ЧистаяМарка = ДатаМобайл_МДЛП.ДобавитьВМаркуУпрСимволы(СтрокаДока.Марка);	
		Иначе
			ЧистаяМарка = ДатаМобайл_Маркировка.УбратьСкобкиТеговМарка(СтрокаДока.Марка,ОбъектТовара.mark_type);
		КонецЕсли;
		
		ОбъектМаркировка = ПолучитьСтруктуруОбъектаДляHttp("marking");
		ОбъектМаркировка.mark = ЧистаяМарка;	
			
		Если ЗначениеЗаполнено(ОбъектМаркировка.mark) Тогда
			СтруктураТекущейСтроки.Вставить("marking", ОбъектМаркировка);
		КонецЕсли;
		
		ОбъектСписка.Добавить(СтруктураТекущейСтроки);
		
		Если ПолучениеШапкиУпаковки Тогда
			Прервать;
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТоварыБезЗаданияПоУпаковкамМДЛП(Barcode, ОсновнойЗапрос, УзелПО, СсылкаНаДок, МаркированныеТоварыВУпаковкиМДЛП)
	
	Если Лев(Barcode, 2) = "00" И (СтрДлина(Barcode) = 20 ИЛИ Найти(Barcode, "/") = 21) Тогда
		Barcode1 = "(00)" + Сред(Barcode, 3, 18);
		Barcode2 = Сред(Barcode, 3, 18);
	ИначеЕсли Лев(Barcode, 4) = "(00)" И (СтрДлина(Barcode) = 22 ИЛИ Найти(Barcode, "/") = 23) Тогда
		Barcode1 = "(00)" + Сред(Barcode, 5, 18);
		Barcode2 = Сред(Barcode, 5, 18);
	Иначе 
		Barcode1 = Barcode;
		Barcode2 = Barcode;		
	КонецЕсли;
	
	ЗапросПоУпаковкамМДЛП = Новый Запрос;
	ЗапросПоУпаковкамМДЛП.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УпаковкиМДЛП.НомерУпаковки КАК НомерУпаковки,
	|	УпаковкиМДЛП.ГрупповаяУпаковка КАК ГрупповаяУпаковка
	|ИЗ
	|	РегистрСведений.УпаковкиМДЛП КАК УпаковкиМДЛП
	|ГДЕ
	|	(УпаковкиМДЛП.НомерГрупповойУпаковки ПОДОБНО &ЗначениеШтрихкода1 СПЕЦСИМВОЛ ""$""
	|			ИЛИ УпаковкиМДЛП.НомерГрупповойУпаковки ПОДОБНО &ЗначениеШтрихкода2 СПЕЦСИМВОЛ ""$"")
	|	И УпаковкиМДЛП.НомерУпаковки <> """"";

	ЗапросПоУпаковкамМДЛП.УстановитьПараметр("ЗначениеШтрихкода1", Barcode1);
	ЗапросПоУпаковкамМДЛП.УстановитьПараметр("ЗначениеШтрихкода2", Barcode2);
	
	ТЗ = ЗапросПоУпаковкамМДЛП.Выполнить().Выгрузить();
	МассивЗначенийШтрихкодов = ТЗ.ВыгрузитьКолонку("НомерУпаковки");
	
	Если МассивЗначенийШтрихкодов.Количество() > 0 Тогда
		
		Если ТЗ[0].ГрупповаяУпаковка Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = ОсновнойЗапрос.Текст;
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "(ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.ЗначениеШтрихкода = &ЗначениеШтрихкода1", 
			"ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.ЗначениеШтрихкода В (&МассивЗначенийШтрихкодов)");
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИЛИ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка.ЗначениеШтрихкода = &ЗначениеШтрихкода2)", "");
			
			Запрос.УстановитьПараметр("МассивЗначенийШтрихкодов", МассивЗначенийШтрихкодов);
			
			Для каждого СтрокаПараметр Из ОсновнойЗапрос.Параметры Цикл
				Запрос.УстановитьПараметр(СтрокаПараметр.Ключ, СтрокаПараметр.Значение);
			КонецЦикла; 
			
			Возврат Запрос.Выполнить().Выгрузить();
		Иначе
			МаркированныеТоварыВУпаковкиМДЛП = Истина;
			ТаблицаТоваров = ПолучитьТоварыБезЗадания(УзелПО, СсылкаНаДок, МассивЗначенийШтрихкодов, "", "");
			
			ТаблицаТоваров.Колонки.Добавить("НоменклатураКороба"	, Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			ТаблицаТоваров.Колонки.Добавить("ХарактеристикаКороба"	, Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
			ТаблицаТоваров.Колонки.Добавить("Марка"					, Новый ОписаниеТипов("Строка"));
			
			Возврат ТаблицаТоваров;
						
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Новый Массив;
	
КонецФункции

#КонецОбласти

#Область SendArtToPrint

Функция ОтправитьСериюНаПечать(SN, UserName, DocID, СтруктураСтроки,ОписаниеОшибки)
	
	УзелПО=НайтиУзел(SN);
	Если УзелПО=Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;


	Если УзелПО.ОнлайнСвязьСПринтсервером Тогда	
		АдресПринтсервера = УзелПО.АдресПринтсервера;
		ПортПринтсервера = УзелПО.ПортПринтсервера;
		Если АдресПринтсервера = "" или ПортПринтсервера=0 Тогда
			ОписаниеОшибки="В обработке АРМ для терминала не указаны настройки онлайн связи с принтсервером. ";
			Возврат Ложь;
		КонецЕсли;	
	Иначе	
		КаталогСохранения = УзелПО.КаталогВыгрузкиФайлаПечати;
		Если КаталогСохранения = "" Тогда
			ОписаниеОшибки = "В обработке АРМ для терминала не указан каталог сохранения файлов печати. ";
		КонецЕсли;		
	КонецЕсли;	

	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocID, 5));
	Исключение
		ОписаниеОшибки="Не найден документ. ";
		Возврат Ложь;
	КонецПопытки;
	
	СтруктураПоиска = Новый Структура("ТипОперации", "Печать серийного номера/серии");
	
	СтрокиРеквизитов = УзелПО.Печать.НайтиСтроки(СтруктураПоиска);
	Если СтрокиРеквизитов.Количество() = 0 Тогда
		ОписаниеОшибки="В обработке АРМ для терминала не указан шаблон печати серийного номера/серии. ";
		Возврат Ложь;
	КонецЕсли;	
	
	ЗаписьXML = Новый ЗаписьXML;
	
	Если НЕ УзелПО.ОнлайнСвязьСПринтсервером Тогда
		ИмяФайла = ПолучитьНовоеИмяФайла();	
		Попытка
			ЗаписьXML.ОткрытьФайл(КаталогСохранения+ИмяФайла+".xml", "UTF-8");
		Исключение
			ОписаниеОшибки="Не удалось сохранить файл печати в каталоге: "+КаталогСохранения+" по причине: " + ОписаниеОшибки();
			Возврат Ложь;
		КонецПопытки;
	Иначе
		ЗаписьXML.УстановитьСтроку("UTF-8");
	КонецЕсли;
			
	ЗаписьXML.ЗаписатьОбъявлениеXML();	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("PrintData");
	
			
		ЗаписьXML.ЗаписатьНачалоЭлемента("PrinterName");
			ЗаписьXML.ЗаписатьТекст(СтрокиРеквизитов[0].ИмяПринтера);
		ЗаписьXML.ЗаписатьКонецЭлемента();		

		ЗаписьXML.ЗаписатьНачалоЭлемента("TemplateName");
			ЗаписьXML.ЗаписатьТекст(СтрокиРеквизитов[0].ИмяШаблона);
		ЗаписьXML.ЗаписатьКонецЭлемента();		
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Count");
			ЗаписьXML.ЗаписатьТекст(Строка(СтруктураСтроки.Количество));
		ЗаписьXML.ЗаписатьКонецЭлемента();		
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("Head");
	
	/////////////////////////////////////////////////
		ПорядковыйНомер = 0;
		СтруктураПоискаНомера = Новый Структура("Номенклатура", СтруктураСтроки.Номенклатура);
		СтрокиПоискаНомера = СсылкаНаДок.СобранныеДанныеПодбор.НайтиСтроки(СтруктураПоискаНомера);
		Если СтрокиПоискаНомера.Количество() = 0 Тогда
			ПорядковыйНомер = ПорядковыйНомер+1;
		Иначе
			Для каждого СтрокаПоискаНомера из СтрокиПоискаНомера цикл
				Если СтрокаПоискаНомера.Количество>0 Тогда
					ПорядковыйНомер = ПорядковыйНомер+1;
				ИначеЕсли СтрокаПоискаНомера.Количество<0 Тогда
					ПорядковыйНомер = ПорядковыйНомер-1;
				КонецЕсли;	
			КонецЦикла;
			ПорядковыйНомер = ПорядковыйНомер+1;
		КонецЕсли;
		
		Если ПорядковыйНомер = 0 Тогда
			ПорядковыйНомер = ПорядковыйНомер+1; 
		КонецЕсли;	
		
		ДатаСтрока = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
		НомерДокумента = СсылкаНаДок.ИсходныйДокумент.Номер;
		СерийныйНомер = СтруктураСтроки.СерийныйНомер;
		НазваниеТовара = СтруктураСтроки.НазваниеТовара;
		
		Попытка 
			АдресДоставки = СсылкаНаДок.ИсходныйДокумент.АдресДоставки; 
		Исключение
			АдресДоставки = ""; 
		КонецПопытки;
	/////////////////////////////////////////////////
	
		ЗаписьXML.ЗаписатьНачалоЭлемента("CountNumber");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(ПорядковыйНомер));
		ЗаписьXML.ЗаписатьКонецЭлемента();//CountNumber
			
		ЗаписьXML.ЗаписатьНачалоЭлемента("DocNumber");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(НомерДокумента));
		ЗаписьXML.ЗаписатьКонецЭлемента();//DocNumber
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("SN");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СерийныйНомер));
		ЗаписьXML.ЗаписатьКонецЭлемента();//SN	
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ArtName");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(НазваниеТовара));
		ЗаписьXML.ЗаписатьКонецЭлемента();//ArtName	
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Address");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(АдресДоставки));
		ЗаписьXML.ЗаписатьКонецЭлемента();//Address	
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Date");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(ДатаСтрока));
		ЗаписьXML.ЗаписатьКонецЭлемента();//Date

		
	ЗаписьXML.ЗаписатьКонецЭлемента();//Head
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Detail");	
	ЗаписьXML.ЗаписатьКонецЭлемента();//Detail
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Summary");
	ЗаписьXML.ЗаписатьКонецЭлемента();//Summary
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("Footer");	
	ЗаписьXML.ЗаписатьКонецЭлемента();//Footer
	
	ЗаписьXML.ЗаписатьКонецЭлемента();//PrintData
	
	Если НЕ УзелПО.ОнлайнСвязьСПринтсервером Тогда
		ЗаписьXML.Закрыть();
	Иначе
		СтрокаДляЗапроса = ЗаписьXML.Закрыть();
		ОтправитьДанныеНаПринтсервер(УзелПО,СтрокаДляЗапроса,ОписаниеОшибки);
	КонецЕсли;

	Возврат Истина;  

КонецФункции

Процедура ВыполнитьПечатьШтрихкодаКороба(УзелПО,СтрокиРеквизитов, ЗаписьXML, Pack, ТЗСобранныеДанныеПодбор, ОписаниеОшибки)

	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("PrintData");
	
	ЗаписатьЭлементXML(ЗаписьXML, "PrinterName", СтрокиРеквизитов[0].ИмяПринтера);
	ЗаписатьЭлементXML(ЗаписьXML, "TemplateName", СтрокиРеквизитов[0].ИмяШаблона);
	ЗаписатьЭлементXML(ЗаписьXML, "Count", СтрокиРеквизитов[0].КоличествоКопий);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Head");
	
	ЗаписатьЭлементXML(ЗаписьXML, "Barcode", ЧистаяСтрока(Сред(Pack, 1, 22)));	
	
	ЗаписатьЭлементXML(ЗаписьXML, "superdata", Формат(ТекущаяДата(), "ДП="));
	
	
	ИтогоТоваров = 0;
	//ЗаписьXML.ЗаписатьНачалоЭлемента("Detail");
	
	ТЗСобранныеДанныеПодбор.Свернуть("НазваниеТовара, ХарактеристикаНоменклатуры, ЕдиницаИзмерения", "Количество"); 

	
	Для Каждого СтрокаТЧ ИЗ ТЗСобранныеДанныеПодбор Цикл
		Если СтрокаТЧ.Количество=0 Тогда
			Продолжить;
		КонецЕсли;	

	//	ЗаписьXML.ЗаписатьНачалоЭлемента("Item");
		
		ИтогоТоваров = ИтогоТоваров + СтрокаТЧ.Количество*?(СтрокаТЧ.ЕдиницаИзмерения.Числитель = 0,1,СтрокаТЧ.ЕдиницаИзмерения.Числитель);
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ArtName");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.НазваниеТовара));
		ЗаписьXML.ЗаписатьКонецЭлемента();//ArtName
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ArtChar");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.ХарактеристикаНоменклатуры.НаименованиеПолное));
		ЗаписьXML.ЗаписатьКонецЭлемента();//ArtChar

		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Qnt");
		ЗаписьXML.ЗаписатьТекст(ЧистаяСтрока(СтрокаТЧ.Количество*?(СтрокаТЧ.ЕдиницаИзмерения.Числитель = 0,1,СтрокаТЧ.ЕдиницаИзмерения.Числитель)));
		ЗаписьXML.ЗаписатьКонецЭлемента();//QNT 
		                                  		
	//	ЗаписьXML.ЗаписатьКонецЭлемента();//Item
		
	КонецЦикла;

	
	//ЗаписьXML.ЗаписатьКонецЭлемента();//Detail
	ЗаписьXML.ЗаписатьКонецЭлемента();//Head

	ЗаписьXML.ЗаписатьНачалоЭлемента("Footer");
	ЗаписьXML.ЗаписатьКонецЭлемента();//Footer
	
	ЗаписьXML.ЗаписатьКонецЭлемента();//PrintData
	
	Если НЕ УзелПО.ОнлайнСвязьСПринтсервером Тогда
		ЗаписьXML.Закрыть();
	Иначе
		СтрокаДляЗапроса = ЗаписьXML.Закрыть();
		ОтправитьДанныеНаПринтсервер(УзелПО,СтрокаДляЗапроса,ОписаниеОшибки);
	КонецЕсли;
		
КонецПроцедуры

Процедура ВыполнитьПечатьОбычныхТоваров(УзелПО, лТовар, лХарактеристика, Barcode, Count, СтруктураParams, ОписаниеОшибки)
	
	СтруктураОтвета = Новый Структура;		
		
	//Если СтруктураParams.IsNeedPrintCopy = "Да" Тогда
	//КонецЕсли;
	
	СтруктураПоиска = Новый Структура("ТипОперации", "Печать этикетки");
	СтрокиРеквизитов = УзелПО.Печать.НайтиСтроки(СтруктураПоиска);
	Если СтрокиРеквизитов.Количество() = 0 тогда
		ОписаниеОшибки = "В обработке АРМ для терминала не указан шаблон печати упак. листа. ";
		Возврат;
	КонецЕсли;	
	
	ЗаписьXML = Новый ЗаписьXML;

	Если НЕ УзелПО.ОнлайнСвязьСПринтсервером тогда
		КаталогСохранения = УзелПО.КаталогВыгрузкиФайлаПечати;
		ИмяФайла = ПолучитьНовоеИмяФайла();	
		Попытка
			ЗаписьXML.ОткрытьФайл(КаталогСохранения+ИмяФайла+".xml", "UTF-8");
		Исключение
			ОписаниеОшибки = "Не удалось сохранить файл печати в каталоге: "+КаталогСохранения+" по причине: " + ОписаниеОшибки();
			Возврат;
		КонецПопытки;
	Иначе
		ЗаписьXML.УстановитьСтроку("UTF-8");
	КонецЕсли;
		

	ЗаписьXML.ЗаписатьОбъявлениеXML();	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("PrintData");
	
	ЗаписатьЭлементXML(ЗаписьXML, "PrinterName", СтрокиРеквизитов[0].ИмяПринтера);
	ЗаписатьЭлементXML(ЗаписьXML, "TemplateName", СтрокиРеквизитов[0].ИмяШаблона);
	ЗаписатьЭлементXML(ЗаписьXML, "Count", СтрокиРеквизитов[0].КоличествоКопий*Count);		
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Head");
	
	
	ЗаписатьЭлементXML(ЗаписьXML, "ArtName", ЧистаяСтрока(лТовар.Наименование+ " " + лХарактеристика.Наименование));
	
	Если ЗначениеЗаполнено(СтруктураParams.GS1) и Лев(СтруктураParams.GS1,4) = "(01)" Тогда
		лШтрихкод=Сред(СтруктураParams.GS1,6,13);	
	Иначе	
		лШтрихкод=Barcode;
	КонецЕсли;
	
	Если стрДлина(Barcode) = 5 Тогда
		лШтрихкодВесовой = "";
		Попытка
			ПрефиксВесовогоТовара = Константы.ПрефиксВесовогоШтрихкода.Получить(); 
			ВесовойШкБезКС = "2" + ПрефиксВесовогоТовара + Barcode+"00000";
			лШтрихкодВесовой = ВесовойШкБезКС + КонтрольныйСимволEAN(ВесовойШкБезКС, 13);
		Исключение 
		КонецПопытки;
	КонецЕсли;

	ЗаписатьЭлементXML(ЗаписьXML, "Barcode", ЧистаяСтрока(лШтрихкод));
	
	
	BarcodeGS1 = Barcode;
	Если ЗначениеЗаполнено(СтруктураParams.GS1) Тогда
		//Barcode //[GS1_DMX]0104640057550637218HqXAdnjKK+Sb~d029910064~d02992IglIfyWPu4avVkl7Mm3+JLQ9JXgipBP9UCYHZeA3gdDF4VRvQ7Q1vUtrrmpfsPfF10f8SQbGSW41S39XxEoJeA==
		//GS1 //(01)04640057550637(21)8HqXAdnjKK+Sb(91)0064(92)IglIfyWPu4avVkl7Mm3+JLQ9JXgipBP9UCYHZeA3gdDF4VRvQ7Q1vUtrrmpfsPfF10f8SQbGSW41S39XxEoJeA==
		
		BarcodeGS1 = СтрЗаменить(BarcodeGS1, "[GS1_EAN]", "");
		BarcodeGS1 = СтрЗаменить(BarcodeGS1, "[GS1_DMX]", "");
	КонецЕсли;
	
	ЗаписатьЭлементXML(ЗаписьXML, "BarcodeGS1", BarcodeGS1);

	
	ЗапросШК = Новый Запрос;
	ЗапросШК.УстановитьПараметр("Номенклатура", лТовар);
	ЗапросШК.УстановитьПараметр("Штрихкод", лШтрихкод);
	
	ЗапросШК.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(ВЫБОР КОГДА ЕСТЬNULL(Штрихкоды.Упаковка.Числитель,1) = 0 ТОГДА 1 ИНАЧЕ ЕСТЬNULL(Штрихкоды.Упаковка.Числитель,1) КОНЕЦ/ 
	|	         ВЫБОР КОГДА ЕСТЬNULL(Штрихкоды.Упаковка.Знаменатель,1) = 0 ТОГДА 1 ИНАЧЕ ЕСТЬNULL(Штрихкоды.Упаковка.Знаменатель,1) КОНЕЦ, 1) КАК КФ,
	|	Штрихкоды.Упаковка.Наименование КАК Наименование,
	|	Штрихкоды.Упаковка КАК УпаковкаСсылка
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Номенклатура = &Номенклатура
	|	И Штрихкоды.Штрихкод = &Штрихкод";
	
	Выборка = ЗапросШк.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		лMeasure=Выборка.Наименование;
		лKf=Выборка.КФ;
		УпаковкаСсылка = Выборка.УпаковкаСсылка;
	Иначе
		лMeasure=лТовар.ЕдиницаИзмерения.Наименование;
		лKf=1;
		УпаковкаСсылка = Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;
	
	ЗаписатьЭлементXML(ЗаписьXML, "Measure", ЧистаяСтрока(лMeasure));
	ЗаписатьЭлементXML(ЗаписьXML, "Kf", ЧистаяСтрока(лKf));
	
	
	ТекущаяЦена = ПолучитьЦенуТовара(лТовар, лХарактеристика, УзелПО.ТипЦен, УпаковкаСсылка);	
	ЗаписатьЭлементXML(ЗаписьXML, "Price", ЧистаяСтрока(ТекущаяЦена));
	
	//Штрихкод для проверки ценников
	//b,2000000052663,price,0100250,50
	Если ТекущаяЦена<0 Тогда
		ТекущаяЦена = 0;
	КонецЕсли;	
	ТекущаяЦенаРубли = Формат(Цел(ТекущаяЦена),"ЧЦ=7; ЧН=0000000; ЧВН=; ЧГ=");
	ТекущаяЦенаКопейки = Формат((ТекущаяЦена-ТекущаяЦенаРубли)*100,"ЧЦ=2; ЧН=00; ЧВН=; ЧГ=");
	ТекущийBarcode = лШтрихкод;
	Если СтрДлина(ТекущийBarcode)>13 Тогда
		ТекущийBarcode = Лев(ТекущийBarcode,13);
	ИначеЕсли СтрДлина(ТекущийBarcode)<13 Тогда
		ТекущийBarcode = ДобавитьЛидирующиеНули(ТекущийBarcode,13);
	КонецЕсли;	
	ЗаписатьЭлементXML(ЗаписьXML, "CheckBarcode", ЧистаяСтрока("b,"+ТекущийBarcode+",price,"+ТекущаяЦенаРубли+","+ТекущаяЦенаКопейки)); 		
					
	
	Атрибуты = ПолучитьАтрибуты(УзелПО);
	
	Для сч = 1 По 10 Цикл
		
		ИмяАтрибута = Атрибуты["ИмяАтрибута" + сч];
		Попытка
			ЗначениеАтрибута = ПолучитьЗначениеАтрибута(лТовар, ИмяАтрибута);
		Исключение
			ЗначениеАтрибута = "";
		КонецПопытки;	

		ЗаписатьЭлементXML(ЗаписьXML, "Attr" + сч, ЧистаяСтрока(ЗначениеАтрибута));
		
	КонецЦикла;
	
	
	ЗаписатьЭлементXML(ЗаписьXML, "QtyInt", ЧистаяСтрока(СтруктураParams.QtyInt));
	ЗаписатьЭлементXML(ЗаписьXML, "QtyFrac", ЧистаяСтрока(СтруктураParams.QtyFrac));
	ЗаписатьЭлементXML(ЗаписьXML, "ArtSN", ЧистаяСтрока(СтруктураParams.snValues));
	ЗаписатьЭлементXML(ЗаписьXML, "MeasureName", ЧистаяСтрока(СтруктураParams.MeasureName));

	
		
	ЗаписьXML.ЗаписатьКонецЭлемента();//Head
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Detail");		
	ЗаписьXML.ЗаписатьКонецЭлемента();//Detail
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Footer");
	ЗаписьXML.ЗаписатьКонецЭлемента();//Footer
	
	ЗаписьXML.ЗаписатьКонецЭлемента();//PrintData
	
	Если НЕ УзелПО.ОнлайнСвязьСПринтсервером Тогда
		ЗаписьXML.Закрыть();
	Иначе
		СтрокаДляЗапроса = ЗаписьXML.Закрыть();
		ОтправитьДанныеНаПринтсервер(УзелПО,СтрокаДляЗапроса,ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

Функция ДобавитьЛидирующиеНули(Строка,НужнаяДлина)
	
	СтрокаБезНулей = Строка;
	Пока СтрДлина(СтрокаБезНулей) < НужнаяДлина цикл
		СтрокаБезНулей = "0"+СтрокаБезНулей;	
	КонецЦикла;	
	
	Возврат СтрокаБезНулей; 
КонецФункции	

Процедура ВыполнитьПечатьКодовМаркировкиОбувь(УзелПО, лТовар, лХарактеристика, Barcode, Count, СтруктураParams, ОписаниеОшибки)
	
	Попытка КоличествоКМ = Число(СтруктураParams.QtyInt); Исключение КоличествоКМ = 1; КонецПопытки;
	
	КоличествоКопийКаждогоКМ = Count;
	МассивСвободныхКодовМаркировки = ДатаМобайл_Маркировка.ПолучитьСвободныеКодыМаркировки(КоличествоКМ, лТовар, лХарактеристика);
	
	Если МассивСвободныхКодовМаркировки.Количество() = 0 Тогда		
		ОписаниеОшибки = "Не найдены свободные коды маркировки для " + лТовар.Наименование;
		Возврат;
	ИначеЕсли МассивСвободныхКодовМаркировки.Количество() < КоличествоКМ Тогда		
		ОписаниеОшибки = "Не хватает " + Строка(КоличествоКМ - МассивСвободныхКодовМаркировки.Количество()) + " свободных кодов маркировки для " + лТовар.Наименование;
		Возврат;
	КонецЕсли;
	
	ПорядковыйНомер = 0;
	
	Для Каждого СвободныйКодМаркировки Из МассивСвободныхКодовМаркировки Цикл
		
		ПорядковыйНомер = ПорядковыйНомер + 1;					
		ЗаполнитьИЗакрытьФайлПечатиСвободногоКодаМаркировки(УзелПО, лТовар, лХарактеристика, Barcode, СвободныйКодМаркировки, ПорядковыйНомер, КоличествоКопийКаждогоКМ,ОписаниеОшибки);
		ДатаМобайл_Маркировка.УстановитьДатуПечатиДляКМ(СвободныйКодМаркировки);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИЗакрытьФайлПечатиСвободногоКодаМаркировки(УзелПО, лТовар, лХарактеристика, Barcode, СвободныйКодМаркировки, ПорядковыйНомер, КоличествоКопийКаждогоКМ, ОписаниеОшибки)
	
	КаталогСохранения = УзелПО.КаталогВыгрузкиФайлаПечати;

	СтруктураПоиска = Новый Структура("ТипОперации", "Печать этикетки маркировка");
	СтрокиРеквизитов = УзелПО.Печать.НайтиСтроки(СтруктураПоиска);
	Если СтрокиРеквизитов.Количество() = 0 Тогда
		ОписаниеОшибки = "В обработке АРМ для терминала не указан шаблон печати этикеток маркированного товара. ";
		Возврат;
	КонецЕсли;
	
	ИзвлеченныйКодМаркировки = ДатаМобайл_Маркировка.Base64ВШтрихкод(СвободныйКодМаркировки.ПолныйКод);

	ЗаписьXML = Новый ЗаписьXML;	
	Если НЕ УзелПО.ОнлайнСвязьСПринтсервером Тогда
		ИмяФайла = ПолучитьНовоеИмяФайла(ПорядковыйНомер);
		Попытка
			ЗаписьXML.ОткрытьФайл(КаталогСохранения+ИмяФайла+".xml", "UTF-8");
		Исключение
			ОписаниеОшибки = "Не удалось сохранить файл печати в каталоге: "+КаталогСохранения+" по причине: " + ОписаниеОшибки();
			Возврат;
		КонецПопытки;
	Иначе
		ЗаписьXML.УстановитьСтроку("UTF-8");
	КонецЕсли;	

	ЗаписьXML.ЗаписатьОбъявлениеXML();
	ЗаписьXML.ЗаписатьНачалоЭлемента("PrintData");
	
	ЗаписатьЭлементXML(ЗаписьXML, "PrinterName", СтрокиРеквизитов[0].ИмяПринтера);
	ЗаписатьЭлементXML(ЗаписьXML, "TemplateName", СтрокиРеквизитов[0].ИмяШаблона);
	
	КоличествоКопийКаждогоКМ = ?(СтрокиРеквизитов[0].КоличествоКопий=0,КоличествоКопийКаждогоКМ,СтрокиРеквизитов[0].КоличествоКопий*КоличествоКопийКаждогоКМ); 
	ЗаписатьЭлементXML(ЗаписьXML, "Count", КоличествоКопийКаждогоКМ);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Head");
	
	КодМаркировкиДляПечати = СтрЗаменить(ИзвлеченныйКодМаркировки, Символ(29), "~d029");
	КодМаркировкиДляПечати = "~d029" + КодМаркировкиДляПечати;
	КодМаркировкиБезFNC = СтрЗаменить(ИзвлеченныйКодМаркировки, Символ(29), "");
	
	ЗаписатьЭлементXML(ЗаписьXML, "ArtName", ЧистаяСтрока(лТовар.Наименование));
	ЗаписатьЭлементXML(ЗаписьXML, "Barcode", ЧистаяСтрока(Barcode));
	ЗаписатьЭлементXML(ЗаписьXML, "DmxBarcodePrint", КодМаркировкиДляПечати);
	ЗаписатьЭлементXML(ЗаписьXML, "DmxBarcode", КодМаркировкиБезFNC);
	ЗаписатьЭлементXML(ЗаписьXML, "GTIN", Сред(ИзвлеченныйКодМаркировки, 3, 14));
	ЗаписатьЭлементXML(ЗаписьXML, "SN", Сред(ИзвлеченныйКодМаркировки, 19, 13));
	
	ТекущаяЦена = ПолучитьЦенуТовара(лТовар, лХарактеристика, УзелПО.ТипЦен);	
	ЗаписатьЭлементXML(ЗаписьXML, "Price", ЧистаяСтрока(ТекущаяЦена));					
	
	Атрибуты = ПолучитьАтрибуты(УзелПО);
	
	Для сч = 1 По 10 Цикл
		
		
		ИмяАтрибута = Атрибуты["ИмяАтрибута" + сч];
		Попытка	
			ЗначениеАтрибута = ПолучитьЗначениеАтрибута(лТовар, ИмяАтрибута);
		Исключение
			ЗначениеАтрибута = "";
		КонецПопытки;	
		ЗаписатьЭлементXML(ЗаписьXML, "Attr" + сч, ЧистаяСтрока(ЗначениеАтрибута));
		
	КонецЦикла;
				
	ЗаписьXML.ЗаписатьКонецЭлемента();//Head
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Detail");
	ЗаписьXML.ЗаписатьКонецЭлемента();//Detail
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Footer");
	ЗаписьXML.ЗаписатьКонецЭлемента();//Footer
	
	ЗаписьXML.ЗаписатьКонецЭлемента();//PrintData
	
	Если НЕ УзелПО.ОнлайнСвязьСПринтсервером Тогда
		ЗаписьXML.Закрыть();
	Иначе
		СтрокаДляЗапроса = ЗаписьXML.Закрыть();
		ОтправитьДанныеНаПринтсервер(УзелПО,СтрокаДляЗапроса,ОписаниеОшибки);
	КонецЕсли;
	
	
	СтруктураТовара = Новый Структура("Номенклатура, Характеристика", лТовар, лХарактеристика);
	Шаблон = Справочники.ДатаМобайл_ШаблоныДокументов.ПустаяСсылка();
	ДатаМобайл_Маркировка.ПолучитьСправочникСсылкаМарка(Сред(ИзвлеченныйКодМаркировки, 1, 31), 31, "", "", Истина, СтруктураТовара,Шаблон);
	
КонецПроцедуры

Функция ПолучитьЗначениеАтрибута(лТовар, ИмяАтрибута)
	
	Если ИмяАтрибута <> "" 
		И ИмяАтрибута <> "!!! Ячейки !!!" 
		И ИмяАтрибута <> "!!! Характеристики !!!"  Тогда
		
		Если ЛЕВ(ИмяАтрибута, 3) = "ДР_" Тогда 
			Попытка ЗначениеАтрибута = ПолучитьДополнительныйРеквизитАтрибута(лТовар, ИмяАтрибута); Исключение КонецПопытки;
		Иначе 
			ЗначениеАтрибута = ЧистаяСтрока(лТовар[ИмяАтрибута]);
		КонецЕсли;	
		
	Иначе 
		ЗначениеАтрибута = "";
	КонецЕсли;
	
	Возврат ЗначениеАтрибута;
	
КонецФункции // ()

Функция ПолучитьНовоеИмяФайла(ПорядковыйНомер=0)
	
	ИмяФайла = СтрЗаменить(ТекущаяДата(),":","");
	ИмяФайла = СтрЗаменить(ИмяФайла, ".","");
	ИмяФайла = СтрЗаменить(ИмяФайла, " ","");
	ИмяФайла = СтрЗаменить(ИмяФайла, "/","");
	ИмяФайла = СтрЗаменить(ИмяФайла, "\","");
	
	Генератор = Новый ГенераторСлучайныхЧисел(1);
	ИдентификаторФайла = Генератор.СлучайноеЧисло(1, 1000);
	
	ИмяФайла = ИмяФайла + ИдентификаторФайла + ПорядковыйНомер;
	
	Возврат ИмяФайла;
	
КонецФункции // ()

Процедура ЗаписатьЭлементXML(ЗаписьXML, ИмяЭлемента, ТекстЭлемента)
	Попытка 
		ТекстЭлементаНаПечть = Строка(ТекстЭлемента);
	Исключение
		ТекстЭлементаНаПечть = "";
	КонецПопытки;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента(ИмяЭлемента);
	ЗаписьXML.ЗаписатьТекст(ТекстЭлементаНаПечть);
	ЗаписьXML.ЗаписатьКонецЭлемента();	
	
КонецПроцедуры

Процедура ОтправитьДанныеНаПринтсервер(УзелПО,СтрокаДляЗапроса,ТекстОшибки);

АдресПринтсервера = УзелПО.АдресПринтсервера;
ПортПринтсервера = УзелПО.ПортПринтсервера;
	
Соединение = Новый HTTPСоединение(АдресПринтсервера,ПортПринтсервера,,,,1,);

РесурсНаСервере = "/printFile/";
HTTPЗапрос = Новый HTTPЗапрос(РесурсНаСервере);
HTTPЗапрос.Заголовки.Вставить("Content-type", "application/xml");
HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаДляЗапроса,КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

ЕстьОшибка = Ложь;

Попытка 
	Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
Исключение
	ЕстьОшибка = Истина;
	ТекстОшибки = "Ошибка онлайн соединения c сервером печати, проверьте настройки.";
КонецПопытки;

Соединение = Неопределено;

Если ЕстьОшибка Тогда
Иначе
	ТекстСообщения  = "" + Результат.КодСостояния +  " " + Результат.ПолучитьТелоКакСтроку();
	Если СтрНайти(Результат.ПолучитьТелоКакСтроку(),"File Uploaded")>0 Тогда
		//Успешная отправка данных
	Иначе
		ЕстьОшибка = Истина;
		ТекстОшибки = "Ошибка отправки данных на печать: "+ТекстСообщения + ", проверьте настройки.";
	КонецЕсли;
КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область FastAccess

//3.0
Функция ПолучитьИнфоJSON(УзелПО, Barcode)
	
	МассивОтвета = Новый Массив;
	СтруктураОтвета = Новый Структура;
	
///////////////	
//МАРКИ ЕГАИС//
///////////////

	Если ДатаМобайл_ОбщийМодуль.ЕстьЕГАИС() и (СтрДлина(Barcode) = 68 или СтрДлина(Barcode) = 150) Тогда 
		
		СтруктураМарка = Новый Структура;
		СтруктураМарка.Вставить("title","Акцизная марка "+ Символы.ПС + Barcode);
		
		ИнфоПоМарке = "";
		ДанныеПомарке = ПолучитьСостояниеАкцизнойМарки(Barcode);
		Если ДанныеПомарке <>Неопределено  Тогда
			ИнфоПоМарке = ИнфоПоМарке+ДанныеПомарке.АлкогольнаяПродукция.Наименование;
			Если ЗначениеЗаполнено(ДанныеПомарке.СправкаБ) Тогда
				ИнфоПоМарке = ИнфоПоМарке+Символы.ПС+"СправкаБ: " + ДанныеПомарке.СправкаБ;
			КонецЕсли;
			Если ЗначениеЗаполнено(ДанныеПомарке.Статус) Тогда
				ИнфоПоМарке = ИнфоПоМарке+Символы.ПС+"Статус: " + ДанныеПомарке.Статус;
			КонецЕсли;
			
		Иначе
			ИнфоПоМарке = "НЕ ЧИСЛИТСЯ В СИСТЕМЕ!!!";
		КонецЕсли;
		
		
		
		
		СтруктураИнфоПоМарке = Новый Структура;
		СтруктураИнфоПоМарке.Вставить("title", ИнфоПоМарке);
		СтруктураИнфоПоМарке.Вставить("value", "");
		СтруктураИнфоПоМарке.Вставить("content", Новый Массив);
		
		СтруктураМарка.content.Добавить(СтруктураИнфоПоМарке);		
		
		
		МассивОтвета.Добавить(СтруктураМарка);
		
		Возврат ПодготовитьОтветJSON(МассивОтвета,,"application/json");
		
	КонецЕсли;	
	
//////////	
//ЯЧЕЙКИ//
//////////

	ТекущаяЯчейка = ДатаМобайл_ОбщийМодуль.ПолучитьЯчейкуПоКодуИлиШтрихкоду(Barcode);
	ВключатьАртикул = УзелПО.ДобавлятьАртикулВНаименование;
	ИспользоватьАртикулКакШтрихкодТовара = УзелПО.ИспользоватьАртикулКакШтрихкодТовара;
	
	ЗапросПоискЯчейки=Новый Запрос;
	ЗапросПоискЯчейки.УстановитьПараметр("ТекущаяЯчейка", ТекущаяЯчейка);	
	ЗапросПоискЯчейки.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	                        |	СкладскиеЯчейки.Ссылка КАК Ячейка
	                        |ИЗ
	                        |	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	                        |ГДЕ
	                        |	СкладскиеЯчейки.Ссылка = &ТекущаяЯчейка";
	
	ВыборкаРезультатПоискаЯчейки=ЗапросПоискЯчейки.Выполнить().Выбрать();
	Если ЗначениеЗаполнено(ТекущаяЯчейка) и ВыборкаРезультатПоискаЯчейки.Следующий() Тогда
		
		НазваниеЯчейки = ?(УзелПО.ВыгружатьВНаименованиеЯчейки=0,ЧистаяСтрока(ТекущаяЯчейка.Наименование), ТекущаяЯчейка.Код);
		НазваниеЯчейки = "Ячейка: " + ЧистаяСтрока(НазваниеЯчейки);
		
		НазваниеСклада = "Склад: "+ЧистаяСтрока(ТекущаяЯчейка.Владелец.Наименование);	
		Если ЗначениеЗаполнено(ТекущаяЯчейка.Помещение) тогда
			НазваниеПомещения = "Помещение: "+ЧистаяСтрока(ТекущаяЯчейка.Помещение.Наименование);
			НазваниеСклада = НазваниеСклада + Символы.ПС + НазваниеПомещения;
		КонецЕсли;
		
		СтруктураЯчейки = Новый Структура;
		СтруктураЯчейки.Вставить("title",НазваниеЯчейки);
		СтруктураЯчейки.Вставить("value",НазваниеСклада);
		СтруктураЯчейки.Вставить("content",Новый Массив);
		
		//Ищем остатки по ячейке
		ЗапросОстатков = Новый Запрос;
		ЗапросОстатков.УстановитьПараметр("ТекущаяЯчейка", ТекущаяЯчейка);
		ЗапросОстатков.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                     |	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
		                     |	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
		                     |	ТоварыВЯчейкахОстатки.Серия КАК Серия,
		                     |	ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка,
		                     |	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток) - СУММА(ТоварыВЯчейкахОстатки.КОтборуОстаток) КАК КоличествоОстаток
		                     |ИЗ
		                     |	РегистрНакопления.ТоварыВЯчейках.Остатки(, Ячейка = &ТекущаяЯчейка) КАК ТоварыВЯчейкахОстатки
		                     |
		                     |СГРУППИРОВАТЬ ПО
		                     |	ТоварыВЯчейкахОстатки.Номенклатура,
		                     |	ТоварыВЯчейкахОстатки.Характеристика,
		                     |	ТоварыВЯчейкахОстатки.Серия,
		                     |	ТоварыВЯчейкахОстатки.Упаковка
		                     |
		                     |ИМЕЮЩИЕ
		                     |	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток) - СУММА(ТоварыВЯчейкахОстатки.КОтборуОстаток) <> 0
		                     |
		                     |УПОРЯДОЧИТЬ ПО
		                     |	ТоварыВЯчейкахОстатки.Номенклатура,
		                     |	ТоварыВЯчейкахОстатки.Характеристика,
		                     |	ТоварыВЯчейкахОстатки.Серия,
		                     |	ТоварыВЯчейкахОстатки.Упаковка
		                     |ИТОГИ
		                     |	СУММА(КоличествоОстаток)
		                     |ПО
		                     |	Номенклатура,
		                     |	Характеристика,
		                     |	Серия,
		                     |	Упаковка";
		
		ВыборкаПоТоварам = ЗапросОстатков.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
		Пока ВыборкаПоТоварам.Следующий() Цикл
			ВыборкаПоХарактеристикам = ВыборкаПоТоварам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
			Пока ВыборкаПоХарактеристикам.Следующий() Цикл
				
				НазваниеТовара = "Товар: " + ?(ВключатьАртикул,ВыборкаПоТоварам.Номенклатура.Артикул + " ","")
				+ ЧистаяСтрока(ВыборкаПоТоварам.Номенклатура.Наименование) + " "
				+ ЧистаяСтрока(ВыборкаПоХарактеристикам.Характеристика.Наименование);
				
				СтруктураТовары = Новый Структура;
				СтруктураТовары.Вставить("title"  , НазваниеТовара);
				СтруктураТовары.Вставить("value"  , "");
				СтруктураТовары.Вставить("content", Новый Массив);
				
				ВыборкаПоСериям = ВыборкаПоХарактеристикам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
				Пока ВыборкаПоСериям.Следующий() Цикл
					
					ВыборкаПоУпаковкам = ВыборкаПоСериям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
					Пока ВыборкаПоУпаковкам.Следующий() Цикл
						
						НазваниеСерии = "";
						Если ЗначениеЗаполнено(ВыборкаПоСериям.Серия) тогда
							НазваниеСерии = "Серия: "+ЧистаяСтрока(ВыборкаПоСериям.Серия.Наименование);
						КонецЕсли;
						СтрокаОстаток = "" + ВыборкаПоУпаковкам.КоличествоОстаток + " " + ЧистаяСтрока(ВыборкаПоУпаковкам.Упаковка.Наименование);
						
						СтруктураОстатки = Новый Структура;
						СтруктураОстатки.Вставить("title",НазваниеСерии);
						СтруктураОстатки.Вставить("value",СтрокаОстаток);
						
						СтруктураТовары.content.Добавить(СтруктураОстатки);
					КонецЦикла;
				КонецЦикла;
				
				//добавляем только если есть строки
				Если СтруктураТовары.content.Количество()>0 тогда
					//если одна строка и нет разбивки, то для красоты выводим данные на уровне выше
					Если СтруктураТовары.content.Количество()=1 и СтруктураТовары.content[0].title="" тогда	
						СтруктураТовары.value = СтруктураТовары.content[0].value;
						СтруктураТовары.content = Новый Массив;
					КонецЕсли;
					СтруктураЯчейки.content.Добавить(СтруктураТовары);
				КонецЕсли;
				
			КонецЦикла;					
		КонецЦикла;	
		
		Если СтруктураЯчейки.content.Количество()=0 тогда 
			СтруктураТовары = Новый Структура;
			СтруктураТовары.Вставить("title", "Остатков не числится...");
			СтруктураТовары.Вставить("value", "");
			СтруктураТовары.Вставить("content", Новый Массив);
			
			СтруктураЯчейки.content.Добавить(СтруктураТовары);		
		КонецЕсли;
		
		МассивОтвета.Добавить(СтруктураЯчейки);
		
		Возврат ПодготовитьОтветJSON(МассивОтвета,,"application/json");
		
	КонецЕсли;
	
	
//////////	
//ТОВАРЫ//
//////////

	ЗапросПоискТовара = Новый Запрос;
	ЗапросПоискТовара.УстановитьПараметр("Barcode", Barcode);
	ЗапросПоискТовара.УстановитьПараметр("ИспользоватьАртикулКакШтрихкодТовара", ИспользоватьАртикулКакШтрихкодТовара);
	ЗапросПоискТовара.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Barcode
	|	И ШтрихкодыНоменклатуры.Номенклатура ССЫЛКА Справочник.Номенклатура
	|	И НЕ ШтрихкодыНоменклатуры.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	//ВЫБОРКА ССЫЛОК ТОВАРОВ И ХАРАКТЕРИСТИК ПО РАЗНЫМ УСЛОВИЯМ ВЕДЕНИЯ ХАРАКТЕРИСТИК ПРИ ИспользоватьАртикулКакШтрихкодТовара 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//БЕЗ ХАРАКТЕРИСТИК
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка) КАК Характеристика
	|ИЗ
	| 	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	&ИспользоватьАртикулКакШтрихкодТовара
	|	И Номенклатура.Артикул = &Barcode
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//ИНДИВИДУАЛЬНЫЕ ХАРАКТЕРИСТИКИ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)) КАК Характеристика
	|ИЗ
	| 	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|			ПО ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка
	|			И Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
	|			И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|ГДЕ
	|	&ИспользоватьАртикулКакШтрихкодТовара
	|	И Номенклатура.Артикул = &Barcode
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И НЕ ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//ОБЩИЕ ХАРАКТЕРИСТИКИ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)) КАК Характеристика
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|			ПО ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВидНоменклатуры
	|			И Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
	|			И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|ГДЕ
	|	&ИспользоватьАртикулКакШтрихкодТовара
	|	И Номенклатура.Артикул = &Barcode
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления 
	|	И НЕ ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//ОБЩИЕ С ДРУГИМ ВИДОМ ХАРАКТЕРИСТИКИ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)) КАК Характеристика
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|			ПО ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВладелецХарактеристик
	|			И Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры)
	|			И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|ГДЕ
	|	&ИспользоватьАртикулКакШтрихкодТовара
	|	И Номенклатура.Артикул = &Barcode
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И НЕ ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL";

	ВыборкаРезультатПоискаТовара = ЗапросПоискТовара.Выполнить().Выбрать();
	
	//Попробуем найти товар по КМ или GTIN КМ
	Если ВыборкаРезультатПоискаТовара.Количество()=0 и стрДлина(Barcode)>30 Тогда		
		Если ДатаМобайл_ОбщийМодуль.ЕстьМаркировка() тогда 
			
			КМ = Лев(Barcode,31);
			ЗначениеШтрихкода = "(01)" + Сред(КМ, 3, 14) + "(21)" + Сред(КМ, 19, 13);
			ЗначениеШтрихкодаДляЗапроса = ""+ЗначениеШтрихкода;
			ЗначениеШтрихкодаДляЗапроса = СтрЗаменить(ЗначениеШтрихкодаДляЗапроса,"_","$_");
			ЗначениеШтрихкодаДляЗапроса = СтрЗаменить(ЗначениеШтрихкодаДляЗапроса,"%","$%");
			ЗначениеШтрихкодаДляЗапроса = ЗначениеШтрихкодаДляЗапроса + "%";
			
			ЗапросПоискТовара = Новый Запрос;
			ЗапросПоискТовара.УстановитьПараметр("ЗначениеШтрихкодаДляЗапроса", ЗначениеШтрихкодаДляЗапроса);
			ЗапросПоискТовара.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			                          |	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
			                          |	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика
			                          |ИЗ
			                          |	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
			                          |ГДЕ
			                          |	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода ПОДОБНО &ЗначениеШтрихкодаДляЗапроса СПЕЦСИМВОЛ ""$""
			                          |	И ШтрихкодыУпаковокТоваров.Номенклатура ССЫЛКА Справочник.Номенклатура
			                          |	И НЕ ШтрихкодыУпаковокТоваров.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
			
			ВыборкаРезультатПоискаТовара = ЗапросПоискТовара.Выполнить().Выбрать();
		КонецЕсли;	
		
		Если ВыборкаРезультатПоискаТовара.Количество()=0 Тогда
			
			ТекущийШтрихкод = Сред(Barcode, 3, 14);
			ТекущийШтрихкод = УдалитьЛидирующиеНули(ТекущийШтрихкод);
			
			ЗапросПоискТовара = Новый Запрос;
			ЗапросПоискТовара.УстановитьПараметр("Barcode", ТекущийШтрихкод);
			ЗапросПоискТовара.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			                          |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
			                          |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
			                          |ИЗ
			                          |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
			                          |ГДЕ
			                          |	ШтрихкодыНоменклатуры.Штрихкод = &Barcode
			                          |	И ШтрихкодыНоменклатуры.Номенклатура ССЫЛКА Справочник.Номенклатура
			                          |	И НЕ ШтрихкодыНоменклатуры.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
			
			ВыборкаРезультатПоискаТовара = ЗапросПоискТовара.Выполнить().Выбрать();
			
		КонецЕсли;		
	КонецЕсли;		
	
	
	Если ВыборкаРезультатПоискаТовара.Количество()>0 Тогда
		
		Пока ВыборкаРезультатПоискаТовара.Следующий() Цикл
			
			МассивАдресныхСкладов = Новый Массив;
			
			НазваниеТовара = "Товар: "   +   ?(ВключатьАртикул,ВыборкаРезультатПоискаТовара.Номенклатура.Артикул + " ","")
			+ ВыборкаРезультатПоискаТовара.Номенклатура + " " 
			+ ВыборкаРезультатПоискаТовара.Характеристика;
			
			ТекущаяЦена = ПолучитьЦенуТовара(ВыборкаРезультатПоискаТовара.Номенклатура, ВыборкаРезультатПоискаТовара.Характеристика, УзелПО.ТипЦен); 
			Если ЗначениеЗаполнено(ТекущаяЦена) тогда
				ТекущаяЦена="Цена: " + ТекущаяЦена;
			Иначе
				ТекущаяЦена="";
			КонецЕсли;
			
			СтруктураТовары = Новый Структура;
			СтруктураТовары.Вставить("title",НазваниеТовара);
			СтруктураТовары.Вставить("value",ТекущаяЦена);
			СтруктураТовары.Вставить("content",Новый Массив);
			
			//Сначала ищем остатки по товару по адресному регистру...
			ЗапросОстатковАдресный =Новый Запрос;
			ЗапросОстатковАдресный.УстановитьПараметр("ТекущаяНоменклатура", ВыборкаРезультатПоискаТовара.Номенклатура);
			ЗапросОстатковАдресный.УстановитьПараметр("ТекущаяХарактеристика", ВыборкаРезультатПоискаТовара.Характеристика);
			
			СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
			ЗапросОстатковАдресный.УстановитьПараметр("Склады", СписокСкладов);
			ЗапросОстатковАдресный.УстановитьПараметр("ВсеСклады", СписокСкладов.Количество()=0);
			
			СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
			ЗапросОстатковАдресный.УстановитьПараметр("Помещения",СписокПомещений);
			ЗапросОстатковАдресный.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);
			
			ЗапросОстатковАдресный.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТоварыВЯчейкахОстатки.Ячейка.Владелец КАК Склад,
			|	ТоварыВЯчейкахОстатки.Ячейка.Помещение КАК Помещение,
			|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
			|	ТоварыВЯчейкахОстатки.Серия КАК Серия,
			|	ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка,
			|	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток) - СУММА(ТоварыВЯчейкахОстатки.КОтборуОстаток) КАК КоличествоОстаток
			|ИЗ
			| 	РегистрНакопления.ТоварыВЯчейках.Остатки(
			|   	,
			|   	Номенклатура = &ТекущаяНоменклатура
			|   	 И Характеристика = &ТекущаяХарактеристика) КАК ТоварыВЯчейкахОстатки
			|ГДЕ
			|   (&ВсеСклады ИЛИ ТоварыВЯчейкахОстатки.Ячейка.Владелец В (&Склады))
			| 		И (&ВсеПомещения ИЛИ ТоварыВЯчейкахОстатки.Ячейка.Помещение В (&Помещения))   
			|СГРУППИРОВАТЬ ПО
			|	ТоварыВЯчейкахОстатки.Ячейка.Владелец,
			|	ТоварыВЯчейкахОстатки.Ячейка.Помещение,
			|	ТоварыВЯчейкахОстатки.Ячейка,
			|	ТоварыВЯчейкахОстатки.Серия,
			|	ТоварыВЯчейкахОстатки.Упаковка
			|ИМЕЮЩИЕ
			| 	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток) - СУММА(ТоварыВЯчейкахОстатки.КОтборуОстаток) <> 0 
			|УПОРЯДОЧИТЬ ПО
			|	ТоварыВЯчейкахОстатки.Ячейка.Владелец,
			|	ТоварыВЯчейкахОстатки.Ячейка.Помещение,
			|	ТоварыВЯчейкахОстатки.Ячейка,
			|	ТоварыВЯчейкахОстатки.Серия,
			|	ТоварыВЯчейкахОстатки.Упаковка
			|ИТОГИ
			|	СУММА(КоличествоОстаток)
			|ПО
			|	Склад,
			|	Помещение,
			|	Ячейка,
			|	Серия,
			|	Упаковка";
			
			ВыборкаПоСкладам=ЗапросОстатковАдресный.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоСкладам.Следующий() Цикл
				
				ВыборкаПоПомещениям = ВыборкаПоСкладам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоПомещениям.Следующий() Цикл
					
					НазваниеСклада = "Склад: "+ЧистаяСтрока(ВыборкаПоСкладам.Склад.Наименование);	
					Если ЗначениеЗаполнено(ВыборкаПоПомещениям.Помещение) тогда
						НазваниеПомещения = "Помещение: "+ЧистаяСтрока(ВыборкаПоПомещениям.Помещение.Наименование);
						НазваниеСклада = НазваниеСклада + Символы.ПС + НазваниеПомещения;
					КонецЕсли;
					
					СтруктураСклады = Новый Структура;
					СтруктураСклады.Вставить("title"  , НазваниеСклада);
					СтруктураСклады.Вставить("value"  , "");
					СтруктураСклады.Вставить("content", Новый Массив);
					
					ВыборкаПоЯчейкам = ВыборкаПоПомещениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПоЯчейкам.Следующий() Цикл
						
						НазваниеЯчейки = ?(УзелПО.ВыгружатьВНаименованиеЯчейки=0,ЧистаяСтрока(ВыборкаПоЯчейкам.Ячейка.Наименование), ВыборкаПоЯчейкам.Ячейка.Код);
						НазваниеЯчейки = "Ячейка: " + ЧистаяСтрока(НазваниеЯчейки);
						
						СтруктураЯчейки = Новый Структура;
						СтруктураЯчейки.Вставить("title"  , НазваниеЯчейки);
						СтруктураЯчейки.Вставить("value"  , "");
						СтруктураЯчейки.Вставить("content", Новый Массив);
						
						ВыборкаПоСериям = ВыборкаПоЯчейкам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаПоСериям.Следующий() Цикл
							
							ВыборкаПоУпаковкам = ВыборкаПоСериям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ВыборкаПоУпаковкам.Следующий() Цикл
								
								НазваниеСерии = "";
								Если ЗначениеЗаполнено(ВыборкаПоСериям.Серия) тогда
									НазваниеСерии = "Серия: "+ЧистаяСтрока(ВыборкаПоСериям.Серия.Наименование);
								КонецЕсли;
								СтрокаОстаток = "" + ВыборкаПоУпаковкам.КоличествоОстаток + " "+ ЧистаяСтрока(ВыборкаПоУпаковкам.Упаковка.Наименование); 
								
								СтруктураОстатки = Новый Структура;
								СтруктураОстатки.Вставить("title",НазваниеСерии);
								СтруктураОстатки.Вставить("value",СтрокаОстаток);
								
								СтруктураЯчейки.content.Добавить(СтруктураОстатки);									
								
							КонецЦикла;
						КонецЦикла;
						
						//добавляем только если есть строки
						Если СтруктураЯчейки.content.Количество()>0 тогда
							//если одна строка и нет разбивки, то для красоты выводим данные на уровне выше
							Если СтруктураЯчейки.content.Количество()=1 и СтруктураЯчейки.content[0].title="" тогда	
								СтруктураЯчейки.value = СтруктураЯчейки.content[0].value;
								СтруктураЯчейки.content = Новый Массив;
							КонецЕсли;
							СтруктураСклады.content.Добавить(СтруктураЯчейки);
						КонецЕсли;
					КонецЦикла;			
					
					//добавляем только если есть строки
					Если СтруктураСклады.content.Количество()>0 тогда
						
						СтруктураТовары.content.Добавить(СтруктураСклады);
						Если МассивАдресныхСкладов.Найти(ВыборкаПоСкладам.Склад)=Неопределено тогда
							МассивАдресныхСкладов.Добавить(ВыборкаПоСкладам.Склад);		
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;					
			КонецЦикла;						
			
			//Затем ищем остатки по товару по обычному регистру на оставщихся складах, исключая адресные...
			ЗапросОстатков =Новый Запрос;
			ЗапросОстатков.УстановитьПараметр("ТекущаяНоменклатура", ВыборкаРезультатПоискаТовара.Номенклатура);
			ЗапросОстатков.УстановитьПараметр("ТекущаяХарактеристика", ВыборкаРезультатПоискаТовара.Характеристика);
			
			СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
			ЗапросОстатков.УстановитьПараметр("Склады", СписокСкладов);
			ЗапросОстатков.УстановитьПараметр("ВсеСклады", СписокСкладов.Количество()=0);
			
			СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
			ЗапросОстатков.УстановитьПараметр("Помещения",СписокПомещений);
			ЗапросОстатков.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);
			
			ЗапросОстатков.УстановитьПараметр("МассивАдресныхСкладов", МассивАдресныхСкладов);
			
			ЗапросОстатков.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТоварыНаСкладахОстатки.Склад,
			|	ТоварыНаСкладахОстатки.Помещение КАК Помещение,
			|	ТоварыНаСкладахОстатки.Серия,
			|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) - СУММА(ТоварыНаСкладахОстатки.КОтгрузкеОстаток) КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.ТоварыНаСкладах.Остатки(
			|			,
			|			Номенклатура = &ТекущаяНоменклатура
			|				И Характеристика = &ТекущаяХарактеристика) КАК ТоварыНаСкладахОстатки
			|ГДЕ
			|	(&ВсеСклады ИЛИ ТоварыНаСкладахОстатки.Склад В (&Склады))
			|		И (НЕ ТоварыНаСкладахОстатки.Склад В (&МассивАдресныхСкладов))
			|		И (&ВсеПомещения ИЛИ ТоварыНаСкладахОстатки.Помещение В (&Помещения)) 
			|СГРУППИРОВАТЬ ПО
			|	ТоварыНаСкладахОстатки.Склад,
			|	ТоварыНаСкладахОстатки.Помещение,
			|	ТоварыНаСкладахОстатки.Серия
			|ИМЕЮЩИЕ
			| 	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток)  - СУММА(ТоварыНаСкладахОстатки.КОтгрузкеОстаток) <> 0
			|УПОРЯДОЧИТЬ ПО
			|	ТоварыНаСкладахОстатки.Склад,
			|	ТоварыНаСкладахОстатки.Помещение,
			|	ТоварыНаСкладахОстатки.Серия
			|ИТОГИ
			|	СУММА(КоличествоОстаток)
			|ПО
			|	Склад,
			|	Помещение,
			|	Серия";
			
			ВыборкаПоСкладам=ЗапросОстатков.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоСкладам.Следующий() Цикл
				
				ВыборкаПоПомещениям = ВыборкаПоСкладам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоПомещениям.Следующий() Цикл
					
					НазваниеСклада = "Склад: "+ЧистаяСтрока(ВыборкаПоСкладам.Склад.Наименование);	
					Если ЗначениеЗаполнено(ВыборкаПоПомещениям.Помещение) тогда
						НазваниеПомещения = "Помещение: "+ЧистаяСтрока(ВыборкаПоПомещениям.Помещение.Наименование);
						НазваниеСклада = НазваниеСклада + Символы.ПС + НазваниеПомещения;
					КонецЕсли;
					
					СтруктураСклады = Новый Структура;
					СтруктураСклады.Вставить("title"  , НазваниеСклада);
					СтруктураСклады.Вставить("value"  , "");
					СтруктураСклады.Вставить("content", Новый Массив);
					
					ВыборкаПоСериям = ВыборкаПоПомещениям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПоСериям.Следующий() Цикл
						
						НазваниеСерии = "";
						Если ЗначениеЗаполнено(ВыборкаПоСериям.Серия) тогда
							НазваниеСерии = "Серия: "+ЧистаяСтрока(ВыборкаПоСериям.Серия.Наименование);
						КонецЕсли;
						СтрокаОстаток = "" + ВыборкаПоСериям.КоличествоОстаток + " "+ ЧистаяСтрока(ВыборкаРезультатПоискаТовара.Номенклатура.ЕдиницаИзмерения.Наименование);  
						
						СтруктураОстатки = Новый Структура;
						СтруктураОстатки.Вставить("title",НазваниеСерии);
						СтруктураОстатки.Вставить("value",СтрокаОстаток);
						
						СтруктураСклады.content.Добавить(СтруктураОстатки);									
						
					КонецЦикла;	
					
					//добавляем только если есть строки
					Если СтруктураСклады.content.Количество()>0 тогда
						//если одна строка и нет разбивки, то для красоты выводим данные на уровне выше
						Если СтруктураСклады.content.Количество()=1 и СтруктураСклады.content[0].title="" тогда	
							СтруктураСклады.value = СтруктураСклады.content[0].value;
							СтруктураСклады.content = Новый Массив;
						КонецЕсли;
						СтруктураТовары.content.Добавить(СтруктураСклады);
					КонецЕсли;
					
				КонецЦикла;					
			КонецЦикла;		
			
			Если СтруктураТовары.content.Количество()=0 тогда 
				СтруктураСклады = Новый Структура;
				СтруктураСклады.Вставить("title", "Остатков не числится...");
				СтруктураСклады.Вставить("value", "");
				СтруктураСклады.Вставить("content", Новый Массив);
				
				СтруктураТовары.content.Добавить(СтруктураСклады);		
			КонецЕсли;
			
			МассивОтвета.Добавить(СтруктураТовары);
			
		КонецЦикла;	
		
		Возврат ПодготовитьОтветJSON(МассивОтвета,,"application/json");
		
	Иначе 
		
		СтруктураТовары = Новый Структура;
		СтруктураТовары.Вставить("title","По штрихкоду данных не найдено...");
		СтруктураТовары.Вставить("value","");
		СтруктураТовары.Вставить("content", Новый Массив);
		
		МассивОтвета.Добавить(СтруктураТовары);
		
		Возврат ПодготовитьОтветJSON(МассивОтвета,,"application/json");
		
	КонецЕсли;

КонецФункции	

Функция ПолучитьИнфоHTML(УзелПО, Barcode)

	ТекстHTML = "<!DOCTYPE html>
	|<html lang=""ru"">
	|<head>
	|	<meta charset=""UTF-8"">
	|	<title>Пример HTML</title>
	|	<style type=""text/css"">
	|		
	|	div.aligncenter {
	|        text-align: center;
	|    }
	|		
	|	p.url {
	|		font-size: 22pt;
	|	}
	|	
	|	p.description {
	|		font-size: 16pt;
	|		color: #808080;
	|	}
	|	
	|	</style>
	|	
	|</head>
	|<body>
	|	<div class=""aligncenter""> 
	|	
	|        <img src=""data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAACAAAAAgCAYAAABzenr0AAAAGXRFWHRTb2Z0d2FyZQBBZG9iZSBJbWFnZVJlYWR5ccllPAAAAyJpVFh0WE1MOmNvbS5hZG9iZS54bXAAAAAAADw/eHBhY2tldCBiZWdpbj0i77u/IiBpZD0iVzVNME1wQ2VoaUh6cmVTek5UY3prYzlkIj8+IDx4OnhtcG1ldGEgeG1sbnM6eD0iYWRvYmU6bnM6bWV0YS8iIHg6eG1wdGs9IkFkb2JlIFhNUCBDb3JlIDUuMy1jMDExIDY2LjE0NTY2MSwgMjAxMi8wMi8wNi0xNDo1NjoyNyAgICAgICAgIj4gPHJkZjpSREYgeG1sbnM6cmRmPSJodHRwOi8vd3d3LnczLm9yZy8xOTk5LzAyLzIyLXJkZi1zeW50YXgtbnMjIj4gPHJkZjpEZXNjcmlwdGlvbiByZGY6YWJvdXQ9IiIgeG1sbnM6eG1wPSJodHRwOi8vbnMuYWRvYmUuY29tL3hhcC8xLjAvIiB4bWxuczp4bXBNTT0iaHR0cDovL25zLmFkb2JlLmNvbS94YXAvMS4wL21tLyIgeG1sbnM6c3RSZWY9Imh0dHA6Ly9ucy5hZG9iZS5jb20veGFwLzEuMC9zVHlwZS9SZXNvdXJjZVJlZiMiIHhtcDpDcmVhdG9yVG9vbD0iQWRvYmUgUGhvdG9zaG9wIENTNiAoV2luZG93cykiIHhtcE1NOkluc3RhbmNlSUQ9InhtcC5paWQ6QTg0ODQ3MEUwMDZEMTFFQUFDQkVBOENCMEJDRTZCRUYiIHhtcE1NOkRvY3VtZW50SUQ9InhtcC5kaWQ6QTg0ODQ3MEYwMDZEMTFFQUFDQkVBOENCMEJDRTZCRUYiPiA8eG1wTU06RGVyaXZlZEZyb20gc3RSZWY6aW5zdGFuY2VJRD0ieG1wLmlpZDpBODQ4NDcwQzAwNkQxMUVBQUNCRUE4Q0IwQkNFNkJFRiIgc3RSZWY6ZG9jdW1lbnRJRD0ieG1wLmRpZDpBODQ4NDcwRDAwNkQxMUVBQUNCRUE4Q0IwQkNFNkJFRiIvPiA8L3JkZjpEZXNjcmlwdGlvbj4gPC9yZGY6UkRGPiA8L3g6eG1wbWV0YT4gPD94cGFja2V0IGVuZD0iciI/PiUzwRcAAAZQSURBVHjarFdriFRlGH6/y7nMzJmZdUd23dZVVzcvFKKVlqJkKF0EwaBCwiyRhAoEJaICoxv9KSTJQlL8YT/6ERSSZeyPFEHFC3mrtGzV1tuuzupe5pw5t+98vd+ZWZ3cdtfNOeywzMd3vu95n+d5L0OklKCepyYtA4cK0CnAq2N2QyPvAkoTUGeMh14vAl0DIAyARhHgH3ghAU0juAeg0WSwr8uBx/f8DZXPgzU6/DB/AnhAa3VGN+o6X844nGnd377k2XM3/lB7KFThkbd9NxmJ/2uUgGXw9dmE0cU5Wx6EAmRE7p0/c+zW/r28GgCuuAFMyRhwcFEzOIEAQgiESFODldgQMm1tIAREiFKte74ATaeTqgogwNOzqF2LlYSiRFmQAEWCpbNFdv/l5b2IAaIw6v9aHQkYlCLOuz4QPDFlUuCcgB0KXnl5hWSyqgzIcmgRgui2fTSmgZHFq5IM8+5dM1COMEkJmUMJrfWQ8kCEKAMZYM6qAohiHiUYnD6NLm9jTNufTekXRiW1VwpoyoIXYhYMevz/94CqGwI/ps4eyJr68YyhfcsoHRPhGqMkmU3qX1iGdgr3LUBJeoc7j49EZ4lhM0JHWSbfbOrac2o1jGQFKxIdLiGp8alSg58FLhBy1wBkv840ofEPTY29pfJZouEG01jIsi0JkBEzQKCkLQZys+wmDbYsbdIvNcbSQqo1CdV6eKW2MY0IIUU5mAoJNeuthN5KOJmu6Fe5Xu3npgkZo9MYBNAVaNAnWmCGVQf11rhNhNPpQkSxvoNampC7B5BKGocszTiQYrLh6+sT4RrkoDHl1AeD0K1WKdZcdD6IKDqOsr2HGPeq/FfrUt5Z+6IV+VVIaqlHxlvG5etRavvyIy3wY5v3+piMHbfoqKKmqYA1RsEPo54u23/R94MZePG7YRg+2lf0nggjaEffDFcC/g0AMaHBhGP73lf1vPBCj9VU/Oja3Gzr+XRTltrfjUm4cbQEi706wvGCT2/YXq7HDbfzst1VE3JF1Jrv9cZfyttb1OJAdeSglTCFWmpoxhVFEa2cnLTNbKKmdf3FWTvW/Xn/+wc6E4tyWmEPl8Vv8gV/guOFa9GSQtF9KyhSqn5+CF6fuxaNmx/OH/y2KkcMzVAYbV9ISEhnZwOnuUPFpqMH23Ibnsy3P/Z43VWoow52GQ6q2pOyCeO4KMMBhELa1NEHKRvT9Sp+Ro+oF6h0VEAoRuIE4V4R+HMnJuxL3Eis+zw/s2l39z1gsAB0hM6V2dCkBT9SRgSNU2BczW00Tuc76Ud88G4h1QVah5+A9l79xBS9e+ObU3+98HC2E67aGqTxMuWzgEoIlEExVXs8H+cACimcBRQ4T8a2GCmA2FBEIp3dwjJm6udgTq571cLRzktNGdfucsxO9OGaUMqdWOtBfRjEjQj6sAMygfrZIXQ7YUNLQ01zLM8QOclvvxrJVKKO+qvH7DB6T37yzpzzKxtrjU2Om0h22Cm8CJpHp9j3SP2RXuGvwLNP9Z+vWFO1UuN6LmVpO/Byc5iCcMsDpFRAiIgEnLbJ5gXm2YbNU0+vzmVqtl2z08lCSJFPWfIIRk0oeSiT0H+vtfSt+GoaFVAs0CTXPqjPmPmJtclZ8d5h6sBNBiIh2kNJtvZCEpbUXIS3x7dBOt2w9JrN4lGrMpvUoaohKYGtBF+V1Nkz2KSO1KXN+9RsECIaHI4HGyiAchYNAOB4fdMkG+3kDBeW8l/gt7MFyNSNPTEuZ80r+gNbLymdBULEqZjFixeqVTFEw1LvMI2D6xaPDayEEhzB0d2BAz0n89BxrAhXTlx6zRHBFiU8HcLPsgxmKLOp94lKTyJ3tR3tfH6gB6A0y2MdRwdjbqt5HyMv+MHqPsebHITRYXUIpSPrfGq7SkmU7Hx30ZvX43iLfT/q+c9CJMtIFBBN6aOMqX7liOiMXfRm246/GBvQxTiaYUps2dQ4HWF2+uGqguM2u0LsU+dpFUHc0VDaf5gfil1dBb+p4AVrkO6IxVMvGahzuR27fvhxt+tnvEBs6++itw9pI5iKS2yoHxwFP/wMZcngBVtVasaMxHSX2p8QYmef4zYi0DfUEo27JanO74L+totZiKr4LyOQSUVf/KTG30hEh/tcb3avFy7BWnGZ3sFU+o8AAwAmPPUznEB9uwAAAABJRU5ErkJggg=="" 
	|	    alt=""Лого DataMobile"">
	|		
	|		
	|		<p class=""url""> 
	|		    <a href=""https://data-mobile.ru/"">Подробнее о DataMobile и других продуктах</a>
	|		</p>
	|		
	|		<p class=""description""> Для отображения контента HTML в пользовательской или типовой функции api/fast_access/html требуется передать в header ответа параметр Content-Type – text/html, а также передать структуру данных в теле ответа </p>
	|		
	|	</div>
	|			
	|</body>
	|</html>";
	
	Возврат ПодготовитьОтветJSON(ТекстHTML,,"text/html");	

КонецФункции

Функция ПолучитьИнфоURL(УзелПО, Barcode)
	
	ТекстURL = "https://data-mobile.ru/";
	Возврат ПодготовитьОтветJSON(ТекстURL,,"text/url");	

КонецФункции
	
Функция ПолучитьИнфоTEXT(УзелПО, Barcode)
	
	
	Если ДатаМобайл_ОбщийМодуль.ЕстьЕГАИС() и (СтрДлина(Barcode) = 68 или СтрДлина(Barcode) = 150) тогда // Инфо по марке ЕГАИС
		
		//есть\нет в системе
		//состояние товара - находится на основном складе или в карантине (брак)
		
		Марка = Barcode;
		ИнфоПоМарке = "";
		ДанныеПомарке = ПолучитьСостояниеАкцизнойМарки(Марка);
		Если ДанныеПомарке <>Неопределено  тогда
			ИнфоПоМарке = ИнфоПоМарке+ДанныеПомарке.АлкогольнаяПродукция.Наименование + Символы.ПС;
			Если ЗначениеЗаполнено(ДанныеПомарке.СправкаБ) тогда
				ИнфоПоМарке = ИнфоПоМарке+"СправкаБ: " + ДанныеПомарке.СправкаБ + Символы.ПС;
			КонецЕсли;
			Если ЗначениеЗаполнено(ДанныеПомарке.Статус) тогда
				ИнфоПоМарке = ИнфоПоМарке+"Статус: " + ДанныеПомарке.Статус + Символы.ПС;
			КонецЕсли;
	
		Иначе
			ИнфоПоМарке = "НЕ ЧИСЛИТСЯ В СИСТЕМЕ!!!";
		КонецЕсли;

		Возврат ПодготовитьОтветJSON("Акцизная марка"+ Символы.ПС + Марка + Символы.ПС + Символы.ПС + ИнфоПоМарке,,"text");
		
	ИНАЧЕ //ОБЫЧНЫЕ ТОВАРЫ
		
	СтрокаВозврата = "";
	ВключатьАртикул = УзелПО.ДобавлятьАртикулВНаименование;
	ИспользоватьАртикулКакШтрихкодТовара = УзелПО.ИспользоватьАртикулКакШтрихкодТовара;

	//Сначала ищем ячейку...	
	ТекущаяЯчейка = ДатаМобайл_ОбщийМодуль.ПолучитьЯчейкуПоКодуИлиШтрихкоду(Barcode);
	ТекущаяЯчейкаНаименование = ?(УзелПО.ВыгружатьВНаименованиеЯчейки=0,ЧистаяСтрока(ТекущаяЯчейка.Наименование), ТекущаяЯчейка.Код);
		
	ЗапросПоискЯчейки=Новый Запрос;
	ЗапросПоискЯчейки.УстановитьПараметр("ТекущаяЯчейка", ТекущаяЯчейка);	
	ЗапросПоискЯчейки.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СкладскиеЯчейки.Ссылка КАК Ячейка
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Ссылка = &ТекущаяЯчейка";
	 
	ВыборкаРезультатПоискаЯчейки=ЗапросПоискЯчейки.Выполнить().Выбрать();
	Если ВыборкаРезультатПоискаЯчейки.Следующий() Тогда
		ИмяЯчейки = "Ячейка: " + ТекущаяЯчейкаНаименование + Символы.ПС + Символы.ПС;
		
		ЗапросОстатков = Новый Запрос;
		ЗапросОстатков.УстановитьПараметр("ТекущаяЯчейка", ТекущаяЯчейка);
		ЗапросОстатков.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыВЯчейкахОстатки.Номенклатура,
		|	ТоварыВЯчейкахОстатки.Характеристика,
		|	ТоварыВЯчейкахОстатки.Серия,
		|	ТоварыВЯчейкахОстатки.Упаковка,
		|	ТоварыВЯчейкахОстатки.Ячейка,
		|	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток)- СУММА(ТоварыВЯчейкахОстатки.КОтборуОстаток) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(,Ячейка=&ТекущаяЯчейка) КАК ТоварыВЯчейкахОстатки
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВЯчейкахОстатки.Номенклатура,
		|	ТоварыВЯчейкахОстатки.Характеристика,
		|	ТоварыВЯчейкахОстатки.Серия,
		|	ТоварыВЯчейкахОстатки.Упаковка,
		|	ТоварыВЯчейкахОстатки.Ячейка			
		|ИМЕЮЩИЕ
		| 	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток) - СУММА(ТоварыВЯчейкахОстатки.КОтборуОстаток) <> 0 
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыВЯчейкахОстатки.Ячейка ВОЗР,
		|	ТоварыВЯчейкахОстатки.Номенклатура ВОЗР,
		|	ТоварыВЯчейкахОстатки.Характеристика ВОЗР,
		|	ТоварыВЯчейкахОстатки.Серия ВОЗР,
		|	ТоварыВЯчейкахОстатки.Упаковка ВОЗР";
		
		ВыборкаРезультатЗапросаОстатков=ЗапросОстатков.Выполнить().Выбрать();
		Если ВыборкаРезультатЗапросаОстатков.Количество()> 0 Тогда
			
			ТекущаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
			ТекущаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();

			Пока ВыборкаРезультатЗапросаОстатков.Следующий() Цикл
				
				Если ВыборкаРезультатЗапросаОстатков.Номенклатура<>ТекущаяНоменклатура или ВыборкаРезультатЗапросаОстатков.Характеристика<>ТекущаяХарактеристика тогда 
					
					ТекущаяНоменклатура = ВыборкаРезультатЗапросаОстатков.Номенклатура;
					ТекущаяХарактеристика = ВыборкаРезультатЗапросаОстатков.Характеристика;
					
					СтрокаВозврата = СтрокаВозврата + Символы.ПС + "Товар: " + ?(ВключатьАртикул,ВыборкаРезультатЗапросаОстатков.Номенклатура.Артикул + " ","")
																			+ ВыборкаРезультатЗапросаОстатков.Номенклатура + " "
																			+ ВыборкаРезультатЗапросаОстатков.Характеристика + "; " + Символы.ПС;
				КонецЕсли;
				
				
					СтрокаВозврата = СтрокаВозврата + ВыборкаРезультатЗапросаОстатков.КоличествоОстаток + " "
													+ ВыборкаРезультатЗапросаОстатков.Упаковка + "; " 
													+ ВыборкаРезультатЗапросаОстатков.Серия + Символы.ПС;		
			КонецЦикла;
		Иначе 
			СтрокаВозврата =  "Товаров не числится...";
		КонецЕсли;
		
		Возврат ПодготовитьОтветJSON(ИмяЯчейки + СтрокаВозврата + Символы.ПС + Символы.ПС,,"text");
		
	КонецЕсли;
	
	//Если ячейки нет, то ищем товар...	
	ЗапросПоискТовара = Новый Запрос;
	ЗапросПоискТовара.УстановитьПараметр("Barcode", Barcode);
	ЗапросПоискТовара.УстановитьПараметр("ИспользоватьАртикулКакШтрихкодТовара", ИспользоватьАртикулКакШтрихкодТовара);

	ЗапросПоискТовара.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Barcode
	|	И ШтрихкодыНоменклатуры.Номенклатура Ссылка Справочник.Номенклатура
	|	И НЕ ШтрихкодыНоменклатуры.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	//ВЫБОРКА ССЫЛОК ТОВАРОВ И ХАРАКТЕРИСТИК ПО РАЗНЫМ УСЛОВИЯМ ВЕДЕНИЯ ХАРАКТЕРИСТИК ПРИ ИспользоватьАртикулКакШтрихкодТовара 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//БЕЗ ХАРАКТЕРИСТИК
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка) КАК Характеристика
	|ИЗ
	| 	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	&ИспользоватьАртикулКакШтрихкодТовара
	|	И Номенклатура.Артикул = &Barcode
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//ИНДИВИДУАЛЬНЫЕ ХАРАКТЕРИСТИКИ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)) КАК Характеристика
	|ИЗ
	| 	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|			ПО ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка
	|			И Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
	|			И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|ГДЕ
	|	&ИспользоватьАртикулКакШтрихкодТовара
	|	И Номенклатура.Артикул = &Barcode
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И НЕ ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//ОБЩИЕ ХАРАКТЕРИСТИКИ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)) КАК Характеристика
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|			ПО ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВидНоменклатуры
	|			И Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
	|			И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|ГДЕ
	|	&ИспользоватьАртикулКакШтрихкодТовара
	|	И Номенклатура.Артикул = &Barcode
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления 
	|	И НЕ ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//ОБЩИЕ С ДРУГИМ ВИДОМ ХАРАКТЕРИСТИКИ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)) КАК Характеристика
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|			ПО ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВладелецХарактеристик
	|			И Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры)
	|			И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|ГДЕ
	|	&ИспользоватьАртикулКакШтрихкодТовара
	|	И Номенклатура.Артикул = &Barcode
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И НЕ ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL";
	
    ВыборкаРезультатПоискаТовара = ЗапросПоискТовара.Выполнить().Выбрать();
	
		Если ВыборкаРезультатПоискаТовара.Количество()=0 и ДатаМобайл_ОбщийМодуль.ЕстьМаркировка() и стрДлина(Barcode)>30 Тогда
			//Попробуем найти товар по КМ	
			КМ = Лев(Barcode,31);
			ЗначениеШтрихкода = "(01)" + Сред(КМ, 3, 14) + "(21)" + Сред(КМ, 19, 13);
	        ЗначениеШтрихкодаДляЗапроса = ""+ЗначениеШтрихкода;
			ЗначениеШтрихкодаДляЗапроса = СтрЗаменить(ЗначениеШтрихкодаДляЗапроса,"_","$_");
			ЗначениеШтрихкодаДляЗапроса = СтрЗаменить(ЗначениеШтрихкодаДляЗапроса,"%","$%");
			ЗначениеШтрихкодаДляЗапроса = ЗначениеШтрихкодаДляЗапроса + "%";
			
			ЗапросПоискТовара = Новый Запрос;
			ЗапросПоискТовара.УстановитьПараметр("ЗначениеШтрихкодаДляЗапроса", ЗначениеШтрихкодаДляЗапроса);
			ЗапросПоискТовара.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
			|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика
			|ИЗ
			|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
			|ГДЕ
			|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода ПОДОБНО &ЗначениеШтрихкодаДляЗапроса СПЕЦСИМВОЛ ""$""
			|	И ШтрихкодыУпаковокТоваров.Номенклатура Ссылка Справочник.Номенклатура
			|	И НЕ ШтрихкодыУпаковокТоваров.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
			
			ВыборкаРезультатПоискаТовара = ЗапросПоискТовара.Выполнить().Выбрать();
			
			Если ВыборкаРезультатПоискаТовара.Количество()=0 тогда
				
				ТекущийШтрихкод = Сред(Barcode, 3, 14);
				ТекущийШтрихкод = УдалитьЛидирующиеНули(ТекущийШтрихкод);
				
				ЗапросПоискТовара = Новый Запрос;
				ЗапросПоискТовара.УстановитьПараметр("Barcode", ТекущийШтрихкод);
				ЗапросПоискТовара.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
				|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
				|ИЗ
				|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
				|ГДЕ
				|	ШтрихкодыНоменклатуры.Штрихкод = &Barcode
				|	И ШтрихкодыНоменклатуры.Номенклатура Ссылка Справочник.Номенклатура";
				
			КонецЕсли;		
	    КонецЕсли;		
		
				
	Если ВыборкаРезультатПоискаТовара.Количество()>0 Тогда	
		Пока ВыборкаРезультатПоискаТовара.Следующий() Цикл
			
			НетНаОстатках = Истина;
			ИмяТовара = "Товар: "   +   ?(ВключатьАртикул,ВыборкаРезультатПоискаТовара.Номенклатура.Артикул + " ","")
			                		+ ВыборкаРезультатПоискаТовара.Номенклатура + " " 
									+ ВыборкаРезультатПоискаТовара.Характеристика + Символы.ПС + Символы.ПС;
			ИнфоТовар = "";
			
			//Сначала ищем остатки по адресному регистру...
			ЗапросОстатковАдресный =Новый Запрос;
			ЗапросОстатковАдресный.УстановитьПараметр("ТекущаяНоменклатура", ВыборкаРезультатПоискаТовара.Номенклатура);
			ЗапросОстатковАдресный.УстановитьПараметр("ТекущаяХарактеристика", ВыборкаРезультатПоискаТовара.Характеристика);
			
			СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
			ЗапросОстатковАдресный.УстановитьПараметр("Склады", СписокСкладов);
			ЗапросОстатковАдресный.УстановитьПараметр("ВсеСклады", СписокСкладов.Количество()=0);

			СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
			ЗапросОстатковАдресный.УстановитьПараметр("Помещения",СписокПомещений);
			ЗапросОстатковАдресный.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);

			ЗапросОстатковАдресный.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТоварыВЯчейкахОстатки.Ячейка.Владелец КАК Склад,
			|	ТоварыВЯчейкахОстатки.Ячейка.Помещение КАК Помещение,
			|	ТоварыВЯчейкахОстатки.Ячейка,
			|	ТоварыВЯчейкахОстатки.Номенклатура,
			|	ТоварыВЯчейкахОстатки.Характеристика,
			|	ТоварыВЯчейкахОстатки.Серия,
			|	ТоварыВЯчейкахОстатки.Упаковка,
			|	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток) - СУММА(ТоварыВЯчейкахОстатки.КОтборуОстаток) КАК КоличествоОстаток
			|ИЗ
			| 	РегистрНакопления.ТоварыВЯчейках.Остатки(
			|   	,
			|   	Номенклатура = &ТекущаяНоменклатура
			|   	 И Характеристика = &ТекущаяХарактеристика) КАК ТоварыВЯчейкахОстатки
			|ГДЕ
			| (&ВсеСклады ИЛИ ТоварыВЯчейкахОстатки.Ячейка.Владелец В (&Склады))
			| И (&ВсеПомещения ИЛИ ТоварыВЯчейкахОстатки.Ячейка.Помещение В (&Помещения))   
			|СГРУППИРОВАТЬ ПО
			|	ТоварыВЯчейкахОстатки.Ячейка.Владелец,
			|	ТоварыВЯчейкахОстатки.Ячейка.Помещение,
			|	ТоварыВЯчейкахОстатки.Ячейка,
			|	ТоварыВЯчейкахОстатки.Номенклатура,
			|	ТоварыВЯчейкахОстатки.Характеристика,
			|	ТоварыВЯчейкахОстатки.Серия,
			|	ТоварыВЯчейкахОстатки.Упаковка
			|ИМЕЮЩИЕ
			| 	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток) - СУММА(ТоварыВЯчейкахОстатки.КОтборуОстаток) <> 0 
			|УПОРЯДОЧИТЬ ПО
			|	ТоварыВЯчейкахОстатки.Ячейка.Владелец ВОЗР,
			|	ТоварыВЯчейкахОстатки.Ячейка ВОЗР,
			|	ТоварыВЯчейкахОстатки.Номенклатура ВОЗР,
			|	ТоварыВЯчейкахОстатки.Характеристика ВОЗР,
			|	ТоварыВЯчейкахОстатки.Серия ВОЗР,
			|	ТоварыВЯчейкахОстатки.Упаковка ВОЗР";
				
			ВыборкаРезультатЗапросаОстатковАдресный=ЗапросОстатковАдресный.Выполнить().Выбрать();
			Если ВыборкаРезультатЗапросаОстатковАдресный.Количество()> 0 Тогда
				
				ТекущийСклад = Справочники.Склады.ПустаяСсылка();
				ТекущееПомещение = Справочники.СкладскиеПомещения.ПустаяСсылка();
				ТекущаяЯчейка = Справочники.СкладскиеЯчейки.ПустаяСсылка();
				
				Пока ВыборкаРезультатЗапросаОстатковАдресный.Следующий() Цикл
					
					Если ВыборкаРезультатЗапросаОстатковАдресный.Склад<>ТекущийСклад тогда 
						ТекущийСклад = ВыборкаРезультатЗапросаОстатковАдресный.Склад;
						
						ИнфоТовар = ИнфоТовар + Символы.ПС + ВыборкаРезультатЗапросаОстатковАдресный.Склад + Символы.ПС;
					КонецЕсли;
					
					Если ВыборкаРезультатЗапросаОстатковАдресный.Помещение<>ТекущееПомещение и ЗначениеЗаполнено(ВыборкаРезультатЗапросаОстатковАдресный.Помещение) тогда 
						ТекущееПомещение = ВыборкаРезультатЗапросаОстатковАдресный.Помещение;
						
						ИнфоТовар = ИнфоТовар + Символы.ПС + ВыборкаРезультатЗапросаОстатковАдресный.Помещение + Символы.ПС;
					КонецЕсли;

					Если ВыборкаРезультатЗапросаОстатковАдресный.Ячейка<>ТекущаяЯчейка тогда 
						ТекущаяЯчейка = ВыборкаРезультатЗапросаОстатковАдресный.Ячейка;
						ТекущаяЯчейкаНаименование = ?(УзелПО.ВыгружатьВНаименованиеЯчейки=0,ЧистаяСтрока(ВыборкаРезультатЗапросаОстатковАдресный.Ячейка.Наименование), ВыборкаРезультатЗапросаОстатковАдресный.Ячейка.Код);
						
						ИнфоТовар = ИнфоТовар + Символы.ПС + ТекущаяЯчейкаНаименование + Символы.ПС;
					КонецЕсли;

					
					ИнфоТовар = ИнфоТовар + ВыборкаРезультатЗапросаОстатковАдресный.КоличествоОстаток + " "
										  + ВыборкаРезультатЗапросаОстатковАдресный.Упаковка + "; " 
										  + ВыборкаРезультатЗапросаОстатковАдресный.Серия + Символы.ПС;
										  
					НетНаОстатках = Ложь;					  
				КонецЦикла;
				
				ИнфоТовар = ИнфоТовар + Символы.ПС+ Символы.ПС+ Символы.ПС;
			КонецЕсли;	
			

			
			//Затем по обычному регистру на оставщихся складах...
			ЗапросОстатков =Новый Запрос;
			ЗапросОстатков.УстановитьПараметр("ТекущаяНоменклатура", ВыборкаРезультатПоискаТовара.Номенклатура);
			ЗапросОстатков.УстановитьПараметр("ТекущаяХарактеристика", ВыборкаРезультатПоискаТовара.Характеристика);
			
			СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
			ЗапросОстатков.УстановитьПараметр("Склады", СписокСкладов);
			ЗапросОстатков.УстановитьПараметр("ВсеСклады", СписокСкладов.Количество()=0);
			
			СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
			ЗапросОстатков.УстановитьПараметр("Помещения",СписокПомещений);
			ЗапросОстатков.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);

			ЗапросОстатков.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТоварыНаСкладахОстатки.Склад,
			|	ТоварыНаСкладахОстатки.Помещение КАК Помещение,
			|	ТоварыНаСкладахОстатки.Номенклатура,
			|	ТоварыНаСкладахОстатки.Характеристика,
			|	ТоварыНаСкладахОстатки.Серия КАК Серия,
			|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) - СУММА(ТоварыНаСкладахОстатки.КОтгрузкеОстаток) КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.ТоварыНаСкладах.Остатки(
			|			,
			|			Номенклатура = &ТекущаяНоменклатура
			|				И Характеристика = &ТекущаяХарактеристика) КАК ТоварыНаСкладахОстатки
			|ГДЕ
			|	(&ВсеСклады ИЛИ ТоварыНаСкладахОстатки.Склад В (&Склады))
			|	И 1=1 
			|СГРУППИРОВАТЬ ПО
			|	ТоварыНаСкладахОстатки.Склад,
			|	ТоварыНаСкладахОстатки.Помещение,
			|	ТоварыНаСкладахОстатки.Номенклатура,
			|	ТоварыНаСкладахОстатки.Характеристика,
			|	ТоварыНаСкладахОстатки.Серия
			|ИМЕЮЩИЕ
			| 	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток)  - СУММА(ТоварыНаСкладахОстатки.КОтгрузкеОстаток) <> 0
			|УПОРЯДОЧИТЬ ПО
			|	ТоварыНаСкладахОстатки.Склад ВОЗР,
			|	ТоварыНаСкладахОстатки.Номенклатура ВОЗР,
			|	ТоварыНаСкладахОстатки.Характеристика ВОЗР,
			|	ТоварыНаСкладахОстатки.Серия ВОЗР";
			
			Если УзелПО.УчитыватьОстаткиПоРегиструСвободныеОстатки Тогда
				ЗапросОстатков.Текст = СтрЗаменить(ЗапросОстатков.Текст, "ТоварыНаСкладахОстатки.Помещение"			, "Значение(Справочник.СкладскиеПомещения.)");
				ЗапросОстатков.Текст = СтрЗаменить(ЗапросОстатков.Текст, "ТоварыНаСкладахОстатки.Серия"				, "ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.)");
				ЗапросОстатков.Текст = СтрЗаменить(ЗапросОстатков.Текст, "ТоварыНаСкладах"							, "СвободныеОстатки");
				ЗапросОстатков.Текст = СтрЗаменить(ЗапросОстатков.Текст, "СвободныеОстаткиОстатки.ВНаличииОстаток"	, "СвободныеОстаткиОстатки.ВНаличииОстаток - СвободныеОстаткиОстатки.ВРезервеСоСкладаОстаток");
				ЗапросОстатков.Текст = СтрЗаменить(ЗапросОстатков.Текст, "КОтгрузкеОстаток"							, "ВРезервеСоСкладаОстаток");
			Иначе
				ЗапросОстатков.Текст = СтрЗаменить(ЗапросОстатков.Текст, "1=1"										, "(&ВсеПомещения ИЛИ ТоварыНаСкладахОстатки.Помещение В (&Помещения))");
			КонецЕсли;
			
			ВыборкаРезультатЗапросаОстатков=ЗапросОстатков.Выполнить().Выбрать();
			Если ВыборкаРезультатЗапросаОстатков.Количество()> 0 Тогда   
				
				ТекущийСклад = Справочники.Склады.ПустаяСсылка();
				ТекущееПомещение = Справочники.СкладскиеПомещения.ПустаяСсылка();
				
				Пока ВыборкаРезультатЗапросаОстатков.Следующий() Цикл
					
					Если ВыборкаРезультатЗапросаОстатков.Склад<>ТекущийСклад тогда 
						ТекущийСклад = ВыборкаРезультатЗапросаОстатков.Склад;
						
						ИнфоТовар = ИнфоТовар + Символы.ПС + ВыборкаРезультатЗапросаОстатков.Склад + Символы.ПС;
					КонецЕсли;
					
					Если ВыборкаРезультатЗапросаОстатков.Помещение<>ТекущееПомещение и ЗначениеЗаполнено(ВыборкаРезультатЗапросаОстатков.Помещение) тогда 
						ТекущееПомещение = ВыборкаРезультатЗапросаОстатков.Помещение;
						
						ИнфоТовар = ИнфоТовар + Символы.ПС + ВыборкаРезультатЗапросаОстатков.Помещение + Символы.ПС;
					КонецЕсли;

					ИнфоТовар = ИнфоТовар + ВыборкаРезультатЗапросаОстатков.КоличествоОстаток + " "
										  + ВыборкаРезультатЗапросаОстатков.Номенклатура.ЕдиницаИзмерения + "; "
										  + ВыборкаРезультатЗапросаОстатков.Серия + Символы.ПС;
										  
					НетНаОстатках = Ложь;
				КонецЦикла;
			КонецЕсли;	

			//Нет остатков...
			Если НетНаОстатках тогда
				ИнфоТовар =  "Остатков не числится...";
			КонецЕсли;				
			
			СтрокаВозврата = ИмяТовара + ИнфоТовар + Символы.ПС + Символы.ПС + Символы.ПС;
		КонецЦикла;
		
		Возврат ПодготовитьОтветJSON(СтрокаВозврата,,"text");

	Иначе 

		Возврат ПодготовитьОтветJSON("По штрихкоду данных не найдено...",,"text");

	КонецЕсли;
	
	КонецЕсли;	

КонецФункции	
		
//2.9		
Функция ПолучитьИнфо(УзелПО, Barcode)
	
	СтруктураОтвета = Новый Структура;
	
	Если ДатаМобайл_ОбщийМодуль.ЕстьЕГАИС() и (СтрДлина(Barcode) = 68 или СтрДлина(Barcode) = 150) Тогда // Инфо по марке ЕГАИС
		
		//есть\нет в системе
		//состояние товара - находится на основном складе или в карантине (брак)
		
		Марка = Barcode;
		ИнфоПоМарке = "";
		ДанныеПомарке = ПолучитьСостояниеАкцизнойМарки(Марка);
		Если ДанныеПомарке <>Неопределено  Тогда
			ИнфоПоМарке = ИнфоПоМарке+ДанныеПомарке.АлкогольнаяПродукция.Наименование + Символы.ПС;
			Если ЗначениеЗаполнено(ДанныеПомарке.СправкаБ) Тогда
				ИнфоПоМарке = ИнфоПоМарке+"СправкаБ: " + ДанныеПомарке.СправкаБ + Символы.ПС;
			КонецЕсли;
			Если ЗначениеЗаполнено(ДанныеПомарке.Статус) Тогда
				ИнфоПоМарке = ИнфоПоМарке+"Статус: " + ДанныеПомарке.Статус + Символы.ПС;
			КонецЕсли;
	
		Иначе
			ИнфоПоМарке = "НЕ ЧИСЛИТСЯ В СИСТЕМЕ!!!";
		КонецЕсли;
		
		Возврат ПодготовитьОтветJSON(СтруктураОтвета.Вставить("data", "Акцизная марка"+ Символы.ПС + Марка + Символы.ПС + Символы.ПС + ИнфоПоМарке));

		
	ИНАЧЕ //ОБЫЧНЫЕ ТОВАРЫ
		
	СтрокаВозврата = "";
	ВключатьАртикул=УзелПО.ДобавлятьАртикулВНаименование;
	ИспользоватьАртикулКакШтрихкодТовара = УзелПО.ИспользоватьАртикулКакШтрихкодТовара;
	//Сначала ищем ячейку...	
	ТекущаяЯчейка = ДатаМобайл_ОбщийМодуль.ПолучитьЯчейкуПоКодуИлиШтрихкоду(Barcode);
	ТекущаяЯчейкаНаименование = ?(УзелПО.ВыгружатьВНаименованиеЯчейки=0,ЧистаяСтрока(ТекущаяЯчейка.Наименование), ТекущаяЯчейка.Код);
		
	ЗапросПоискЯчейки=Новый Запрос;
	ЗапросПоискЯчейки.УстановитьПараметр("ТекущаяЯчейка", ТекущаяЯчейка);	
	ЗапросПоискЯчейки.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	СкладскиеЯчейки.Ссылка КАК Ячейка
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	СкладскиеЯчейки.Ссылка = &ТекущаяЯчейка";
	 
	ВыборкаРезультатПоискаЯчейки=ЗапросПоискЯчейки.Выполнить().Выбрать();
	Если ВыборкаРезультатПоискаЯчейки.Следующий() Тогда
		ИмяЯчейки = "Ячейка: " + ТекущаяЯчейкаНаименование + Символы.ПС + Символы.ПС;
		
		ЗапросОстатков = Новый Запрос;
		ЗапросОстатков.УстановитьПараметр("ТекущаяЯчейка", ТекущаяЯчейка);
		ЗапросОстатков.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыВЯчейкахОстатки.Номенклатура,
		|	ТоварыВЯчейкахОстатки.Характеристика,
		|	ТоварыВЯчейкахОстатки.Серия,
		|	ТоварыВЯчейкахОстатки.Упаковка,
		|	ТоварыВЯчейкахОстатки.Ячейка,
		|	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток)- СУММА(ТоварыВЯчейкахОстатки.КОтборуОстаток) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(,Ячейка=&ТекущаяЯчейка) КАК ТоварыВЯчейкахОстатки
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВЯчейкахОстатки.Номенклатура,
		|	ТоварыВЯчейкахОстатки.Характеристика,
		|	ТоварыВЯчейкахОстатки.Серия,
		|	ТоварыВЯчейкахОстатки.Упаковка,
		|	ТоварыВЯчейкахОстатки.Ячейка			
		|ИМЕЮЩИЕ
		| 	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток) - СУММА(ТоварыВЯчейкахОстатки.КОтборуОстаток) <> 0 
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыВЯчейкахОстатки.Ячейка ВОЗР,
		|	ТоварыВЯчейкахОстатки.Номенклатура ВОЗР,
		|	ТоварыВЯчейкахОстатки.Характеристика ВОЗР,
		|	ТоварыВЯчейкахОстатки.Серия ВОЗР,
		|	ТоварыВЯчейкахОстатки.Упаковка ВОЗР";
		
		ВыборкаРезультатЗапросаОстатков=ЗапросОстатков.Выполнить().Выбрать();
		Если ВыборкаРезультатЗапросаОстатков.Количество()> 0 Тогда
			
			ТекущаяНоменклатура = Справочники.Номенклатура.ПустаяСсылка();
			ТекущаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();

			Пока ВыборкаРезультатЗапросаОстатков.Следующий() Цикл
				
				Если ВыборкаРезультатЗапросаОстатков.Номенклатура<>ТекущаяНоменклатура или ВыборкаРезультатЗапросаОстатков.Характеристика<>ТекущаяХарактеристика Тогда 
					
					ТекущаяНоменклатура = ВыборкаРезультатЗапросаОстатков.Номенклатура;
					ТекущаяХарактеристика = ВыборкаРезультатЗапросаОстатков.Характеристика;
					
					СтрокаВозврата = СтрокаВозврата + Символы.ПС + "Товар: " + ?(ВключатьАртикул,ВыборкаРезультатЗапросаОстатков.Номенклатура.Артикул + " ","")
																			+ ВыборкаРезультатЗапросаОстатков.Номенклатура + " "
																			+ ВыборкаРезультатЗапросаОстатков.Характеристика + "; " + Символы.ПС;
				КонецЕсли;
				
				
					СтрокаВозврата = СтрокаВозврата + ВыборкаРезультатЗапросаОстатков.КоличествоОстаток + " "
													+ ВыборкаРезультатЗапросаОстатков.Упаковка + "; " 
													+ ВыборкаРезультатЗапросаОстатков.Серия + Символы.ПС;		
			КонецЦикла;
		Иначе 
			СтрокаВозврата =  "Товаров не числится...";
		КонецЕсли;
		РезСтрока = ИмяЯчейки + СтрокаВозврата;
		
		СтруктураОтвета.Вставить("data", РезСтрока);
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
		
	КонецЕсли;
	
	//Если ячейки нет, то ищем товар...	
	
	ЗапросПоискТовара = Новый Запрос;
	ЗапросПоискТовара.УстановитьПараметр("Barcode", Barcode);
	ЗапросПоискТовара.УстановитьПараметр("ИспользоватьАртикулКакШтрихкодТовара", ИспользоватьАртикулКакШтрихкодТовара);
	ЗапросПоискТовара.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Barcode
	|	И ШтрихкодыНоменклатуры.Номенклатура ССЫЛКА Справочник.Номенклатура
	|	И НЕ ШтрихкодыНоменклатуры.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	//ВЫБОРКА ССЫЛОК ТОВАРОВ И ХАРАКТЕРИСТИК ПО РАЗНЫМ УСЛОВИЯМ ВЕДЕНИЯ ХАРАКТЕРИСТИК ПРИ ИспользоватьАртикулКакШтрихкодТовара 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//БЕЗ ХАРАКТЕРИСТИК
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка) КАК Характеристика
	|ИЗ
	| 	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	&ИспользоватьАртикулКакШтрихкодТовара
	|	И Номенклатура.Артикул = &Barcode
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ
	|	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//ИНДИВИДУАЛЬНЫЕ ХАРАКТЕРИСТИКИ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)) КАК Характеристика
	|ИЗ
	| 	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|			ПО ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка
	|			И Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
	|			И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|ГДЕ
	|	&ИспользоватьАртикулКакШтрихкодТовара
	|	И Номенклатура.Артикул = &Barcode
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И НЕ ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//ОБЩИЕ ХАРАКТЕРИСТИКИ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)) КАК Характеристика
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|			ПО ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВидНоменклатуры
	|			И Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
	|			И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|ГДЕ
	|	&ИспользоватьАртикулКакШтрихкодТовара
	|	И Номенклатура.Артикул = &Barcode
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления 
	|	И НЕ ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//ОБЩИЕ С ДРУГИМ ВИДОМ ХАРАКТЕРИСТИКИ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)) КАК Характеристика
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|			ПО ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВладелецХарактеристик
	|			И Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры)
	|			И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
	|ГДЕ
	|	&ИспользоватьАртикулКакШтрихкодТовара
	|	И Номенклатура.Артикул = &Barcode
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И НЕ ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL";
	
    ВыборкаРезультатПоискаТовара = ЗапросПоискТовара.Выполнить().Выбрать();
	
		Если ВыборкаРезультатПоискаТовара.Количество()=0 и ДатаМобайл_ОбщийМодуль.ЕстьМаркировка() и стрДлина(Barcode)>30 Тогда
			//Попробуем найти товар по КМ	
			КМ = Лев(Barcode,31);
			ЗначениеШтрихкода = "(01)" + Сред(КМ, 3, 14) + "(21)" + Сред(КМ, 19, 13);
	        ЗначениеШтрихкодаДляЗапроса = ""+ЗначениеШтрихкода;
			ЗначениеШтрихкодаДляЗапроса = СтрЗаменить(ЗначениеШтрихкодаДляЗапроса,"_","$_");
			ЗначениеШтрихкодаДляЗапроса = СтрЗаменить(ЗначениеШтрихкодаДляЗапроса,"%","$%");
			ЗначениеШтрихкодаДляЗапроса = ЗначениеШтрихкодаДляЗапроса + "%";
			
			ЗапросПоискТовара = Новый Запрос;
			ЗапросПоискТовара.УстановитьПараметр("ЗначениеШтрихкодаДляЗапроса", ЗначениеШтрихкодаДляЗапроса);
			ЗапросПоискТовара.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
			|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика
			|ИЗ
			|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
			|ГДЕ
			|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода ПОДОБНО &ЗначениеШтрихкодаДляЗапроса СПЕЦСИМВОЛ ""$""
			|	И ШтрихкодыУпаковокТоваров.Номенклатура Ссылка Справочник.Номенклатура
			|	И НЕ ШтрихкодыУпаковокТоваров.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
			
			ВыборкаРезультатПоискаТовара = ЗапросПоискТовара.Выполнить().Выбрать();
			
			Если ВыборкаРезультатПоискаТовара.Количество()=0 Тогда
				
				ТекущийШтрихкод = Сред(Barcode, 3, 14);
				ТекущийШтрихкод = УдалитьЛидирующиеНули(ТекущийШтрихкод);
				
				ЗапросПоискТовара = Новый Запрос;
				ЗапросПоискТовара.УстановитьПараметр("Barcode", ТекущийШтрихкод);
				ЗапросПоискТовара.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
				|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
				|ИЗ
				|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
				|ГДЕ
				|	ШтрихкодыНоменклатуры.Штрихкод = &Barcode
				|	И ШтрихкодыНоменклатуры.Номенклатура Ссылка Справочник.Номенклатура";
				
			КонецЕсли;		
	    КонецЕсли;		
		
				
	Если ВыборкаРезультатПоискаТовара.Количество()>0 Тогда	
		Пока ВыборкаРезультатПоискаТовара.Следующий() Цикл
			
			НетНаОстатках = Истина;
			ИмяТовара = "Товар: "   +   ?(ВключатьАртикул,ВыборкаРезультатПоискаТовара.Номенклатура.Артикул + " ","")
			                		+ ВыборкаРезультатПоискаТовара.Номенклатура + " " 
									+ ВыборкаРезультатПоискаТовара.Характеристика + Символы.ПС + Символы.ПС;
			ИнфоТовар = "";
			
			//Сначала ищем остатки по адресному регистру...
			ЗапросОстатковАдресный =Новый Запрос;
			ЗапросОстатковАдресный.УстановитьПараметр("ТекущаяНоменклатура", ВыборкаРезультатПоискаТовара.Номенклатура);
			ЗапросОстатковАдресный.УстановитьПараметр("ТекущаяХарактеристика", ВыборкаРезультатПоискаТовара.Характеристика);
			
			СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
			ЗапросОстатковАдресный.УстановитьПараметр("Склады", СписокСкладов);
			ЗапросОстатковАдресный.УстановитьПараметр("ВсеСклады", СписокСкладов.Количество()=0);

			СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
			ЗапросОстатковАдресный.УстановитьПараметр("Помещения",СписокПомещений);
			ЗапросОстатковАдресный.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);

			ЗапросОстатковАдресный.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТоварыВЯчейкахОстатки.Ячейка.Владелец КАК Склад,
			|	ТоварыВЯчейкахОстатки.Ячейка.Помещение КАК Помещение,
			|	ТоварыВЯчейкахОстатки.Ячейка,
			|	ТоварыВЯчейкахОстатки.Номенклатура,
			|	ТоварыВЯчейкахОстатки.Характеристика,
			|	ТоварыВЯчейкахОстатки.Серия,
			|	ТоварыВЯчейкахОстатки.Упаковка,
			|	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток) - СУММА(ТоварыВЯчейкахОстатки.КОтборуОстаток) КАК КоличествоОстаток
			|ИЗ
			| 	РегистрНакопления.ТоварыВЯчейках.Остатки(
			|   	,
			|   	Номенклатура = &ТекущаяНоменклатура
			|   	 И Характеристика = &ТекущаяХарактеристика) КАК ТоварыВЯчейкахОстатки
			|ГДЕ
			| (&ВсеСклады ИЛИ ТоварыВЯчейкахОстатки.Ячейка.Владелец В (&Склады))
			| И (&ВсеПомещения ИЛИ ТоварыВЯчейкахОстатки.Ячейка.Помещение В (&Помещения))   
			|СГРУППИРОВАТЬ ПО
			|	ТоварыВЯчейкахОстатки.Ячейка.Владелец,
			|	ТоварыВЯчейкахОстатки.Ячейка.Помещение,
			|	ТоварыВЯчейкахОстатки.Ячейка,
			|	ТоварыВЯчейкахОстатки.Номенклатура,
			|	ТоварыВЯчейкахОстатки.Характеристика,
			|	ТоварыВЯчейкахОстатки.Серия,
			|	ТоварыВЯчейкахОстатки.Упаковка
			|ИМЕЮЩИЕ
			| 	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток) - СУММА(ТоварыВЯчейкахОстатки.КОтборуОстаток) <> 0 
			|УПОРЯДОЧИТЬ ПО
			|	ТоварыВЯчейкахОстатки.Ячейка.Владелец ВОЗР,
			|	ТоварыВЯчейкахОстатки.Ячейка ВОЗР,
			|	ТоварыВЯчейкахОстатки.Номенклатура ВОЗР,
			|	ТоварыВЯчейкахОстатки.Характеристика ВОЗР,
			|	ТоварыВЯчейкахОстатки.Серия ВОЗР,
			|	ТоварыВЯчейкахОстатки.Упаковка ВОЗР";
				
			ВыборкаРезультатЗапросаОстатковАдресный=ЗапросОстатковАдресный.Выполнить().Выбрать();
			Если ВыборкаРезультатЗапросаОстатковАдресный.Количество()> 0 Тогда
				
				ТекущийСклад = Справочники.Склады.ПустаяСсылка();
				ТекущееПомещение = Справочники.СкладскиеПомещения.ПустаяСсылка();
				ТекущаяЯчейка = Справочники.СкладскиеЯчейки.ПустаяСсылка();
				
				Пока ВыборкаРезультатЗапросаОстатковАдресный.Следующий() Цикл
					
					Если ВыборкаРезультатЗапросаОстатковАдресный.Склад<>ТекущийСклад Тогда 
						ТекущийСклад = ВыборкаРезультатЗапросаОстатковАдресный.Склад;
						
						ИнфоТовар = ИнфоТовар + Символы.ПС + ВыборкаРезультатЗапросаОстатковАдресный.Склад + Символы.ПС;
					КонецЕсли;
					
					Если ВыборкаРезультатЗапросаОстатковАдресный.Помещение<>ТекущееПомещение и ЗначениеЗаполнено(ВыборкаРезультатЗапросаОстатковАдресный.Помещение) Тогда 
						ТекущееПомещение = ВыборкаРезультатЗапросаОстатковАдресный.Помещение;
						
						ИнфоТовар = ИнфоТовар + Символы.ПС + ВыборкаРезультатЗапросаОстатковАдресный.Помещение + Символы.ПС;
					КонецЕсли;

					Если ВыборкаРезультатЗапросаОстатковАдресный.Ячейка<>ТекущаяЯчейка Тогда 
						ТекущаяЯчейка = ВыборкаРезультатЗапросаОстатковАдресный.Ячейка;
						ТекущаяЯчейкаНаименование = ?(УзелПО.ВыгружатьВНаименованиеЯчейки=0,ЧистаяСтрока(ВыборкаРезультатЗапросаОстатковАдресный.Ячейка.Наименование), ВыборкаРезультатЗапросаОстатковАдресный.Ячейка.Код);
						
						ИнфоТовар = ИнфоТовар + Символы.ПС + ТекущаяЯчейкаНаименование + Символы.ПС;
					КонецЕсли;

					
					ИнфоТовар = ИнфоТовар + ВыборкаРезультатЗапросаОстатковАдресный.КоличествоОстаток + " "
										  + ВыборкаРезультатЗапросаОстатковАдресный.Упаковка + "; " 
										  + ВыборкаРезультатЗапросаОстатковАдресный.Серия + Символы.ПС;
										  
					НетНаОстатках = Ложь;					  
				КонецЦикла;
				
				ИнфоТовар = ИнфоТовар + Символы.ПС+ Символы.ПС+ Символы.ПС;
			КонецЕсли;	
			

			
			//Затем по обычному регистру на оставщихся складах...
			ЗапросОстатков =Новый Запрос;
			ЗапросОстатков.УстановитьПараметр("ТекущаяНоменклатура", ВыборкаРезультатПоискаТовара.Номенклатура);
			ЗапросОстатков.УстановитьПараметр("ТекущаяХарактеристика", ВыборкаРезультатПоискаТовара.Характеристика);
			
			СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
			ЗапросОстатков.УстановитьПараметр("Склады", СписокСкладов);
			ЗапросОстатков.УстановитьПараметр("ВсеСклады", СписокСкладов.Количество()=0);
			
			СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
			ЗапросОстатков.УстановитьПараметр("Помещения",СписокПомещений);
			ЗапросОстатков.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);

			ЗапросОстатков.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТоварыНаСкладахОстатки.Склад,
			|	ТоварыНаСкладахОстатки.Помещение КАК Помещение,
			|	ТоварыНаСкладахОстатки.Номенклатура,
			|	ТоварыНаСкладахОстатки.Характеристика,
			|	ТоварыНаСкладахОстатки.Серия,
			|	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток) - СУММА(ТоварыНаСкладахОстатки.КОтгрузкеОстаток) КАК КоличествоОстаток
			|ИЗ
			|	РегистрНакопления.ТоварыНаСкладах.Остатки(
			|			,
			|			Номенклатура = &ТекущаяНоменклатура
			|				И Характеристика = &ТекущаяХарактеристика) КАК ТоварыНаСкладахОстатки
			|ГДЕ
			|	(&ВсеСклады ИЛИ ТоварыНаСкладахОстатки.Склад В (&Склады))
			|	И (&ВсеПомещения ИЛИ ТоварыНаСкладахОстатки.Помещение В (&Помещения)) 
			|СГРУППИРОВАТЬ ПО
			|	ТоварыНаСкладахОстатки.Склад,
			|	ТоварыНаСкладахОстатки.Помещение,
			|	ТоварыНаСкладахОстатки.Номенклатура,
			|	ТоварыНаСкладахОстатки.Характеристика,
			|	ТоварыНаСкладахОстатки.Серия
			|ИМЕЮЩИЕ
			| 	СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток)  - СУММА(ТоварыНаСкладахОстатки.КОтгрузкеОстаток) <> 0
			|УПОРЯДОЧИТЬ ПО
			|	ТоварыНаСкладахОстатки.Склад ВОЗР,
			|	ТоварыНаСкладахОстатки.Номенклатура ВОЗР,
			|	ТоварыНаСкладахОстатки.Характеристика ВОЗР,
			|	ТоварыНаСкладахОстатки.Серия ВОЗР";
			
			ВыборкаРезультатЗапросаОстатков=ЗапросОстатков.Выполнить().Выбрать();
			Если ВыборкаРезультатЗапросаОстатков.Количество()> 0 Тогда   
				
				ТекущийСклад = Справочники.Склады.ПустаяСсылка();
				ТекущееПомещение = Справочники.СкладскиеПомещения.ПустаяСсылка();
				
				Пока ВыборкаРезультатЗапросаОстатков.Следующий() Цикл
					
					Если ВыборкаРезультатЗапросаОстатков.Склад<>ТекущийСклад Тогда 
						ТекущийСклад = ВыборкаРезультатЗапросаОстатков.Склад;
						
						ИнфоТовар = ИнфоТовар + Символы.ПС + ВыборкаРезультатЗапросаОстатков.Склад + Символы.ПС;
					КонецЕсли;
					
					Если ВыборкаРезультатЗапросаОстатков.Помещение<>ТекущееПомещение и ЗначениеЗаполнено(ВыборкаРезультатЗапросаОстатков.Помещение) Тогда 
						ТекущееПомещение = ВыборкаРезультатЗапросаОстатков.Помещение;
						
						ИнфоТовар = ИнфоТовар + Символы.ПС + ВыборкаРезультатЗапросаОстатков.Помещение + Символы.ПС;
					КонецЕсли;

					ИнфоТовар = ИнфоТовар + ВыборкаРезультатЗапросаОстатков.КоличествоОстаток + " "
										  + ВыборкаРезультатЗапросаОстатков.Номенклатура.ЕдиницаИзмерения + "; "
										  + ВыборкаРезультатЗапросаОстатков.Серия + Символы.ПС;
										  
					НетНаОстатках = Ложь;
				КонецЦикла;
			КонецЕсли;	

			//Нет остатков...
			Если НетНаОстатках Тогда
				ИнфоТовар =  "Остатков не числится...";
			КонецЕсли;				
			
			СтрокаВозврата = ИмяТовара + ИнфоТовар;
		КонецЦикла;
		
		СтруктураОтвета.Вставить("data", СтрокаВозврата);
		
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
		
	Иначе 
		
		СтруктураОтвета.Вставить("data", "По штрихкоду данных не найдено...");
		Возврат ПодготовитьОтветJSON(СтруктураОтвета);
	КонецЕсли;
	
	КонецЕсли;	

КонецФункции	

Функция ПолучитьСостояниеАкцизнойМарки(ИдентификаторМарки = "")
	
		
	PDFBarcode = ИдентификаторМарки;
	СтруктураДанных = Новый Структура("АлкогольнаяПродукция, СправкаБ, Статус");
	
	Если ДатаМобайл_ОбщийМодуль.ЕстьАСТ() Тогда
		ЗапросЕГАИС = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	астМаркиЕГАИС.НоменклатураЕГАИС.Ссылка КАК АлкогольнаяПродукция,
		|	"""" КАК СправкаБ,
		|	"""" КАК Статус
		|ИЗ
		|	Справочник.астМаркиЕГАИС КАК астМаркиЕГАИС
		|ГДЕ
		|	астМаркиЕГАИС.Наименование = &Код
		|	И НЕ астМаркиЕГАИС.ПометкаУдаления");
		ЗапросЕГАИС.УстановитьПараметр("Код", PDFBarcode);
		Результат = ЗапросЕГАИС.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураДанных, Результат);
			Возврат СтруктураДанных;
		КонецЕсли;
		
		Если стрДлина(PDFBarcode)=68 Тогда
			Алкокод=КодНоменклатурыЕГАИСПоPDF417(PDFBarcode);	
			ЗапросЕГАИС = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЕГАИС_Номенклатура.Ссылка КАК АлкогольнаяПродукция,
			|	"""" КАК СправкаБ,
			|	"""" КАК Статус
			|ИЗ
			|	Справочник.астНоменклатураЕГАИС КАК ЕГАИС_Номенклатура
			|ГДЕ
			|	ЕГАИС_Номенклатура.Код = &Код
			|	И НЕ ЕГАИС_Номенклатура.ПометкаУдаления");
			
			ЗапросЕГАИС.УстановитьПараметр("Код", Алкокод);
			
			Результат = ЗапросЕГАИС.Выполнить().Выбрать();
			Если Результат.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(СтруктураДанных, Результат);
				Возврат СтруктураДанных;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ДатаМобайл_ОбщийМодуль.ЕстьКТ2000() Тогда
		ЗапросЕГАИС = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	МаркиЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	МаркиЕГАИС.СправкаБ КАК СправкаБ,
		|	"""" КАК Статус
		|ИЗ
		|	РегистрСведений.алкХранилищеАкцизныхМарок.СрезПоследних(, Марка = &Упаковка) КАК МаркиЕГАИС
		|");
		ЗапросЕГАИС.УстановитьПараметр("Код", PDFBarcode);
		
		Результат = ЗапросЕГАИС.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураДанных, Результат);
			Возврат СтруктураДанных;
		КонецЕсли;
		
	Иначе
		ЗапросЕГАИС = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЕГАИС_РегистрМарок.АлкогольнаяПродукция.Ссылка КАК АлкогольнаяПродукция,
		|	ЕГАИС_РегистрМарок.Справка2 КАК СправкаБ,
		|	ЕГАИС_РегистрМарок.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.АкцизныеМаркиЕГАИС КАК ЕГАИС_РегистрМарок
		|ГДЕ
		|	ЕГАИС_РегистрМарок.АкцизнаяМарка = &ЕГАИС_Код
		|	И НЕ ЕГАИС_РегистрМарок.АлкогольнаяПродукция.ПометкаУдаления");
		МаркаСсылка = Справочники.ШтрихкодыУпаковокТоваров.НайтиПоРеквизиту("ЗначениеШтрихкода",PDFBarcode);
		ЗапросЕГАИС.УстановитьПараметр("ЕГАИС_Код", МаркаСсылка);
		
		
		Результат = ЗапросЕГАИС.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураДанных, Результат);
			Возврат СтруктураДанных;
		КонецЕсли;
		
		
		Если стрДлина(PDFBarcode) = 68 Тогда 
			
			ЗапросЕГАИС = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЕГАИС_Номенклатура.Ссылка КАК АлкогольнаяПродукция,
			|	ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка) КАК СправкаБ,
			|	ЗНАЧЕНИЕ(Перечисление.СтатусыАкцизныхМарок.ПустаяСсылка) КАК Статус
			|ИЗ
			|	Справочник.КлассификаторАлкогольнойПродукцииЕГАИС КАК ЕГАИС_Номенклатура
			|ГДЕ
			|	ЕГАИС_Номенклатура.Код = &Код
			|	И НЕ ЕГАИС_Номенклатура.ПометкаУдаления");
			Алкокод=КодНоменклатурыЕГАИСПоPDF417(PDFBarcode);
			ЗапросЕГАИС.УстановитьПараметр("Код", Алкокод);
			
			Результат = ЗапросЕГАИС.Выполнить().Выбрать();
			Если Результат.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(СтруктураДанных, Результат);
				Возврат СтруктураДанных;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

#Область ПланОбмена

Функция НайтиУзел(SN)
	Запрос=Новый Запрос("ВЫБРАТЬ первые 1
	|	ДатаМобайл_СписокТСД.Ссылка
	|ИЗ
	|	ПланОбмена.ДатаМобайл_СписокТСД КАК ДатаМобайл_СписокТСД
	|ГДЕ
	|	ДатаМобайл_СписокТСД.Код = &Код");
	Запрос.УстановитьПараметр("Код",SN);
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Ссылка;
	КонецЕсли;	
	Возврат Неопределено;
КонецФункции	

Функция NewTSD(SN, UserName)
	НовыйТСД = ПланыОбмена.ДатаМобайл_СписокТСД.СоздатьУзел();
	НовыйТСД.Код = SN;
	НовыйТСД.Наименование = SN;
	НовыйТСД.Записать();
	
	Если ЗначениеЗаполнено(НовыйТСД.Ссылка) Тогда
		ДатаМобайл_ОбщийМодуль.ЗаписьЗначенийУзлаОбменаТСД(НовыйТСД.Ссылка, "ТекущийПользователь", UserName);
	КонецЕсли;
	
	Возврат НовыйТСД.Ссылка;
КонецФункции

Функция ПолучитьАтрибуты(УзелПО)
	
	СтруктураАтрибутов = Новый Структура;
	СтруктураАтрибутов.Вставить("ИмяАтрибута1",УзелПО.ИмяАтрибута1);
	СтруктураАтрибутов.Вставить("ИмяАтрибута2",УзелПО.ИмяАтрибута2);
	СтруктураАтрибутов.Вставить("ИмяАтрибута3",УзелПО.ИмяАтрибута3);
	СтруктураАтрибутов.Вставить("ИмяАтрибута4",УзелПО.ИмяАтрибута4);
	СтруктураАтрибутов.Вставить("ИмяАтрибута5",УзелПО.ИмяАтрибута5);
	СтруктураАтрибутов.Вставить("ИмяАтрибута6",УзелПО.ИмяАтрибута6);
	СтруктураАтрибутов.Вставить("ИмяАтрибута7",УзелПО.ИмяАтрибута7);
	СтруктураАтрибутов.Вставить("ИмяАтрибута8",УзелПО.ИмяАтрибута8);
	СтруктураАтрибутов.Вставить("ИмяАтрибута9",УзелПО.ИмяАтрибута9);
	СтруктураАтрибутов.Вставить("ИмяАтрибута10",УзелПО.ИмяАтрибута10);
	
	
	Возврат СтруктураАтрибутов;	
	
КонецФункции

Процедура УстановитьЗначениеИЗСтроки(НоменклатураОбъект, ИмяРеквизита, НовоеЗначениеРеквизитаСтрокой, ТекстОшибки = "")
	
	Если ИмяРеквизита = "Код" Тогда
		ТипРеквизита = Новый ОписаниеТипов("Строка");
	Иначе	
		ТипРеквизита = Метаданные.Справочники.Номенклатура.Реквизиты[ИмяРеквизита].Тип;	
	КонецЕсли; 
	
	Если ТипРеквизита = Новый ОписаниеТипов("Строка") ИЛИ ТипРеквизита.СодержитТип(Тип("Строка")) Тогда
		НоменклатураОбъект[ИмяРеквизита] = НовоеЗначениеРеквизитаСтрокой;
	ИначеЕсли ТипРеквизита = Новый ОписаниеТипов("Булево") ИЛИ ТипРеквизита.СодержитТип(Тип("Булево")) Тогда
		Если НовоеЗначениеРеквизитаСтрокой = "Да" ИЛИ НовоеЗначениеРеквизитаСтрокой = "Нет" Тогда
			НоменклатураОбъект[ИмяРеквизита] = Булево(НовоеЗначениеРеквизитаСтрокой);
		Иначе
			ТекстОшибки = ТекстОшибки + "Не удалось установить значение для реквизита '" + ИмяРеквизита + "' - возможны только строки Да или Нет" + Символы.ПС;
		КонецЕсли;
	ИначеЕсли ТипРеквизита = Новый ОписаниеТипов("Число") ИЛИ ТипРеквизита.СодержитТип(Тип("Число")) Тогда
		Попытка
			НоменклатураОбъект[ИмяРеквизита] = Число(СтрЗаменить(СтрЗаменить(НовоеЗначениеРеквизитаСтрокой, " ", ""), " ", ""));
		Исключение
			ТекстОшибки = ТекстОшибки + "Не удалось установить значение для реквизита '" + ИмяРеквизита + "' - неизвестный формат числа" + Символы.ПС;
		КонецПопытки;
	ИначеЕсли ТипРеквизита = Новый ОписаниеТипов("Дата") ИЛИ ТипРеквизита.СодержитТип(Тип("Дата")) Тогда
		Попытка
			НоменклатураОбъект[ИмяРеквизита] = Дата(НовоеЗначениеРеквизитаСтрокой);
		Исключение
			ТекстОшибки = ТекстОшибки + "Не удалось установить значение для реквизита '" + ИмяРеквизита + "' - неизвестный формат даты" + Символы.ПС;
		КонецПопытки;
	Иначе
		
		// Типы Справочник и перечисление, варианты с составнымы типами или определяемым типом не рассматриваем
		МетаданныеРеквизита = Метаданные.НайтиПоТипу(ТипЗнч(НоменклатураОбъект[ИмяРеквизита]));
		Если МетаданныеРеквизита <> Неопределено Тогда
			
			ПолноеИмя = МетаданныеРеквизита.ПолноеИмя();
			Если Лев(ПолноеИмя, 13) = "Перечисление." Тогда
				Попытка
					НоменклатураОбъект[ИмяРеквизита] = ПредопределенноеЗначение(ПолноеИмя + "." + НовоеЗначениеРеквизитаСтрокой);
				Исключение
					ТекстОшибки = ТекстОшибки + "Не удалось установить значение для реквизита '" + ИмяРеквизита + "' - неизвестное значение перечисления" + Символы.ПС;
				КонецПопытки;
			ИначеЕсли Лев(ПолноеИмя, 11) = "Справочник." Тогда
				
				ЕстьОшибка = Ложь;
				Попытка
					ИмяСправочника = Прав(ПолноеИмя, СтрДлина(ПолноеИмя) - 11);
					Ссылка = Справочники[ИмяСправочника].НайтиПоНаименованию(НовоеЗначениеРеквизитаСтрокой, Истина);
					Если ЗначениеЗаполнено(Ссылка) Тогда
						НоменклатураОбъект[ИмяРеквизита] = Ссылка;
					Иначе
						ЕстьОшибка = Истина;
					КонецЕсли;
				Исключение
					ЕстьОшибка = Истина;
				КонецПопытки;
				
				Если ЕстьОшибка Тогда
					ТекстОшибки = ТекстОшибки + "Не удалось установить значение для реквизита '" + ИмяРеквизита + "' - справочник не найден" + Символы.ПС;
				КонецЕсли;
				
			Иначе
				ТекстОшибки = ТекстОшибки + "Не удалось установить значение для реквизита '" + ИмяРеквизита + "' - неизвестный тип реквизита" + Символы.ПС;
			КонецЕсли;
		Иначе
			ТекстОшибки = ТекстОшибки + "Не удалось установить значение для реквизита '" + ИмяРеквизита + "' - неизвестный тип реквизита" + Символы.ПС;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДополнительныйРеквизитАтрибута(Номенклатура,НаименованиеСвойства)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ 
	
	|ВЫБОР 
	|	КОГДА 
	|		ВЫРАЗИТЬ(ЕСТЬNULL(СправочникНоменклатураДополнительныеРеквизиты.Значение.Наименование,"""") КАК СТРОКА (100)) = """" 
	|	ТОГДА 
	|		СправочникНоменклатураДополнительныеРеквизиты.Значение 
	|	ИНАЧЕ
	|   	ВЫРАЗИТЬ(СправочникНоменклатураДополнительныеРеквизиты.Значение.Наименование КАК СТРОКА (100)) 
	|КОНЕЦ КАК Значение
	|ИЗ
	|Справочник.Номенклатура.ДополнительныеРеквизиты КАК СправочникНоменклатураДополнительныеРеквизиты
	|ГДЕ 
	|СправочникНоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
	|И СправочникНоменклатураДополнительныеРеквизиты.Свойство.Заголовок = &НаименованиеСвойства";
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("НаименованиеСвойства",СтрЗаменить(НаименованиеСвойства,"ДР_",""));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат ЧистаяСтрока(Выборка.Значение);
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#Область Штрихкодирование

Функция ПолучитьГУИДПоШтрихкоду(Barcode)
	
	Штрихкод16 = ДатаМобайл_ОбщийМодуль.ПреобразоватьДесятичноеЧислоВШестнадцатиричнуюСистемуСчисления(Barcode);
	
	Если СтрДлина(Штрихкод16) < 32 Тогда
		
		Пока СтрДлина(Штрихкод16) < 32 Цикл
			Штрихкод16 = Строка("0")+Штрихкод16;
		КонецЦикла;
		
	КонецЕсли;
	
	ГУИД = Сред(Штрихкод16, 1,  8)
	+ "-" + Сред(Штрихкод16, 9,  4)
	+ "-" + Сред(Штрихкод16, 13, 4)
	+ "-" + Сред(Штрихкод16, 17, 4)
	+ "-" + Сред(Штрихкод16, 21, 12);
	
	Возврат ГУИД;
	
КонецФункции	

Функция ЧисловойКодПоСсылке(Ссылка)
	ШестнадчатиричноеЧисло = СтрЗаменить(Строка(Ссылка.УникальныйИдентификатор()),"-","");
	Возврат ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(ШестнадчатиричноеЧисло);
КонецФункции

Функция ПреобразоватьИзШестнадцатиричнойСистемыСчисленияВДесятичноеЧисло(Знач Значение)
	
	Значение = НРег(Значение);
	ДлинаСтроки = СтрДлина(Значение);
	
	Результат = 0;
	Для НомерСимвола = 1 По ДлинаСтроки Цикл
		Результат = Результат * 16 + Найти("0123456789abcdef", Сред(Значение, НомерСимвола, 1)) - 1;
	КонецЦикла;
	
	Возврат Формат(Результат, "ЧГ=0");
	
КонецФункции

Функция КонтрольныйСимволEAN(ШтрихКод, Тип)

	Четн   = 0;
	Нечетн = 0;

	КоличествоИтераций = ?(Тип = 13 ИЛИ Тип = 14, 6, 4);

	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) и (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;

	Если Тип = 14 Тогда
		Нечетн = Нечетн + Сред(ШтрихКод, 13, 1);
		Нечетн = Нечетн * 3;
	ИначеЕсли Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;

	КонтЦифра = 10 - (Четн + Нечетн) % 10;

	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));

КонецФункции // КонтрольныйСимволEAN()

#КонецОбласти

#Область Документы

Функция СоздатьДокумент(SN, UserName, DocOutID,TemplateID)
	УзелПО=НайтиУзел(SN);
	Если УзелПО=Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);  
	КонецЕсли;
	Запрос=Новый Запрос("ВЫБРАТЬ
	                   	|	ДатаМобайл_ШаблоныДокументов.Ссылка КАК ШаблонСсылка
	                    |ИЗ
	                    |	Справочник.ДатаМобайл_ШаблоныДокументов КАК ДатаМобайл_ШаблоныДокументов
	                    |ГДЕ
	                    |	ДатаМобайл_ШаблоныДокументов.Код = &ИД");
	Запрос.УстановитьПараметр("ИД",TemplateID);
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Док=Справочники.ДатаМобайл_ДокументыТСД.СоздатьЭлемент();
		Док.УстановитьНовыйКод();
		Док.Шаблон=Рез.ШаблонСсылка;
		Док.ДатаСоздания=ТекущаяДата();
		Док.ДатаНачалаСбора=ТекущаяДата();
		
		Если НЕ (Док.Шаблон.ГрупповаяРабота) Тогда
			Док.ТСД=УзелПО;
		КонецЕсли;
	
		Док.Дата=ТекущаяДата();
		Док.Номер="DMO-"+Формат(Док.код,"ЧДЦ=2; ЧРД=.; ЧН=0; ЧГ=0");
		Док.Комментарий=DocOutID;
		Док.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
		Если Док.Шаблон.ГрупповаяРабота Тогда
			Док.ОбменДанными.Получатели.Заполнить();
		Иначе
			Док.ОбменДанными.Получатели.Очистить();
		КонецЕсли;
		Док.Записать();
		
		Возврат Док.Ссылка;
	Иначе	
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции

Процедура ЗаполнитьОбъектШаблона(ОбъектШаблона,ШаблонСсылка, AppVersion)
	
	ВерсияПО31ИлиВыше = Ложь;
	
	Попытка
		AppVersion = СтрЗаменить(AppVersion, ".", "");
		ВерсияПОЧислом = Число(Лев(AppVersion, 2));
		Если ВерсияПОЧислом = 31 Или ВерсияПОЧислом > 31 Тогда
			ВерсияПО31ИлиВыше = Истина;		
		КонецЕсли; 
	Исключение	
	КонецПопытки;
	
	Запрос=Новый Запрос(	
	"ВЫБРАТЬ 	
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка, ЗНАЧЕНИЕ(Справочник.ДатаМобайл_ШаблоныДокументов.ПустаяСсылка)) КАК ШаблонСсылка,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.Код, 0) КАК id,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.Наименование, """") КАК name,
	|	ИСТИНА КАК is_use_all_barcodes,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ПометкаУдаления, ЛОЖЬ) КАК is_deleted,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.РазрешеноСозданиеНаТСД, ЛОЖЬ) КАК is_allow_create_on_device,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ОбновлятьПриКаждомОткрытии, ЛОЖЬ) КАК is_load_rows_on_open_doc,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ОбновлятьТоварыСДокументом, ЛОЖЬ) КАК is_load_arts_with_doc,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ЗапретитьРучноеИзменениеКлиента, ЛОЖЬ) КАК is_disable_manual_change_client,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ЗапретитьИзменениеКлиентаКардРидером, ЛОЖЬ) КАК is_disable_reader_change_client,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.КардРидер_Трек1, ЛОЖЬ) КАК is_reader_track_1_use,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.КардРидер_Трек2, ЛОЖЬ) КАК is_reader_track_2_use,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.КардРидер_Трек3, ЛОЖЬ) КАК is_reader_track_3_use,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ГенерацияПаклистаНаСервере, 0) КАК pack_list_generate_mode,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ШтрихкодыТолькоПоШаблонам, ЛОЖЬ) КАК is_use_barcode_templates,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ПриемкаПоПодбору, ЛОЖЬ) КАК is_use_select_log_as_insert_task,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ПриПриемкеЗапрашиватьТовар, ЛОЖЬ) КАК is_scan_art_again,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.РазрешитьВыгрузкуНеполногоДокумента, 0) КАК unload_incorrect_doc_action,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.РазрешитьВыгрузкуНеполногоДокументаВариант, 0) КАК unload_incorrect_doc_option,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ПоштучноеПеремещение, 0) КАК is_from_select_to_insert_art_by_art,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ПриСканированииНовогоТовара, 0) КАК new_art_action,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ГрупповаяРабота, ЛОЖЬ) КАК is_multi_doc,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ГрупповаяРаботаЗвуковоеОповещение, ЛОЖЬ) КАК is_play_multi_doc_sound,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ГрупповаяРаботаИнтервалОпроса, 0) КАК multi_doc_timeout,		
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ИспользоватьСервисRateGoods, ЛОЖЬ) КАК is_use_online_arts_catalog,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ОповеститьОНовомДокументе, ЛОЖЬ) КАК is_notify_getting_doc,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ВводТовараБезСканирования, ЛОЖЬ) КАК is_manual_apply_art,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ВводЯчейкиБезСканирования, ЛОЖЬ) КАК is_manual_apply_cell,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.УдалитьОстатокЗаданияПослеВводаСтроки, ЛОЖЬ) КАК is_delete_left_task_qty,
	|   1 = 1,
	|   ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ДополнительныеФормыСТоваром, ЛОЖЬ) КАК is_use_additional_forms,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ДополнительныеФормыОнлайнОбновлениеСправочника, ЛОЖЬ) КАК is_update_forms_from_server,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.РазрешитьПропускатьВводУпаковочногоЛиста, ЛОЖЬ) КАК is_can_skip_pack,	
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ВыгружатьВыполненныйНаТСДДокументАвтоматически, ЛОЖЬ) КАК is_unload_completed_doc,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ВыгружатьВыполненныйНаТСДДочернийДокументАвтоматически, ЛОЖЬ) КАК is_unload_completed_child_doc,	 
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.МаркировкаКоличествоЕдиницВУпаковкеПриАгрегации, 0) КАК required_pack_qty,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ЗагружатьСписокСерийССервера, ЛОЖЬ) КАК is_get_sn_list_from_server,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ИспользоватьВторойСклад, ЛОЖЬ) КАК is_use_second_warehouse,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ТипБизнесПроцесса, 0) КАК process_id,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.Описание, """") КАК description
	|	ПОМЕСТИТЬ ОбщиеНастройки
	|ИЗ
	|	Справочник.ДатаМобайл_ШаблоныДокументов КАК ДатаМобайл_ШаблоныДокументов
	|ГДЕ
	|	ДатаМобайл_ШаблоныДокументов.Ссылка = &ШаблонСсылка
	|;
	|  	ВЫБРАТЬ 
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ИспользоватьПодбор, ЛОЖЬ) КАК is_use_operation,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ПриСканированииТовараПодбор, 0) КАК art_scan_action,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ПриПревышенииЗаданияПодбор, 0) КАК task_exceed_action,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ПриПревышенииЛимитаПодбор, 0) КАК limit_exceed_action,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ИспользованиеЯчеекПодбор, 0) КАК use_cell_mode,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ИспользованиеУпаковочныхЛистовПодбор, 0) КАК use_pack_mode,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.УчитыватьЯчеекВЗаданииПодбор, ЛОЖЬ) КАК is_check_cell_by_task,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.УчитыватьСерийниковВЗаданииПодбор, ЛОЖЬ) КАК is_check_sn_by_task,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.РучнойВводКоличестваПодбор, ЛОЖЬ) КАК is_manual_quantity,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ПодтверждатьЭнтеромПодбор, ЛОЖЬ) КАК is_enter_to_commit,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ОтсылатьГотовуюЗаписьНаСерверПодбор, ЛОЖЬ) КАК is_send_row_to_server,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ПечатьЭтикеткиПриПодборе, 0) КАК print_label_mode,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ИспользованиеСерийниковПодбор, 0) КАК use_sn_mode,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ВыгрузкаЯчеекПодбор, 0) КАК enter_cell_type,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ЗагружатьCписокЯчеекССервераПодбор, ЛОЖЬ) КАК is_get_cells_from_server,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.УникальныеСерийныеНомераПодбор, ЛОЖЬ) КАК is_use_unique_sn,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ОбработкаЯчейкиЦеликомПодбор, ЛОЖЬ) КАК is_handle_whole_cell,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ИспользоватьФотофиксациюПодбор, ЛОЖЬ) КАК is_use_photo_fixation,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.СерНомНеПустойПодбор, ЛОЖЬ) КАК is_require_enter_sn,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ПодборПроверкаУпаковочныхЛистовПоЗаданию, ЛОЖЬ) КАК is_check_pack_by_task
	|	ПОМЕСТИТЬ Подбор
	|ИЗ
	|	Справочник.ДатаМобайл_ШаблоныДокументов КАК ДатаМобайл_ШаблоныДокументов
	|ГДЕ
	|	ДатаМобайл_ШаблоныДокументов.Ссылка = &ШаблонСсылка
	|;
	|  	ВЫБРАТЬ 
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ИспользоватьПриемку, ЛОЖЬ) КАК is_use_operation,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ПриСканированииТовараПриемка, 0) КАК art_scan_action,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ПриПревышенииЗаданияПриемка, 0) КАК task_exceed_action,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ПриПревышенииЛимитаПриемка, 0) КАК limit_exceed_action,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ИспользованиеЯчеекПриемка, 0) КАК use_cell_mode,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ИспользованиеУпаковочныхЛистовПриемка, 0) КАК use_pack_mode,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.УчитыватьЯчеекВЗаданииПриемка, ЛОЖЬ) КАК is_check_cell_by_task,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.УчитыватьСерийниковВЗаданииПриемка, ЛОЖЬ) КАК is_check_sn_by_task,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.РучнойВводКоличестваПриемка, ЛОЖЬ) КАК is_manual_quantity,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ПодтверждатьЭнтеромПриемка, ЛОЖЬ) КАК is_enter_to_commit,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ОтсылатьГотовуюЗаписьНаСерверПриемка, ЛОЖЬ) КАК is_send_row_to_server,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ПечатьЭтикеткиПриПриемке, 0) КАК print_label_mode,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ИспользованиеСерийниковПриемка, 0) КАК use_sn_mode,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ВыгрузкаЯчеекПриемка, 0) КАК enter_cell_type,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ЗагружатьCписокЯчеекССервераПриемка, ЛОЖЬ) КАК is_get_cells_from_server,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.УникальныеСерийныеНомераПриемка, ЛОЖЬ) КАК is_use_unique_sn,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ОбработкаЯчейкиЦеликомПриемка, ЛОЖЬ) КАК is_handle_whole_cell,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ИспользоватьФотофиксациюПриемка, ЛОЖЬ) КАК is_use_photo_fixation,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.СерНомНеПустойПриемка, ЛОЖЬ) КАК is_require_enter_sn,
	|	ЛОЖЬ КАК is_check_pack_by_task
	|	ПОМЕСТИТЬ Приемка
	|ИЗ
	|	Справочник.ДатаМобайл_ШаблоныДокументов КАК ДатаМобайл_ШаблоныДокументов
	|ГДЕ
	|	ДатаМобайл_ШаблоныДокументов.Ссылка = &ШаблонСсылка
	|;
	|  	ВЫБРАТЬ 
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ЕГАИС, ЛОЖЬ) КАК is_egais_doc,
	|	ЛОЖЬ КАК is_use_bottling_date,
	|	0 КАК enter_data_matrix_mode,
	|	0 КАК enter_pdf417_barcode_mode,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.СопоставлениеЕГАИС, ЛОЖЬ) КАК is_compare,
	|	ЛОЖЬ КАК is_use_blank_a,
	|	ЛОЖЬ КАК is_use_blank_b,
	|	ЛОЖЬ КАК is_check_mark_on_server,
	|	ЛОЖЬ КАК is_get_bottling_date_from_server,
	|	1 КАК version
	|	ПОМЕСТИТЬ ЕГАИС
	|ИЗ
	|	Справочник.ДатаМобайл_ШаблоныДокументов КАК ДатаМобайл_ШаблоныДокументов
	|ГДЕ
	|	ДатаМобайл_ШаблоныДокументов.Ссылка = &ШаблонСсылка
	|;
	|  	ВЫБРАТЬ 
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ИспользоватьМаркировку, ЛОЖЬ) КАК is_marking_doc,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.МаркировкаСканироватьEAN, 0) КАК ean_scan_type,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.МаркировкаEANсоответствуетGTIN, ЛОЖЬ) КАК is_ean_equals_gtin,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.МаркировкаИгнорироватьНесоответствиеТовараПоЕАNиКМ, ЛОЖЬ) КАК is_ignore_art_mismatch_by_ean_km,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.МаркировкаДополнительныйПоискПоКМ, ЛОЖЬ) КАК is_search_by_km,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.МаркировкаЗапретитьПодборНемаркируемыхТоваров, ЛОЖЬ) КАК is_only_mark_art,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.МаркировкаВводМаркируемогоТовараБезКМ, 0) КАК without_km_enter_type,	
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.МаркировкаПроверкаВладелькаКМ, ЛОЖЬ) КАК check_km_owner_action,
	|	ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.МаркировкаПроверкаСтатусаКМ, ЛОЖЬ) КАК check_km_status_action
	|	ПОМЕСТИТЬ Маркировка
	|ИЗ
	|	Справочник.ДатаМобайл_ШаблоныДокументов КАК ДатаМобайл_ШаблоныДокументов
	|ГДЕ
	|	ДатаМобайл_ШаблоныДокументов.Ссылка = &ШаблонСсылка
	|");
	
	Если ВерсияПО31ИлиВыше Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ДополнительныеФормыСТоваром, ЛОЖЬ) КАК is_use_additional_forms", "ВЫБОР
		|	КОГДА ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ДополнительныеФормыСТоваром, ЛОЖЬ) = ИСТИНА
		|		ТОГДА 0
		|	ИНАЧЕ 1
		|	КОНЕЦ КАК additional_forms_for_art_mode");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ИспользоватьДопФормы, ЛОЖЬ) КАК is_use_additional_forms");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ДополнительныеФормыСТоваром, ЛОЖЬ)", "ВЫБОР
		|	КОГДА ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ИспользоватьДопФормы, ЛОЖЬ) = ИСТИНА
		|		И ЕСТЬNULL(ДатаМобайл_ШаблоныДокументов.Ссылка.ДополнительныеФормыСТоваром, ЛОЖЬ) = ИСТИНА
		|	ТОГДА ИСТИНА
		|	ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ"); 
	КонецЕсли; 

	Запрос.УстановитьПараметр("ШаблонСсылка", ШаблонСсылка);
	
	РезультатПакета = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
		
	ПервыйЗапрос = РезультатПакета[0].Выгрузить();
	
	Для Каждого Элемент Из ПервыйЗапрос Цикл
		ЗаполнитьЗначенияСвойств(ОбъектШаблона, Элемент);
	КонецЦикла;
	
	Если ШаблонСсылка.ИспользованиеСерийниковПодбор<>0 или ШаблонСсылка.ИспользованиеСерийниковПриемка<>0 Тогда
		ОбъектШаблона.Вставить("is_multi_sn_logic", Истина);
	КонецЕсли;
	
	//unique_barcode_mode принимает значения 
	//(0. Выключено, 1. Для всех ШК, 2. Только для весовых ШК) 
	//используем только 0 и 1	
	Если ШаблонСсылка.УникальныеШтрихкодыНоменклатурыВДокументе Тогда
		ОбъектШаблона.Вставить("unique_barcode_mode", 1);
	КонецЕсли;
	
	//search_barcode_priority принимает значения
	//(0. Сначала товары, 1. Сначала задание, могут затем еще другие появиться)
	//используем только 0 и 1
	Если ШаблонСсылка.ПервичныйПоискПоШКвЗадании Тогда
		ОбъектШаблона.Вставить("search_barcode_priority", 1);
	КонецЕсли;
	
	ВторойЗапрос = РезультатПакета[1].Выгрузить();
	Для Каждого Элемент Из ВторойЗапрос Цикл
		ЗаполнитьЗначенияСвойств(ОбъектШаблона.select, Элемент);
	КонецЦикла;	
	
	ТретийЗапрос = РезультатПакета[2].Выгрузить();
	Для Каждого Элемент Из ТретийЗапрос Цикл
		ЗаполнитьЗначенияСвойств(ОбъектШаблона.insert, Элемент);
	КонецЦикла;	
	
	ЧетвертыйЗапрос = РезультатПакета[3].Выгрузить();
	Для Каждого Элемент Из ЧетвертыйЗапрос Цикл
		ЗаполнитьЗначенияСвойств(ОбъектШаблона.egais, Элемент);
	КонецЦикла;	
	
	ПятыйЗапрос = РезультатПакета[4].Выгрузить();
	Для Каждого Элемент Из ПятыйЗапрос Цикл
		ЗаполнитьЗначенияСвойств(ОбъектШаблона.marking, Элемент);
	КонецЦикла;
	
	Если ШаблонСсылка.МаркировкаПроверкаСтатусаКМ тогда
		МассивРазрешенныхСтатусовКМ = ДатаМобайл_ОбщийМодуль.РазложитьСтрокуВМассивЧисловыхПодстрокДМ(ШаблонСсылка.МаркировкаРазрешенныеСтатусыКМ);
		ОбъектШаблона.marking.Вставить("allowed_statuses", МассивРазрешенныхСтатусовКМ);
	КонецЕсли; 		
	
КонецПроцедуры

Функция ПолучитьСтруктуруСтрокиДокумента(ИмяТаблицы,УзелПО,СсылкаНаДок,СтрокаДокумента,UserName,ВызовИзWriteDoc = Ложь)
	
	Шаблон = СсылкаНаДок.Шаблон;
	ИспользоватьМаркировку = Шаблон.ИспользоватьМаркировку;
	ИспользоватьЕГАИС = Шаблон.ЕГАИС;
	ЗаписыватьПолныйКМ 		= Шаблон.МаркировкаЗаписыватьПолныйКМ;

	
	СтруктураСтроки = Новый Структура;
	СтруктураСтроки.Вставить("ДокументТСД", 	 	СсылкаНаДок);
    СтруктураСтроки.Вставить("ИмяТаблицы", 			ИмяТаблицы);	
	СтруктураСтроки.Вставить("ИдентификаторСтроки", Число(СтрокаДокумента.row_id));
	СтруктураСтроки.Вставить("Штрихкод",			СтрокаДокумента.barcode.value);
	СтруктураСтроки.Вставить("Уникальность",		Новый УникальныйИдентификатор());	
	СтруктураСтроки.Вставить("Ячейка", 				СтрокаДокумента.cell.barcode);
	СтруктураСтроки.Вставить("КодТовара", 			СтрокаДокумента.art.id);
	СтруктураСтроки.Вставить("НазваниеТовара",		СтрокаДокумента.art.name);
	СтруктураСтроки.Вставить("Количество",   		Число(СтрокаДокумента.qty));
	СтруктураСтроки.Вставить("Пользователь", 		UserName);
	СтруктураСтроки.Вставить("ТСД", 		 		УзелПО);
	СтруктураСтроки.Вставить("Дата", 		 		СтрокаДокумента.date);	
	Попытка СтруктураСтроки.Вставить("КоличествоВУпаковке", СтрокаДокумента.qty_in_pack); Исключение СтруктураСтроки.Вставить("КоличествоВУпаковке", 0); КонецПопытки;
	
	Если СтруктураСтроки.Количество>0 тогда 
		СтруктураСтроки.Вставить("КоличествоМест", 1);
	ИначеЕсли СтруктураСтроки.Количество<0 тогда 
		СтруктураСтроки.Вставить("КоличествоМест", -1);
	Иначе
		СтруктураСтроки.Вставить("КоличествоМест", 0);
	КонецЕсли;	
	
	СтруктураСтроки.Вставить("Пользователь", UserName);
	СтруктураСтроки.Вставить("ТСД", УзелПО);
	СтруктураСтроки.Вставить("Дата", СтрокаДокумента.date);	
	
	ТекущаяЯчейкаСсылка = ДатаМобайл_ОбщийМодуль.ПолучитьЯчейкуПоКодуИлиШтрихкоду(СтрокаДокумента.cell.barcode);
	СтруктураСтроки.Вставить("ЯчейкаСсылка", ТекущаяЯчейкаСсылка);
	СтруктураСтроки.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	СтруктураСтроки.Вставить("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());

	Попытка
		Если Лев(СтрокаДокумента.art.id, 3) = "8U-" Тогда
			СтруктураСтроки.Номенклатура = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(СтрокаДокумента.art.id, 4, 36));
			ИДХК = Сред(СтрокаДокумента.art.id, 40, 36);
			Если ИДХК <> "00000000-0000-0000-0000-000000000000" Тогда
				СтруктураСтроки.ХарактеристикаНоменклатуры = XMLЗначение(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"), ИДХК);
			КонецЕсли;	
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(СокрЛП(СтруктураСтроки.НазваниеТовара)) тогда
			ВключатьАртикул=УзелПО.ДобавлятьАртикулВНаименование;
			
			СтруктураСтроки.НазваниеТовара = ?(ВключатьАртикул,СтруктураСтроки.Номенклатура.Артикул + " ","")
			+ СтруктураСтроки.Номенклатура.Наименование + " " 
			+ СтруктураСтроки.ХарактеристикаНоменклатуры.Наименование; 
		КонецЕсли;
		
	Исключение	
	КонецПопытки;
	СтруктураСтроки.Вставить("ЕдиницаИзмерения", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	СтруктураСтроки.Вставить("КоэффициентЕдиницы", 1);
	СтруктураСтроки.Вставить("СерияСсылка", Справочники.СерииНоменклатуры.ПустаяСсылка());
	СтруктураСтроки.Вставить("СерийныйНомер", ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.sn,Ложь));
	ЭтоКодМаркировки = Ложь;

		//Переменные Params
		СтруктураParams = Новый Структура;
		СтруктураParams.Вставить("KM_GTIN",       ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.marking.gtin));
		СтруктураParams.Вставить("KM_SN",	      ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.marking.sn));
		СтруктураParams.Вставить("KM_Barcode", 	  ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.marking.mark));
		СтруктураParams.Вставить("KM_RawBarcode", ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.marking.raw_barcode));		
		СтруктураParams.Вставить("KM_DecodedMrc", ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.marking.decoded_mrc));
		СтруктураParams.Вставить("KM_RawMrc",	  ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.marking.raw_mrc));	
		СтруктураParams.Вставить("KM_TNVED",	  ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.marking.tnvd));
		СтруктураParams.Вставить("GS1",			  ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.gs1_barcode));
		СтруктураParams.Вставить("packAttrs",	  СтрЗаменить(СтрокаДокумента.pack_attributes, "\\", ""));
		
	//МАРКИРОВКА
	Если ИспользоватьМаркировку Тогда
		
	
		
		СтруктураСтроки.Вставить("ЦРПТМарка", СтруктураParams.KM_Barcode);
		Если СтруктураСтроки.ЦРПТМарка = "" Тогда
			СтруктураСтроки.ЦРПТМарка = СтруктураParams.KM_RawBarcode;	
		КонецЕсли;	       
		
		СтруктураСтроки.Вставить("ЦРПТМарка_Длина", СтрДлина(СтруктураСтроки.ЦРПТМарка));	
		СтруктураСтроки.Вставить("Короб", ЧистаяСтрока(СтрокаДокумента.box_pack));
		Если ЗначениеЗаполнено(СтруктураParams.KM_SN) и Шаблон.МаркировкаИспользоватьСериюКМКакСериюТовара Тогда
			ЭтоКодМаркировки = Истина;
			СтруктураСтроки.Вставить("СерийныйНомер", СтруктураParams.KM_SN);
		КонецЕсли;	
		СтруктураСтроки.Вставить("KM_GTIN", 	  СтруктураParams.KM_GTIN);
		СтруктураСтроки.Вставить("KM_RawMrc", 	  СтруктураParams.KM_RawMrc);
		СтруктураСтроки.Вставить("KM_DecodedMrc", СтруктураParams.KM_DecodedMrc);
		СтруктураСтроки.Вставить("GS1", 		  СтруктураParams.GS1);
		СтруктураСтроки.Вставить("KM_TNVED", 	  СтруктураParams.KM_TNVED);
		
		Если ЗначениеЗаполнено(СтруктураСтроки.Номенклатура) Тогда
			ПараметрыТовара = Новый Структура("Номенклатура, Характеристика", СтруктураСтроки.Номенклатура, СтруктураСтроки.ХарактеристикаНоменклатуры);
		Иначе
			ПараметрыТовара = Неопределено;
		КонецЕсли;
				
	
		Если ЗначениеЗаполнено(СтруктураСтроки.ЦРПТМарка) и (НЕ ВызовИзWriteDoc или Шаблон.ИспользованиеУпаковочныхЛистовПодбор = 4 или НЕ ДатаМобайл_Маркировка.ТребуетсяСпецОбработка(СсылкаНаДок)) Тогда
			Если Шаблон.ИспользованиеУпаковочныхЛистовПодбор = 4 Тогда //короба в палеты
				СтруктураСтроки.Вставить("КМСсылка", ДатаМобайл_Маркировка.ПолучитьСправочникСсылкаУпаковка(СтруктураСтроки.ЦРПТМарка,Шаблон.МаркировкаСоздаватьСправочникКМЕслиНеНайден,ПараметрыТовара));	
			Иначе //обычные документы маркировки
				СтруктураСтроки.Вставить("КМСсылка", ДатаМобайл_Маркировка.ПолучитьСправочникСсылкаМарка(СтруктураСтроки.ЦРПТМарка,СтруктураСтроки.ЦРПТМарка_Длина,СтруктураСтроки.KM_RawMrc,СтруктураСтроки.KM_TNVED,Шаблон.МаркировкаСоздаватьСправочникКМЕслиНеНайден,ПараметрыТовара,Шаблон));
			КонецЕсли;
		Иначе
			СтруктураСтроки.Вставить("КМСсылка", Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());	
		КонецЕсли;
		
		
		//Получим данные по номенклатуре и характеристике из упаковки (если это формирование палеты)
		Если НЕ ЗначениеЗаполнено(СтруктураСтроки.Номенклатура) И ЗначениеЗаполнено(СтруктураСтроки.КМСсылка) Тогда		
			СтруктураСтроки.Вставить("Номенклатура", СтруктураСтроки.КМСсылка.Номенклатура);
			СтруктураСтроки.Вставить("ХарактеристикаНоменклатуры", СтруктураСтроки.КМСсылка.Характеристика);
			ПараметрыТовара = Новый Структура("Номенклатура, Характеристика", СтруктураСтроки.Номенклатура, СтруктураСтроки.ХарактеристикаНоменклатуры);
		КонецЕсли;

		
		
		
		ТекущийКороб =  СтрокаДокумента.box_pack;
		ТекущийКороб = ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(ТекущийКороб);
		Если СтрДлина(ТекущийКороб) = 20 и Лев(ТекущийКороб,2) = "00" Тогда		
			ТекущийКороб = "(00)" +  Сред(ТекущийКороб,3,18);
		ИначеЕсли СтрДлина(ТекущийКороб) = 18 Тогда		
			ТекущийКороб = "(00)" +  Сред(ТекущийКороб,1,18);		
		КонецЕсли;

		
		ТекущийУпаковочныйЛист = СтрокаДокумента.pack;		
		//СимволРазделителяУпаковочныйЛист = Найти(СтрокаДокумента.DMPackID,"/");
		//Если СимволРазделителяУпаковочныйЛист>0 Тогда 
		//	ТекущийУпаковочныйЛист = Лев(ТекущийУпаковочныйЛист,СимволРазделителяУпаковочныйЛист-1);
		//КонецЕсли;
		ТекущийУпаковочныйЛист = ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(ТекущийУпаковочныйЛист);
		Если СтрДлина(ТекущийУпаковочныйЛист) = 20 и Лев(ТекущийУпаковочныйЛист,2) = "00" Тогда		
			ТекущийУпаковочныйЛист = "(00)" +  Сред(ТекущийУпаковочныйЛист,3,18);
		ИначеЕсли СтрДлина(ТекущийУпаковочныйЛист) = 18 Тогда		
			ТекущийУпаковочныйЛист = "(00)" +  Сред(ТекущийУпаковочныйЛист,1,18);	
		КонецЕсли;

		//Если это не агрегация, то паковочный лист может быть пустым, используем Тогда короб
		Если ТекущийУпаковочныйЛист = "" и ТекущийКороб<>"" Тогда
			ТекущийУпаковочныйЛист = ТекущийКороб;
			ТекущийКороб = "";	
		КонецЕсли;
				
		Если ТекущийКороб<>"" Тогда
			СтруктураСтроки.Вставить("КоробСсылка", ДатаМобайл_Маркировка.ПолучитьСправочникСсылкаУпаковка(ТекущийКороб,Шаблон.МаркировкаСоздаватьСправочникКМЕслиНеНайден,ПараметрыТовара));
		Иначе
			СтруктураСтроки.Вставить("КоробСсылка", Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
		КонецЕсли;
		СтруктураСтроки.Вставить("Короб", ТекущийКороб);
		
		
		Если ТекущийУпаковочныйЛист<>"" Тогда
			СтруктураСтроки.Вставить("УпаковочныйЛистСсылка", ДатаМобайл_Маркировка.ПолучитьСправочникСсылкаУпаковка(ТекущийУпаковочныйЛист,Шаблон.МаркировкаСоздаватьСправочникКМЕслиНеНайден,ПараметрыТовара));
		Иначе
			СтруктураСтроки.Вставить("УпаковочныйЛистСсылка", Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка());
		КонецЕсли;
		СтруктураСтроки.Вставить("УпаковочныйЛист", ТекущийУпаковочныйЛист);
		
		
		СтруктураСтроки.Вставить("УпаковочныйЛистАтрибуты", СтруктураParams.packAttrs);
		
		//Не сохранять криптохвосты в GS1
		Если ЗаписыватьПолныйКМ Тогда
			ПолныйКодМаркировки = СтруктураParams.GS1;
			СтруктураСтроки.Вставить("ПолныйКодМаркировки", ПолныйКодМаркировки);
		Иначе
			//Не сохранять криптохвосты в GS1
			Если (СтруктураСтроки.ЦРПТМарка_Длина = 31 //Обувь и прочее
				или СтруктураСтроки.ЦРПТМарка_Длина = 25 //Блок табака
				или СтруктураСтроки.ЦРПТМарка_Длина = 21 //Пачка табака
				или СтруктураСтроки.ЦРПТМарка_Длина = 38 //Фото
				или СтруктураСтроки.ЦРПТМарка_Длина = 24 или СтруктураСтроки.ЦРПТМарка_Длина = 32) //Молочка
				тогда
				СтруктураСтроки.GS1	= "";
			КонецЕсли;
		КонецЕсли;

		Если СтруктураСтроки.Штрихкод = "" Тогда	
			СтруктураСтроки.Штрихкод = УдалитьЛидирующиеНули(СтруктураParams.KM_GTIN);	
		КонецЕсли;	
				
	Иначе
		
		ТекущийУпаковочныйЛист =  СтрокаДокумента.pack;	
		//СимволРазделителяУпаковочныйЛист = Найти(СтрокаДокумента.DMPackID,"/");
		//Если СимволРазделителяУпаковочныйЛист>0 Тогда 
		//	ТекущийУпаковочныйЛист = Лев(ТекущийУпаковочныйЛист,СимволРазделителяУпаковочныйЛист-1);
		//КонецЕсли;
		Если ТекущийУпаковочныйЛист = "0" Тогда
			ТекущийУпаковочныйЛист = "";
		КонецЕсли;	
		СтруктураСтроки.Вставить("УпаковочныйЛист", ТекущийУпаковочныйЛист);
		СтруктураСтроки.Вставить("Короб", СтрокаДокумента.box_pack);
		
		СтруктураСтроки.Вставить("УпаковочныйЛистАтрибуты", СтруктураParams.packAttrs);

	КонецЕсли;
	
	
	УстановитьЕдиницу(СтруктураСтроки);
	
	
	//ЕГАИС
	Если ИспользоватьЕГАИС Тогда
		
		СтруктураСтроки.Вставить("КодТовара", СтрокаДокумента.egais_art.id);
		
		Если ДатаМобайл_ОбщийМодуль.ЕстьАСТ() Тогда
			ИмяСправочникаНоменклатурыЕГАИС = "астНоменклатураЕГАИС";
			
		ИначеЕсли ДатаМобайл_ОбщийМодуль.ЕстьКТ2000() Тогда
			ИмяСправочникаНоменклатурыЕГАИС = "алкКлассификаторАлкогольнойПродукцииЕГАИС";
			
		Иначе
			ИмяСправочникаНоменклатурыЕГАИС = "КлассификаторАлкогольнойПродукцииЕГАИС";
		КонецЕсли;		
		
		СтруктураСтроки.Вставить("НоменклатураЕГАИС", Справочники[ИмяСправочникаНоменклатурыЕГАИС].ПустаяСсылка());	
				
		Попытка
			СтруктураСтроки.НоменклатураЕГАИС=Справочники[ИмяСправочникаНоменклатурыЕГАИС].ПолучитьСсылку(Новый УникальныйИдентификатор(Сред(СтрокаДокумента.egais_art.id,4,36)));
		Исключение
			СтруктураСтроки.НоменклатураЕГАИС=Справочники[ИмяСправочникаНоменклатурыЕГАИС].НайтиПоКоду(СокрЛП(СтрокаДокумента.egais.alcocode));
		КонецПопытки;

		
		СтруктураСтроки.Вставить("PDF", СтрокаДокумента.egais.alcocode);		
		Если СтрокаДокумента.egais.date_bottling <> "" И СтрокаДокумента.egais.date_bottling <> "1/1/00 12:00:00 AM" И СтрокаДокумента.egais.date_bottling <> "01.01.00 12:00:00 AM" И СтрокаДокумента.egais.date_bottling <> "010100" Тогда    			
			ДатаРозливаГод = Строка(Строка("20")+Строка(Сред(СтрокаДокумента.egais.date_bottling, 5, 2)));
			ДатаРозливаМесяц = Сред(СтрокаДокумента.egais.date_bottling,3,2);
			ДатаРозливаДень = ЛЕВ(СтрокаДокумента.egais.date_bottling,2);
			ДатаРозлива = Дата(Число(ДатаРозливаГод), Число(ДатаРозливаМесяц), Число(ДатаРозливаДень));
			СтруктураСтроки.Вставить("ЕгаисДатаРозлива", ДатаРозлива);
		КонецЕсли; 		
		СтруктураСтроки.Вставить("ЕгаисМарка", "");
		СтруктураСтроки.Вставить("ЕгаисПолныйКод", ЧистаяСтрока(СтрокаДокумента.egais.mark));
		
		//Определение данных номенклатуры по марке если нет сопоставления
		Если НЕ ДатаМобайл_ОбщийМодуль.ЕстьАСТ() и ЗначениеЗаполнено(СтруктураСтроки.ЕгаисПолныйКод) и НЕ Шаблон.СопоставлениеЕГАИС Тогда			
			ДатаМобайл_ОбщийМодуль.ПолучитьНоменклатуруПоМарке(СтруктураСтроки);
		КонецЕсли;
		
			Если НЕ ЗначениеЗаполнено(СтруктураСтроки.Номенклатура) И ЗначениеЗаполнено(СтруктураСтроки.НоменклатураЕГАИС) Тогда
				СтруктураСтроки.Номенклатура = ДатаМобайл_ОбщийМодуль.ПолучитьНоменклатуруПоЕГАИС(СтруктураСтроки.НоменклатураЕГАИС);
			КонецЕсли;
		
			Если НЕ ЗначениеЗаполнено(СтруктураСтроки.НоменклатураЕГАИС) И ЗначениеЗаполнено(СтруктураСтроки.Номенклатура) Тогда
				СтруктураСтроки.НоменклатураЕГАИС = ДатаМобайл_ОбщийМодуль.ПолучитьЕГАИСПоНоменклатуре(СтруктураСтроки.Номенклатура);
			КонецЕсли;
		 
			Если ЗначениеЗаполнено(СтрокаДокумента.box_pack) и НЕ ЗначениеЗаполнено(СтрокаДокумента.pack) Тогда
				СтруктураСтроки.УпаковочныйЛист = СтрокаДокумента.box_pack;
				СтруктураСтроки.Короб = "";
			КонецЕсли;
	
		
		//Сопоставление
		Если Шаблон.СопоставлениеЕГАИС Тогда
			
			Если СтруктураСтроки.НоменклатураЕГАИС.Пустая() Тогда
			ИначеЕсли СтруктураСтроки.Номенклатура.Пустая() Тогда
			Иначе		
				
				ЗапросСопоставления = Новый Запрос;
				ЗапросСопоставления.УстановитьПараметр("Номенклатура", СтруктураСтроки.Номенклатура);
				ЗапросСопоставления.УстановитьПараметр("ЕГАИС_Номенклатура", СтруктураСтроки.НоменклатураЕГАИС);
				
				ЗапросСопоставления.Текст = "ВЫБРАТЬ
				|	ИСТИНА КАК Сопоставлен
				|ИЗ
				|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК ЕГАИС_СоответствиеНоменклатуры
				|ГДЕ
				|	ЕГАИС_СоответствиеНоменклатуры.АлкогольнаяПродукция = &ЕГАИС_Номенклатура
				|	И ЕГАИС_СоответствиеНоменклатуры.Номенклатура = &Номенклатура";
				
				
				Если ЗапросСопоставления.Выполнить().Пустой() Тогда
					
					МенеджерЗаписиЕГАИС = РегистрыСведений.СоответствиеНоменклатурыЕГАИС.СоздатьМенеджерЗаписи();
					МенеджерЗаписиЕГАИС.АлкогольнаяПродукция = СтруктураСтроки.НоменклатураЕГАИС;
					МенеджерЗаписиЕГАИС.Номенклатура = СтруктураСтроки.Номенклатура;
					МенеджерЗаписиЕГАИС.Записать();													
					
				КонецЕсли;	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//СЕРИИ
	Попытка ОпределитьСериюВСтрокеДокумента(Шаблон,СтруктураСтроки,ЭтоКодМаркировки); Исключение КонецПопытки;
	
	Возврат СтруктураСтроки;	
КонецФункции

Функция ПроверитьЗаписи(ИмяТаблицы,УзелПО,СсылкаНаДок,СтрокаДокумента,Объект=Неопределено)
	
	Модуль_ОбщегоНазначения = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначения");
	ЗначенияРеквизитовСсылкаНаДок = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДок,"Шаблон");
	Шаблон = ЗначенияРеквизитовСсылкаНаДок.Шаблон;

	ЗначенияРеквизитовШаблон = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Шаблон,"ГрупповаяРабота,ИспользованиеУпаковочныхЛистовПодбор,БыстроеСканирование,ИспользоватьМаркировку,МаркировкаСоздаватьСправочникКМЕслиНеНайден");
	Шаблон_ГрупповаяРабота = ЗначенияРеквизитовШаблон.ГрупповаяРабота;
	Шаблон_ИспользованиеУпаковочныхЛистовПодбор = ЗначенияРеквизитовШаблон.ИспользованиеУпаковочныхЛистовПодбор;
	Шаблон_БыстроеСканирование = ЗначенияРеквизитовШаблон.БыстроеСканирование;
	Шаблон_ИспользоватьМаркировку = ЗначенияРеквизитовШаблон.ИспользоватьМаркировку;
	Шаблон_МаркировкаСоздаватьСправочникКМЕслиНеНайден = ЗначенияРеквизитовШаблон.МаркировкаСоздаватьСправочникКМЕслиНеНайден;


	
		ЗапросСтрок = Новый Запрос;
		ЗапросСтрок.УстановитьПараметр("ТСД", УзелПО);
		ЗапросСтрок.УстановитьПараметр("ДокументТСД", СсылкаНаДок);
		ЗапросСтрок.УстановитьПараметр("ИдентификаторСтроки", Число(СтрокаДокумента.row_id));
		ЗапросСтрок.УстановитьПараметр("ИмяТаблицы", ИмяТаблицы);
		
		ЗапросСтрок.Текст = "ВЫБРАТЬ
		|	ИСТИНА КАК Выгружен
		|ИЗ
		|	Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_СтрокиДокументов
		|ГДЕ
		|	ДатаМобайл_СтрокиДокументов.ТСД = &ТСД
		|	И ДатаМобайл_СтрокиДокументов.ссылка = &ДокументТСД
		|	И ДатаМобайл_СтрокиДокументов.ИдентификаторСтроки = &ИдентификаторСтроки
		|	И ДатаМобайл_СтрокиДокументов.Количество > 0
		|	
		|ОБЪЕДИНИТЬ
		|	
		|ВЫБРАТЬ
		|	ИСТИНА КАК Выгружен
		|ИЗ
		|	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК ДатаМобайл_СтрокиДокументов
		|ГДЕ
		|	ДатаМобайл_СтрокиДокументов.ТСД = &ТСД
		|	И ДатаМобайл_СтрокиДокументов.ДокументТСД = &ДокументТСД
		|	И ДатаМобайл_СтрокиДокументов.ИдентификаторСтроки = &ИдентификаторСтроки
		|	И ДатаМобайл_СтрокиДокументов.ИмяТаблицы = &ИмяТаблицы
		|	И ДатаМобайл_СтрокиДокументов.Количество > 0
		|";
		
		Если Число(СтрокаДокумента.qty) < 0 Тогда
			ЗапросСтрок.Текст = СтрЗаменить(ЗапросСтрок.Текст,"Количество > 0","Количество < 0");
		КонецЕсли;

		Если ИмяТаблицы = "Insert" Тогда
			ЗапросСтрок.Текст = СтрЗаменить(ЗапросСтрок.Текст,"Подбор","Приемка");
		КонецЕсли;		
	
		Если НЕ ЗапросСтрок.Выполнить().Пустой() Тогда
			
			//ОБНОВЛЕНИЕ ЗНАЧЕНИЙ ВВОДИМЫХ ПОСЛЕ ЗАПИСИ СТРОКИ
			Если Число(СтрокаДокумента.changed_price) > 0 
				ИЛИ (СтрокаДокумента.pack <> "" И Шаблон_ИспользованиеУпаковочныхЛистовПодбор=2) Тогда
				
				Если Шаблон_ГрупповаяРабота или Шаблон_БыстроеСканирование Тогда
					
					НаборЗаписей = РегистрыСведений.ДатаМобайл_СтрокиГрупповыхДокументов.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.ТСД.Установить(УзелПО);
					НаборЗаписей.Отбор.ДокументТСД.Установить(СсылкаНаДок);
					НаборЗаписей.Отбор.ДляОбмена.Установить(Ложь);
					НаборЗаписей.Отбор.ИдентификаторСтроки.Установить(Число(СтрокаДокумента.row_id));

					НаборЗаписей.Прочитать();
					
					Для Каждого СтрокаЗаписи из НаборЗаписей цикл 
						СтрокаЗаписи.НоваяЦена = Число(СтрокаДокумента.changed_price);
						УстановитьУпаковочныйЛист(СтрокаЗаписи,СтрокаДокумента,Шаблон_ИспользоватьМаркировку,Шаблон_МаркировкаСоздаватьСправочникКМЕслиНеНайден);
					КонецЦикла;
					НаборЗаписей.Записать();
			
				Иначе
					Если Объект<>Неопределено Тогда
						СтруктураПоиска = Новый Структура("ИдентификаторСтроки,ТСД", Число(СтрокаДокумента.row_id),УзелПО);
						Если ИмяТаблицы = "Insert" Тогда
							СтрокиПодбора = Объект.СобранныеДанныеПриемка.НайтиСтроки(СтруктураПоиска);
						Иначе	
							СтрокиПодбора = Объект.СобранныеДанныеПодбор.НайтиСтроки(СтруктураПоиска);
						КонецЕсли;	
						Если СтрокиПодбора.Количество() > 0 Тогда
							Для Каждого СтрокаПодбора ИЗ СтрокиПодбора Цикл
								СтрокаПодбора.НоваяЦена = Число(СтрокаДокумента.changed_price);
								УстановитьУпаковочныйЛист(СтрокаПодбора,СтрокаДокумента,Шаблон_ИспользоватьМаркировку,Шаблон_МаркировкаСоздаватьСправочникКМЕслиНеНайден);
							КонецЦикла;
							
							Объект.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;
							Объект.ОбменДанными.Получатели.Очистить();							
							Объект.Записать();
							//Если ТранзакцияАктивна() Тогда
							//	ЗафиксироватьТранзакцию();
							//КонецЕсли;
	
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			
			Возврат Истина;
		КонецЕсли;

	Возврат Ложь;
КонецФункции	

Процедура УстановитьУпаковочныйЛист(СтруктураСтроки,СтрокаДокумента,ИспользоватьМаркировку,МаркировкаСоздаватьСправочникКМЕслиНеНайден)
	
		//Переменные Params
		СтруктураParams = Новый Структура;
		СтруктураParams.Вставить("KM_GTIN", 	  ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.marking.gtin));
		СтруктураParams.Вставить("KM_SN", 		  ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.marking.sn));
		СтруктураParams.Вставить("KM_Barcode",    ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.marking.mark));
		СтруктураParams.Вставить("KM_RawBarcode", ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.marking.raw_barcode));		
		СтруктураParams.Вставить("KM_DecodedMrc", ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.marking.decoded_mrc));
		СтруктураParams.Вставить("KM_RawMrc", 	  ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.marking.raw_mrc));	
		СтруктураParams.Вставить("KM_TNVED", 	  ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.marking.tnvd));
		СтруктураParams.Вставить("GS1",			  ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(СтрокаДокумента.marking.ean));
		СтруктураParams.Вставить("packAttrs",    СтрЗаменить(СтрокаДокумента.pack_attributes, "\\", ""));
		

	ТекущийУпаковочныйЛист = СтрокаДокумента.pack;		
	//СимволРазделителяУпаковочныйЛист = Найти(DMPackID,"/");
	//Если СимволРазделителяУпаковочныйЛист>0 Тогда 
	//	ТекущийУпаковочныйЛист = Лев(ТекущийУпаковочныйЛист,СимволРазделителяУпаковочныйЛист-1);
	//КонецЕсли;
	ТекущиеУпаковочныйЛистАтрибуты = СтруктураParams.packAttrs;

	
	Если ИспользоватьМаркировку Тогда 
		
		Если ЗначениеЗаполнено(СтруктураСтроки.Номенклатура) Тогда
			ПараметрыТовара = Новый Структура("Номенклатура, Характеристика", СтруктураСтроки.Номенклатура, СтруктураСтроки.ХарактеристикаНоменклатуры);
		Иначе
			ПараметрыТовара = Неопределено;
		КонецЕсли;
		
		
		ТекущийУпаковочныйЛист = СтрЗаменить(ТекущийУпаковочныйЛист,"[","(");
		ТекущийУпаковочныйЛист = СтрЗаменить(ТекущийУпаковочныйЛист,"]",")");
	
		Если СтрДлина(ТекущийУпаковочныйЛист) = 20 и Лев(ТекущийУпаковочныйЛист,2) = "00" Тогда		
			ТекущийУпаковочныйЛист = "(00)" +  Сред(ТекущийУпаковочныйЛист,3,18);
		КонецЕсли;	
		
		СтруктураСтроки.УпаковочныйЛист = ТекущийУпаковочныйЛист;
		Если ТекущийУпаковочныйЛист<>"" Тогда
			СтруктураСтроки.УпаковочныйЛистСсылка = ДатаМобайл_Маркировка.ПолучитьСправочникСсылкаУпаковка(ТекущийУпаковочныйЛист,МаркировкаСоздаватьСправочникКМЕслиНеНайден,ПараметрыТовара);
		КонецЕсли;
		
		СтруктураСтроки.УпаковочныйЛистАтрибуты = ТекущиеУпаковочныйЛистАтрибуты;
	Иначе
		СтруктураСтроки.УпаковочныйЛист = ТекущийУпаковочныйЛист;
		СтруктураСтроки.УпаковочныйЛистАтрибуты = ТекущиеУпаковочныйЛистАтрибуты;		
	КонецЕсли;
	
	
КонецПроцедуры

Функция ПроверитьПревышениеГрупповогоЗадания (ИмяТаблицы,УзелПО,СсылкаНаДок,СтрокаДокумента,СтруктураСтроки)
	
	Шаблон=СсылкаНаДок.Шаблон;
	
	ЗапросПревышения = Новый Запрос;
	ЗапросПревышения.Текст = "ВЫБРАТЬ
	|	ЕстьNull(СУММА(ЕстьNull(ТаблицаТоваровВДокументе.Количество,0)),0) КАК КоличествоЗадание,
	|	0 КАК КоличествоПодбор
	|ПОМЕСТИТЬ ВременныеДанные
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.Товары КАК ТаблицаТоваровВДокументе
	|ГДЕ
	|	ТаблицаТоваровВДокументе.Ссылка = &ИсходныйДокумент 
	|	И ТаблицаТоваровВДокументе.Номенклатура = &Номенклатура
	|	И ТаблицаТоваровВДокументе.Характеристика = &Характеристика
	|
	|ОБЪЕДИНИТЬ
	|	ВЫБРАТЬ
	|	0,
	|   ЕстьNull(СУММА(ЕстьNull(ТаблицаТоваровВРегистре.Количество,0)),0)
	|ИЗ
	|	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК ТаблицаТоваровВРегистре
	|ГДЕ
	|	ТаблицаТоваровВРегистре.ДокументТСД = &ДокументТСД
	|	И ТаблицаТоваровВРегистре.Номенклатура = &Номенклатура
	|	И ТаблицаТоваровВРегистре.ХарактеристикаНоменклатуры = &Характеристика
	|	И ТаблицаТоваровВРегистре.ИмяТаблицы = &ИмяТаблицы
	|	И НЕ ТаблицаТоваровВРегистре.ДляОбмена
	|;
	|ВЫБРАТЬ 
	|ЕстьNull(СУММА(ЕстьNull(ВременныеДанные.КоличествоЗадание,0)),0) КАК КоличествоЗадание,
	|ЕстьNull(СУММА(ЕстьNull(ВременныеДанные.КоличествоПодбор,0)),0)  КАК КоличествоПодбор
	|
	|ИЗ ВременныеДанные КАК ВременныеДанные";
	
	ЗапросПревышения.УстановитьПараметр("ДокументТСД",СсылкаНаДок);
	ЗапросПревышения.УстановитьПараметр("ИсходныйДокумент",СсылкаНаДок.ИсходныйДокумент);
	ЗапросПревышения.УстановитьПараметр("ИмяТаблицы",ИмяТаблицы);
	ЗапросПревышения.Текст=СтрЗаменить(ЗапросПревышения.Текст,".ПриходныйОрдерНаТовары.","."+Шаблон.ВидДокумента+".");
	Если ИмяТаблицы = "Select" Тогда
		ЗапросПревышения.Текст=СтрЗаменить(ЗапросПревышения.Текст,".Товары КАК ","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК ");
	Иначе
		ЗапросПревышения.Текст=СтрЗаменить(ЗапросПревышения.Текст,".Товары КАК ","."+Шаблон.ИмяТабличнойЧастиПриемка+" КАК ");
	КонецЕсли;
	
	Если Шаблон.ЕГАИС Тогда
		Если ДатаМобайл_ОбщийМодуль.ЕстьАСТ() Тогда
			ЗапросПревышения.Текст=СтрЗаменить(ЗапросПревышения.Текст,"ТаблицаТоваровВДокументе.Номенклатура","ТаблицаТоваровВДокументе.НоменклатураЕГАИС");
			
		ИначеЕсли ДатаМобайл_ОбщийМодуль.ЕстьКТ2000() Тогда
			ЗапросПревышения.Текст=СтрЗаменить(ЗапросПревышения.Текст,"ТаблицаТоваровВДокументе.Номенклатура","ТаблицаТоваровВДокументе.АлкогольнаяПродукция");
			ЗапросПревышения.Текст=СтрЗаменить(ЗапросПревышения.Текст,"ТаблицаТоваровВРегистре.Номенклатура","ТаблицаТоваровВРегистре.НоменклатураЕГАИС");
		Иначе
			ЗапросПревышения.Текст=СтрЗаменить(ЗапросПревышения.Текст,"ТаблицаТоваровВДокументе.Номенклатура","ТаблицаТоваровВДокументе.АлкогольнаяПродукция");
		КонецЕсли;			
		ЗапросПревышения.Текст=СтрЗаменить(ЗапросПревышения.Текст,"И ТаблицаТоваровВДокументе.Характеристика = &Характеристика","");
		ЗапросПревышения.Текст=СтрЗаменить(ЗапросПревышения.Текст,"И ТаблицаТоваровВРегистре.ХарактеристикаНоменклатуры = &Характеристика","");
		ЗапросПревышения.УстановитьПараметр("Номенклатура",СтруктураСтроки.НоменклатураЕГАИС);
	Иначе
		ЗапросПревышения.УстановитьПараметр("Номенклатура",СтруктураСтроки.Номенклатура);
		ЗапросПревышения.УстановитьПараметр("Характеристика",СтруктураСтроки.ХарактеристикаНоменклатуры);
	КонецЕсли;	
	
	ВыборкаПревышения = ЗапросПревышения.Выполнить().Выбрать();
	Пока ВыборкаПревышения.Следующий() цикл
		Если ВыборкаПревышения.КоличествоПодбор + Число(СтрокаДокумента.qty) > ВыборкаПревышения.КоличествоЗадание Тогда
			Возврат Истина;
		КонецЕсли;
		Прервать;
	КонецЦикла;	
	
	Возврат Ложь;	
КонецФункции	

#КонецОбласти

#Область Серии

Функция ПолучитьПризнакУчетаСерий(ВидНоменклатуры,Склад)
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Возврат ВидНоменклатуры.ИспользоватьСерии;	
	Иначе
		Попытка
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ВидыНоменклатурыПолитикиУчетаСерий.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий
			|ИЗ
			|	Справочник.ВидыНоменклатуры.ПолитикиУчетаСерий КАК ВидыНоменклатурыПолитикиУчетаСерий
			|ГДЕ
			|	ВидыНоменклатурыПолитикиУчетаСерий.Склад = &Склад
			|	И ВидыНоменклатурыПолитикиУчетаСерий.Ссылка = &ВидНоменклатуры";
			
			Запрос.УстановитьПараметр("Склад",Склад);
			Запрос.УстановитьПараметр("ВидНоменклатуры",ВидНоменклатуры);
			
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.ПолитикаУчетаСерий = Справочники.ПолитикиУчетаСерий.СерииНеИспользуются Тогда
					Возврат Ложь;
				Иначе
					Возврат ВидНоменклатуры.ИспользоватьСерии;
				КонецЕсли;	
			Иначе
				Возврат ВидНоменклатуры.ИспользоватьСерии;
			КонецЕсли;	
		Исключение
			Возврат ВидНоменклатуры.ИспользоватьСерии;	
		КонецПопытки;
	КонецЕсли;
	
	Возврат ВидНоменклатуры.ИспользоватьСерии;
КонецФункции

Процедура ОпределитьСериюВСтрокеДокумента(Шаблон,СтруктураСтроки,ЭтоКодМаркировки)

	ИмяТаблицы  = СтруктураСтроки.ИмяТаблицы;
	ТоварПоиска = СтруктураСтроки.Номенклатура;	
	СтрокаСерии = СокрЛП(СтруктураСтроки.СерийныйНомер);
		
	//СтруктураСтроки.СерияСсылка - будет определена в данной функции
	
	Если ЗначениеЗаполнено(СтрокаСерии) Тогда
		
		//ДАННЫЕ ДЛЯ ПОИСКА СЕРИИ		
			
			ДатаПроизводства11 = Дата(1,1,1);
			ДатаОкончанияСрокаГодности17 = Дата(1,1,1);
			НомерСерии = "";
			
			РазобратьСтрокуСерииПоSNTypes(СтрокаСерии,ДатаПроизводства11,ДатаОкончанияСрокаГодности17,НомерСерии,ТоварПоиска,Шаблон.СерииРассчитыватьГоденДо);				
		
		//ПОИСК СЕРИИ	
		Если НЕ ТоварПоиска.ВладелецСерий.Пустая() Тогда
			ВидНоменклатурыПоиск = ТоварПоиска.ВладелецСерий;
		Иначе
			ВидНоменклатурыПоиск = ТоварПоиска.ВидНоменклатуры;
		КонецЕсли;
		
		ЗапросСерий = Новый Запрос;                 
		ЗапросСерий.Текст =  "ВЫБРАТЬ
		|	СерииНоменклатуры.Ссылка КАК Серия
		| ИЗ
		|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		| ГДЕ
		|	(СерииНоменклатуры.Номер = &Номер И СерииНоменклатуры.ДатаПроизводства = &ДатаПроизводства И СерииНоменклатуры.ГоденДо = &ГоденДо)
		|	И СерииНоменклатуры.ВидНоменклатуры = &ВидНоменклатурыПоиск
		|	И НЕ СерииНоменклатуры.ПометкаУдаления";
		

			ЗапросСерий.УстановитьПараметр("ГоденДо",ДатаОкончанияСрокаГодности17);
			ЗапросСерий.УстановитьПараметр("Номер",НомерСерии);
			ЗапросСерий.УстановитьПараметр("ДатаПроизводства",ДатаПроизводства11);
			
			ЗапросСерий.УстановитьПараметр("ВидНоменклатурыПоиск",ВидНоменклатурыПоиск); 
		
		РезультатСерий = ЗапросСерий.Выполнить();
		Если РезультатСерий.Пустой() Тогда
			
			//СОЗДАНИЕ СЕРИИ
			Если Шаблон.СоздаватьСерииЕслиНеНайдены Тогда				
				НоваяСерия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
				НоваяСерия.ВидНоменклатуры = ВидНоменклатурыПоиск;
				
					НоваяСерия.Номер = НомерСерии;
					НоваяСерия.ДатаПроизводства = ДатаПроизводства11;
					НоваяСерия.ГоденДо = ДатаОкончанияСрокаГодности17;

				НоваяСерия.Записать();
				СтруктураСтроки.СерияСсылка = НоваяСерия.Ссылка;
			КонецЕсли;
			
		Иначе 
			ВыборкаСерий = РезультатСерий.Выгрузить();
			Для Каждого Стр Из ВыборкаСерий Цикл
				СтруктураСтроки.СерияСсылка = Стр.Серия;
				Прервать;
			КонецЦикла; 
		КонецЕсли;	
		
		
		//СЕРИИ МАРКИРОВКА
		Если Шаблон.ИспользоватьМаркировку и Шаблон.МаркировкаИспользоватьСериюКМКакСериюТовара Тогда 
			КМСсылка = СтруктураСтроки.КМСсылка;

			Если ЗначениеЗаполнено(СтруктураСтроки.СерияСсылка) и ЗначениеЗаполнено(КМСсылка) Тогда		
				Если НЕ ЗначениеЗаполнено(КМСсылка.Серия) Тогда
					КМОбъект = КМСсылка.ПолучитьОбъект();
					КМОбъект.Серия = СтруктураСтроки.СерияСсылка;
					КМОбъект.Записать();
				КонецЕсли;	
			ИначеЕсли НЕ ЗначениеЗаполнено(СтруктураСтроки.СерияСсылка) и ЗначениеЗаполнено(КМСсылка) Тогда	
				Если ЗначениеЗаполнено(КМСсылка.Серия) Тогда
					СтруктураСтроки.СерияСсылка = КМСсылка.Серия;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РазобратьСтрокуСерииПоSNTypes(СтрокаСерии,ДатаПроизводства11,ДатаОкончанияСрокаГодности17,НомерСерии,лТовар, РасчитатьГоденДо)
	
	Если НЕ ЗначениеЗаполнено(лТовар) Тогда
		Возврат;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(лТовар.ВидНоменклатуры.ВладелецСерий) Тогда
		ТекущийВладелецСерий = лТовар.ВидНоменклатуры.ВладелецСерий;
	Иначе
		ТекущийВладелецСерий = лТовар.ВидНоменклатуры;
	КонецЕсли;						
	

	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаСерии);
	МассивТекущейСерии = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();

	ПорядковыйНомерМассива = 0;
	
	Попытка
		Если ТекущийВладелецСерий.ИспользоватьНомерСерии Тогда //(10)
			ПорядковыйНомерМассива = ПорядковыйНомерМассива+1;
			НомерСерии = МассивТекущейСерии[ПорядковыйНомерМассива-1];		
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Если ТекущийВладелецСерий.ИспользоватьДатуПроизводстваСерии Тогда  //(11)
			ПорядковыйНомерМассива = ПорядковыйНомерМассива+1;
			ДатаПроизводства11 = МассивТекущейСерии[ПорядковыйНомерМассива-1];    //07.05.21	
			ДатаПроизводства11 = СтрЗаменить(ДатаПроизводства11, ".", "");				
			ДатаПроизводства11 = РасшифроватьМаскуВвода("dd.mm.yy", ДатаПроизводства11);
		КонецЕсли; 	
	Исключение
	КонецПопытки;
	
	Попытка
		Если ТекущийВладелецСерий.ИспользоватьСрокГодностиСерии Тогда	//(17)
			Если РасчитатьГоденДо И ЗначениеЗаполнено(ДатаПроизводства11) И ЗначениеЗаполнено(лТовар.СрокГодности) Тогда // расчет по настройке
				ДатаОкончанияСрокаГодности17 = РассчитатьГоденДоСерии(лТовар,ДатаПроизводства11);				
			Иначе				
				ПорядковыйНомерМассива = ПорядковыйНомерМассива+1;
				ДатаОкончанияСрокаГодности17 = МассивТекущейСерии[ПорядковыйНомерМассива-1];	 //07.05.21
				ДатаОкончанияСрокаГодности17 = СтрЗаменить(ДатаОкончанияСрокаГодности17, ".", "");				
				ДатаОкончанияСрокаГодности17 = РасшифроватьМаскуВвода("dd.mm.yy", ДатаОкончанияСрокаГодности17);
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;	
	
	
КонецПроцедуры

Функция ПолучитьДопускОСГ(Номенклатура,Партнер=Неопределено)
	
	ДопускОСГ = Неопределено;
	
	Попытка 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	1 КАК Приоритет,
		|	ДатаМобайл_ДопускиОСГ_Ном.Допуск КАК Допуск
		|Поместить ТаблицаДопуски	
		|ИЗ
		|	РегистрСведений.ДатаМобайл_ДопускиОСГ КАК ДатаМобайл_ДопускиОСГ_Ном
		|ГДЕ
		|	ДатаМобайл_ДопускиОСГ_Ном.НоменклатураВидНоменклатуры = &Номенклатура 
		|	И ДатаМобайл_ДопускиОСГ_Ном.Партнер = &Партнер
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	2 КАК Приоритет,
		|	ДатаМобайл_ДопускиОСГ_Вид.Допуск КАК Допуск
		|ИЗ
		|	РегистрСведений.ДатаМобайл_ДопускиОСГ КАК ДатаМобайл_ДопускиОСГ_Вид
		|ГДЕ
		|	ДатаМобайл_ДопускиОСГ_Вид.НоменклатураВидНоменклатуры = &Родитель
		|	И ДатаМобайл_ДопускиОСГ_Вид.Партнер = &Партнер
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	3 КАК Приоритет,
		|	ДатаМобайл_ДопускиОСГ_Вид.Допуск КАК Допуск
		|ИЗ
		|	РегистрСведений.ДатаМобайл_ДопускиОСГ КАК ДатаМобайл_ДопускиОСГ_Вид
		|ГДЕ
		|	ДатаМобайл_ДопускиОСГ_Вид.НоменклатураВидНоменклатуры = &ВидНоменклатуры
		|	И ДатаМобайл_ДопускиОСГ_Вид.Партнер = &Партнер
		|;
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТаблицаДопуски.Допуск КАК Допуск
		|ИЗ
		|	ТаблицаДопуски КАК ТаблицаДопуски
		|УПОРЯДОЧИТЬ ПО 
		|	ТаблицаДопуски.Приоритет ВОЗР";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Родитель", Номенклатура.Родитель);
		Запрос.УстановитьПараметр("ВидНоменклатуры", Номенклатура.ВидНоменклатуры);
		
		Если Партнер = Неопределено тогда //допуск для товара
			Запрос.УстановитьПараметр("Партнер", Справочники.Партнеры.ПустаяСсылка());	
		ИначеЕсли ЗначениеЗаполнено(Партнер) тогда //допуск для документа
			Запрос.УстановитьПараметр("Партнер", Партнер);
		Иначе
			Запрос.УстановитьПараметр("Партнер", Неопределено);
		КонецЕсли;	
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() тогда
			ДопускОСГ = Выборка.Допуск;
		КонецЕсли;	
	Исключение
	КонецПопытки;
	
	Возврат ДопускОСГ;
	
	
КонецФункции	

Функция ПолучитьЗначениеСерии(Шаблон,лТовар,лСерия,Insert=Ложь)
	
	ЗначениеСерии = ПолучитьЗначенияSNTypesСерии(лТовар,лСерия,Шаблон.СерииРассчитыватьГоденДо);	
	
	Возврат ЗначениеСерии;
КонецФункции

Функция СформироватьМаскуВвода(Маска, ДатаСерии)
	Серия = "";
	
	Попытка 
		НоваяМаска = СтрЗаменить(Маска, "m", "M");	
		Серия = Формат(ДатаСерии,"ДФ="+НоваяМаска);	
	Исключение 	
	КонецПопытки;
	
	Возврат Серия;	
КонецФункции

Функция ПолучитьЗначенияSNTypesСерии(лТовар,лСерия,РасчитыватьГоденДо)
		
	МассивТекущейСерии = Новый Массив;
	
	Если ЗначениеЗаполнено(лТовар) и ЗначениеЗаполнено(лСерия) тогда
		
		Если ЗначениеЗаполнено(лТовар.ВидНоменклатуры.ВладелецСерий) Тогда
			ТекущийВладелецСерий = лТовар.ВидНоменклатуры.ВладелецСерий;
		Иначе
			ТекущийВладелецСерий = лТовар.ВидНоменклатуры;
		КонецЕсли;						
		
		Попытка
			Если ТекущийВладелецСерий.ИспользоватьНомерСерии Тогда //(10)
				МассивТекущейСерии.Добавить(СокрЛП(лСерия.Номер));
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Попытка
			Если ТекущийВладелецСерий.ИспользоватьДатуПроизводстваСерии Тогда  //(11)
				МассивТекущейСерии.Добавить(Формат(лСерия.ДатаПроизводства,"ДФ=dd.MM.yy"));
			КонецЕсли; 	
		Исключение
		КонецПопытки;
		
		Попытка
			Если ТекущийВладелецСерий.ИспользоватьСрокГодностиСерии Тогда	//(17)							
				Если РасчитыватьГоденДо Тогда // расчет по настройке
					//Если расссчитывается, то в задание не передаем.
				Иначе
					МассивТекущейСерии.Добавить(Формат(лСерия.ГоденДо,"ДФ=dd.MM.yy"));
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	СтрокаJSON = "";
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.JavaScript;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);
	
	Запись = Новый ЗаписьJSON;
	Запись.ПроверятьСтруктуру = Истина;
	Запись.УстановитьСтроку(ПараметрыJSON);

	ЗаписатьJSON(Запись, МассивТекущейСерии, НастройкиСериализации);
	СтрокаJSON = Запись.Закрыть();

	Возврат СтрокаJSON;

КонецФункции

Функция ПолучитьМассивСерий(УзелПО,СсылкаНаДок,лТовар,лХарактеристикаНоменклатуры,ТекущаяЯчейка,Шаблон);

  МассивСерий = Новый Массив;

  Если  ЗначениеЗаполнено(ТекущаяЯчейка) Тогда
      
    ЗапросСерийПоЯчейке = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
    |  ТоварыВЯчейкахОстатки.Серия КАК Серия
    |ИЗ
    |  РегистрНакопления.ТоварыВЯчейках.Остатки(
    |        ,
    |        Номенклатура = &Номенклатура 
    |        И Характеристика = &Характеристика
    |        И Ячейка = &Ячейка) КАК ТоварыВЯчейкахОстатки
    |ГДЕ
    |  ТоварыВЯчейкахОстатки.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)");
    
    ЗапросСерийПоЯчейке.УстановитьПараметр("Номенклатура", лТовар);
    ЗапросСерийПоЯчейке.УстановитьПараметр("Характеристика", лХарактеристикаНоменклатуры);
    ЗапросСерийПоЯчейке.УстановитьПараметр("Ячейка", ТекущаяЯчейка);
    
    Возврат ЗапросСерийПоЯчейке.Выполнить().Выгрузить().ВыгрузитьКолонку("Серия");
    
  Иначе    
    
    
    ЗапросСерийПоСкладам = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
                                        |  ТоварыНаСкладах.Серия КАК Серия
                                        |ИЗ
                                        |  РегистрНакопления.ТоварыНаСкладах.Остатки(
                                        |      ,
                                        |      &ВсеСклады
                                        |        ИЛИ Склад В (&Склады)
                                        |          И (&ВсеПомещения
                                        |            ИЛИ Помещение В (&Помещения))
                                        |          И Номенклатура = &Номенклатура
                                        |          И Характеристика = &Характеристика) КАК ТоварыНаСкладах
                                        |ГДЕ
                                        |  ТоварыНаСкладах.Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)");
    
    ЗапросСерийПоСкладам.УстановитьПараметр("Номенклатура", лТовар);
    ЗапросСерийПоСкладам.УстановитьПараметр("Характеристика", лХарактеристикаНоменклатуры);
    ЗапросСерийПоСкладам.УстановитьПараметр("Ячейка", ТекущаяЯчейка);
    
		СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
		Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
			СписокСкладов.Очистить();
			СписокСкладов.Добавить(СсылкаНаДок.Склад);			
		КонецЕсли;
		ЗапросСерийПоСкладам.УстановитьПараметр("Склады",СписокСкладов);
		ЗапросСерийПоСкладам.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
		
		СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
		Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
			СписокПомещений.Очистить();
			СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
		КонецЕсли;
		ЗапросСерийПоСкладам.УстановитьПараметр("Помещения",СписокПомещений);
		ЗапросСерийПоСкладам.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);

    
    Возврат ЗапросСерийПоСкладам.Выполнить().Выгрузить().ВыгрузитьКолонку("Серия");

  КонецЕсли;
КонецФункции

Функция РасшифроватьМаскуВвода(Маска, Серия)
	НоваяМаска = СтрЗаменить(Маска, ".", "");	

	//Считаем год
	гПозиция = Найти(НоваяМаска, "y"); //Позиция года в серии
	гДлина = СтрЧислоВхождений(НоваяМаска, "y");
	//Считаем месяц
	мПозиция = Найти(НоваяМаска, "m"); //Позиция года в серии
	мДлина = СтрЧислоВхождений(НоваяМаска, "m");
	//Считаем день
	дПозиция = Найти(НоваяМаска, "d"); //Позиция года в серии
	дДлина = СтрЧислоВхождений(НоваяМаска, "d");
	
	Год = Сред(Серия, гПозиция, гДлина);
	Месяц = Сред(Серия, мПозиция, мДлина);
	День = Сред(Серия, дПозиция, дДлина);
	Если СтрДлина(Год) = 2 Тогда
		Год = "20" + Год;
	КонецЕсли;
	
	ДатаСерии = Дата(Число(Год), Число(Месяц), Число(День));
	
	Возврат ДатаСерии;	
КонецФункции

Процедура РазобратьТэгиGS1(СтрокаСерии,ДатаПроизводства11,ДатаОкончанияСрокаГодности17,НомерСерии)

	СтрокиGS1 = СтрЗаменить(СтрокаСерии,"[",Символы.ПС);
	
	Для i=1 по 4 цикл		
		ТекущийТэг = СтрПолучитьСтроку(СтрокиGS1, i);
		Если ТекущийТэг="" Тогда
			Продолжить;
		КонецЕсли;	

		// РАЗБОР GS1 ТЭГОВ 
		Если СтрНайти(ТекущийТэг, "11]") > 0 Тогда // Тэг 11 (Дата производства)		
			Тэг11 = Сред(ТекущийТэг,4);  	
			Год11 =  "20" + Лев(Тэг11,2);
			День11 = Прав(Тэг11,2);
			Месяц11 = Прав(Лев(Тэг11,4),2);
			ДатаПроизв = Год11+Месяц11+День11;
			ДатаПроизводства11 = Дата(ДатаПроизв);
		ИначеЕсли СтрНайти(ТекущийТэг, "17]") > 0 или СтрНайти(ТекущийТэг, "15]") > 0  Тогда // Тэг 17 (Дата окончания срока годности) или Тэг 15 (Дата окончания использования) 			
			Тэг17 = Сред(ТекущийТэг,4);  	
			Год17 =  "20" + Лев(Тэг17,2);
			День17 = Прав(Тэг17,2);
			Месяц17 = Прав(Лев(Тэг17,4),2);
			ДатаОСГ = Год17+Месяц17+День17;
			ДатаОкончанияСрокаГодности17 = Дата(ДатаОСГ);
		ИначеЕсли СтрНайти(ТекущийТэг,"21]") > 0 Тогда // Тэг 21 (серийный номер)
			СерийныйНомер21 = Сред(ТекущийТэг,4);
			НомерСерии = СерийныйНомер21
		ИначеЕсли СтрНайти(ТекущийТэг,"10]") > 0 Тогда // Тэг 10 (партия)
			Партия10 = Сред(ТекущийТэг,4);
			НомерСерии = Партия10;
		КонецЕсли;			
	КонецЦикла;
	
КонецПроцедуры	

Функция СерияНеПодходит(УзелПО,СсылкаНаДок,СтрокаДокумента,ШаблонПроверкиСерии)
	
	ВведеннаяСерия = СтрокаДокумента.sn;
	Номенклатура=Справочники.Номенклатура.ПустаяСсылка();  
	Попытка Номенклатура = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(СтрокаДокумента.art.id, 4, 36)); Исключение	КонецПопытки;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДатаМобайл_ПроверкаСерий.Номенклатура КАК Номенклатура,
	               |	ДатаМобайл_ПроверкаСерий.ШаблонСерии КАК ШаблонСерии,
	               |	ИСТИНА КАК ЕстьШаблон
	               |ПОМЕСТИТЬ ШаблонПроверки
	               |ИЗ
	               |	РегистрСведений.ДатаМобайл_ПроверкаСерий КАК ДатаМобайл_ПроверкаСерий
	               |ГДЕ
	               |	ДатаМобайл_ПроверкаСерий.Номенклатура = &Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ШаблонПроверки.Номенклатура КАК Номенклатура,
	               |	ШаблонПроверки.ШаблонСерии КАК ШаблонСерии,
	               |	ШаблонПроверки.ЕстьШаблон КАК ЕстьШаблон,
	               |	ВЫБОР
	               |		КОГДА &ВведеннаяСерия ПОДОБНО ШаблонПроверки.ШаблонСерии
				   |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ШаблонПодходит
	               |ИЗ
	               |	ШаблонПроверки КАК ШаблонПроверки";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВведеннаяСерия", ВведеннаяСерия);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ШаблонПроверкиСерии = Выборка.ШаблонСерии;
		Если Выборка.ШаблонПодходит Тогда 
			Возврат Ложь; //корректная серия по шаблону
		Иначе	
			Возврат Истина; //серия не подходит по шаблону
		КонецЕсли;
	Иначе 
		Возврат Ложь; //Не задан шаблон
	КонецЕсли;	
	
КонецФункции	

Функция ПроверитьПревышениеОстатковПоСерии(УзелПО,СсылкаНаДок,СтрокаДокумента,СтруктураСтроки,СообщениеОПревышении)
	
	Если НЕ ЗначениеЗаполнено(СтруктураСтроки.СерияСсылка)  Тогда
		
		СообщениеОПревышении = "" + ?(УзелПО.ДобавлятьАртикулВНаименование,СтруктураСтроки.Номенклатура.Артикул + " ","")
								  + СтруктураСтроки.Номенклатура + " "
								  + СтруктураСтроки.ХарактеристикаНоменклатуры + " " 
								  + СтруктураСтроки.СерийныйНомер + " " + Символы.ПС
								  + " Серия не найдена! Строка не будет записана!";
		Возврат Истина;
	КонецЕсли;	
	
	//Собрано по серии в незавершенных документах
	ЗапросСобрано = Новый Запрос;
	ЗапросСобрано.Текст = "ВЫБРАТЬ
	|	ЕстьNULL(Сумма(ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Количество*ЕстьNULL(ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЕдиницаИзмерения.Числитель,1)),0) КАК КоличествоСобрано
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор
	|ГДЕ
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Ссылка.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	|	И ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Ссылка.Шаблон.КонтролироватьОстатокПоСериям
	|	И ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Номенклатура = &ТекущийТовар
	|	И ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ХарактеристикаНоменклатуры = &ТекущаяХарактеристика
	|	И ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.СерияСсылка = &ТекущаяСерия
	|	И ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Ссылка.Склад = &ТекущийСклад
	|	И ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЯчейкаСсылка = &ТекущаяЯчейка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЕстьNULL(Сумма(ДатаМобайл_СтрокиГрупповыхДокументов.Количество*ЕстьNULL(ДатаМобайл_СтрокиГрупповыхДокументов.ЕдиницаИзмерения.Числитель,1)),0)
	|ИЗ
	|	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК ДатаМобайл_СтрокиГрупповыхДокументов
	|ГДЕ
	|	ДатаМобайл_СтрокиГрупповыхДокументов.ДокументТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	|	И ДатаМобайл_СтрокиГрупповыхДокументов.ДокументТСД.Шаблон.КонтролироватьОстатокПоСериям
	|	И ДатаМобайл_СтрокиГрупповыхДокументов.Номенклатура = &ТекущийТовар
	|	И ДатаМобайл_СтрокиГрупповыхДокументов.ХарактеристикаНоменклатуры = &ТекущаяХарактеристика
	|	И ДатаМобайл_СтрокиГрупповыхДокументов.СерияСсылка = &ТекущаяСерия
	|	И ДатаМобайл_СтрокиГрупповыхДокументов.ДокументТСД.Склад = &ТекущийСклад
	|	И ДатаМобайл_СтрокиГрупповыхДокументов.ЯчейкаСсылка = &ТекущаяЯчейка";
	
	ЗапросСобрано.УстановитьПараметр("ТекущийТовар", СтруктураСтроки.Номенклатура);
	ЗапросСобрано.УстановитьПараметр("ТекущаяХарактеристика", СтруктураСтроки.ХарактеристикаНоменклатуры);
	ЗапросСобрано.УстановитьПараметр("ТекущаяСерия", СтруктураСтроки.СерияСсылка);
	ЗапросСобрано.УстановитьПараметр("ТекущийСклад", СсылкаНаДок.Склад);
	ЗапросСобрано.УстановитьПараметр("ТекущаяЯчейка", СтруктураСтроки.ЯчейкаСсылка);
	
	КоличествоСобрано = 0;
	ВыборкаСобрано = ЗапросСобрано.Выполнить().Выбрать();
	Пока ВыборкаСобрано.Следующий() цикл
		КоличествоСобрано = КоличествоСобрано+ВыборкаСобрано.КоличествоСобрано;
	КонецЦикла;	
	
	//Собрано в текущей строке
	КоэффициентУпаковки = ?(СтруктураСтроки.ЕдиницаИзмерения.Числитель=0,1,СтруктураСтроки.ЕдиницаИзмерения.Числитель);
	КоличествоСобрано = КоличествоСобрано + СтруктураСтроки.Количество*КоэффициентУпаковки;
	
	
	
	//Остатки по серии в базе
	Если НЕ ЗначениеЗаполнено(СтруктураСтроки.ЯчейкаСсылка) Тогда
		ЗапросОстаток = Новый Запрос;
		ЗапросОстаток.Текст = "ВЫБРАТЬ
		                      |	ЕСТЬNULL(СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток), 0) - ЕСТЬNULL(СУММА(ТоварыНаСкладахОстатки.КОтгрузкеОстаток), 0) КАК КоличествоОстаток
							  |ИЗ
		                      |	РегистрНакопления.ТоварыНаСкладах.Остатки(
		                      |			,
		                      |			Номенклатура = &ТекущийТовар
		                      |				И Характеристика = &ТекущаяХарактеристика
		                      |				И Серия = &ТекущаяСерия
		                      |				И Склад = &ТекущийСклад) КАК ТоварыНаСкладахОстатки";
		
		ЗапросОстаток.УстановитьПараметр("ТекущийСклад", СсылкаНаДок.Склад);

	Иначе
		ЗапросОстаток = Новый Запрос;
		ЗапросОстаток.Текст = "ВЫБРАТЬ
		                      |	ЕСТЬNULL(СУММА(ТоварыНаСкладахОстатки.ВНаличииОстаток * ЕСТЬNULL(ТоварыНаСкладахОстатки.Упаковка.Числитель, 1)), 0) - ЕСТЬNULL(СУММА(ТоварыНаСкладахОстатки.КОтборуОстаток * ЕСТЬNULL(ТоварыНаСкладахОстатки.Упаковка.Числитель, 1)), 0) КАК КоличествоОстаток
		                      |ИЗ
		                      |	РегистрНакопления.ТоварыВЯчейках.Остатки(
		                      |			,
		                      |			Номенклатура = &ТекущийТовар
		                      |				И Характеристика = &ТекущаяХарактеристика
		                      |				И Серия = &ТекущаяСерия
		                      |				И Ячейка = &ТекущаяЯчейка) КАК ТоварыНаСкладахОстатки";
				
		ЗапросОстаток.УстановитьПараметр("ТекущаяЯчейка", СтруктураСтроки.ЯчейкаСсылка);

	КонецЕсли;
	
	
	ЗапросОстаток.УстановитьПараметр("ТекущийТовар", СтруктураСтроки.Номенклатура);
	ЗапросОстаток.УстановитьПараметр("ТекущаяХарактеристика", СтруктураСтроки.ХарактеристикаНоменклатуры);
	ЗапросОстаток.УстановитьПараметр("ТекущаяСерия", СтруктураСтроки.СерияСсылка);
	
	
	КоличествоОстаток = 0;
	ВыборкаОстаток = ЗапросОстаток.Выполнить().Выбрать();
	Пока ВыборкаОстаток.Следующий() цикл
		КоличествоОстаток = КоличествоОстаток+ВыборкаОстаток.КоличествоОстаток;
	КонецЦикла;			
	
	
	Если КоличествоСобрано > КоличествоОстаток Тогда
		
		СообщениеОПревышении = "" + ?(УзелПО.ДобавлятьАртикулВНаименование,СтруктураСтроки.Номенклатура.Артикул + " ","")
								  + СтруктураСтроки.Номенклатура + " "
								  + СтруктураСтроки.ХарактеристикаНоменклатуры + " " 
								  + СтруктураСтроки.СерияСсылка + " " + Символы.ПС
								  + "Остаток: " + КоличествоОстаток 
								  + " Подобрано:  " + КоличествоСобрано 
								  + " Остаток по серии превышен! Строка не будет записана!";
		Возврат Истина;
	КонецЕсли;		
	
	Возврат Ложь;

КонецФункции	

Функция РассчитатьГоденДоСерии(лТовар,лДатаПроизводства)
	
	СрокГодности   = лТовар.СрокГодности; 
	СрокГодностиЕд = лТовар.ЕдиницаИзмеренияСрокаГодности;
	ГоденДо17      = Дата(1,1,1);
	
	Если СрокГодностиЕд = Перечисления.ЕдиницыИзмеренияВремени.Секунда Тогда
		ГоденДо17 = лДатаПроизводства + СрокГодности * 1;
	ИначеЕсли СрокГодностиЕд = Перечисления.ЕдиницыИзмеренияВремени.Минута Тогда
		ГоденДо17 = лДатаПроизводства + СрокГодности * 60;
	ИначеЕсли СрокГодностиЕд = Перечисления.ЕдиницыИзмеренияВремени.Час Тогда
		ГоденДо17 = лДатаПроизводства + СрокГодности * 60*60;
	ИначеЕсли СрокГодностиЕд = Перечисления.ЕдиницыИзмеренияВремени.День Тогда
		ГоденДо17 = лДатаПроизводства + СрокГодности * 60*60*12;
	ИначеЕсли СрокГодностиЕд = Перечисления.ЕдиницыИзмеренияВремени.Сутки Тогда
		ГоденДо17 = лДатаПроизводства + СрокГодности * 60*60*24;
	ИначеЕсли СрокГодностиЕд = Перечисления.ЕдиницыИзмеренияВремени.Месяц Тогда
		ГоденДо17 = ДобавитьМесяц(лДатаПроизводства, СрокГодности * 1);
	ИначеЕсли СрокГодностиЕд = Перечисления.ЕдиницыИзмеренияВремени.Год Тогда
		ГоденДо17 = ДобавитьМесяц(лДатаПроизводства, СрокГодности * 12);
	КонецЕсли; 
	
	Возврат ГоденДо17;
	
КонецФункции

#КонецОбласти

#Область ЕдиницыИзмерения

Функция УстановитьЕдиницу(СтрокаТЧ)
	
	Если СтрокаТЧ.Штрихкод <> "" Тогда
		
	зпр=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
					 |	ВЫБОР
					 |		КОГДА Штрихкоды.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяССылка)
					 |			ТОГДА Штрихкоды.Номенклатура.ЕдиницаИзмерения
					 |		ИНАЧЕ Штрихкоды.Упаковка
					 |	КОНЕЦ КАК ЕИ,
					 //|	Штрихкоды.Упаковка КАК ЕИ,
	                 |	Штрихкоды.Номенклатура,
	                 |	Штрихкоды.Характеристика
	                 |ПОМЕСТИТЬ тШтрихкоды
	                 |ИЗ
	                 |	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
	                 |ГДЕ
	                 |	Штрихкоды.Штрихкод = &код
	                 |	И (&ВсяНоменклатура
	                 |			ИЛИ Штрихкоды.Номенклатура = &Номенклатура)
	                 //|	И (&ВсеХарактеристики
	                 //|			ИЛИ Штрихкоды.Характеристика = &Характеристика)
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	тШтрихкоды.ЕИ,
	                 |	тШтрихкоды.Номенклатура,
	                 |	тШтрихкоды.Характеристика
	                 |ИЗ
	                 |	тШтрихкоды КАК тШтрихкоды");
	
	зпр.УстановитьПараметр("Код",СтрокаТЧ.Штрихкод);
	зпр.УстановитьПараметр("Номенклатура",СтрокаТЧ.Номенклатура);
	//зпр.УстановитьПараметр("Характеристика",СтрокаТЧ.ХарактеристикаНоменклатуры);
	зпр.УстановитьПараметр("ВсяНоменклатура",СтрокаТЧ.Номенклатура.Пустая());
	//зпр.УстановитьПараметр("ВсеХарактеристики",СтрокаТЧ.ХарактеристикаНоменклатуры.Пустая());
	рез=зпр.Выполнить().Выгрузить();
	Если Рез.Количество()>0 Тогда
		СтрокаТЧ.ЕдиницаИзмерения=Рез[0].ЕИ;
		Если СтрокаТЧ.Номенклатура.Пустая() Тогда
			СтрокаТЧ.Номенклатура=Рез[0].Номенклатура;
		КонецЕсли;	
		Если СтрокаТЧ.ХарактеристикаНоменклатуры.Пустая() Тогда
			СтрокаТЧ.ХарактеристикаНоменклатуры=Рез[0].Характеристика;
		КонецЕсли;	
	КонецЕсли;	
	
	Коэффициент = ?(СтрокаТЧ.ЕдиницаИзмерения.Числитель=0,1,СтрокаТЧ.ЕдиницаИзмерения.Числитель)/?(СтрокаТЧ.ЕдиницаИзмерения.Знаменатель=0,1,СтрокаТЧ.ЕдиницаИзмерения.Знаменатель);
	
	Пересчет = Ложь;
	
	//Пересчет единиц мерных товаров, учет которых ведется в штуках
	Попытка
		Если 
			НЕ Справочники.УпаковкиЕдиницыИзмерения.ЭтоМернаяЕдиница(СтрокаТЧ.Номенклатура.ЕдиницаИзмерения)
			И СтрокаТЧ.Номенклатура.ВесИспользовать 
			И НЕ СтрокаТЧ.Номенклатура.ВесЕдиницаИзмерения.Пустая()
			И СтрокаТЧ.Номенклатура.ВесЧислитель<>0 
			И СтрокаТЧ.ТСД.ПересчитыватьКоличество
			И СтрДлина(СтрокаТЧ.Штрихкод)=5  //только весовые, может не всем подойти, надо закомментировать Тогда
			И СтрокаТЧ.ЕдиницаИзмерения.Пустая() Тогда
			
			Коэффициент = СтрокаТЧ.Номенклатура.ВесЧислитель;
			Пересчет = Истина;
		КонецЕсли;
	Исключение
	КонецПопытки;
	//

	Модуль_ОбщегоНазначения = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначения");
	ВесЕдиницаИзмерения = Модуль_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Номенклатура, "ВесЕдиницаИзмерения");
	
	Попытка
		Если СтрокаТЧ.ТСД.НеИспользоватьПересчетУпаковок Тогда
			СтрокаТЧ.Количество = СтрокаТЧ.Количество;
		Иначе
			СтрокаТЧ.Количество = ?(Пересчет, СтрокаТЧ.Количество/ВесЕдиницаИзмерения.Числитель/Коэффициент, СтрокаТЧ.Количество/Коэффициент);			
		КонецЕсли;
		СтрокаТЧ.КоэффициентЕдиницы = Коэффициент;
	Исключение
		СтрокаТЧ.Количество = СтрокаТЧ.Количество;
		СтрокаТЧ.КоэффициентЕдиницы = 1;
	КонецПопытки;

	КонецЕсли;

КонецФункции	

Функция ПолучитьШтрихкодУпаковки(лНоменклатура,лХарактеристика,лУпаковка)
	
	ТекущийШтрихкод = "";
	
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                    |	ШтрихкодыНоменклатуры.Штрихкод
	                    |ИЗ
	                    |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                    |ГДЕ
	                    |	ШтрихкодыНоменклатуры.Номенклатура = &лНоменклатура
						|	И ШтрихкодыНоменклатуры.Характеристика = &лХарактеристика
	                 	|	И ШтрихкодыНоменклатуры.Упаковка = &лУпаковка
						|");
	
	Запрос.УстановитьПараметр("лНоменклатура", лНоменклатура);
	Запрос.УстановитьПараметр("лХарактеристика", лХарактеристика);
	Запрос.УстановитьПараметр("лУпаковка", лУпаковка);
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Если ЗначениеЗаполнено(Рез.Штрихкод) Тогда
			ТекущийШтрихкод = Рез.Штрихкод;
		КонецЕсли;	
	КонецЕсли;				
	
	Возврат ТекущийШтрихкод;

КонецФункции

#КонецОбласти

#Область Товары

Функция СобратьТовары(СписокТоваров, УзелПО, СписокХарактеристик = Неопределено, Шаблон = Неопределено) Экспорт

	ОбъектСписка = Новый Массив();
	
	ТипЦен=УзелПО.ТипЦен;
	ВключатьАртикул=УзелПО.ДобавлятьАртикулВНаименование; 
	

	ЗапросТоваров=Новый Запрос();
	
	ЗапросТоваров.УстановитьПараметр("Товар",СписокТоваров);
	ЗапросТоваров.УстановитьПараметр("ВсеТовары",Ложь);	
	Если СписокТоваров.Количество()=0 Тогда
		ЗапросТоваров.УстановитьПараметр("ВсеТовары",Истина);
	КонецЕсли;
	
	Если СписокХарактеристик = Неопределено Тогда
		ЗапросТоваров.УстановитьПараметр("ВсеХарактеристики",Истина);
		ЗапросТоваров.УстановитьПараметр("Характеристики",СписокХарактеристик);
	Иначе	
		ЗапросТоваров.УстановитьПараметр("Характеристики",СписокХарактеристик);
		ЗапросТоваров.УстановитьПараметр("ВсеХарактеристики",Ложь);	
		Если СписокТоваров.Количество()=0 Тогда
			ЗапросТоваров.УстановитьПараметр("ВсеХарактеристики",Истина);
		КонецЕсли;
	КонецЕсли;
	
	ЗапросТоваров.УстановитьПараметр("КаталогиТовара",УзелПО.ДоступныеГруппыТоваров.ВыгрузитьКолонку("Номенклатура"));
	ЗапросТоваров.УстановитьПараметр("ВсеКаталоги",Ложь);	
	Если УзелПО.ДоступныеГруппыТоваров.Количество()=0 Тогда
		ЗапросТоваров.УстановитьПараметр("ВсеКаталоги",Истина);
	КонецЕсли;

	СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
	ЗапросТоваров.УстановитьПараметр("Склады",СписокСкладов);
	ЗапросТоваров.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
	
	СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	ЗапросТоваров.УстановитьПараметр("Помещения",СписокПомещений);
	ЗапросТоваров.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);


	ТекстЗапроса="ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ 
				 //ВЫБОРКА ССЫЛОК ТОВАРОВ И ХАРАКТЕРИСТИК ПО РАЗНЫМ УСЛОВИЯМ ВЕДЕНИЯ ХАРАКТЕРИСТИК 
				 |	Номенклатура.Ссылка КАК Номенклатура,
				 |	Номенклатура.ВесМожноУказыватьВДокументах КАК Весовой,
				 |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)) КАК Характеристика
				 |ПОМЕСТИТЬ СписокТоваровОбщий
				 |ИЗ
				 | 	Справочник.Номенклатура КАК Номенклатура
				 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
				 |			ПО ХарактеристикиНоменклатуры.Владелец = Номенклатура.Ссылка
				 |			И Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры)
				 |			И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
				 |			И (ХарактеристикиНоменклатуры.Ссылка В (&Характеристики) ИЛИ &ВсеХарактеристики)
				 |ГДЕ
				 |	НЕ Номенклатура.ЭтоГруппа
				 //|	И НЕ Номенклатура.ПометкаУдаления
				 |	И (Номенклатура.Ссылка В (&Товар) ИЛИ &ВсеТовары)
				 |	И (Номенклатура.Ссылка В ИЕРАРХИИ (&КаталогиТовара) ИЛИ &ВсеКаталоги)
				 |
				 |ОБЪЕДИНИТЬ
				 |	
				 |ВЫБРАТЬ РАЗЛИЧНЫЕ 
				 |	Номенклатура.Ссылка КАК Номенклатура,
				 |	Номенклатура.ВесМожноУказыватьВДокументах,
				 |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)) КАК Характеристика
				 |ИЗ
				 |	Справочник.Номенклатура КАК Номенклатура
				 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
				 |			ПО ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВидНоменклатуры
				 |			И Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры)
				 |			И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
				 |			И (ХарактеристикиНоменклатуры.Ссылка В (&Характеристики) ИЛИ &ВсеХарактеристики)
				 |ГДЕ
				 |	НЕ Номенклатура.ЭтоГруппа
				 //|	И НЕ Номенклатура.ПометкаУдаления
				 |	И (Номенклатура.Ссылка В (&Товар)ИЛИ &ВсеТовары)
				 |	И (Номенклатура.Ссылка В ИЕРАРХИИ (&КаталогиТовара)ИЛИ &ВсеКаталоги)
				 |	И НЕ ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL   
				 |
				 |ОБЪЕДИНИТЬ
				 |
				 |ВЫБРАТЬ РАЗЛИЧНЫЕ 
				 |	Номенклатура.Ссылка КАК Номенклатура,
				 |	Номенклатура.ВесМожноУказыватьВДокументах,
				 |	ЕСТЬNULL(ХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)) КАК Характеристика
				 |ИЗ
				 |	Справочник.Номенклатура КАК Номенклатура
				 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
				 |			ПО ХарактеристикиНоменклатуры.Владелец = Номенклатура.ВладелецХарактеристик
				 |			И Номенклатура.ИспользованиеХарактеристик = ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеСДругимВидомНоменклатуры)
				 |			И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления
				 |			И (ХарактеристикиНоменклатуры.Ссылка В (&Характеристики) ИЛИ &ВсеХарактеристики)
				 |ГДЕ
				 |	НЕ Номенклатура.ЭтоГруппа
				 //|	И НЕ Номенклатура.ПометкаУдаления
				 |	И (Номенклатура.Ссылка В (&Товар) ИЛИ &ВсеТовары)
				 |	И (Номенклатура.Ссылка В ИЕРАРХИИ (&КаталогиТовара) ИЛИ &ВсеКаталоги)
				 |	И НЕ ХарактеристикиНоменклатуры.Ссылка ЕСТЬ NULL	
				 |	
				 |;
				 |////////////////////////////////////////////////////////////////////////////////
				 |ВЫБРАТЬ РАЗРЕШЕННЫЕ 
				 |	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
				 |	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.КОтгрузкеОстаток, 0)) КАК ВРезерве,
				 |	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
				 |	СвободныеОстаткиОстатки.Характеристика КАК Характеристика
				 |ПОМЕСТИТЬ ТоварыСОстатками1С
				 |ИЗ
				 |	РегистрНакопления.ТоварыНаСкладах.Остатки(
				 |				,
				 |				(&ВсеСклады ИЛИ Склад В (&Склады)) 
				 |				И (&ВсеПомещения ИЛИ Помещение В (&Помещения))
				 |				И (Номенклатура.Ссылка В (&Товар) ИЛИ &ВсеТовары)
				 |				И (Номенклатура.Ссылка В ИЕРАРХИИ (&КаталогиТовара) ИЛИ &ВсеКаталоги)
				 |	) КАК СвободныеОстаткиОстатки
				 |
				 |СГРУППИРОВАТЬ ПО
				 |	СвободныеОстаткиОстатки.Номенклатура,
				 |	СвободныеОстаткиОстатки.Характеристика
				 |;
				 |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ 
				 //ВЫБОРКА ЦЕН И ДОПОЛНИТЕЛЬНЫХ ДАННЫХ ПО ТОВАРАМ
	             |	СписокТоваровОбщий.Номенклатура,
				 |	СписокТоваровОбщий.Весовой,
	             |	СписокТоваровОбщий.Характеристика,
				 |	ЛОЖЬ КАК ЭтоНовыйТовар,
				 |	ВЫБОР
	             |		КОГДА СписокТоваровОбщий.Номенклатура.ПометкаУдаления ИЛИ СписокТоваровОбщий.Характеристика.ПометкаУдаления	             
				 |			ТОГДА ИСТИНА
	             |		ИНАЧЕ ЛОЖЬ
	             |	КОНЕЦ КАК Удалить,
				 |	ВЫБОР
	             |		КОГДА &ВключатьАртикул
	             |			ТОГДА ВЫБОР КОГДА СписокТоваровОбщий.Номенклатура.Артикул = """" ТОГДА """" ИНАЧЕ СписокТоваровОбщий.Номенклатура.Артикул + "" "" КОНЕЦ
	             |		ИНАЧЕ """"
	             |	КОНЕЦ + СписокТоваровОбщий.Номенклатура.Наименование + "" "" + ЕстьNULL(СписокТоваровОбщий.Характеристика.Наименование, """") КАК Наименование,
				 |	ЕСТЬNULL(ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) / ВЫБОР
				 |				КОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель, 0) = 0
				 |					ТОГДА 1
				 |				ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель
				 |			КОНЕЦ КАК ЧИСЛО(19, 2)), 0) КАК Цена,
	             |	ЕСТЬNULL(СписокТоваровОбщий.Номенклатура.ВидНоменклатуры.ИспользоватьСерии, ЛОЖЬ) КАК ИспользоватьСерии,
				 //|  СписокЯчеек.АдресХранения
				 |	ЕСТЬNULL(ТоварыСОстатками1С.ВНаличии, 0) КАК ВНаличии,
				 |	ЕСТЬNULL(ТоварыСОстатками1С.ВРезерве, 0) КАК ВРезерве		 
				 |ПОМЕСТИТЬ СписокТоваров
	             |ИЗ
	             |	СписокТоваровОбщий КАК СписокТоваровОбщий
	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ВидЦены = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	             |			ПО ЦеныНоменклатурыСрезПоследних.Номенклатура = СписокТоваровОбщий.Номенклатура 
				 |				И ЦеныНоменклатурыСрезПоследних.Характеристика = СписокТоваровОбщий.Характеристика 
				 |		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСОстатками1С КАК ТоварыСОстатками1С
				 |			ПО ТоварыСОстатками1С.Номенклатура = СписокТоваровОбщий.Номенклатура
				 |				И ТоварыСОстатками1С.Характеристика = СписокТоваровОбщий.Характеристика 
				 |
				 |ОБЪЕДИНИТЬ
	             |
	             |ВЫБРАТЬ
	             |	ДатаМобайл_НовыеТоварыИзменения.Ссылка,
				 |	ЛОЖЬ,
				 |	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка),
	             |	ИСТИНА,
	             |	ВЫБОР
	             |		КОГДА ДатаМобайл_НовыеТоварыИзменения.Ссылка.ПометкаУдаления	             
				 |			ТОГДА ИСТИНА
	             |		ИНАЧЕ ЛОЖЬ
	             |	КОНЕЦ,
				 |	ДатаМобайл_НовыеТоварыИзменения.Ссылка.Наименование,
				 |	0,
				 |  ЛОЖЬ,
				 //|	""""
				 |	0,
				 |	0
				 |ИЗ
	             |	Справочник.ДатаМобайл_НовыеТовары.Изменения КАК ДатаМобайл_НовыеТоварыИзменения
	             |ГДЕ
				 |	ДатаМобайл_НовыеТоварыИзменения.Узел = &Узел
				 |	И (ДатаМобайл_НовыеТоварыИзменения.Ссылка В (&Товар) ИЛИ ДатаМобайл_НовыеТоварыИзменения.Ссылка.Номенклатура В (&Товар) ИЛИ &ВсеТовары)
	             |	И НЕ ДатаМобайл_НовыеТоварыИзменения.НомерСообщения ЕСТЬ NULL 
				 |
				 |;
				 |
				 |////////////////////////////////////////////////////////////////////////////////
				 |  ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				 //ВЫБОРКА ШТРИХКОДОВ
				 |	ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Штрихкод КАК СТРОКА(60)) КАК Штрихкод,
	             |	ШтрихкодыНоменклатуры.Номенклатура,
	             |	ШтрихкодыНоменклатуры.Характеристика,
	             |	ЕСТЬNULL(ВЫБОР КОГДА ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка.Числитель,1) =0 ТОГДА 1 ИНАЧЕ ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка.Числитель,1) КОНЕЦ/ 
				 |	         ВЫБОР КОГДА ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка.Знаменатель,1) = 0 ТОГДА 1 ИНАЧЕ ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка.Знаменатель,1) КОНЕЦ, 1) КАК КФ,
	             |	ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка.ЕдиницаИзмерения.Наименование, ШтрихкодыНоменклатуры.Номенклатура.ЕдиницаИзмерения.Наименование) КАК ЕИ
				 |ПОМЕСТИТЬ СписокШтрихкодов
				 |ИЗ
	             |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	             |ГДЕ
	             |	(ШтрихкодыНоменклатуры.Номенклатура В ИЕРАРХИИ  (&Товар) ИЛИ &ВсеТовары)
				 |	И (ШтрихкодыНоменклатуры.Номенклатура В ИЕРАРХИИ (&КаталогиТовара) ИЛИ &ВсеКаталоги)
	             |
	             |ОБЪЕДИНИТЬ
	             |
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ВЫРАЗИТЬ(ДатаМобайл_НовыеШтрихкоды.ШтрихКод КАК Строка(60)),
	             |	ДатаМобайл_НовыеШтрихкоды.Номенклатура,
	             |	ДатаМобайл_НовыеШтрихкоды.Характеристика,
	             |	ДатаМобайл_НовыеШтрихкоды.Коэффициент,
	             |	ДатаМобайл_НовыеШтрихкоды.Наименование
	             |ИЗ
	             |	РегистрСведений.ДатаМобайл_НовыеШтрихкоды КАК ДатаМобайл_НовыеШтрихкоды
	             |ГДЕ
	             |	(ДатаМобайл_НовыеШтрихкоды.Номенклатура В ИЕРАРХИИ (&Товар) ИЛИ &ВсеТовары)
				 |	И (ДатаМобайл_НовыеШтрихкоды.Номенклатура В ИЕРАРХИИ (&КаталогиТовара) ИЛИ &ВсеКаталоги)
				 |	И ДатаМобайл_НовыеШтрихкоды.Номенклатура ССЫЛКА Справочник.Номенклатура
				 |
				 |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	          	 |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ  
				 //СОЕДИНЕНИЕ ТАБЛИЦ ТОВАРОВ И ШТРИХКОДОВ
	             |	СписокТоваров.Номенклатура,
				 |	СписокТоваров.Весовой,
				 |	СписокТоваров.Характеристика,
				 |	СписокТоваров.ЭтоНовыйТовар,
				 |	СписокТоваров.Удалить,
				 |	СписокТоваров.Наименование,
	             |	СписокТоваров.Цена,
				 |	СписокТоваров.ИспользоватьСерии,
				 //|  СписокТоваров.АдресХранения,
				 |  СписокТоваров.ВНаличии,
				 |  СписокТоваров.ВРезерве,
				 |	ЕСТЬNULL(СписокШтрихкодов.Штрихкод,"""") КАК Штрихкод,
				 |	ЕСТЬNULL(СписокШтрихкодов.КФ, 1) КАК КФ,
				 |  ЕСТЬNULL(СписокШтрихкодов.ЕИ,""шт."") КАК  ЕИ
				 |ИЗ
	             |	СписокТоваров КАК СписокТоваров
				 |		ЛЕВОЕ СОЕДИНЕНИЕ СписокШтрихкодов КАК СписокШтрихкодов
	             |			ПО СписокШтрихкодов.Номенклатура = СписокТоваров.Номенклатура 
				 |				И СписокШтрихкодов.Характеристика = СписокТоваров.Характеристика 
				 |ИТОГИ ПО 
				 |   СписокТоваров.Номенклатура, СписокТоваров.Характеристика
				 |   
				 |;
                 | УНИЧТОЖИТЬ  СписокТоваровОбщий
				 |;
                 | УНИЧТОЖИТЬ  СписокТоваров
				 |;
                 | УНИЧТОЖИТЬ  СписокШтрихкодов
				 //|;
				 //| УНИЧТОЖИТЬ  СписокЯчеек
				 |";
				 
	СкорректироватьЗапросПоЦенообразованию25(ТекстЗапроса, "СобратьТовары");
	
	ЗапросТоваров.Текст=ТекстЗапроса;
	лТипНеопределеннойДлины=Тип("Строка");
	
	ЗапросТоваров.УстановитьПараметр("Узел",УзелПО);
	ЗапросТоваров.УстановитьПараметр("ТипЦен",ТипЦен);
	ЗапросТоваров.УстановитьПараметр("ВключатьАртикул",ВключатьАртикул);					 
	ЗапросТоваров.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Товары=ЗапросТоваров.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	СтруктураСпискаТоваров = Новый Структура;
	
	т = 0;
	х = 0;
	ш = 0;
	
	Пока Товары.Следующий() цикл
		т = т + 1;
		
		СтрХарактеристика = Товары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока СтрХарактеристика.Следующий() цикл
		х = х + 1;
		
		СтрТовара=СтрХарактеристика.Выбрать();
		n = 0;
		
		Пока СтрТовара.Следующий() цикл
			ш=ш+1;

			Если n=0 Тогда
				
		        ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art");

				ОбъектТовара.id = ?(СтрТовара.ЭтоНовыйТовар, "8n-" + XMLСтрока(СтрТовара.Номенклатура), "8U-" + XMLСтрока(СтрТовара.Номенклатура) + XMLСтрока(СтрТовара.Характеристика));	
				ОбъектТовара.name = ЛЕВ(ЧистаяСтрока(СтрТовара.Наименование), 150);	
				ОбъектТовара.price = СтрТовара.Цена;
				
				СформироватьЗаголовкиJSONParamsТовара(УзелПО,ОбъектТовара,СтрТовара.Номенклатура,СтрТовара.Характеристика,СтрТовара.ИспользоватьСерии,Шаблон);
					
				ОбъектТовара.is_deleted = СтрТовара.Удалить;
		
				ЭтоУслуга = Ложь;
				Попытка 
					Если СтрТовара.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
						ЭтоУслуга = Истина;
					КонецЕсли;
				Исключение
				КонецПопытки;
				
				Если УзелПО.НеОтображатьОстатки Тогда
					ОбъектТовара.rest = 0;
				ИначеЕсли ЭтоУслуга Тогда
					ОбъектТовара.rest = 999;	
				Иначе
					Итог = (СтрТовара.ВНаличии-СтрТовара.ВРезерве);
					ОбъектТовара.rest = Итог;
				КонецЕсли;
				
				Если ОбъектТовара.name = "" и СтрТовара.ЭтоНовыйТовар Тогда
					ОбъектТовара.name = "УдалитьНовыйТовар";
					ОбъектТовара.is_deleted = Истина;
				КонецЕсли;	
				
			КонецЕсли;

			n=n+1;
			
			Если УзелПО.ИспользоватьАртикулКакШтрихкодТовара И ТипЗнч(СтрТовара.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				Штрихкод = СтрТовара.Номенклатура.Артикул;
			Иначе
				Штрихкод = СтрТовара.ШтрихКод;
			КонецЕсли;
			
			Если НЕ Штрихкод = "" Тогда

				ОбъектШтрихкода = ПолучитьСтруктуруОбъектаДляHttp("barcode");

				Если СтрДлина(ШтрихКод) = 13 // EAN13
				И Лев(ШтрихКод, 1) = "2" // Внутренний штрихкод
				И Сред(ШтрихКод, 2, 1) = "_" Тогда // Найден префикс весового товара
					Штрихкод =  Сред(ШтрихКод, 3, 5);
					ОбъектШтрихкода.value = ЧистаяСтрока(Штрихкод);
				Иначе	
					ОбъектШтрихкода.value = ЧистаяСтрока(ШтрихКод);
				КонецЕсли;	
				
				ОбъектШтрихкода.unit_name = ЧистаяСтрока(СтрТовара.ЕИ);
				
				Если УзелПО.НеИспользоватьПересчетУпаковок Тогда
					ОбъектШтрихкода.unit_coef = 1;
				Иначе	
					ОбъектШтрихкода.unit_coef = СтрТовара.КФ;
				КонецЕсли;

				ОбъектШтрихкода.is_deleted = СтрТовара.Удалить;
				
				ОбъектТовара.barcodes.Добавить(ОбъектШтрихкода);
			КонецЕсли;			                                                                              
		КонецЦикла;
		
		Если ОбъектТовара.name = "" или ОбъектТовара.id = "" Тогда
			Продолжить;
		КонецЕсли;

		ОбъектСписка.Добавить(ОбъектТовара);
	КонецЦикла;
	КонецЦикла;
	
	Возврат ОбъектСписка;

КонецФункции

Функция ПолучитьДопускВесовогоТовара(Номенклатура,Партнер=Неопределено)
	
	Если Номенклатура.ВесМожноУказыватьВДокументах тогда	
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДатаМобайл_ДопускиВесовыхТоваров.ПроцентДопуска КАК ПроцентДопуска,
		|	ДатаМобайл_ДопускиВесовыхТоваров.Партнер.Наименование
		|ИЗ
		|	РегистрСведений.ДатаМобайл_ДопускиВесовыхТоваров КАК ДатаМобайл_ДопускиВесовыхТоваров
		|ГДЕ
		|	ДатаМобайл_ДопускиВесовыхТоваров.Номенклатура = &Номенклатура
		|	И ДатаМобайл_ДопускиВесовыхТоваров.Партнер = &Партнер
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ДатаМобайл_ДопускиВесовыхТоваров.ПроцентДопуска КАК ПроцентДопуска,
		|	ДатаМобайл_ДопускиВесовыхТоваров.Партнер.Наименование
		|ИЗ
		|	РегистрСведений.ДатаМобайл_ДопускиВесовыхТоваров КАК ДатаМобайл_ДопускиВесовыхТоваров
		|ГДЕ
		|	ДатаМобайл_ДопускиВесовыхТоваров.Номенклатура = &Номенклатура
		|	И ДатаМобайл_ДопускиВесовыхТоваров.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
		|УПОРЯДОЧИТЬ ПО 
		|	ДатаМобайл_ДопускиВесовыхТоваров.Партнер.Наименование УБЫВ";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		Если Партнер = Неопределено Тогда
			Запрос.УстановитьПараметр("Партнер", Справочники.Партнеры.ПустаяСсылка());
		Иначе	
			Запрос.УстановитьПараметр("Партнер", Партнер);
		КонецЕсли;	
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.ПроцентДопуска*0.01;
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;	

КонецФункции	

Функция ПолучитьОстаткиПоТовару(УзелПО,ТекущийСклад,лТовар,лХарактеристикаНоменклатуры)
	
	ОстаткиПоТовару = 0;

	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
	|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.КОтгрузкеОстаток, 0)) КАК ВРезерве,
	|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
	|	СвободныеОстаткиОстатки.Характеристика КАК Характеристика
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				(&ВсеСклады
	|					ИЛИ Склад В (&Склады))
	|				И (&ВсеПомещения
	|					ИЛИ Помещение В (&Помещения)) И Номенклатура = &Номенклатура И Характеристика = &Характеристика) КАК СвободныеОстаткиОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	СвободныеОстаткиОстатки.Номенклатура,
	|	СвободныеОстаткиОстатки.Характеристика";


	Запрос.УстановитьПараметр("Номенклатура", лТовар);
	Запрос.УстановитьПараметр("Характеристика", лХарактеристикаНоменклатуры);
	
	СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
	Запрос.УстановитьПараметр("Склады",СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
	
	СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	Запрос.УстановитьПараметр("Помещения",СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);

				
		ВыборкаОстаток = Запрос.Выполнить().Выбрать();	
		Пока ВыборкаОстаток.Следующий() цикл
			ОстаткиПоТовару = ОстаткиПоТовару + ВыборкаОстаток.ВНаличии - ВыборкаОстаток.ВРезерве;
		КонецЦикла;

		ОстаткиПоТовару= ОстаткиПоТовару;
  		Возврат ОстаткиПоТовару;
	
КонецФункции

Функция ОпределитьНоменклатуруПоGTIN(лНоменклатура,лХарактеристика,GTIN)
	
	
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
						|	ШтрихкодыНоменклатуры.Номенклатура,
						|	ШтрихкодыНоменклатуры.Характеристика
	                    |ИЗ
	                    |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                    |ГДЕ
	                    |	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод");

	Запрос.УстановитьПараметр("Штрихкод",GTIN);
	
	Выборка = Запрос.Выполнить().Выбрать();
	 
	Если Выборка.Следующий() Тогда
		лНоменклатура = Выборка.Номенклатура;
		лХарактеристика = Выборка.Характеристика;
	КонецЕсли;	 
	
КонецФункции	

Функция РазрешеноРедактированиеТовара(УзелПО,UserName)
	
	СтруктураПоиска = Новый Структура("Пользователь", Справочники.Пользователи.НайтиПоНаименованию(UserName,Ложь));
	СтрокиПользователиТСД = УзелПО.ПользователиТСД.НайтиСтроки(СтруктураПоиска);
	Если СтрокиПользователиТСД.Количество() = 0 Тогда
		Возврат Истина;
	Иначе
		Возврат СтрокиПользователиТСД[0].РазрешитьРедактированиеТовара; 
	КонецЕсли
	
КонецФункции

Функция ПолучитьЦенуТовара(Номенклатура, ХарактеристикаНоменклатуры, ТипЦен, УпаковкаСсылка = Неопределено)
		
	лТекущаяЦена = 0;
	
	Если НЕ ЗначениеЗаполнено(УпаковкаСсылка) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		                      |ИЗ
		                      |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		                      |			&ТекущаяДата,
		                      |			ВидЦены = &ТипЦен
		                      |				И Номенклатура = &Номенклатура
		                      |				И Характеристика = &ХарактеристикаНоменклатуры) КАК ЦеныНоменклатурыСрезПоследних");
	Иначе	
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		                      |ИЗ
		                      |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		                      |			&ТекущаяДата,
		                      |			ВидЦены = &ТипЦен
		                      |				И Номенклатура = &Номенклатура
		                      |				И Характеристика = &ХарактеристикаНоменклатуры) КАК ЦеныНоменклатурыСрезПоследних
		                      |ГДЕ
		                      |	ЦеныНоменклатурыСрезПоследних.Упаковка = &Упаковка");
	КонецЕсли;	

	СкорректироватьЗапросПоЦенообразованию25(Запрос.Текст, "ПолучитьЦенуТовара"); 
	
	Если НЕ УпаковкаСсылка = Неопределено Тогда
		Если ЗначениеЗаполнено(УпаковкаСсылка) Тогда
			Запрос.УстановитьПараметр("Упаковка",УпаковкаСсылка); 
		КонецЕсли;
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("ТипЦен",ТипЦен);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() цикл    
		лТекущаяЦена =  Рез.Цена;
	КонецЦикла;	

	Возврат лТекущаяЦена;

КонецФункции

Процедура СформироватьЗаголовкиJSONParamsТовара(УзелПО,ОбъектТовара,СсылкаТовар,СсылкаХарактеристика,DMUseSN = Ложь,Шаблон = Неопределено)
	
	ОбъектТовара.is_use_sn = DMUseSN;
	Попытка ОбъектТовара.parent_id = ?(XMLСтрока(СсылкаХарактеристика) = "00000000-0000-0000-0000-000000000000", "", "8U-" + XMLСтрока(СсылкаТовар) + "00000000-0000-0000-0000-000000000000"); Исключение КонецПопытки;
	Попытка ОбъектТовара.measure_type = ?(СсылкаТовар.ВесМожноУказыватьВДокументах, 1, 0); Исключение ОбъектТовара.measure_type = 0; КонецПопытки;			
	Попытка ОбъектТовара.mark_type = ДатаМобайл_Маркировка.ПолучитьТипМаркированнойПродукции(СсылкаТовар); Исключение ОбъектТовара.mark_type = 0; КонецПопытки;
	
	ЭтоНовыйТовар = Ложь;
	Если НЕ ТипЗнч(СсылкаТовар) = Тип("СправочникСсылка.Номенклатура") тогда
		ЭтоНовыйТовар = Истина;
	КонецЕсли;
	РассчитатьГоденДо = ?(Шаблон = Неопределено, Истина, Шаблон.СерииРассчитыватьГоденДо);		
	
	Атрибуты = ПолучитьАтрибуты(УзелПО); 				
	СтруктураАтрибутов = Новый Структура;	
	Для сч = 1 По 10 Цикл
		Попытка 
			ИмяАтрибута =  Атрибуты["ИмяАтрибута" + сч];
			Если ЭтоНовыйТовар Тогда
				СтруктураАтрибутов.Вставить("attr_" + сч, "");
			ИначеЕсли ИмяАтрибута = "!!! Ячейки !!!" Тогда
				СтруктураАтрибутов.Вставить("attr_" + сч, ПолучитьСправочныеЯчейкиТовара(УзелПО, СсылкаТовар));
			ИначеЕсли ИмяАтрибута = "!!! Характеристики !!!" Тогда
				СтруктураАтрибутов.Вставить("attr_" + сч, ЧистаяСтрока(СсылкаХарактеристика.Наименование));
			ИначеЕсли ЛЕВ(ИмяАтрибута, 3) = "ДР_" Тогда 
				СтруктураАтрибутов.Вставить("attr_" + сч, ПолучитьДополнительныйРеквизитАтрибута(СсылкаТовар, ИмяАтрибута));	
			ИначеЕсли ИмяАтрибута <> "" Тогда
				СтруктураАтрибутов.Вставить("attr_" + сч, ЧистаяСтрока(СсылкаТовар[ИмяАтрибута]));						
			Иначе 
				СтруктураАтрибутов.Вставить("attr_" + сч, "");
			КонецЕсли;
		Исключение
			СтруктураАтрибутов.Вставить("attr_" + сч, "");
		КонецПопытки;	
	КонецЦикла;
	
	ОбъектТовара.attributes = СтруктураАтрибутов;
	
	
	Если DMUseSN И НЕ ЭтоНовыйТовар тогда
		
		Если ЗначениеЗаполнено(СсылкаТовар.ВидНоменклатуры.ВладелецСерий) Тогда  
			ТекущийВладелецСерий = СсылкаТовар.ВидНоменклатуры.ВладелецСерий;
		Иначе
			ТекущийВладелецСерий = СсылкаТовар.ВидНоменклатуры;
		КонецЕсли;	
		
		МассивТиповСерийныхНомеров = Новый Массив;
		
		
		Попытка 
			Если ТекущийВладелецСерий.ИспользоватьНомерСерии Тогда //(10)
				МассивТиповСерийныхНомеров.Добавить("10");
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Попытка
			Если ТекущийВладелецСерий.ИспользоватьДатуПроизводстваСерии Тогда  //(11)
				МассивТиповСерийныхНомеров.Добавить("11");
			КонецЕсли; 	
		Исключение
		КонецПопытки;
		
		Попытка
			Если ТекущийВладелецСерий.ИспользоватьСрокГодностиСерии Тогда	//(17)
				Если РассчитатьГоденДо Тогда
					// не выгружаем тип серийного номера для даты срока годности
				Иначе
					МассивТиповСерийныхНомеров.Добавить("17");
				КонецЕсли;
			КонецЕсли;
		Исключение
		КонецПопытки;
			
		ОбъектТовара.Вставить("sn_types", МассивТиповСерийныхНомеров);

		Попытка
			ДопускОСГ =  ПолучитьДопускОСГ(СсылкаТовар);
		Исключение
			ДопускОСГ = Неопределено;
		КонецПопытки;
		
		Если ДопускОСГ<>Неопределено тогда
			ОбъектТовара.Вставить("remaining_expiration_date_in_days", ДопускОСГ);
		КонецЕсли;

	КонецЕсли;

	Если НЕ ЭтоНовыйТовар тогда
		Попытка
			Если СсылкаТовар.ВесМожноУказыватьВДокументах тогда
				Попытка
					ДопускВесовогоТовара =  ПолучитьДопускВесовогоТовара(СсылкаТовар);
				Исключение
					ДопускВесовогоТовара = Неопределено;
				КонецПопытки;
				
				Если ДопускВесовогоТовара<>Неопределено тогда
					ОбъектТовара.Вставить("weight_task", ДопускВесовогоТовара);
				КонецЕсли;	
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьНоменклатуруПоШтрихкоду(лШтрихкод)
	
	Результат = Справочники.Номенклатура.ПустаяСсылка(); 
	
	Если лШтрихкод = "" Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	ШтрихкодыНоменклатуры.Штрихкод = &Штрихкод");
	Запрос.УстановитьПараметр("Штрихкод", лШтрихкод);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Номенклатура;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
#КонецОбласти

#Область Ячейки

Функция ПолучитьСправочныеЯчейкиТовара(УзелПО,Номенклатура)
	
	СтрокаЯчеек = "";
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ячейки.Ячейка.Наименование КАК АдресХранения
	|ИЗ
	|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК Ячейки
	|ГДЕ
	|	Ячейки.Номенклатура=&Номенклатура 
	|	И (&ВсеСклады ИЛИ Ячейки.Склад В (&Склады))
	|	И (&ВсеПомещения ИЛИ Ячейки.Помещение В (&Помещения))");
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);

	СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
	Запрос.УстановитьПараметр("Склады",СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
	
	СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	Запрос.УстановитьПараметр("Помещения",СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);


	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() цикл
		Если СтрокаЯчеек = "" Тогда
			СтрокаЯчеек = СтрокаЯчеек + Рез.АдресХранения;
		Иначе	
			СтрокаЯчеек =  СтрокаЯчеек + ", " + Рез.АдресХранения;
		КонецЕсли;	
	КонецЦикла;	

	Возврат СтрокаЯчеек;

КонецФункции

Функция ПолучитьОстаткиПоЯчейке(УзелПО,ТекущийСклад,лТовар,лХарактеристикаНоменклатуры,ТекущаяЯчейка)
	
	ОстаткиПоЯчейке = 0;

		ЗапросОстатковПоЯчейке = Новый Запрос("ВЫБРАТЬ
		|	СУММА(ТоварыВЯчейкахОстатки.ВНаличииОстаток) КАК Остаток,
		|	ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Остатки КАК ТоварыВЯчейкахОстатки
		|ГДЕ
		|	ТоварыВЯчейкахОстатки.Номенклатура = &Номенклатура
		|	И ТоварыВЯчейкахОстатки.Характеристика = &Характеристика
		|	И ТоварыВЯчейкахОстатки.Ячейка = &Ячейка
		|СГРУППИРОВАТЬ ПО 
		|	ТоварыВЯчейкахОстатки.Упаковка");
		
		ЗапросОстатковПоЯчейке.УстановитьПараметр("Номенклатура", лТовар);
		ЗапросОстатковПоЯчейке.УстановитьПараметр("Характеристика", лХарактеристикаНоменклатуры);
		ЗапросОстатковПоЯчейке.УстановитьПараметр("Ячейка", ТекущаяЯчейка);
				
		ВыборкаОстатокПоЯчейке = ЗапросОстатковПоЯчейке.Выполнить().Выбрать();
		

		Пока ВыборкаОстатокПоЯчейке.Следующий() цикл
			КоэффициентУпаковки = ?(ВыборкаОстатокПоЯчейке.Упаковка.Числитель=0,1,ВыборкаОстатокПоЯчейке.Упаковка.Числитель)/?(ВыборкаОстатокПоЯчейке.Упаковка.Знаменатель=0,1,ВыборкаОстатокПоЯчейке.Упаковка.Знаменатель);
			ОстаткиПоЯчейке = ОстаткиПоЯчейке + ВыборкаОстатокПоЯчейке.Остаток*КоэффициентУпаковки;
		КонецЦикла;

		ОстаткиПоЯчейке= ОстаткиПоЯчейке;
  		Возврат ОстаткиПоЯчейке;
	
КонецФункции

Функция ПолучитьЗаданиеПоЯчейке(УзелПО,СсылкаНаДок,лТовар,лХарактеристикаНоменклатуры,ТекущаяЯчейка,Тип)
	
	ЗаданиеПоЯчейке = 0;
	
	Если Тип = "Select" Тогда
		ИмяТЧ = СсылкаНаДок.Шаблон.ИмяТабличнойЧастиПодбор;
		УчитыватьЯчеекВЗадании = СсылкаНаДок.Шаблон.УчитыватьЯчеекВЗаданииПодбор;
	Иначе 
		ИмяТЧ = СсылкаНаДок.Шаблон.ИмяТабличнойЧастиПриемка;
		УчитыватьЯчеекВЗадании = СсылкаНаДок.Шаблон.УчитыватьЯчеекВЗаданииПриемка;
	КонецЕсли;
	
		ЗапросЗадания = Новый Запрос();
		ЗапросЗадания.Текст = "ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ЗАДАНИЕ.Количество, 0)) КАК Количество
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг.Товары КАК ЗАДАНИЕ
		|ГДЕ
		| Задание.ССылка = &ИсходныйДокумент
		|	И ЗАДАНИЕ.Номенклатура = &Номенклатура
		|	И ЗАДАНИЕ.Характеристика = &ХарактеристикаНоменклатуры";
	
		ЗапросЗадания.Текст = СтрЗаменить(ЗапросЗадания.Текст, "ПриобретениеТоваровУслуг", СсылкаНаДок.Шаблон.ВидДокумента);	
		ЗапросЗадания.Текст = СтрЗаменить(ЗапросЗадания.Текст, ".Товары", "." + ИмяТЧ);
	
		ЗапросЗадания.УстановитьПараметр("ИсходныйДокумент", СсылкаНаДок.ИсходныйДокумент);				
		ЗапросЗадания.УстановитьПараметр("Номенклатура", лТовар);
		ЗапросЗадания.УстановитьПараметр("ХарактеристикаНоменклатуры", лХарактеристикаНоменклатуры);


		Если УчитыватьЯчеекВЗадании Тогда	
			ЗапросЗадания.Текст = ЗапросЗадания.Текст + "
			|	И ЗАДАНИЕ.Ячейка = &Ячейка";
			
			ЗапросЗадания.УстановитьПараметр("Ячейка", ТекущаяЯчейка);		
		КонецЕсли;

		//Если ЭтоВводЯчеекДоТовара Тогда	
		//	ЗапросЗадания.Текст = "ВЫБРАТЬ
		//                      |	СУММА( ЕСТЬNULL(Задание.Количество, 0)) КАК Количество
		//                      |ИЗ
		//                      |	Документ.ОтборРазмещениеТоваров.ТоварыОтбор КАК Задание
		//                      |ГДЕ
		//                      |	Задание.Ссылка = &ИсходныйДокумент
		//                      |	И Задание.Ячейка = &Ячейка";
		//	ЗапросЗадания.Текст = СтрЗаменить(ЗапросЗадания.Текст, "ОтборРазмещениеТоваров", СсылкаНаДок.Шаблон.ВидДокумента);							  
		//	ЗапросЗадания.Текст = СтрЗаменить(ЗапросЗадания.Текст, ".ТоварыОтбор", "." + ИмяТЧ);	
		//КонецЕсли;

	
		ВыборкаЗадания = ЗапросЗадания.Выполнить().Выбрать();
				
		Пока ВыборкаЗадания.Следующий() Цикл
			ЗаданиеПоЯчейке = ЗаданиеПоЯчейке + ВыборкаЗадания.Количество;		
		КонецЦикла;

			
	Возврат ЗаданиеПоЯчейке;		
			
КонецФункции

Функция ЯчейкиСправочноеРазмещениеПоТоваруОчистить(УзелПО, Номенклатура, ТекстОписания)
	
	ЕстьОшибки = Ложь;
	ТекстОшибки = "";
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РазмещениеНоменклатуры.Номенклатура КАК Номенклатура,
	|	РазмещениеНоменклатуры.Склад КАК Склад,
	|	РазмещениеНоменклатуры.Помещение КАК Помещение,
	|	РазмещениеНоменклатуры.Ячейка КАК Ячейка
	|ИЗ
	|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатуры
	|ГДЕ
	|	РазмещениеНоменклатуры.Номенклатура=&Номенклатура 
	|	И (&ВсеСклады ИЛИ РазмещениеНоменклатуры.Склад В (&Склады))
	|	И (&ВсеПомещения ИЛИ РазмещениеНоменклатуры.Помещение В (&Помещения))");
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);

	СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
	Запрос.УстановитьПараметр("Склады",СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
	
	СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	Запрос.УстановитьПараметр("Помещения",СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	НачатьТранзакцию();
	
	Пока Выборка.Следующий() Цикл
		Рег = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьМенеджерЗаписи();
		Рег.Номенклатура = Выборка.Номенклатура;
		Рег.Склад        = Выборка.Склад;
		Рег.Помещение    = Выборка.Помещение;
		Рег.Ячейка       = Выборка.Ячейка; 
		
		Рег.Прочитать();
		Если Рег.Выбран() Тогда
			Попытка			
				Рег.Удалить();
			Исключение
				ТекстОшибки = ОписаниеОшибки();
				Прервать;
			КонецПопытки;
		КонецЕсли;		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		ОтменитьТранзакцию();
		ТекстОписания = "Ошибка очистки справочного размещения для номенклатуры:" + Символы.ПС + ТекстОшибки;
		Возврат Ложь;
	Иначе
		ЗафиксироватьТранзакцию();
		ТекстОписания = "Ячейки справочного размещения для номенклатуры очищены!"; 
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ЯчейкиСправочноеРазмещениеПоТоваруСоздать(Номенклатура, Ячейка, ТекстОписания)
	
	Результат = Ложь; 
	
	Рег = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьМенеджерЗаписи();
	Рег.Номенклатура = Номенклатура;
	Рег.Склад        = Ячейка.Владелец;
	Рег.Помещение    = Ячейка.Помещение;
	Рег.Ячейка       = Ячейка; 
	
	Рег.Прочитать();
	Если Рег.Выбран() Тогда		
		Результат = Истина;

	Иначе 
		Рег.Номенклатура   = Номенклатура;
		Рег.Склад          = Ячейка.Владелец;
		Рег.Помещение      = Ячейка.Помещение;
		Рег.Ячейка         = Ячейка;
		Рег.ОсновнаяЯчейка = Истина;
		
		Попытка	
			Рег.Записать();
			Результат = Истина;
		Исключение
			Попытка // еще раз не основной
				Рег.ОсновнаяЯчейка = Ложь;
				Рег.Записать();
				Результат = Истина;				
			Исключение
				ТекстОписания = ОписаниеОшибки();
				Результат = Ложь;
			КонецПопытки;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЯчейкиСправочноеРазмещениеПоТоваруОбработать(УзелПО, CellBC, ArtID, Barcode, Ячейка, ТекстОписания)
	
	Если Лев(ArtID, 3) = "8U-" Тогда
		лТовар = XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Сред(ArtID, 4, 36));
	Иначе   
		лТовар = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(лТовар) Тогда
		лТовар = ПолучитьНоменклатуруПоШтрихкоду(Barcode);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(лТовар) Тогда
		ТекстОписания = "Не найден товар для обработки справочного размещения.";		
		Возврат Ложь;	
	КонецЕсли;
	
	// очистка
	Если СокрЛП(УзелПО.ШтрихкодОчисткиСправочногоРазмещенияЯчеек) = CellBC Тогда
		Рез = ЯчейкиСправочноеРазмещениеПоТоваруОчистить(УзелПО, лТовар, ТекстОписания);
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ячейка) Тогда
		ТекстОписания = "Ячейка по штрихкоду " + CellBC + " не найдена в базе.";		
		Возврат Ложь;	
	КонецЕсли;
	
	// проверка и создание нового размещения
	Рез = ЯчейкиСправочноеРазмещениеПоТоваруСоздать(лТовар, Ячейка, ТекстОписания);
	Возврат Рез;
	
КонецФункции

#КонецОбласти 

#Область Ценообразование 

Процедура СкорректироватьЗапросПоЦенообразованию25(ТестЗапросаИсх, ИмяФункции)
	Если НЕ ДатаМобайл_ОбщийМодуль.Ценообразование25() Тогда Возврат; КонецЕсли;
	
	ТекстЗапроса = ТестЗапросаИсх;
	
	Если ИмяФункции = "GetCellContent" ИЛИ ИмяФункции = "OnArtScan_Select_Insert_Cells" ИЛИ ИмяФункции = "OnArtScan_Select_Insert_Casual" 
		ИЛИ ИмяФункции = "OnArtScan_Select_EGAIS" ИЛИ ИмяФункции = "ПолучитьСодержимоеУпаковки_НашУпаковочныйЛист" 
		ИЛИ ИмяФункции = "ПолучитьСодержимоеУпаковки_ТиповойУпаковочныйЛист" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"РегистрСведений.ЦеныНоменклатуры.СрезПоследних", 
		"РегистрСведений.ЦеныНоменклатуры25.СрезПоследних");
		
		Если ИмяФункции = "OnArtScan_Select_Insert_Casual" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
			"И ДоступныеТовары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика",
			"			И (ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО В (ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка))
			|				ИЛИ ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО В
			|					(ВЫБРАТЬ
			|						Хар.ХарактеристикаНоменклатурыДляЦенообразования КАК ХарактеристикаЦО
			|					ИЗ
			|						Справочник.ХарактеристикиНоменклатуры КАК Хар
			|					ГДЕ
			|						Хар.Ссылка В
			|							(ВЫБРАТЬ
			|								ДоступныеТовары.Характеристика КАК Характеристика
			|							ИЗ
			|								ДоступныеТовары КАК ДоступныеТовары)))");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
			"И ДоступныеТовары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика", 
			"И ДоступныеТовары.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования = ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО");	
		КонецЕсли;
		
	ИначеЕсли ИмяФункции = "ПолучитьНоменклатуруУпаковкиМДЛП" ИЛИ ИмяФункции = "ПолучитьСодержимоеУпаковки_Маркировка" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"РегистрСведений.ЦеныНоменклатуры.СрезПоследних",                         
		"РегистрСведений.ЦеныНоменклатуры25.СрезПоследних");
		
	ИначеЕсли ИмяФункции = "СобратьТовары" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"РегистрСведений.ЦеныНоменклатуры.СрезПоследних",                         
		"РегистрСведений.ЦеныНоменклатуры25.СрезПоследних");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"И ЦеныНоменклатурыСрезПоследних.Характеристика = СписокТоваровОбщий.Характеристика", 
		"И ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО = ISNULL(СписокТоваровОбщий.Характеристика.ХарактеристикаНоменклатурыДляЦенообразования, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка))");
		
	ИначеЕсли ИмяФункции = "ПолучитьЦенуТовара" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, 
		"РегистрСведений.ЦеныНоменклатуры.СрезПоследних",                         
		"РегистрСведений.ЦеныНоменклатуры25.СрезПоследних");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
		"И Характеристика = &ХарактеристикаНоменклатуры",
		"И (ХарактеристикаЦО = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка) ИЛИ ХарактеристикаЦО В (ВЫБРАТЬ ПЕРВЫЕ 1 Хар.ХарактеристикаНоменклатурыДляЦенообразования КАК ХарактеристикаЦО 
		| ИЗ Справочник.ХарактеристикиНоменклатуры КАК Хар ГДЕ Хар.Ссылка = &ХарактеристикаНоменклатуры))");
		
	ИначеЕсли ИмяФункции = "ПолучитьТоварыБезЗадания" Тогда
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК ЧИСЛО(19, 2))) КАК Цена
		|ПОМЕСТИТЬ ТоварыСЦенами
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
		|			&ТекущаяДата, 
		|			Номенклатура В (ВЫБРАТЬ
		|									НайденныеТовары.Номенклатура КАК Номенклатура
		|								ИЗ 
		|									НайденныеТовары КАК НайденныеТовары)
		|			И (ХарактеристикаЦО = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатурыДляЦенообразования.ПустаяСсылка)
		|			ИЛИ ХарактеристикаЦО В ( 
		|								ВЫБРАТЬ Хар.ХарактеристикаНоменклатурыДляЦенообразования КАК ХарактеристикаЦО 
		| 									ИЗ Справочник.ХарактеристикиНоменклатуры КАК Хар ГДЕ Хар.Ссылка В (ВЫБРАТЬ
		|									НайденныеТовары.Характеристика КАК Характеристика
		|									ИЗ 
		|									НайденныеТовары КАК НайденныеТовары)))
		|			И ВидЦены = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";
	КонецЕсли;
	
	ТестЗапросаИсх = ТекстЗапроса;
КонецПроцедуры


#КонецОбласти

#Область ОбщегоНазначения

Функция СсылкаСуществует(ЛюбаяСсылка)
    
    ТекстЗапроса = "
        |ВЫБРАТЬ
        |    Ссылка
        |ИЗ
        |    [ИмяТаблицы]
        |ГДЕ
        |    Ссылка = &Ссылка
        |";
    
    ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[ИмяТаблицы]", ИмяТаблицыПоСсылке(ЛюбаяСсылка));
    
    Запрос = Новый Запрос;
    Запрос.Текст = ТекстЗапроса;
    Запрос.УстановитьПараметр("Ссылка", ЛюбаяСсылка);
    
    УстановитьПривилегированныйРежим(Истина);
    
    Возврат НЕ Запрос.Выполнить().Пустой();
    
КонецФункции

Функция ИмяТаблицыПоСсылке(Ссылка)
    
    Возврат Метаданные.НайтиПоТипу(ТипЗнч(Ссылка)).ПолноеИмя();
    
КонецФункции

Функция ЧистаяСтрока(Знач ГрязнаяСтрока)
	ГрязнаяСтрока=СтрЗаменить(ГрязнаяСтрока,"'","-");
	ГрязнаяСтрока=СтрЗаменить(ГрязнаяСтрока,Символы.ВК," ");
	ГрязнаяСтрока=СтрЗаменить(ГрязнаяСтрока,Символы.ПС,"-");
	ГрязнаяСтрока=СтрЗаменить(ГрязнаяСтрока,Символы.НПП," ");
	ГрязнаяСтрока=СтрЗаменить(ГрязнаяСтрока,";","");
	ГрязнаяСтрока=СтрЗаменить(ГрязнаяСтрока,"""","''");
	ГрязнаяСтрока=СтрЗаменить(ГрязнаяСтрока,"%","");
	//ГрязнаяСтрока=СтрЗаменить(ГрязнаяСтрока,"&","");
	ГрязнаяСтрока=СтрЗаменить(ГрязнаяСтрока,"<","[");
	ГрязнаяСтрока=СтрЗаменить(ГрязнаяСтрока,">","]"); 
	ГрязнаяСтрока=СокрЛП(ГрязнаяСтрока);
	
	Модуль_ОбщегоНазначенияКлиентСервер = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначенияКлиентСервер");
	ГрязнаяСтрока = Модуль_ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(ГрязнаяСтрока, "");	
	
	возврат Грязнаястрока;
КонецФункции

Функция ПолучитьФорматнуюСтрокуЧисла()
	возврат "ЧДЦ=3; ЧРД=.; ЧН=0; ЧГ=0";
КонецФункции

Функция ДатуВTimestamp(пДата = Неопределено)
	
	Возврат Формат(Число(?(ТипЗнч(пДата) = Тип("Дата"), пДата, ТекущаяДата())-Дата("19700101")),"ЧН=0; ЧГ=0");
	
КонецФункции

Функция TimestampВДату(пДатаТС)
	
	Попытка
		Возврат Дата("19700101")+?(ТипЗнч(пДатаТС) = Тип("Строка"), Число(пДатаТС), пДатаТС);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция УдалитьЛидирующиеНули(Строка)
	
	СтрокаБезНулей = Строка;
	Пока Лев(СтрокаБезНулей,1) = "0" цикл
		СтрокаБезНулей = Прав(СтрокаБезНулей,СтрДлина(СтрокаБезНулей)-1);	
	КонецЦикла;	
	
	Возврат СтрокаБезНулей; 
КонецФункции	

Процедура ПрочитатьВсеВходящиеПараметрыИзJSON(Params, СтруктураПараметров)

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Params);
	ВходящиеПараметры = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	

	Для каждого Элемент из СтруктураПараметров Цикл
		Если ВходящиеПараметры.Свойство(Элемент.Ключ) Тогда
			СтруктураПараметров[Элемент.Ключ] = ДатаМобайл_Маркировка.ОбработатьЭкранированиеСтроки(ВходящиеПараметры[Элемент.Ключ]); 
		КонецЕсли;		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ЕГАИС

Функция ТоварСопоставленОдинКОдному(НоменклатураЕГАИС)
	
	СопоставленОдинКОдному = Ложь;
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	                |	ЕГАИС_СоответствиеНоменклатуры.Номенклатура как ссылка
	                |ИЗ
	                |	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК ЕГАИС_СоответствиеНоменклатуры
	                |ГДЕ
	                |	ЕГАИС_СоответствиеНоменклатуры.АлкогольнаяПродукция = &ЕГАИСНоменклатура";
	Запрос.УстановитьПараметр("ЕГАИСНоменклатура", НоменклатураЕГАИС);
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Количество() = 1 Тогда
		СопоставленОдинКОдному = Истина;	
	КонецЕсли;

	Возврат СопоставленОдинКОдному;
	
КонецФункции

Функция МаркаСерияУжеЕсть(PDFDataMatrix, Задание, ЭтоСерия)
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("PDFDataMatrix", PDFDataMatrix);
	Запрос.УстановитьПараметр("Задание", Задание);
	Запрос.УстановитьПараметр("ЭтоСерия", ЭтоСерия);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДатаМобайл_МаркиДляПроверки.Марка,
	               |	ДатаМобайл_МаркиДляПроверки.ЗаданиеТСД
	               |ИЗ
	               |	РегистрСведений.ДатаМобайл_МаркиДляПроверки КАК ДатаМобайл_МаркиДляПроверки
	               |ГДЕ
	               |	ДатаМобайл_МаркиДляПроверки.ЗаданиеТСД = &Задание
	               |	И ВЫБОР
	               |			КОГДА &ЭтоСерия
	               |				ТОГДА ДатаМобайл_МаркиДляПроверки.Серия = &PDFDataMatrix
	               |			ИНАЧЕ ДатаМобайл_МаркиДляПроверки.Марка = &PDFDataMatrix
	               |		КОНЕЦ";
				   
	Возврат Запрос.Выполнить().Выбрать().Количество() > 0;
	
КонецФункции

Функция КодНоменклатурыЕГАИСПоPDF417(PDFBarcode)
	
	Сч = 0;
	Значение=СокрЛП(PDFBarcode);
		
	Если Сред(Значение, 4, 5) = "00000" Тогда
		Значение = Сред(Значение, 9, 11);
		Сч = 11;
	Иначе
		Значение = Сред(Значение, 8, 12);
		Сч = 12;
	КонецЕсли;

	Результат = 0;

	Для Поз = 1 По Сч Цикл

		Множитель = 1;
		
		Для СчМ = 1 По Сч - Поз Цикл   
			Множитель = Множитель * 36;
		КонецЦикла;

		Результат = Результат + (Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ", Сред(Значение, Поз, 1)) - 1) * Множитель;

	КонецЦикла;

	Возврат Формат(Результат, "ЧЦ=19; ЧВН=; ЧГ=0");
	
КонецФункции

Функция ПолучитьТаблицуУпакованныхМарок(ИдентификаторУпаковки = "")
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("ИдентификаторУпаковки", ИдентификаторУпаковки);		
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеУпаковкиУровень1.Штрихкод КАК Штрихкод
	               |ПОМЕСТИТЬ ДанныеУпаковкиУровень1
	               |ИЗ
	               |	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ДанныеУпаковкиУровень1
	               |ГДЕ
	               |	ДанныеУпаковкиУровень1.Ссылка.ЗначениеШтрихкода = &ИдентификаторУпаковки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеУпаковкиУровень2.Штрихкод.ЗначениеШтрихкода КАК Марка,
	               |	ДанныеУпаковкиУровень2.Ссылка КАК Короб
	               |ПОМЕСТИТЬ ПереченньМарок
	               |ИЗ
	               |	ДанныеУпаковкиУровень1 КАК ДанныеУпаковкиУровень1
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ДанныеУпаковкиУровень2
	               |		ПО ДанныеУпаковкиУровень1.Штрихкод = ДанныеУпаковкиУровень2.Ссылка
	               |ГДЕ                                                                     		
	               |	(ДанныеУпаковкиУровень1.Штрихкод.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
	               |			ИЛИ ДанныеУпаковкиУровень1.Штрихкод.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка))
	               |	И ДанныеУпаковкиУровень2.Штрихкод.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ДанныеУпаковкиУровень1.Штрихкод.ЗначениеШтрихкода,
	               |	ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	               |ИЗ
	               |	ДанныеУпаковкиУровень1 КАК ДанныеУпаковкиУровень1
	               |ГДЕ
	               |	ДанныеУпаковкиУровень1.Штрихкод.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПереченньМарок.Марка КАК Марка,
	               |	ПереченньМарок.Короб КАК Короб,
	               |	ЕСТЬNULL(ЕГАИС_РегистрМарок.АлкогольнаяПродукция, ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)) КАК АлкогольнаяПродукция
	               |ИЗ
	               |	ПереченньМарок КАК ПереченньМарок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АкцизныеМаркиЕГАИС КАК ЕГАИС_РегистрМарок
	               |		ПО (ЕГАИС_РегистрМарок.АкцизнаяМарка.ЗначениеШтрихкода = ПереченньМарок.Марка)"; 
		
	Возврат Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);

				
КонецФункции

Функция ПроверитьУникальностьМаркиЕгаисГрупповогоЗадания (ИмяТаблицы,УзелПО,СсылкаНаДок,СтрокаДокумента,СтруктураСтроки)
	
	Шаблон=СсылкаНаДок.Шаблон;
	
	ЗапросПревышения = Новый Запрос;
	ЗапросПревышения.Текст = "ВЫБРАТЬ
	|   ЕстьNull(СУММА(ЕстьNull(ТаблицаТоваровВРегистре.Количество,0)),0) КАК КоличествоПодбор
	|ИЗ
	|	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК ТаблицаТоваровВРегистре
	|ГДЕ
	|	ТаблицаТоваровВРегистре.ДокументТСД = &ДокументТСД
	|	И ТаблицаТоваровВРегистре.ЕгаисПолныйКод = &ЕгаисПолныйКод
	|	И ТаблицаТоваровВРегистре.ИмяТаблицы = &ИмяТаблицы
	|	И НЕ ТаблицаТоваровВРегистре.ДляОбмена";
	
	ЗапросПревышения.УстановитьПараметр("ДокументТСД",СсылкаНаДок);
	//ЗапросПревышения.УстановитьПараметр("ИсходныйДокумент",СсылкаНаДок.ИсходныйДокумент);
	ЗапросПревышения.УстановитьПараметр("ЕгаисПолныйКод",СтрокаДокумента.egais.mark);
	ЗапросПревышения.УстановитьПараметр("ИмяТаблицы",ИмяТаблицы);
	
	ВыборкаПревышения = ЗапросПревышения.Выполнить().Выбрать();
	Пока ВыборкаПревышения.Следующий() цикл
		Если ВыборкаПревышения.КоличествоПодбор > 0 Тогда
			Возврат Истина;
		КонецЕсли;
		Прервать;
	КонецЦикла;	
	
	Возврат Ложь;	
КонецФункции

Функция ПроверитьПревышениеЗаданияПоСправкамЕГАИС(ИмяТаблицы,УзелПО,СсылкаНаДок,СтрокаДокумента,СтруктураСтроки)
	
	ЗначениеВозврата = 0;
	
	ТекущаяСправкаБ = Справочники.астСправкиАиБ_ЕГАИС.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	астПартииТоваровПоМаркамЕГАИС.СправкаБ КАК ТекущаяСправкаБ,
		|	1 КАК Количество
		|ИЗ
		|	РегистрНакопления.астПартииТоваровПоМаркамЕГАИС.Остатки(,ШтрихкодМарки.Наименование = &DMPDFBarcode) КАК астПартииТоваровПоМаркамЕГАИС
		|";

	Запрос.УстановитьПараметр("DMPDFBarcode", СтрокаДокумента.egais.mark);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда		
		ТекущаяСправкаБ = Выборка.ТекущаяСправкаБ; 	
	КонецЕсли;
	
	СтруктураСтроки.Вставить("ЕгаисСправкаБ", ТекущаяСправкаБ);

		
	Если ТекущаяСправкаБ.Пустая() Тогда
		Если СтрДлина(СтрокаДокумента.egais.mark) = 150 Тогда // нет на остатках новой марки, надо ругаться
			Возврат 3;
		Иначе	
			Возврат 0;
		КонецЕсли;	
	КонецЕсли;
	
	
	КоличествоПодобранных = 1;
	КоличествоВИсходномДокументе = 0;
	
	//ПОДБОР
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЕгаисСправкаБ КАК СправкаБ,
		|	Сумма(ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Количество) КАК Количество
		|ИЗ
		|	Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор
		|ГДЕ
		|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Ссылка = &Ссылка
		|	И ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЕгаисСправкаБ = &ТекущаяСправкаБ
		|
		|СГРУППИРОВАТЬ ПО
		|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.ЕгаисСправкаБ";
	
	Запрос.УстановитьПараметр("ТекущаяСправкаБ"		, ТекущаяСправкаБ);
	Запрос.УстановитьПараметр("Ссылка"				, СтруктураСтроки.ДокументТСД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	 
	Если Выборка.Следующий() Тогда		
		КоличествоПодобранных =  КоличествоПодобранных+Выборка.Количество;
	КонецЕсли;
	
		
	
	//ЗАДАНИЕ	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	астТоварноТранспортныеНакладныеИзЕГАИСТовары.СправкаБ КАК СправкаБ,
		|	СУММА(астТоварноТранспортныеНакладныеИзЕГАИСТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.астТоварноТранспортныеНакладныеИзЕГАИС.Товары КАК астТоварноТранспортныеНакладныеИзЕГАИСТовары
		|ГДЕ
		|	астТоварноТранспортныеНакладныеИзЕГАИСТовары.Ссылка = &ИсходныйДокумент
		|	И астТоварноТранспортныеНакладныеИзЕГАИСТовары.СправкаБ = &ТекущаяСправкаБ
		|
		|СГРУППИРОВАТЬ ПО
		|	астТоварноТранспортныеНакладныеИзЕГАИСТовары.СправкаБ";
	
	Запрос.УстановитьПараметр("ТекущаяСправкаБ"		, ТекущаяСправкаБ);
	Запрос.УстановитьПараметр("ИсходныйДокумент"	, СсылкаНаДок.ИсходныйДокумент);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		КоличествоВИсходномДокументе = КоличествоВИсходномДокументе + Выборка.Количество;
	КонецЕсли; 

	
	
		
		Если КоличествоВИсходномДокументе = 0 Тогда
			ЗначениеВозврата = 2;
			Возврат ЗначениеВозврата;
		КонецЕсли; 
		
		Если КоличествоВИсходномДокументе < КоличествоПодобранных Тогда
			ЗначениеВозврата = 1;	
		КонецЕсли; 	
	

	
	Возврат ЗначениеВозврата;
	

КонецФункции	

#КонецОбласти

#Область Маркировка

Функция ПроверитьТребуетсяВыгрузкаМарок(СсылкаНаДок)

	ВидДокумента = СсылкаНаДок.Шаблон.ВидДокумента;
	
	Если ВидДокумента = "ПриобретениеТоваровУслуг" 
		или ВидДокумента = "ПриемкаТоваровИСМП" Тогда
		
		Возврат Истина;

	ИначеЕсли ВидДокумента = "ВозвратТоваровОтКлиента"	Тогда
		
		МаркиУказаныПоставщиком = Ложь;

		Если СсылкаНаДок.ИсходныйДокумент.ШтрихкодыУпаковок.Количество()>0 Тогда
			МаркиУказаныПоставщиком = Истина;
		КонецЕсли;
		
		Если МаркиУказаныПоставщиком Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
		
	ИначеЕсли ВидДокумента = "УведомлениеОПриемкеМДЛП" Тогда
		ПрямойАкцепт = Ложь;
		Попытка 
			Если СсылкаНаДок.ИсходныйДокумент.СхемаАкцептования = Перечисления.СхемыАкцептованияМДЛП.ПрямойПорядок Тогда
				ПрямойАкцепт = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Если ПрямойАкцепт Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ()

Функция ПолучитьТоварыБезЗадания(УзелПО,СсылкаНаДок,КМ,GS1,ЗначениеШтрихкода)
	
	Модуль_ОбщегоНазначения = ДатаМобайл_ОбщийМодуль.ОбщийМодуль("ОбщегоНазначения");
	
	ЗначенияРеквизитовСсылкаНаДок = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаНаДок,"Шаблон");
	Шаблон = ЗначенияРеквизитовСсылкаНаДок.Шаблон;
	
	ЗначенияРеквизитовШаблон = Модуль_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Шаблон,"ВидДокумента");
	Шаблон_ВидДокумента = ЗначенияРеквизитовШаблон.ВидДокумента;

	Если ДатаМобайл_ОбщийМодуль.ЕстьМДЛП() Тогда
		ЭтоДокументМДЛП = ДатаМобайл_МДЛП.ЭтоДокументМДЛП(Шаблон_ВидДокумента);
		
		Если Не ЭтоДокументМДЛП И СтрДлина(КМ) = 31 Тогда
			Если СтрНачинаетсяС(КМ, "01") И Сред(КМ, 17, 2) = "21" Тогда //скорее всего это ЛС
				ЭтоДокументМДЛП = Истина;	
			КонецЕсли;	
		КонецЕсли;
		
	Иначе
		ЭтоДокументМДЛП = Ложь;
	КонецЕсли;	
		
	ЭтоКММассивов = Ложь;	
		
	Если ТипЗнч(КМ) = Тип("Массив") Тогда
		ЭтоКММассивов = Истина;	
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	ТекстЗапросаЦены = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК ЧИСЛО(19, 2))) КАК Цена
	|ПОМЕСТИТЬ ТоварыСЦенами
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			&ТекущаяДата, 
	|			Номенклатура В (ВЫБРАТЬ
	|									НайденныеТовары.Номенклатура КАК Номенклатура
	|								ИЗ 
	|									НайденныеТовары КАК НайденныеТовары)
	|			И Характеристика В (ВЫБРАТЬ
	|									НайденныеТовары.Характеристика КАК Характеристика
	|								ИЗ 
	|									НайденныеТовары КАК НайденныеТовары)
	|			И ВидЦены = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";	
	СкорректироватьЗапросПоЦенообразованию25(ТекстЗапросаЦены, "ПолучитьТоварыБезЗадания");
		
	Если ЭтоДокументМДЛП И Метаданные.НайтиПоПолномуИмени("РегистрСведений.УАС_АналитикаНомеровУпаковок") <> Неопределено Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	УАС_АналитикаНомеровУпаковок.Номенклатура КАК Номенклатура,
		|	УАС_АналитикаНомеровУпаковок.Характеристика КАК Характеристика,
		|	УАС_АналитикаНомеровУпаковок.Серия КАК Серия,
		|	УАС_АналитикаНомеровУпаковок.НомерУпаковки КАК Марка
		|ПОМЕСТИТЬ Марки
		|ИЗ
		|	РегистрСведений.УАС_АналитикаНомеровУпаковок КАК УАС_АналитикаНомеровУпаковок
		|ГДЕ
		|	УАС_АналитикаНомеровУпаковок.Номенклатура <> Значение(Справочник.Номенклатура.ПустаяСсылка)
		|	И УАС_АналитикаНомеровУпаковок.НомерУпаковки ПОДОБНО &ЗначениеШтрихкодаДляЗапроса СПЕЦСИМВОЛ ""$""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Марки.Номенклатура КАК Номенклатура,
		|	Марки.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ НайденныеТовары
		|ИЗ
		|	Марки КАК Марки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";
		
		Запрос.Текст = Запрос.Текст + ТекстЗапросаЦены + "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
		|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.КОтгрузкеОстаток, 0)) КАК ВРезерве,
		|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
		|	СвободныеОстаткиОстатки.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ТоварыСОстатками1С
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			&ТекущаяДата,
		|			Номенклатура В (ВЫБРАТЬ
		|									НайденныеТовары.Номенклатура КАК Номенклатура
		|								ИЗ 
		|									НайденныеТовары КАК НайденныеТовары)						
		|			И (&ВсеСклады ИЛИ Склад В (&Склады))
		|			И (&ВсеПомещения ИЛИ Помещение В (&Помещения))) КАК СвободныеОстаткиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	СвободныеОстаткиОстатки.Номенклатура,
		|	СвободныеОстаткиОстатки.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ДокументыСРезервамиТСД
		|ИЗ
		|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
		|ГДЕ	
		|	(ДатаМобайл_ДокументыТСД.Ссылка <> &ИсходноеЗадание)
		|		И (ДатаМобайл_ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1))
		|			И (ДатаМобайл_ДокументыТСД.Шаблон.РезервироватьТовар)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество,0)) КАК Количество
		|ПОМЕСТИТЬ ДанныеДокументыСРезервамиТСД
		|ИЗ
		|	ДокументыСРезервамиТСД КАК ДокументыСРезервамиТСД
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
		|		ПО ДокументыСРезервамиТСД.Ссылка = ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК Характеристика,
		|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество * (ВЫБОР
		|				КОГДА ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель = 0
		|						ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель ЕСТЬ NULL
		|					ТОГДА 1
		|				ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель
		|			КОНЕЦ / ВЫБОР
		|				КОГДА ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель = 0
		|						ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель ЕСТЬ NULL
		|					ТОГДА 1
		|				ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель
		|			КОНЕЦ), 0)) КАК ВРезервеТСД
		|ПОМЕСТИТЬ ТоварыСРезервамиТСД
		|ИЗ
		|	НайденныеТовары КАК НайденныеТовары
		|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументыСРезервамиТСД КАК ДатаМобайл_ДокументыТСДСобранныеДанные
		|	ПО НайденныеТовары.Номенклатура = ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура
		| 		И НайденныеТовары.Характеристика = ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры
		|СГРУППИРОВАТЬ ПО
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Марки.Марка КАК Марка,
		|	Марки.Номенклатура КАК Номенклатура,
		|	Марки.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА &ВключатьАртикул
		|			ТОГДА ВЫБОР
		|					КОГДА Марки.Номенклатура.Артикул = """"
		|						ТОГДА """"
		|					ИНАЧЕ Марки.Номенклатура.Артикул + "" ""
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ + Марки.Номенклатура.Наименование + "" "" + ЕСТЬNULL(Марки.Характеристика.Наименование, """") КАК НаименованиеТовара,
		|	Марки.Номенклатура.ЕдиницаИзмерения.Наименование КАК НаименованиеУпаковки,
		|	Марки.Номенклатура.ВидНоменклатуры.ИспользоватьСерии КАК ИспользоватьСерии,
		|	1 КАК Коэффициент,
		|	"""" КАК НоменклатураКороба,
		|	"""" КАК ХарактеристикаКороба,
		|	"""" КАК УпаковкаКороба,
		|	"""" КАК КоэффициентУпаковкиКороба,
		|	ЕСТЬNULL(ТоварыСОстатками1С.ВНаличии, 0) КАК ВНаличии,
		|	ЕСТЬNULL(ТоварыСОстатками1С.ВРезерве, 0) КАК ВРезерве,
		|	ЕСТЬNULL(ТоварыСРезервамиТСД.ВРезервеТСД, 0) КАК ВРезервеТСД,
		|	ЕСТЬNULL(ТоварыСЦенами.Цена, 0) КАК Цена
		|ПОМЕСТИТЬ ИтоговыеДанныеУпаковки
		|ИЗ
		|	Марки КАК Марки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСОстатками1С КАК ТоварыСОстатками1С
		|		ПО Марки.Номенклатура = ТоварыСОстатками1С.Номенклатура
		|			И Марки.Характеристика = ТоварыСОстатками1С.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСРезервамиТСД КАК ТоварыСРезервамиТСД
		|		ПО Марки.Номенклатура = ТоварыСРезервамиТСД.Номенклатура
		|			И Марки.Характеристика = ТоварыСРезервамиТСД.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСЦенами КАК ТоварыСЦенами
		|		ПО Марки.Номенклатура = ТоварыСЦенами.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИтоговыеДанныеУпаковки.Марка КАК ЗначениеШтрихкода,
		|	ИтоговыеДанныеУпаковки.Номенклатура КАК Номенклатура,
		|	ИтоговыеДанныеУпаковки.Характеристика КАК Характеристика,
		|	ИтоговыеДанныеУпаковки.НаименованиеТовара КАК НаименованиеТовара,
		|	ИтоговыеДанныеУпаковки.НаименованиеУпаковки КАК НаименованиеУпаковки,
		|	ИтоговыеДанныеУпаковки.ИспользоватьСерии КАК ИспользоватьСерии,
		|	СУММА(ИтоговыеДанныеУпаковки.Коэффициент) КАК Коэффициент,
		|	ИтоговыеДанныеУпаковки.ВНаличии КАК ВНаличии,
		|	ИтоговыеДанныеУпаковки.ВРезерве КАК ВРезерве,
		|	ИтоговыеДанныеУпаковки.ВРезервеТСД КАК ВРезервеТСД,
		|	ИтоговыеДанныеУпаковки.Цена КАК Цена,
		|	0 КАК КоличествоВЗадании
		|ИЗ
		|	ИтоговыеДанныеУпаковки КАК ИтоговыеДанныеУпаковки
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтоговыеДанныеУпаковки.Марка,
		|	ИтоговыеДанныеУпаковки.Номенклатура,
		|	ИтоговыеДанныеУпаковки.Характеристика,
		|	ИтоговыеДанныеУпаковки.НаименованиеТовара,
		|	ИтоговыеДанныеУпаковки.НаименованиеУпаковки,
		|	ИтоговыеДанныеУпаковки.ИспользоватьСерии,
		|	ИтоговыеДанныеУпаковки.ВНаличии,
		|	ИтоговыеДанныеУпаковки.ВРезерве,
		|	ИтоговыеДанныеУпаковки.ВРезервеТСД,
		|	ИтоговыеДанныеУпаковки.Цена,
		|	0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТоварыСОстатками1С
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДокументыСРезервамиТСД
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДанныеДокументыСРезервамиТСД
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТоварыСРезервамиТСД
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТоварыСЦенами
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Марки
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ НайденныеТовары
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ИтоговыеДанныеУпаковки";
		
	Иначе		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
		|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА &ВключатьАртикул
		|			ТОГДА ВЫБОР
		|					КОГДА ШтрихкодыУпаковокТоваров.Номенклатура.Артикул = """"
		|						ТОГДА """"
		|					ИНАЧЕ ШтрихкодыУпаковокТоваров.Номенклатура.Артикул + "" ""
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ + ШтрихкодыУпаковокТоваров.Номенклатура.Наименование + "" "" + ЕСТЬNULL(ШтрихкодыУпаковокТоваров.Характеристика.Наименование, """") КАК НаименованиеТовара,
		|	ЕСТЬNULL(ШтрихкодыУпаковокТоваров.Упаковка.Наименование, ШтрихкодыУпаковокТоваров.Номенклатура.ЕдиницаИзмерения.Наименование) КАК НаименованиеУпаковки,
		|	ШтрихкодыУпаковокТоваров.Номенклатура.ВидНоменклатуры.ИспользоватьСерии КАК ИспользоватьСерии,
		|	ВЫБОР
		|		КОГДА ШтрихкодыУпаковокТоваров.Количество = 0 
		|		ТОГДА
		|			ВЫБОР
		|				КОГДА ЕСТЬNULL(ШтрихкодыУпаковокТоваров.Упаковка.Числитель,0) = 0
		|				ТОГДА 1
		|				ИНАЧЕ ШтрихкодыУпаковокТоваров.Упаковка.Числитель
		|			КОНЕЦ
		|		ИНАЧЕ ШтрихкодыУпаковокТоваров.Количество 
		|	КОНЕЦ КАК Коэффициент,
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	0 КАК КоличествоВЗадании
		|ПОМЕСТИТЬ Марки
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.Номенклатура <> Значение(Справочник.Номенклатура.ПустаяСсылка)
		|	И ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода ПОДОБНО &ЗначениеШтрихкодаДляЗапроса СПЕЦСИМВОЛ ""$""
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ПулКодовМаркировкиСУЗ.Номенклатура КАК Номенклатура,
		|	ПулКодовМаркировкиСУЗ.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА &ВключатьАртикул
		|			ТОГДА ВЫБОР
		|					КОГДА ПулКодовМаркировкиСУЗ.Номенклатура.Артикул = """"
		|						ТОГДА """"
		|					ИНАЧЕ ПулКодовМаркировкиСУЗ.Номенклатура.Артикул + "" ""
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ + ПулКодовМаркировкиСУЗ.Номенклатура.Наименование + "" "" + ЕСТЬNULL(ПулКодовМаркировкиСУЗ.Характеристика.Наименование, """") КАК НаименованиеТовара,
		|	ЕСТЬNULL(РегистрСведенийШтрихкодыНоменклатуры.Упаковка.Наименование,ПулКодовМаркировкиСУЗ.Номенклатура.ЕдиницаИзмерения.Наименование)  КАК НаименованиеУпаковки,
		|	ПулКодовМаркировкиСУЗ.Номенклатура.ВидНоменклатуры.ИспользоватьСерии КАК ИспользоватьСерии,
		|	ВЫБОР 
		|		КОГДА МАКСИМУМ(ЕСТЬNULL(РегистрСведенийШтрихкодыНоменклатуры.Упаковка.Числитель,1))=0 
		|		ТОГДА 1
		|		ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(РегистрСведенийШтрихкодыНоменклатуры.Упаковка.Числитель,1)) 
		|	КОНЕЦ КАК Коэффициент,
		|	ПулКодовМаркировкиСУЗ.КодМаркировки КАК ЗначениеШтрихкода,
		|	0 КАК КоличествоВЗадании
		|ИЗ
		|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК РегистрСведенийШтрихкодыНоменклатуры
	    |		ПО ПулКодовМаркировкиСУЗ.GTIN = ""0""+РегистрСведенийШтрихкодыНоменклатуры.Штрихкод ИЛИ ПулКодовМаркировкиСУЗ.GTIN = ""000000""+РегистрСведенийШтрихкодыНоменклатуры.Штрихкод ИЛИ ПулКодовМаркировкиСУЗ.GTIN = РегистрСведенийШтрихкодыНоменклатуры.Штрихкод 
		|ГДЕ
		|	ПулКодовМаркировкиСУЗ.Номенклатура <> Значение(Справочник.Номенклатура.ПустаяСсылка)
		|	И ПулКодовМаркировкиСУЗ.КодМаркировки ПОДОБНО &ЗначениеШтрихкодаДляЗапроса СПЕЦСИМВОЛ ""$""
		|СГРУППИРОВАТЬ ПО
		|	ПулКодовМаркировкиСУЗ.Номенклатура,
		|	ПулКодовМаркировкиСУЗ.Характеристика,
		|	ВЫБОР
		|		КОГДА &ВключатьАртикул
		|			ТОГДА ВЫБОР
		|					КОГДА ПулКодовМаркировкиСУЗ.Номенклатура.Артикул = """"
		|						ТОГДА """"
		|					ИНАЧЕ ПулКодовМаркировкиСУЗ.Номенклатура.Артикул + "" ""
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ + ПулКодовМаркировкиСУЗ.Номенклатура.Наименование + "" "" + ЕСТЬNULL(ПулКодовМаркировкиСУЗ.Характеристика.Наименование, """"),
		|	ЕСТЬNULL(РегистрСведенийШтрихкодыНоменклатуры.Упаковка.Наименование,ПулКодовМаркировкиСУЗ.Номенклатура.ЕдиницаИзмерения.Наименование),  
		|	ПулКодовМаркировкиСУЗ.КодМаркировки	
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Марки.Номенклатура КАК Номенклатура,
		|	Марки.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ НайденныеТовары
		|ИЗ
		|	Марки КАК Марки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";
		
		Запрос.Текст = Запрос.Текст + ТекстЗапросаЦены + "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0)) КАК ВНаличии,
		|	СУММА(ЕСТЬNULL(СвободныеОстаткиОстатки.КОтгрузкеОстаток, 0)) КАК ВРезерве,
		|	СвободныеОстаткиОстатки.Номенклатура КАК Номенклатура,
		|	СвободныеОстаткиОстатки.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ТоварыСОстатками1С
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			&ТекущаяДата,
		|			Номенклатура В (ВЫБРАТЬ
		|									НайденныеТовары.Номенклатура КАК Номенклатура
		|								ИЗ 
		|									НайденныеТовары КАК НайденныеТовары)						
		|			И (&ВсеСклады ИЛИ Склад В (&Склады))
		|			И (&ВсеПомещения ИЛИ Помещение В (&Помещения))) КАК СвободныеОстаткиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	СвободныеОстаткиОстатки.Номенклатура,
		|	СвободныеОстаткиОстатки.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатаМобайл_ДокументыТСД.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ДокументыСРезервамиТСД
		|ИЗ
		|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
		|ГДЕ	
		|	(ДатаМобайл_ДокументыТСД.Ссылка <> &ИсходноеЗадание)
		|		И (ДатаМобайл_ДокументыТСД.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1))
		|			И (ДатаМобайл_ДокументыТСД.Шаблон.РезервироватьТовар)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество,0)) КАК Количество
		|ПОМЕСТИТЬ ДанныеДокументыСРезервамиТСД
		|ИЗ
		|	ДокументыСРезервамиТСД КАК ДокументыСРезервамиТСД
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
		|		ПО ДокументыСРезервамиТСД.Ссылка = ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры КАК Характеристика,
		|	СУММА(ЕСТЬNULL(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество * (ВЫБОР
		|				КОГДА ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель = 0
		|						ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель ЕСТЬ NULL
		|					ТОГДА 1
		|				ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Числитель
		|			КОНЕЦ / ВЫБОР
		|				КОГДА ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель = 0
		|						ИЛИ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель ЕСТЬ NULL
		|					ТОГДА 1
		|				ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанные.ЕдиницаИзмерения.Знаменатель
		|			КОНЕЦ), 0)) КАК ВРезервеТСД
		|ПОМЕСТИТЬ ТоварыСРезервамиТСД
		|ИЗ
		|	НайденныеТовары КАК НайденныеТовары
		|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДокументыСРезервамиТСД КАК ДатаМобайл_ДокументыТСДСобранныеДанные
		|	ПО НайденныеТовары.Номенклатура = ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура
		| 		И НайденныеТовары.Характеристика = ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры
		|СГРУППИРОВАТЬ ПО
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура,
		|	ДатаМобайл_ДокументыТСДСобранныеДанные.ХарактеристикаНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Марки.Номенклатура КАК Номенклатура,
		|	Марки.Характеристика КАК Характеристика,
		|	Марки.НаименованиеТовара КАК НаименованиеТовара,
		|	Марки.НаименованиеУпаковки КАК НаименованиеУпаковки,
		|	Марки.ИспользоватьСерии КАК ИспользоватьСерии,
		|	Марки.Коэффициент КАК Коэффициент,
		|	Марки.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	0 КАК КоличествоВЗадании,
		|	ЕСТЬNULL(ТоварыСОстатками1С.ВНаличии, 0) КАК ВНаличии,
		|	ЕСТЬNULL(ТоварыСОстатками1С.ВРезерве, 0) КАК ВРезерве,
		|	ЕСТЬNULL(ТоварыСРезервамиТСД.ВРезервеТСД, 0) КАК ВРезервеТСД,
		|	ЕСТЬNULL(ТоварыСЦенами.Цена, 0) КАК Цена
		|ПОМЕСТИТЬ ДанныеВыборки
		|ИЗ
		|	Марки КАК Марки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСОстатками1С КАК ТоварыСОстатками1С
		|		ПО Марки.Номенклатура = ТоварыСОстатками1С.Номенклатура
		|			И Марки.Характеристика = ТоварыСОстатками1С.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСРезервамиТСД КАК ТоварыСРезервамиТСД
		|		ПО Марки.Номенклатура = ТоварыСРезервамиТСД.Номенклатура
		|			И Марки.Характеристика = ТоварыСРезервамиТСД.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСЦенами КАК ТоварыСЦенами
		|		ПО Марки.Номенклатура = ТоварыСЦенами.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";
		Если ЭтоКММассивов Тогда
			Запрос.Текст = Запрос.Текст +
			"
			|ВЫБРАТЬ
			|";
		Иначе
			Запрос.Текст = Запрос.Текст + 
			"
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|";
		КонецЕсли;
		Запрос.Текст = Запрос.Текст + 
		"
		|	ДанныеВыборки.Номенклатура КАК Номенклатура,
		|	ДанныеВыборки.Характеристика КАК Характеристика,
		|	ДанныеВыборки.НаименованиеТовара КАК НаименованиеТовара,
		|	ДанныеВыборки.НаименованиеУпаковки КАК НаименованиеУпаковки,
		|	ДанныеВыборки.ИспользоватьСерии КАК ИспользоватьСерии,
		|	ДанныеВыборки.Коэффициент КАК Коэффициент,
		|	ДанныеВыборки.ЗначениеШтрихкода КАК Марка,
		|	ДанныеВыборки.ВНаличии КАК ВНаличии,
		|	ДанныеВыборки.ВРезерве КАК ВРезерве,
		|	ДанныеВыборки.ВРезервеТСД КАК ВРезервеТСД,
		|	ДанныеВыборки.Цена КАК Цена,
		|	ДанныеВыборки.КоличествоВЗадании КАК КоличествоВЗадании
		|ПОМЕСТИТЬ ИтоговыеДанныеУпаковки
		|ИЗ 
		|	ДанныеВыборки КАК ДанныеВыборки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИтоговыеДанныеУпаковки.Марка КАК ЗначениеШтрихкода,
		|	ИтоговыеДанныеУпаковки.Номенклатура КАК Номенклатура,
		|	ИтоговыеДанныеУпаковки.Характеристика КАК Характеристика,
		|	ИтоговыеДанныеУпаковки.НаименованиеТовара КАК НаименованиеТовара,
		|	ИтоговыеДанныеУпаковки.НаименованиеУпаковки КАК НаименованиеУпаковки,
		|	ИтоговыеДанныеУпаковки.ИспользоватьСерии КАК ИспользоватьСерии,
		|	СУММА(ИтоговыеДанныеУпаковки.Коэффициент) КАК Коэффициент,
		|	ИтоговыеДанныеУпаковки.ВНаличии КАК ВНаличии,
		|	ИтоговыеДанныеУпаковки.ВРезерве КАК ВРезерве,
		|	ИтоговыеДанныеУпаковки.ВРезервеТСД КАК ВРезервеТСД,
		|	ИтоговыеДанныеУпаковки.Цена КАК Цена,
		|	ИтоговыеДанныеУпаковки.КоличествоВЗадании КАК КоличествоВЗадании
		|ИЗ
		|	ИтоговыеДанныеУпаковки КАК ИтоговыеДанныеУпаковки
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтоговыеДанныеУпаковки.Марка,
		|	ИтоговыеДанныеУпаковки.Номенклатура,
		|	ИтоговыеДанныеУпаковки.Характеристика,
		|	ИтоговыеДанныеУпаковки.НаименованиеТовара,
		|	ИтоговыеДанныеУпаковки.НаименованиеУпаковки,
		|	ИтоговыеДанныеУпаковки.ИспользоватьСерии,
		|	ИтоговыеДанныеУпаковки.ВНаличии,
		|	ИтоговыеДанныеУпаковки.ВРезерве,
		|	ИтоговыеДанныеУпаковки.ВРезервеТСД,
		|	ИтоговыеДанныеУпаковки.Цена,
		|	ИтоговыеДанныеУпаковки.КоличествоВЗадании
		|
		|УПОРЯДОЧИТЬ ПО
		|	Коэффициент УБЫВ
		|;		
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТоварыСОстатками1С
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДокументыСРезервамиТСД
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДанныеДокументыСРезервамиТСД
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТоварыСРезервамиТСД
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТоварыСЦенами
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Марки
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ НайденныеТовары
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДанныеВыборки
		|";
		
	КонецЕсли;	
	
	//Если Шаблон.МаркировкаОнлайнПроверкаВложенностиУпаковок тогда
	//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИтоговыеДанныеУпаковки.Марка", """""");	
	//КонецЕсли;
	
	//Пачка табака:
	//GTIN+SN = 21
	//Блок табака:
	//01+GTIN+21+SN = 25
	//Обувь:
	//01+GTIN+21+SN = 31
	//Лекарства:
	//01+GTIN+21+SN = 31
	//Фото:
	//01+GTIN+21+SN = 38
	//Молочка:
	//01+GTIN+21+SN = 24 или 32
	
	Если Не ЭтоКММассивов Тогда
		Если СтрДлина(КМ) = 20 тогда
			Если  ЭтоДокументМДЛП тогда
				ЗначениеШтрихкода = Сред(КМ,3,18);
			Иначе	
				ЗначениеШтрихкода = "(00)" + Сред(КМ,3,18);
			КонецЕсли;
		ИначеЕсли СтрДлина(КМ) = 22 тогда
			Если  ЭтоДокументМДЛП тогда
				ЗначениеШтрихкода = Сред(КМ,5,18);
			Иначе	
				ЗначениеШтрихкода = "(00)" + Сред(КМ,5,18);
			КонецЕсли;	
		ИначеЕсли СтрДлина(КМ) = 21 тогда
			ЗначениеШтрихкода = КМ;
		ИначеЕсли СтрДлина(КМ) = 25 тогда
			ЗначениеШтрихкода = "(01)" + Сред(КМ, 3, 14) + "(21)" + Сред(КМ, 19, 7);
		ИначеЕсли СтрДлина(КМ) = 24 тогда
			ЗначениеШтрихкода = "(01)" + Сред(КМ, 3, 14) + "(21)" + Сред(КМ, 19, 6);
		ИначеЕсли СтрДлина(КМ) = 38 тогда
			ЗначениеШтрихкода = "(01)" + Сред(КМ, 3, 14) + "(21)" + Сред(КМ, 19, 20);	
		ИначеЕсли СтрДлина(КМ) = 31 тогда
			Если  ЭтоДокументМДЛП тогда
				ЗначениеШтрихкода = Сред(КМ, 3, 14) +  Сред(КМ, 19, 13);
			Иначе	
				ЗначениеШтрихкода = "(01)" + Сред(КМ, 3, 14) + "(21)" + Сред(КМ, 19, 13);
			КонецЕсли;
		ИначеЕсли СтрДлина(КМ) = 32 тогда
			ЗначениеШтрихкода = "(01)" + Сред(КМ, 3, 14) + "(21)" + Сред(КМ, 19, 14);	
		Иначе
			//упаковки
			
			Если ЗначениеЗаполнено(GS1) тогда
				GS1 = СтрЗаменить(GS1,"[","(");
				GS1 = СтрЗаменить(GS1,"]",")");
			Иначе
				GS1 = КМ;
			КонецЕсли;
			
			ЗначениеШтрихкода = GS1;
		КонецЕсли;
		
		//Символы _ и % присутствуют в алфавите маркировки, поэтому требуется экранирование через спецсимвол, символ $ не присутствует в алфавите маркировки
		ЗначениеШтрихкодаДляЗапроса = ""+ЗначениеШтрихкода;
		ЗначениеШтрихкодаДляЗапроса = СтрЗаменить(ЗначениеШтрихкодаДляЗапроса,"_","$_");
		ЗначениеШтрихкодаДляЗапроса = СтрЗаменить(ЗначениеШтрихкодаДляЗапроса,"%","$%");
		ЗначениеШтрихкодаДляЗапроса = ЗначениеШтрихкодаДляЗапроса + "%";
		
		Запрос.УстановитьПараметр("ЗначениеШтрихкодаДляЗапроса", ЗначениеШтрихкодаДляЗапроса);
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПОДОБНО &ЗначениеШтрихкодаДляЗапроса СПЕЦСИМВОЛ ""$""", "В (&ЗначениеШтрихкодаДляЗапроса)"); 
		Запрос.УстановитьПараметр("ЗначениеШтрихкодаДляЗапроса", КМ);
	КонецЕсли;
		
	Запрос.УстановитьПараметр("ИсходноеЗадание", СсылкаНаДок);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Запрос.УстановитьПараметр("ВключатьАртикул", УзелПО.ДобавлятьАртикулВНаименование);
	Запрос.УстановитьПараметр("ТипЦен",УзелПО.ТипЦен);
	
	СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
	Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
		СписокСкладов.Очистить();
		СписокСкладов.Добавить(СсылкаНаДок.Склад);			
	КонецЕсли;	
	Запрос.УстановитьПараметр("Склады",СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
	
	СписокПомещений=УзелПО.Помещения.ВыгрузитьКолонку("Помещение");
	Если ЗначениеЗаполнено(СсылкаНаДок.Помещение) Тогда	
		СписокПомещений.Очистить();
		СписокПомещений.Добавить(СсылкаНаДок.Помещение);			
	КонецЕсли;
	Запрос.УстановитьПараметр("Помещения",СписокПомещений);
	Запрос.УстановитьПараметр("ВсеПомещения",СписокПомещений.Количество()=0);

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция БылоСканированиеУпаковкиВСоставеДругойВЭтомДокументе(СтруктураСтроки = Неопределено, ДокументТСД = Неопределено, Шаблон = Неопределено)
	
	Если СтруктураСтроки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДатаМобайл_ОбщийМодуль.ЕстьМДЛП() Тогда
		ЭтоДокументМДЛП = ДатаМобайл_МДЛП.ЭтоДокументМДЛП(Шаблон.ВидДокумента);
	Иначе
		ЭтоДокументМДЛП = Ложь;
	КонецЕсли;
	
	//1. Проверить что сканируем КМ, а ранее были отсканированы короб или палета с этой КМ
	Если ЗначениеЗаполнено(СтруктураСтроки.КМСсылка) Тогда	
		
		Запрос = Новый Запрос;
		//Получим данные упаковок где хранится марка по базе 1с
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(ДанныеУпаковкиУровень1.Ссылка, ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)) КАК Короб,
		|	ЕСТЬNULL(ДанныеУпаковкиУровень2.Ссылка, ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)) КАК Палета
		|ПОМЕСТИТЬ УпаковкиМарки
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ДанныеУпаковкиУровень1
		|		ПО (ДанныеУпаковкиУровень1.Штрихкод = ШтрихкодыУпаковокТоваров.Ссылка)
		|			И (ДанныеУпаковкиУровень1.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
		|				ИЛИ ДанныеУпаковкиУровень1.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ДанныеУпаковкиУровень2
		|		ПО (ДанныеУпаковкиУровень2.Штрихкод = ДанныеУпаковкиУровень1.Ссылка)
		|			И (ДанныеУпаковкиУровень2.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
		|				ИЛИ ДанныеУпаковкиУровень2.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка))
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И ШтрихкодыУпаковокТоваров.Ссылка = &КМСсылка
		|;
		|
		//Получим собранные по документу упаковки
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СобранныеДанныеПодбор.УпаковочныйЛистСсылка КАК Упаковка
		|ПОМЕСТИТЬ СобранныеУпаковки
		|ИЗ
		|	Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК СобранныеДанныеПодбор
		|ГДЕ
		|	СобранныеДанныеПодбор.Ссылка = &ДокументТСД
		|	И СобранныеДанныеПодбор.УпаковочныйЛистСсылка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	СобранныеДанныеПодбор.УпаковочныйЛистСсылка
		|
		|ИМЕЮЩИЕ
		|	СУММА(СобранныеДанныеПодбор.Количество) > 0
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РегистрСобранныеДанныеПодбор.УпаковочныйЛистСсылка
		|ИЗ
		|	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК РегистрСобранныеДанныеПодбор
		|ГДЕ
		|	РегистрСобранныеДанныеПодбор.ДокументТСД = &ДокументТСД
		|	И РегистрСобранныеДанныеПодбор.УпаковочныйЛистСсылка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	РегистрСобранныеДанныеПодбор.УпаковочныйЛистСсылка
		|
		|ИМЕЮЩИЕ
		|	СУММА(РегистрСобранныеДанныеПодбор.Количество) > 0
		|;
		|
		//Проверим что упаковки еще не подбирались
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УпаковкиМарки.Короб КАК Короб,
		|	УпаковкиМарки.Палета КАК Палета
		|ИЗ
		|	УпаковкиМарки КАК УпаковкиМарки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СобранныеУпаковки КАК СобранныеУпаковки
		|		ПО (УпаковкиМарки.Короб = СобранныеУпаковки.Упаковка
		|				ИЛИ УпаковкиМарки.Палета = СобранныеУпаковки.Упаковка)
		|			И (СобранныеУпаковки.Упаковка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка))";
		
		
		Запрос.УстановитьПараметр("КМСсылка", СтруктураСтроки.КМСсылка);			
		Запрос.УстановитьПараметр("ДокументТСД", ДокументТСД);				
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			лТекущийКороб = Выборка.Короб;
			лТекущийПалета = Выборка.Палета;	
			Возврат Истина;		
		КонецЦикла;
		
	Иначе 	
		
		//2. Проверить что сканируем короб или палету, а ранее отсканированы КМ из этой упаковки
		//4. Проверить что сканируем палету, а ранее отсканирован короб из этой палеты

		Если ЗначениеЗаполнено(СтруктураСтроки.УпаковочныйЛистСсылка) Тогда
			
			Запрос = Новый Запрос;
			//Получим данные подобранных КМ
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СобранныеДанныеПодбор.КМСсылка КАК ПодобранныйКМилиУпаковка
			|ПОМЕСТИТЬ СобранныеМарки
			|ИЗ
			|	Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК СобранныеДанныеПодбор
			|ГДЕ
			|	СобранныеДанныеПодбор.Ссылка = &ДокументТСД
			|	И СобранныеДанныеПодбор.КМСсылка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	СобранныеДанныеПодбор.КМСсылка
			|
			|ИМЕЮЩИЕ
			|	СУММА(СобранныеДанныеПодбор.Количество) > 0
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РегистрСобранныеДанныеПодбор.КМСсылка
			|ИЗ
			|	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК РегистрСобранныеДанныеПодбор
			|ГДЕ
			|	РегистрСобранныеДанныеПодбор.ДокументТСД = &ДокументТСД
			|	И РегистрСобранныеДанныеПодбор.КМСсылка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	РегистрСобранныеДанныеПодбор.КМСсылка
			|
			|ИМЕЮЩИЕ
			|	СУММА(РегистрСобранныеДанныеПодбор.Количество) > 0
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СобранныеДанныеПодбор.УпаковочныйЛистСсылка
			|ИЗ
			|	Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК СобранныеДанныеПодбор
			|ГДЕ
			|	СобранныеДанныеПодбор.Ссылка = &ДокументТСД
			|	И СобранныеДанныеПодбор.УпаковочныйЛистСсылка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	СобранныеДанныеПодбор.УпаковочныйЛистСсылка
			|
			|ИМЕЮЩИЕ
			|	СУММА(СобранныеДанныеПодбор.Количество) > 0
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РегистрСобранныеДанныеПодбор.УпаковочныйЛистСсылка
			|ИЗ
			|	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК РегистрСобранныеДанныеПодбор
			|ГДЕ
			|	РегистрСобранныеДанныеПодбор.ДокументТСД = &ДокументТСД
			|	И РегистрСобранныеДанныеПодбор.УпаковочныйЛистСсылка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	РегистрСобранныеДанныеПодбор.УпаковочныйЛистСсылка
			|
			|ИМЕЮЩИЕ
			|	СУММА(РегистрСобранныеДанныеПодбор.Количество) > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ЕСТЬNULL(ДанныеУпаковкиУровень1.Ссылка, ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)) КАК Короб,
			|	ЕСТЬNULL(ДанныеУпаковкиУровень2.Ссылка, ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)) КАК Палета
			|ПОМЕСТИТЬ УпаковкиМарки
			|ИЗ
			|	СобранныеМарки КАК СобранныеМарки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ДанныеУпаковкиУровень1
			|		ПО (ДанныеУпаковкиУровень1.Штрихкод = СобранныеМарки.ПодобранныйКМилиУпаковка)
			|			И (ДанныеУпаковкиУровень1.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
			|				ИЛИ ДанныеУпаковкиУровень1.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка))
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ДанныеУпаковкиУровень2
			|		ПО (ДанныеУпаковкиУровень2.Штрихкод = ДанныеУпаковкиУровень1.Ссылка)
			|			И (ДанныеУпаковкиУровень2.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
			|				ИЛИ ДанныеУпаковкиУровень2.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка))
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	УпаковкиМарки.Короб,
			|	УпаковкиМарки.Палета
			|ИЗ
			|	УпаковкиМарки КАК УпаковкиМарки
			|ГДЕ
			|	УпаковкиМарки.Короб =  &УпаковочныйЛистСсылка
			|		ИЛИ УпаковкиМарки.Палета = &УпаковочныйЛистСсылка
			|";
			
			
			Запрос.УстановитьПараметр("ДокументТСД", ДокументТСД);
			Запрос.УстановитьПараметр("УпаковочныйЛистСсылка", СтруктураСтроки.УпаковочныйЛистСсылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() цикл
				лТекущийКороб = Выборка.Короб;
				лТекущийПалета = Выборка.Палета;	
				Возврат Истина;		
			КонецЦикла;
			
			
			
			//3. Проверить что сканируем короб, а ранее отсканирована палета с этим коробом
					
			Запрос = Новый Запрос;
			//Получим данные упаковок где хранится текущая упаковка по базе 1с
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ЕСТЬNULL(ДанныеУпаковкиУровень1.Ссылка, ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)) КАК Палета
			|ПОМЕСТИТЬ УпаковкиМарки
			|ИЗ
			|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ДанныеУпаковкиУровень1
			|		ПО (ДанныеУпаковкиУровень1.Штрихкод = ШтрихкодыУпаковокТоваров.Ссылка)
			|			И (ДанныеУпаковкиУровень1.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МонотоварнаяУпаковка)
			|				ИЛИ ДанныеУпаковкиУровень1.Ссылка.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка))
			|ГДЕ
			|	ШтрихкодыУпаковокТоваров.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|	И ШтрихкодыУпаковокТоваров.Ссылка = &УпаковочныйЛистСсылка
			|;
			|
			//Получим собранные по документу упаковки
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СобранныеДанныеПодбор.УпаковочныйЛистСсылка КАК Упаковка
			|ПОМЕСТИТЬ СобранныеУпаковки
			|ИЗ
			|	Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК СобранныеДанныеПодбор
			|ГДЕ
			|	СобранныеДанныеПодбор.Ссылка = &ДокументТСД
			|	И СобранныеДанныеПодбор.УпаковочныйЛистСсылка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	СобранныеДанныеПодбор.УпаковочныйЛистСсылка
			|
			|ИМЕЮЩИЕ
			|	СУММА(СобранныеДанныеПодбор.Количество) > 0
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РегистрСобранныеДанныеПодбор.УпаковочныйЛистСсылка
			|ИЗ
			|	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК РегистрСобранныеДанныеПодбор
			|ГДЕ
			|	РегистрСобранныеДанныеПодбор.ДокументТСД = &ДокументТСД
			|	И РегистрСобранныеДанныеПодбор.УпаковочныйЛистСсылка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	РегистрСобранныеДанныеПодбор.УпаковочныйЛистСсылка
			|
			|ИМЕЮЩИЕ
			|	СУММА(РегистрСобранныеДанныеПодбор.Количество) > 0
			|;
			|
			//Проверим что упаковки еще не подбирались
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	УпаковкиМарки.Палета КАК Палета
			|ИЗ
			|	УпаковкиМарки КАК УпаковкиМарки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СобранныеУпаковки КАК СобранныеУпаковки
			|		ПО (УпаковкиМарки.Палета = СобранныеУпаковки.Упаковка)
			|			И (СобранныеУпаковки.Упаковка <> ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка))";
			
			
			Запрос.УстановитьПараметр("УпаковочныйЛистСсылка", СтруктураСтроки.УпаковочныйЛистСсылка);			
			Запрос.УстановитьПараметр("ДокументТСД", ДокументТСД);				
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() цикл
				лТекущийПалета = Выборка.Палета;	
				Возврат Истина;		
			КонецЦикла;
			
			
		КонецЕсли;				
		
	КонецЕсли;
	
	Если ЭтоДокументМДЛП Тогда
		Если БылоСканированиеУпаковкиВСоставеДругойВЭтомДокументеМДЛП(СтруктураСтроки, ДокументТСД, Шаблон) Тогда
			Возврат Истина;	
		КонецЕсли;		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция БылоСканированиеУпаковкиВСоставеДругойВЭтомДокументеМДЛП(СтруктураСтроки, ДокументТСД, Шаблон)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.УпаковочныйЛист, 1, 4) = ""(00)""
	|			ТОГДА ПОДСТРОКА(ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.УпаковочныйЛист, 5, 18)
	|		ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.УпаковочныйЛист
	|	КОНЕЦ КАК УпаковочныйЛист,
	|	СУММА(ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_УпаковкиМДЛП
	|ИЗ
	|	Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор
	|ГДЕ
	|	ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.Ссылка = &Ссылка
	|	И ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.УпаковочныйЛист <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.УпаковочныйЛист, 1, 4) = ""(00)""
	|			ТОГДА ПОДСТРОКА(ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.УпаковочныйЛист, 5, 18)
	|		ИНАЧЕ ДатаМобайл_ДокументыТСДСобранныеДанныеПодбор.УпаковочныйЛист
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_УпаковкиМДЛП.УпаковочныйЛист КАК УпаковочныйЛист
	|ПОМЕСТИТЬ ВТ_УпаковкиИзПодбора
	|ИЗ
	|	ВТ_УпаковкиМДЛП КАК ВТ_УпаковкиМДЛП
	|ГДЕ
	|	ВТ_УпаковкиМДЛП.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УпаковкиМДЛП.НомерУпаковки КАК НомерУпаковки
	|ИЗ
	|	РегистрСведений.УпаковкиМДЛП КАК УпаковкиМДЛП
	|ГДЕ
	|	УпаковкиМДЛП.НомерУпаковки = &НомерУпаковки
	|	И УпаковкиМДЛП.НомерГрупповойУпаковки В
	|			(ВЫБРАТЬ
	|				ВТ_УпаковкиИзПодбора.УпаковочныйЛист КАК УпаковочныйЛист
	|			ИЗ
	|				ВТ_УпаковкиИзПодбора КАК ВТ_УпаковкиИзПодбора)";
	
	ЦРПТМарка = ДатаМобайл_МДЛП.УбратьИзМаркиУпрСимволы(СтруктураСтроки.ЦРПТМарка);
	
	Запрос.УстановитьПараметр("НомерУпаковки", ЦРПТМарка);
	Запрос.УстановитьПараметр("Ссылка", ДокументТСД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция УпаковочныйЛистУжеИмеетВложенность(СтруктураСтроки = Неопределено, ДокументТСД = Неопределено, Шаблон = Неопределено)
	
	Если СтруктураСтроки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
		Если ДатаМобайл_ОбщийМодуль.ЕстьМДЛП() Тогда
			ЭтоДокументМДЛП = ДатаМобайл_МДЛП.ЭтоДокументМДЛП(Шаблон.ВидДокумента);
		Иначе
			ЭтоДокументМДЛП = Ложь;
		КонецЕсли;	
	
		
		//Проверить что сканируем короб или палету, а ранее отсканированы КМ из этой упаковки
		Если СтруктураСтроки.УпаковочныйЛист<>"" Тогда
			
			УпаковочныйЛистСсылка = ДатаМобайл_Маркировка.ПолучитьСправочникСсылкаУпаковка(СтруктураСтроки.УпаковочныйЛист);
			Если УпаковочныйЛистСсылка<>Неопределено Тогда
				
				Если УпаковочныйЛистСсылка.ВложенныеШтрихкоды.Количество()>0 Тогда
					Возврат Истина;
				КонецЕсли;	
					
			КонецЕсли;			
		КонецЕсли;
		
	
	Возврат Ложь;
	
КонецФункции

Функция КодМаркировкиУжеАгрегирован(СтруктураСтроки = Неопределено, ДокументТСД = Неопределено, Шаблон = Неопределено)
	
	Если СтруктураСтроки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
		
		//Проверить что агрегируем КМ который еще не агрегирован
		Если ЗначениеЗаполнено(СтруктураСтроки.КМСсылка) или ЗначениеЗаполнено(СтруктураСтроки.КоробСсылка)  Тогда
			
			Запрос = Новый Запрос;
			//Получим данные упаковок где хранится марка по базе 1с
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
			|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка КАК Короб
			|ИЗ
			|	Справочник.ШтрихкодыУпаковокТоваров.ВложенныеШтрихкоды КАК ШтрихкодыУпаковокТоваровВложенныеШтрихкоды
			|ГДЕ
			|	ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод = &КМСсылка ИЛИ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Штрихкод = &КоробСсылка
			|	И НЕ ШтрихкодыУпаковокТоваровВложенныеШтрихкоды.Ссылка ЕСТЬ NULL";
			
			Запрос.УстановитьПараметр("КМСсылка", СтруктураСтроки.КМСсылка);
			Запрос.УстановитьПараметр("КоробСсылка", СтруктураСтроки.КоробСсылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда	
				Возврат Истина;		
			КонецЕсли;

			
		КонецЕсли;
		
	
	Возврат Ложь;
	
КонецФункции

Функция ПроверитьУникальностьКодаМаркировкиГрупповогоЗадания (ИмяТаблицы,УзелПО,СсылкаНаДок,СтрокаДокумента,СтруктураСтроки)
	
	Шаблон=СсылкаНаДок.Шаблон;
	
	ЗапросПревышения = Новый Запрос;
	ЗапросПревышения.Текст = "ВЫБРАТЬ
	|   ЕстьNull(СУММА(ЕстьNull(ТаблицаТоваровВРегистре.Количество,0)),0) КАК КоличествоПодбор
	|ИЗ
	|	РегистрСведений.ДатаМобайл_СтрокиГрупповыхДокументов КАК ТаблицаТоваровВРегистре
	|ГДЕ
	|	ТаблицаТоваровВРегистре.ДокументТСД = &ДокументТСД
	|	И ТаблицаТоваровВРегистре.ЦРПТМарка = &ЦРПТМарка
	|	И ТаблицаТоваровВРегистре.ИмяТаблицы = &ИмяТаблицы
	|	И НЕ ТаблицаТоваровВРегистре.ДляОбмена";
	
	ЗапросПревышения.УстановитьПараметр("ДокументТСД",СсылкаНаДок);
	//ЗапросПревышения.УстановитьПараметр("ИсходныйДокумент",СсылкаНаДок.ИсходныйДокумент);
	ЗапросПревышения.УстановитьПараметр("ЦРПТМарка",СтруктураСтроки.ЦРПТМарка);
	ЗапросПревышения.УстановитьПараметр("ИмяТаблицы",ИмяТаблицы);
	
	ВыборкаПревышения = ЗапросПревышения.Выполнить().Выбрать();
	Пока ВыборкаПревышения.Следующий() цикл
		Если ВыборкаПревышения.КоличествоПодбор > 0 Тогда
			Возврат Истина;
		КонецЕсли;
		Прервать;
	КонецЦикла;	
	
	Возврат Ложь;	
КонецФункции

#КонецОбласти


#КонецОбласти

#Область КТ2000
Функция GetDocArts_КТ2000(SN, UserName, DocOutID)
	
	ОбъектСписка = Новый Массив();
	СтруктураОтвета = Новый Структура;
	
	УзелПО = НайтиУзел(SN);	
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);
	КонецЕсли;
	
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));	
	Исключение	
		СтруктураОтвета.Вставить("Описание", "Не найден документ. ");	
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецПопытки;
	
	Если СсылкаНаДок.ПолучитьОбъект() = Неопределено Тогда		
		СтруктураОтвета.Вставить("Описание", "Не найден документ. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);
	КонецЕсли;	
	
	Шаблон = СсылкаНаДок.Шаблон; 
	
	Если Шаблон.ЕГАИС тогда
		//Пиво в ЕГАИС документах		
		Если  Шаблон.ВидДокумента = "РеализацияТоваровУслуг" или Шаблон.ВидДокумента = "ПеремещениеТоваров" или Шаблон.ВидДокумента = "СписаниеНедостачТоваров" или Шаблон.ВидДокумента = "ОрдерНаОтражениеНедостачТоваров" или Шаблон.ВидДокумента = "ДатаМобайл_ЗаявкаНаСклад" или Шаблон.ВидДокумента = "ДатаМобайл_УпаковочныйЛист"  тогда		
			Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Документ1С.Номенклатура КАК Ссылка
			|ИЗ
			|	Документ.ОтборРазмещениеТоваров.ТоварыОтбор КАК Документ1С
			|ГДЕ
			|	Документ1С.Ссылка = &Ссылка
			|	И Документ1С.Номенклатура.алкВидПродукции В (&СписокМарок)");			
			Запрос.Текст=СтрЗаменить(Запрос.Текст,".ТоварыОтбор КАК ","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК ");
			
		Иначе	
			Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|		СоответствиеНоменклатурыЕГАИС.Номенклатура КАК Ссылка
			|	ИЗ
			|		Документ.алкТоварноТранспортнаяНакладнаяЕГАИС.Товары КАК Документ1С
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры КАК СоответствиеНоменклатурыЕГАИС
			|		ПО  СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция = Документ1С.АлкогольнаяПродукция
			|	ГДЕ
			|		Документ1С.Ссылка = &Ссылка
			|		И Документ1С.АлкогольнаяПродукция.ВидПродукции В (&СписокМарок)
			|		И НЕ СоответствиеНоменклатурыЕГАИС.Номенклатура ЕСТЬ NULL");
			Запрос.Текст=СтрЗаменить(Запрос.Текст,".Товары КАК ","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК ");		
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Ссылка",ссылканадок.ИсходныйДокумент);
		СписокМарок = ДатаМобайл_ОбщийМодуль.СформироватьСписокНепроверяемыхМарокЕГАИС();	
		Запрос.УстановитьПараметр("СписокМарок",СписокМарок);
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".алкТоварноТранспортнаяНакладнаяЕГАИС.","."+Шаблон.ВидДокумента+".");
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".ОтборРазмещениеТоваров.","."+Шаблон.ВидДокумента+".");
		
		МассивКВыгрузке=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Если МассивКВыгрузке.Количество()>0 тогда
			ОбъектСписка = СобратьТовары(МассивКВыгрузке,УзелПО,Запрос.Выполнить().Выгрузить(), Шаблон);
		КонецЕсли;	
		
	Иначе
		Запрос=Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Документ1С.Номенклатура КАК Ссылка,
		|	Документ1С.Характеристика
		|ИЗ
		|	Документ.ОтборРазмещениеТоваров.ТоварыОтбор КАК Документ1С
		|ГДЕ
		|	Документ1С.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Документ1С.Номенклатура,
		|	Документ1С.Характеристика
		|ИЗ
		|	Документ.ОтборРазмещениеТоваров.ТоварыРазмещение КАК Документ1С
		|ГДЕ
		|	Документ1С.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка",ссылканадок.ИсходныйДокумент);
		
		Если Шаблон.ЕГАИС И Шаблон.ВидДокумента <> "ВскрытиеТарыЕГАИС" И Шаблон.ВидДокумента <> "УдалитьВскрытиеТарыЕГАИС" И Шаблон.ВидДокумента <> "ВозвратТоваровОтПокупателя" Тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"Документ1С.Номенклатура КАК Ссылка,","Документ1С.АлкогольнаяПродукция КАК Ссылка,");	
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"Документ1С.Номенклатура,","Документ1С.АлкогольнаяПродукция,");	
			Запрос.Текст=СтрЗаменить(Запрос.Текст,"Документ1С.Характеристика","ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика");	
		КонецЕсли;
		
		Запрос.Текст=СтрЗаменить(Запрос.Текст,".ОтборРазмещениеТоваров.","."+Шаблон.ВидДокумента+".");
		
		Если НЕ Шаблон.ИмяТабличнойЧастиПодбор="" тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,".ТоварыОтбор КАК ","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК ");
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,".ТоварыОтбор КАК ","."+Шаблон.ИмяТабличнойЧастиПриемка+" КАК ");
		КонецЕсли;
		
		Если НЕ Шаблон.ИмяТабличнойЧастиПриемка="" тогда
			Запрос.Текст=СтрЗаменить(Запрос.Текст,".ТоварыРазмещение КАК ","."+Шаблон.ИмяТабличнойЧастиПриемка+" КАК ");
		Иначе
			Запрос.Текст=СтрЗаменить(Запрос.Текст,".ТоварыРазмещение КАК ","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК ");
		КонецЕсли;	
		МассивКВыгрузке=Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Если МассивКВыгрузке.Количество()>0 тогда
			ОбъектСписка = СобратьТовары(МассивКВыгрузке,УзелПО,Запрос.Выполнить().Выгрузить(), Шаблон);
		КонецЕсли;	
	КонецЕсли;

	Возврат ПодготовитьОтветJSON(ОбъектСписка);

КонецФункции
Функция OnArtEgaisScan_КТ2000(SN, UserName, ArtID, Barcode, PDFBarcode, DocOutID, Cell) 
	
	СтруктураОтвета = Новый Структура;
	
	ОбъектТовараЕГАИС = ПолучитьСтруктуруОбъектаДляHttp("egais_art");
	
	УзелПО = НайтиУзел(SN);
	Если УзелПО = Неопределено Тогда
		УзелПО = NewTSD(SN, UserName);   
	КонецЕсли;
	
	Если НЕ (СтрДлина(PDFBarcode) = 68 ИЛИ СтрДлина(PDFBarcode) = 150) Тогда  // формат марки	
		СтруктураОтвета.Вставить("Описание", "Некорректный формат марки. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецЕсли;
	
	Попытка		
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));			
	Исключение		
		СтруктураОтвета.Вставить("Описание", "Не удалось найти документ. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);		
	КонецПопытки;
	
	Шаблон = СсылкаНаДок.Шаблон;
	
	Если стрДлина(PDFBarcode)=68 тогда
		Алкокод = КодНоменклатурыЕГАИСПоPDF417(PDFBarcode);
		
		ЗапросЕГАИС = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЕГАИС_Номенклатура.Ссылка,
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.Наименование, """") КАК name,
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.Производитель.Наименование, """") КАК manufacturer,
		//|	ЕСТЬNULL(ЕГАИС_Номенклатура.Импортер.Наименование, """") КАК importer,
		|	"""" КАК importer,
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.Объем, 0) КАК capacity,
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.Крепость, 0) КАК percent_alco,
		|	ЕСТЬNULL(ЕГАИС_Номенклатура.ВидПродукции.Наименование, """") КАК type_alco
		|ИЗ
		|	Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС КАК ЕГАИС_Номенклатура
		|ГДЕ
		|	ЕГАИС_Номенклатура.Код = &Код
		|	И НЕ ЕГАИС_Номенклатура.ПометкаУдаления");
		ЗапросЕГАИС.УстановитьПараметр("Код", Алкокод);
		
		ВыборкаЕГАИС = ЗапросЕГАИС.Выполнить().Выбрать();
		Пока ВыборкаЕГАИС.Следующий() Цикл			
			OnArtEgaisScan_ЗаполнитьОбъектТовара(ВыборкаЕГАИС, ОбъектТовараЕГАИС);
			ОбъектТовараЕГАИС.box_coef = 6; //количество единиц в коробе
		КонецЦикла;
		
	ИначеЕсли стрДлина(PDFBarcode) = 150  тогда        // новые марки
		//во входящей ттн упаковки смотрим в самом доке
		ЭтоВходящаяТТН = Ложь;
		Если  Шаблон.ВидДокумента = "алкТоварноТранспортнаяНакладнаяЕГАИС" тогда
			Если СсылкаНаДок.ИсходныйДокумент.ВидДокумента = Перечисления.алкВидыДокументовЕГАИС.Входящий тогда
				ЭтоВходящаяТТН = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтоВходящаяТТН Тогда			
			ЗапросЕГАИС = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЕстьNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция,ЗНАЧЕНИЕ(Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)) КАК Ссылка,
			|	ЕстьNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.Код, """")  КАК Алкокод,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.Наименование, """") КАК name,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.Производитель.Наименование, """") КАК manufacturer,
			//|	ЕСТЬNULL(ЕГАИС_Номенклатура.Импортер.Наименование, """") КАК importer,
			|	"""" КАК importer,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.Объем, 0) КАК capacity,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.Крепость, 0) КАК percent_alco,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.ВидПродукции.Наименование, """") КАК type_alco			
			|ИЗ
			|	Документ.алкТоварноТранспортнаяНакладнаяЕГАИС.АкцизныеМарки КАК ЕГАИС_Марки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.алкТоварноТранспортнаяНакладнаяЕГАИС.Товары КАК ЕГАИС_Номенклатура
			|		ПО ЕГАИС_Марки.КлючСвязи = ЕГАИС_Номенклатура.КлючСвязи
			|		И ЕГАИС_Марки.Ссылка = ЕГАИС_Номенклатура.Ссылка
			|ГДЕ
			|   ЕГАИС_Марки.Ссылка = &СсылкаНаТТН И ЕГАИС_Номенклатура.Ссылка = &СсылкаНаТТН 
			|   И ЕГАИС_Марки.КодАкцизнойМарки = &Код
			|   И НЕ ЕГАИС_Номенклатура.АлкогольнаяПродукция ЕСТЬ NULL");
			
			ЗапросЕГАИС.УстановитьПараметр("Код", PDFBarcode);
			ЗапросЕГАИС.УстановитьПараметр("СсылкаНаТТН", СсылкаНаДок.ИсходныйДокумент);
			
		Иначе			
			ЗапросЕГАИС = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЕГАИС_Номенклатура.АлкогольнаяПродукция.Ссылка КАК Ссылка,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.Наименование, """") КАК name,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.Производитель.Наименование, """") КАК manufacturer,
			//|	ЕСТЬNULL(ЕГАИС_Номенклатура.Импортер.Наименование, """") КАК importer,
			|	"""" КАК importer,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.Объем, 0) КАК capacity,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.Крепость, 0) КАК percent_alco,
			|	ЕСТЬNULL(ЕГАИС_Номенклатура.АлкогольнаяПродукция.ВидПродукции.Наименование, """") КАК type_alco
			|ИЗ
			|	РегистрСведений.алкХранилищеАкцизныхМарок КАК ЕГАИС_Номенклатура
			|ГДЕ
			|	ЕГАИС_Номенклатура.Марка = &Код
			|	И НЕ ЕГАИС_Номенклатура.АлкогольнаяПродукция.ПометкаУдаления");
			ЗапросЕГАИС.УстановитьПараметр("Код", PDFBarcode);
		КонецЕсли;
		
		ВыборкаЕГАИС = ЗапросЕГАИС.Выполнить().Выбрать();
		Пока ВыборкаЕГАИС.Следующий() Цикл
			OnArtEgaisScan_ЗаполнитьОбъектТовара(ВыборкаЕГАИС, ОбъектТовараЕГАИС);
			ОбъектТовараЕГАИС.box_coef = 6; //количество единиц в коробе
		КонецЦикла;
	КонецЕсли;
		
	Возврат ПодготовитьОтветJSON(ОбъектТовараЕГАИС);	
	
КонецФункции
Функция OnEgaisPalletScan_КТ2000(SN, UserName, Barcode, DocOutID, Cell)
	
	ОбъектСписка = Новый Массив;
	СтруктураОтвета = Новый Структура;

	УзелПО=НайтиУзел(SN);
	Если УзелПО=Неопределено тогда
		УзелПО = NewTSD(SN, UserName); 
	КонецЕсли;	
	
	Попытка
		СсылкаНаДок = XMLЗначение(Тип("СправочникСсылка.ДатаМобайл_ДокументыТСД"), Сред(DocOutID, 5));
	Исключение	
		СтруктураОтвета.Вставить("Описание", "Не нашли документ. ");		
		Возврат ПодготовитьОтветJSON(,СтруктураОтвета);	
	КонецПопытки;

	Шаблон = СсылкаНаДок.Шаблон;

	//во входящей ттн упаковки смотрим в самом доке
	ЭтоВходящаяТТН = Ложь;
	Если  Шаблон.ВидДокумента = "алкТоварноТранспортнаяНакладнаяЕГАИС" тогда
		Если СсылкаНаДок.ИсходныйДокумент.ВидДокумента = Перечисления.алкВидыДокументовЕГАИС.Входящий тогда
			ЭтоВходящаяТТН = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоВходящаяТТН тогда
		//марки входящей ТТН в задании
		Возврат ПодготовитьОтветJSON(ОбъектСписка);
	Иначе		
		ТЗМарок = ПолучитьТаблицуУпакованныхМарок_КТ2000(Barcode);
	КонецЕсли;
	
	Для Каждого СтрокаДока ИЗ ТЗМарок Цикл
		СтруктураТекущейСтроки = Новый Структура;
		
		qty  = 1; 
		СтруктураТекущейСтроки.Вставить("qty", qty);
		
		ОбъектЕГАИС = ПолучитьСтруктуруОбъектаДляHttp("egais");
		ОбъектЕГАИС.mark = СтрокаДока.Марка;	
		СтруктураТекущейСтроки.Вставить("egais", ОбъектЕГАИС);
		
		Если ЗначениеЗаполнено(ОбъектЕГАИС.mark) Тогда				
			ОбъектСписка.Добавить(СтруктураТекущейСтроки);
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ПодготовитьОтветJSON(ОбъектСписка);	
	
КонецФункции 
Функция ПолучитьТаблицуУпакованныхМарок_КТ2000(ИдентификаторУпаковки = "", Период = Неопределено, ЭтоВыборочнаяПроверка = Ложь) Экспорт
	
	ТЗМарок = Новый Массив;
	ТЗУпаковок = Новый Массив;
	
	Если ИдентификаторУпаковки = "" тогда
		Возврат ТЗМарок;
	Иначе
		ТЗУпаковок.Добавить(ИдентификаторУпаковки);
	КонецЕсли;	
	
	ЭтоКороб = ПроверитьУпаковочныйлистЭтоКороб_КТ2000(ИдентификаторУпаковки);
	
	//Получим упаковки палеты
	Если НЕ ЭтоКороб тогда	
		ЗапросУпаковок = Новый Запрос;
		ЗапросУпаковок.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
		ЗапросУпаковок.УстановитьПараметр("Упаковка", ИдентификаторУпаковки);
		ЗапросУпаковок.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	алкХранилищеУпаковокСрезПоследних.Регистратор,
		|	алкХранилищеУпаковокСрезПоследних.Упаковка
		|ПОМЕСТИТЬ ДанныеУпаковки	
		|ИЗ
		|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(&Период, Упаковка = &Упаковка) КАК алкХранилищеУпаковокСрезПоследних
		|ГДЕ
		|	алкХранилищеУпаковокСрезПоследних.ИерархияУпаковки = """"
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	алкХранилищеУпаковокСрезПоследних.Регистратор,
		|	алкХранилищеУпаковокСрезПоследних.Упаковка
		|ИЗ
		|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(&Период, ИерархияУпаковки = &Упаковка) КАК алкХранилищеУпаковокСрезПоследних
		|	ЛЕВОЕ СОЕДИНЕНИЕ ДанныеУпаковки КАК ДанныеУпаковки
		|	ПО ДанныеУпаковки.Регистратор = алкХранилищеУпаковокСрезПоследних.Регистратор
		|ГДЕ
		|	алкХранилищеУпаковокСрезПоследних.Упаковка <> """"
		|	И НЕ ДанныеУпаковки.Регистратор ЕСТЬ NULL И НЕ ДанныеУпаковки.Регистратор ЕСТЬ NULL"; 
		
		Выборка = ЗапросУпаковок.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			ТЗУпаковок.Добавить(Выборка.Упаковка);	
		КонецЦикла;	
	КонецЕсли;	
	
	ТЗМарок = Новый ТаблицаЗначений();
	ТЗМарок.Колонки.Добавить("Период");	
	ТЗМарок.Колонки.Добавить("Регистратор");
	ТЗМарок.Колонки.Добавить("Марка");	
	ТЗМарок.Колонки.Добавить("СправкаБ");
	ТЗМарок.Колонки.Добавить("АлкогольнаяПродукция");
	ТЗМарок.Колонки.Добавить("Организация");
	ТЗМарок.Колонки.Добавить("ПунктРазгрузки");
	ТЗМарок.Колонки.Добавить("ОтметкаВыбытия");
	ТЗМарок.Колонки.Добавить("Упаковка");
	ТЗМарок.Колонки.Добавить("ЭтоУпаковка");
	ТЗМарок.Колонки.Добавить("Наименование");
	
	Если ЭтоВыборочнаяПроверка Тогда
		ТЗМарок.Колонки.Добавить("Количество");	
	КонецЕсли;
	
	//Получим список марок	
	Для каждого Упаковка из ТЗУпаковок Цикл		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
		Запрос.УстановитьПараметр("Упаковка", Упаковка);
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	алкХранилищеУпаковокСрезПоследних.Регистратор,
		|	алкХранилищеУпаковокСрезПоследних.Упаковка	
		|ИЗ
		|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(&Период, Упаковка = &Упаковка) КАК алкХранилищеУпаковокСрезПоследних";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() тогда
			Регистратор = Выборка.Регистратор;
		Иначе
			Возврат ТЗМарок;
		КонецЕсли;		
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
		Запрос.УстановитьПараметр("Упаковка", Упаковка);
		Запрос.УстановитьПараметр("Регистратор", Регистратор);	
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	алкХранилищеАкцизныхМарокСрезПоследних.Период,
		|	алкХранилищеАкцизныхМарокСрезПоследних.Регистратор,
		|	алкХранилищеАкцизныхМарокСрезПоследних.Марка КАК Марка,
		|	алкХранилищеАкцизныхМарокСрезПоследних.СправкаБ,
		|	алкХранилищеАкцизныхМарокСрезПоследних.АлкогольнаяПродукция,
		|	алкХранилищеАкцизныхМарокСрезПоследних.Организация,
		|	алкХранилищеАкцизныхМарокСрезПоследних.ПунктРазгрузки,
		|	алкХранилищеАкцизныхМарокСрезПоследних.ОтметкаВыбытия,
		|	алкХранилищеАкцизныхМарокСрезПоследних.Упаковка,
		|	алкХранилищеАкцизныхМарокСрезПоследних.Упаковка КАК Наименование
		|ИЗ
		|	РегистрСведений.алкХранилищеАкцизныхМарок.СрезПоследних(&Период, Упаковка = &Упаковка И Регистратор = &Регистратор) КАК алкХранилищеАкцизныхМарокСрезПоследних
		|ГДЕ
		|	алкХранилищеАкцизныхМарокСрезПоследних.ОтметкаВыбытия = ЛОЖЬ"; 
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			НоваяСтрока = ТЗМарок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
			
			Если ЭтоВыборочнаяПроверка Тогда
				НоваяСтрока.Количество = 1;
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла;
	
	Если ТЗМарок.Количество()>0 Тогда
	Иначе
		Если ЭтоКороб тогда
			//Информация об упаковках в регистре марок
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
			Запрос.УстановитьПараметр("Упаковка", ИдентификаторУпаковки);
			
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	алкХранилищеАкцизныхМарокСрезПоследних.Период,
			|	алкХранилищеАкцизныхМарокСрезПоследних.Регистратор,
			|	алкХранилищеАкцизныхМарокСрезПоследних.Марка КАК Марка,
			|	алкХранилищеАкцизныхМарокСрезПоследних.СправкаБ,
			|	алкХранилищеАкцизныхМарокСрезПоследних.АлкогольнаяПродукция,
			|	алкХранилищеАкцизныхМарокСрезПоследних.Организация,
			|	алкХранилищеАкцизныхМарокСрезПоследних.ПунктРазгрузки,
			|	алкХранилищеАкцизныхМарокСрезПоследних.ОтметкаВыбытия,
			|	алкХранилищеАкцизныхМарокСрезПоследних.Упаковка,
			|	алкХранилищеАкцизныхМарокСрезПоследних.Упаковка КАК Наименование
			|ИЗ
			|	РегистрСведений.алкХранилищеАкцизныхМарок.СрезПоследних(&Период, Упаковка = &Упаковка) КАК алкХранилищеАкцизныхМарокСрезПоследних
			|ГДЕ
			|	алкХранилищеАкцизныхМарокСрезПоследних.ОтметкаВыбытия = ЛОЖЬ"; 
			
			ТЗМарок = Запрос.Выполнить().Выгрузить();
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат ТЗМарок;
	
КонецФункции
Функция ПроверитьУпаковочныйлистЭтоКороб_КТ2000(УпаковочныйЛист, Период = Неопределено) Экспорт
		
	Если ПустаяСтрока(УпаковочныйЛист) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Упаковка", УпаковочныйЛист);
	Запрос.УстановитьПараметр("Период", ?(ЗначениеЗаполнено(Период), Период, Неопределено));
	Запрос.Текст = "ВЫБРАТЬ
	|	алкХранилищеУпаковокСрезПоследних.Упаковка,
	|	алкХранилищеУпаковокСрезПоследних.ИерархияУпаковки
	|ИЗ
	|	РегистрСведений.алкХранилищеУпаковок.СрезПоследних(&Период, ИерархияУпаковки = &Упаковка) КАК алкХранилищеУпаковокСрезПоследних";
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции
Процедура GetDocRowsSelectEGAIS_КТ2000(УзелПО, Шаблон, ОбъектСписка, СсылкаНаДок)
	
	Запрос=Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапросСЛимитами.Номенклатура,
	|	ЗапросСЛимитами.Количество КАК Количество,
	|   СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(РезервыТСД.Количество, 0)) КАК Лимит,
	|	ЗапросСЛимитами.НомерСтроки КАК НомерСтроки,
	|	ЗапросСЛимитами.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаТоваровВДокументе.АлкогольнаяПродукция КАК Номенклатура,
	|		ТаблицаТоваровВДокументе.Количество КАК Количество,
	|		ТаблицаТоваровВДокументе.НомерСтроки КАК НомерСтроки,
	|		ТаблицаТоваровВДокументе.КлючСвязи КАК ИдентификаторСтроки
	|	ИЗ
	|		Документ.алкТоварноТранспортнаяНакладнаяЕГАИС.Товары КАК ТаблицаТоваровВДокументе
	|	ГДЕ
	|		ТаблицаТоваровВДокументе.Ссылка = &ИсходноеЗадание
	|		И НЕ ТаблицаТоваровВДокументе.АлкогольнаяПродукция.ВидПродукции В (&СписокМарок)) КАК ЗапросСЛимитами
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				&ВсеСклады
	|					ИЛИ Склад В (&Склады)) КАК ТоварыНаСкладахОстатки
	|		ПО ЗапросСЛимитами.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
	|			СУММА(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество) КАК Количество
	|		ИЗ
	|			Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
	|		ГДЕ
	|			ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка <> &Ссылка
	|			И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.Шаблон.РезервироватьТовар
	|			И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура) КАК РезервыТСД
	|		ПО ЗапросСЛимитами.Номенклатура = РезервыТСД.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗапросСЛимитами.Номенклатура,
	|	ЗапросСЛимитами.Количество,
	|	ЗапросСЛимитами.НомерСтроки,
	|	ЗапросСЛимитами.ИдентификаторСтроки
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки"); 	
	
	СписокМарок = ДатаМобайл_ОбщийМодуль.СформироватьСписокНепроверяемыхМарокЕГАИС();
	Запрос.УстановитьПараметр("СписокМарок", СписокМарок);		
	
	Если Шаблон.ВидДокумента <> "алкТоварноТранспортнаяНакладнаяЕГАИС" тогда 
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.КлючСвязи","0");
	КонецЕсли;	
	
	Если Шаблон.ВидДокумента = "ДатаМобайл_УпаковочныйЛист" тогда 
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.АлкогольнаяПродукция","ТаблицаТоваровВДокументе.ЕГАИС_Номенклатура");
	ИначеЕсли Шаблон.ВидДокумента = "алкАктФиксацииШтрихкодовНаБалансеОрганизацииЕГАИС" тогда 
		Запрос.Текст=СтрЗаменить(Запрос.Текст,"ТаблицаТоваровВДокументе.Количество","0");
	ИначеЕсли Шаблон.ВидДокумента = "РеализацияТоваровУслуг" или Шаблон.ВидДокумента = "ЗаказПокупателя" или Шаблон.ВидДокумента = "РасходныйОрдерНаТовары" или Шаблон.ВидДокумента = "ЧекККМ"  тогда 
		Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗапросСЛимитами.Номенклатура,
		|	ЗапросСЛимитами.Количество КАК Количество,
		|   СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.ВНаличииОстаток, 0) - ЕСТЬNULL(РезервыТСД.Количество, 0)) КАК Лимит,
		|	ЗапросСЛимитами.НомерСтроки КАК НомерСтроки,
		|	ЗапросСЛимитами.ИдентификаторСтроки КАК ИдентификаторСтроки
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция,ЗНАЧЕНИЕ(Справочник.алкКлассификаторАлкогольнойПродукцииЕГАИС.ПустаяССылка))) КАК Номенклатура,
		|		ТаблицаТоваровВДокументе.Количество КАК Количество,
		|		ТаблицаТоваровВДокументе.НомерСтроки КАК НомерСтроки,
		|		0 КАК ИдентификаторСтроки
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТоваровВДокументе
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алкСоответствияАлкогольнойПродукцииЕГАИСИНоменклатуры КАК СоответствиеНоменклатурыЕГАИС
		|			ПО СоответствиеНоменклатурыЕГАИС.Номенклатура = ТаблицаТоваровВДокументе.Номенклатура
		|	ГДЕ
		|		ТаблицаТоваровВДокументе.Ссылка = &ИсходноеЗадание
		|	СГРУППИРОВАТЬ ПО
		|		ТаблицаТоваровВДокументе.Номенклатура,
		|		ТаблицаТоваровВДокументе.Количество,
		|		ТаблицаТоваровВДокументе.НомерСтроки,
		|		0
		|	
		|	) КАК ЗапросСЛимитами
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				,
		|				&ВсеСклады
		|					ИЛИ Склад В (&Склады)) КАК ТоварыНаСкладахОстатки
		|		ПО ЗапросСЛимитами.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура КАК Номенклатура,
		|			СУММА(ДатаМобайл_ДокументыТСДСобранныеДанные.Количество) КАК Количество
		|		ИЗ
		|			Справочник.ДатаМобайл_ДокументыТСД.СобранныеДанныеПодбор КАК ДатаМобайл_ДокументыТСДСобранныеДанные
		|		ГДЕ
		|			ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка <> &Ссылка
		|			И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.Шаблон.РезервироватьТовар
		|			И ДатаМобайл_ДокументыТСДСобранныеДанные.Ссылка.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ДатаМобайл_ДокументыТСДСобранныеДанные.Номенклатура) КАК РезервыТСД
		|		ПО ЗапросСЛимитами.Номенклатура = РезервыТСД.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапросСЛимитами.Номенклатура,
		|	ЗапросСЛимитами.Количество,
		|	ЗапросСЛимитами.НомерСтроки,
		|	ЗапросСЛимитами.ИдентификаторСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
	КонецЕсли;	
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаДок);
	Запрос.УстановитьПараметр("ИсходноеЗадание",СсылкаНаДок.ИсходныйДокумент);
	Запрос.Текст=СтрЗаменить(Запрос.Текст,".алкТоварноТранспортнаяНакладнаяЕГАИС.","."+Шаблон.ВидДокумента+".");
	Запрос.Текст=СтрЗаменить(Запрос.Текст,".ПриходныйОрдерНаТовары.","."+Шаблон.ВидДокумента+".");
	Запрос.Текст=СтрЗаменить(Запрос.Текст,".РеализацияТоваровУслуг.","."+Шаблон.ВидДокумента+".");
	Запрос.Текст=СтрЗаменить(Запрос.Текст,".Товары КАК ","."+Шаблон.ИмяТабличнойЧастиПодбор+" КАК ");
	СписокСкладов=УзелПО.Склады.ВыгрузитьКолонку("Склад");
	Если ЗначениеЗаполнено(СсылкаНаДок.Склад) Тогда	
		СписокСкладов.Очистить();
		СписокСкладов.Добавить(СсылкаНаДок.Склад);			
	КонецЕсли;	
	Запрос.УстановитьПараметр("Склады",СписокСкладов);
	Запрос.УстановитьПараметр("ВсеСклады",СписокСкладов.Количество()=0);
	
	Попытка
		ЕстьТЧМарок = СсылкаНаДок.ИсходныйДокумент.метаданные().ТабличныеЧасти.Найти("АкцизныеМарки") <> Неопределено;
		ЕстьРеквизитИдентификаторСтроки = СсылкаНаДок.ИсходныйДокумент.метаданные().ТабличныеЧасти[Шаблон.ИмяТабличнойЧастиПодбор].Реквизиты.Найти("КлючСвязи") <> Неопределено;
	Исключение
	    ЕстьТЧМарок = Ложь;
		ЕстьРеквизитИдентификаторСтроки = Ложь;
	КонецПопытки;
	
	Рез = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаДока из Рез Цикл
		ТекущийИдентификаторСтроки = СтрокаДока.ИдентификаторСтроки;
		
		СтруктураТекущейСтроки = Новый Структура;		
		ОбъектТовара = Неопределено;
		ОбъектТовараЕГАИС = Неопределено;
		
		СписокМарок = ДатаМобайл_ОбщийМодуль.СформироватьСписокНепроверяемыхМарокЕГАИС();  
		Если СписокМарок.НайтиПоЗначению(СтрокаДока.Номенклатура.ВидПродукции)<>Неопределено  Тогда
			ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","id");
			лТекущаяНоменклатура = ДатаМобайл_ОбщийМодуль.ПолучитьНоменклатуруПоЕГАИС(СтрокаДока.Номенклатура);
			ОбъектТовара.id = "8U-" + XMLСтрока(лТекущаяНоменклатура) + XMLСтрока(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
			СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
		Иначе	
			ОбъектТовара = ПолучитьСтруктуруОбъектаДляHttp("art","id");
			ОбъектТовара.id = "8e-" + XMLСтрока(СтрокаДока.Номенклатура);
			СтруктураТекущейСтроки.Вставить("art", ОбъектТовара);
			
			ОбъектТовараЕГАИС = ПолучитьСтруктуруОбъектаДляHttp("egais_art","id");
			ОбъектТовараЕГАИС.id = "8e-" + XMLСтрока(СтрокаДока.Номенклатура);
			СтруктураТекущейСтроки.Вставить("egais_art", ОбъектТовараЕГАИС);		
		КонецЕсли;	
		
		limit_qty=0;		
		Если УзелПО.НеОтображатьОстатки Тогда
			limit_qty=0;
		Иначе		
			Попытка
				Итог = СтрокаДока.Лимит;
				limit_qty=Итог;
			Исключение
				limit_qty=0;
			КонецПопытки;
		КонецЕсли;	
		
		price=0;
		
		//Марки формат 3.0
		Если Шаблон.ВидДокумента = "ТТНВходящаяЕГАИС" ИЛИ Шаблон.ВидДокумента = "астТоварноТранспортныеНакладныеИзЕГАИС" Тогда
			КоличествоБезМарок = СтрокаДока.Количество;
			
			ЗапросМарок = Новый Запрос;
			ЗапросМарок.Текст = "ВЫБРАТЬ
			|	ЕГАИС_ТТНДанныеМарок.КодАкцизнойМарки КАК Марка,
			|	ЕГАИС_ТТНДанныеМарок.НомерКоробки КАК Короб,
			|	ЕстьNULL(ЕГАИС_ТТНДанныеУпаковок.ИерархияУпаковки,"""") КАК Палета
			|ИЗ
			|	Документ.алкТоварноТранспортнаяНакладнаяЕГАИС.АкцизныеМарки КАК ЕГАИС_ТТНДанныеМарок
			|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.алкТоварноТранспортнаяНакладнаяЕГАИС.Упаковки КАК ЕГАИС_ТТНДанныеУпаковок
			|	ПО ЕГАИС_ТТНДанныеМарок.Ссылка = ЕГАИС_ТТНДанныеУпаковок.Ссылка
			|	И ЕГАИС_ТТНДанныеМарок.НомерКоробки = ЕГАИС_ТТНДанныеУпаковок.Упаковка
			|ГДЕ
			|   ЕГАИС_ТТНДанныеМарок.Ссылка = &СсылкаТТН
			|	И ЕГАИС_ТТНДанныеМарок.КлючСвязи = &ТекущийИдентификаторСтроки";
			
			ЗапросМарок.УстановитьПараметр("СсылкаТТН",СсылкаНаДок.ИсходныйДокумент);
			ЗапросМарок.УстановитьПараметр("ТекущийИдентификаторСтроки",ТекущийИдентификаторСтроки);
			
			РезМарок = ЗапросМарок.Выполнить().Выгрузить();
			Для Каждого СтрокаМарок из РезМарок Цикл				
				Если КоличествоБезМарок > 0 Тогда
					
					СтруктураТекущейСтрокиМарки = Новый Структура;
					
					Если ОбъектТовара <> Неопределено тогда
						СтруктураТекущейСтрокиМарки.Вставить("art", ОбъектТовара);		
					КонецЕсли;
					
					Если ОбъектТовараЕГАИС <> Неопределено тогда		
						СтруктураТекущейСтрокиМарки.Вставить("egais_art", ОбъектТовараЕГАИС);	
					КонецЕсли;
					
					qty = 1;
					
					СтруктураТекущейСтрокиМарки.Вставить("limit_qty", limit_qty);
					СтруктураТекущейСтрокиМарки.Вставить("qty", qty);
					СтруктураТекущейСтроки.Вставить("price", price);
					
					ОбъектЕГАИС = ПолучитьСтруктуруОбъектаДляHttp("egais");
					ОбъектЕГАИС.mark = СтрокаМарок.Марка;	
					
					Если ЗначениеЗаполнено(ОбъектЕГАИС.mark) Тогда				
						СтруктураТекущейСтрокиМарки.Вставить("egais", ОбъектЕГАИС);
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрокаМарок.Короб) Тогда
						СтруктураТекущейСтрокиМарки.Вставить("box_pack", СтрокаМарок.Короб);
					КонецЕсли; 
					Если ЗначениеЗаполнено(СтрокаМарок.Палета) Тогда
						СтруктураТекущейСтрокиМарки.Вставить("pack", СтрокаМарок.Палета);
					КонецЕсли; 
					
					ОбъектСписка.Добавить(СтруктураТекущейСтрокиМарки); 
					
					КоличествоБезМарок = КоличествоБезМарок-1;
				Иначе
					Продолжить;
				КонецЕсли; 
				
			КонецЦикла;
		КонецЕсли; 		
		
		Если Шаблон.ВидДокумента = "ТТНВходящаяЕГАИС" ИЛИ Шаблон.ВидДокумента = "астТоварноТранспортныеНакладныеИзЕГАИС" Тогда
			Если КоличествоБезМарок > 0 Тогда
				qty = КоличествоБезМарок;
				
				СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
				СтруктураТекущейСтроки.Вставить("qty", qty);
				СтруктураТекущейСтроки.Вставить("price", price);
				
				ОбъектСписка.Добавить(СтруктураТекущейСтроки);
			КонецЕсли;	
		Иначе
			qty = СтрокаДока.Количество;
			
			СтруктураТекущейСтроки.Вставить("limit_qty", limit_qty);
			СтруктураТекущейСтроки.Вставить("qty", qty);
			СтруктураТекущейСтроки.Вставить("price", price);
			
			ОбъектСписка.Добавить(СтруктураТекущейСтроки);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#Область ФункцииHTTPОтвета

Функция ПолучитьСтруктуруОбъектаДляHttp(ТекущийОбъект,ТекущийТип="")	
	
	Если  ТекущийОбъект = "art" Тогда
				
		Если  ТекущийТип = "scan" Тогда
			
			СтруктураОбъекта = Новый Структура;
			
			СтруктураОбъекта.Вставить("id",   			"");
			СтруктураОбъекта.Вставить("name", 			""); 
			СтруктураОбъекта.Вставить("price", 			0);
			СтруктураОбъекта.Вставить("is_use_sn",    	Ложь);
			СтруктураОбъекта.Вставить("measure_type", 	0);
			СтруктураОбъекта.Вставить("mark_type",    	0);	
			СтруктураОбъекта.Вставить("attributes", 	Новый Структура);  				 	
			СтруктураОбъекта.Вставить("parent_id", 		"");
			
			Возврат СтруктураОбъекта;
			
		ИначеЕсли  ТекущийТип = "id" Тогда
			
			СтруктураОбъекта = Новый Структура;
			
			СтруктураОбъекта.Вставить("id",   			"");
			СтруктураОбъекта.Вставить("parent_id", 		"");
			
			Возврат СтруктураОбъекта;
			
		ИначеЕсли  ТекущийТип = "id_name" Тогда
			
			СтруктураОбъекта = Новый Структура;
			
			СтруктураОбъекта.Вставить("id",   			"");
			СтруктураОбъекта.Вставить("name", 			""); 
			СтруктураОбъекта.Вставить("parent_id", 		"");
			
			Возврат СтруктураОбъекта;
			
		Иначе
			
			СтруктураОбъекта = Новый Структура;
			
			СтруктураОбъекта.Вставить("id",   			"");
			СтруктураОбъекта.Вставить("name", 			""); 
			СтруктураОбъекта.Вставить("price", 			0);
			СтруктураОбъекта.Вставить("is_use_sn",    	Ложь);
			СтруктураОбъекта.Вставить("measure_type", 	0);
			СтруктураОбъекта.Вставить("mark_type",    	0);	
			СтруктураОбъекта.Вставить("attributes", 	Новый Структура);  				 	
			СтруктураОбъекта.Вставить("is_deleted",   	Ложь);
			СтруктураОбъекта.Вставить("rest",         	0);
			СтруктураОбъекта.Вставить("barcodes", 		Новый Массив);
			СтруктураОбъекта.Вставить("parent_id", 		"");
			
			Возврат СтруктураОбъекта;
			
		КонецЕсли;
		
	ИначеЕсли ТекущийОбъект = "barcode" Тогда
			
		Если ТекущийТип = "scan" Тогда
			
			СтруктураОбъекта = Новый Структура;
			
			СтруктураОбъекта.Вставить("unit_name",   "");         
			СтруктураОбъекта.Вставить("unit_coef",   1);		 	
			
			Возврат СтруктураОбъекта;
			
		ИначеЕсли ТекущийТип = "value" Тогда
			
			СтруктураОбъекта = Новый Структура;
			
			СтруктураОбъекта.Вставить("value",       "");
			
			Возврат СтруктураОбъекта;
			
		ИначеЕсли ТекущийТип = "unit_value" Тогда
			
			СтруктураОбъекта = Новый Структура;
			
			СтруктураОбъекта.Вставить("value",       "");
			СтруктураОбъекта.Вставить("unit_name",   "");         
			СтруктураОбъекта.Вставить("unit_coef",   1);
			СтруктураОбъекта.Вставить("use_sn_mode", 2);
			
			Возврат СтруктураОбъекта;
			
		Иначе
				
			СтруктураОбъекта = Новый Структура;
			СтруктураОбъекта.Вставить("value",       "");             
			СтруктураОбъекта.Вставить("unit_name",   "");         
			СтруктураОбъекта.Вставить("unit_coef",   1);
			СтруктураОбъекта.Вставить("use_sn_mode", 2);
			СтруктураОбъекта.Вставить("is_deleted",  Ложь);		  			 	
			
			Возврат СтруктураОбъекта;
			
		КонецЕсли
		
	ИначеЕсли ТекущийОбъект = "cell" Тогда
		
		Если ТекущийТип = "barcode" Тогда
			
			СтруктураОбъекта = Новый Структура;
			
			СтруктураОбъекта.Вставить("barcode", "");
			
			Возврат СтруктураОбъекта;
			
		Иначе
			
			СтруктураОбъекта = Новый Структура;
			
			СтруктураОбъекта.Вставить("name",    "");             
			СтруктураОбъекта.Вставить("barcode", "");
			
			Возврат СтруктураОбъекта;
			
		КонецЕсли
	
	ИначеЕсли ТекущийОбъект = "barcode_template" Тогда
		
		СтруктураОбъекта = Новый Структура;
		
		СтруктураОбъекта.Вставить("type_id",         "");
		СтруктураОбъекта.Вставить("length",          "");
		СтруктураОбъекта.Вставить("barcode_type_id", "");
		СтруктураОбъекта.Вставить("prefix",          "");
				
		Возврат СтруктураОбъекта;
			

	ИначеЕсли ТекущийОбъект = "user" Тогда
		
		СтруктураОбъекта = Новый Структура;
		
		СтруктураОбъекта.Вставить("login",            	"");             
		СтруктураОбъекта.Вставить("username", 	    	"");         
		СтруктураОбъекта.Вставить("password", 			"");		 
		СтруктураОбъекта.Вставить("is_admin", 			Ложь);		 
		СтруктураОбъекта.Вставить("is_can_edit_arts", 	Ложь);			

		Возврат СтруктураОбъекта;		
		
	ИначеЕсли ТекущийОбъект = "client" Тогда
		
		СтруктураОбъекта = Новый Структура;
		
		СтруктураОбъекта.Вставить("id",      ""); 
		СтруктураОбъекта.Вставить("name",    "");                     
		СтруктураОбъекта.Вставить("barcode", "");	
		
		Возврат СтруктураОбъекта;
				
	ИначеЕсли ТекущийОбъект = "unit" Тогда
		
		СтруктураОбъекта = Новый Структура;
		
		СтруктураОбъекта.Вставить("id",   "");             
		СтруктураОбъекта.Вставить("name", "");
		
		Возврат СтруктураОбъекта;
		
	ИначеЕсли ТекущийОбъект = "warehouse" Тогда
		
		СтруктураОбъекта = Новый Структура;
		
		СтруктураОбъекта.Вставить("id",   "");             
		СтруктураОбъекта.Вставить("name", "");
		
		Возврат СтруктураОбъекта;
		
	ИначеЕсли ТекущийОбъект = "template" Тогда
				
		СтруктураОбъекта = Новый Структура;
		
		СтруктураОбъекта.Вставить("id", "");
		СтруктураОбъекта.Вставить("is_deleted", Ложь);
		СтруктураОбъекта.Вставить("name", "");
		СтруктураОбъекта.Вставить("is_allow_create_on_device", Ложь);
		СтруктураОбъекта.Вставить("is_load_arts_with_doc", Ложь);
		СтруктураОбъекта.Вставить("is_load_rows_on_open_doc", Ложь);
		СтруктураОбъекта.Вставить("is_disable_manual_change_client", Ложь);
		СтруктураОбъекта.Вставить("is_disable_reader_change_client", Ложь);
		СтруктураОбъекта.Вставить("is_reader_track_1_use", Ложь);
		СтруктураОбъекта.Вставить("is_reader_track_2_use", Ложь);
		СтруктураОбъекта.Вставить("is_reader_track_3_use", Ложь);
		СтруктураОбъекта.Вставить("pack_list_generate_mode", 0);
		СтруктураОбъекта.Вставить("is_use_barcode_templates", Ложь);
		СтруктураОбъекта.Вставить("is_use_select_log_as_insert_task", Ложь);
		СтруктураОбъекта.Вставить("unload_incorrect_doc_action", 0);
		СтруктураОбъекта.Вставить("unload_incorrect_doc_option", 0);
		СтруктураОбъекта.Вставить("is_scan_art_again", Ложь);
		СтруктураОбъекта.Вставить("is_use_all_barcodes", Истина);
		СтруктураОбъекта.Вставить("is_unload_completed_child_doc", Ложь);
		СтруктураОбъекта.Вставить("is_unload_completed_doc", Ложь);
		СтруктураОбъекта.Вставить("required_pack_qty", 0);
		СтруктураОбъекта.Вставить("is_use_second_warehouse", Ложь);
		СтруктураОбъекта.Вставить("is_multi_sn_logic", Ложь);
		СтруктураОбъекта.Вставить("dest_template_id",   );
		СтруктураОбъекта.Вставить("is_notify_getting_doc", Ложь);                      	
		СтруктураОбъекта.Вставить("is_manual_apply_cell", Ложь);
		СтруктураОбъекта.Вставить("is_manual_apply_art", Ложь);
		СтруктураОбъекта.Вставить("is_use_additional_forms", Ложь);
		СтруктураОбъекта.Вставить("is_update_forms_from_server", Ложь);
		СтруктураОбъекта.Вставить("is_can_skip_pack", Ложь);
		СтруктураОбъекта.Вставить("is_get_sn_list_from_server", Ложь);
		СтруктураОбъекта.Вставить("is_delete_left_task_qty", Ложь);
		СтруктураОбъекта.Вставить("new_art_action", 0);
		СтруктураОбъекта.Вставить("is_multi_doc", Ложь);	
		СтруктураОбъекта.Вставить("is_from_select_to_insert_art_by_art", Ложь);
		СтруктураОбъекта.Вставить("unique_barcode_mode", 0);
		СтруктураОбъекта.Вставить("multi_doc_timeout", 0);
		СтруктураОбъекта.Вставить("is_play_multi_doc_sound", Ложь);
		СтруктураОбъекта.Вставить("is_use_online_arts_catalog", Ложь); 
		СтруктураОбъекта.Вставить("is_unload_completed_doc", Ложь);
		СтруктураОбъекта.Вставить("is_unload_completed_child_doc", Ложь);
		СтруктураОбъекта.Вставить("is_use_second_warehouse", Ложь);
		СтруктураОбъекта.Вставить("is_get_sn_list_from_server", Ложь);
		СтруктураОбъекта.Вставить("is_multi_sn_logic", Ложь);
		СтруктураОбъекта.Вставить("search_barcode_priority", 0);
		СтруктураОбъекта.Вставить("process_id", 0);		 
		СтруктураОбъекта.Вставить("description", "");
		СтруктураОбъекта.Вставить("additional_forms_for_art_mode", 0);
		
		СтруктураПодбор = Новый Структура;
		
		СтруктураПодбор.Вставить("is_use_operation", Ложь);
		СтруктураПодбор.Вставить("art_scan_action", 1);
		СтруктураПодбор.Вставить("task_exceed_action", 0);
		СтруктураПодбор.Вставить("limit_exceed_action", 0);
		СтруктураПодбор.Вставить("use_cell_mode", 0);
		СтруктураПодбор.Вставить("use_sn_mode", 0);
		СтруктураПодбор.Вставить("use_pack_mode", 0);
		СтруктураПодбор.Вставить("is_check_cell_by_task", Ложь);
		СтруктураПодбор.Вставить("is_check_sn_by_task", Ложь);
		СтруктураПодбор.Вставить("is_manual_quantity", Ложь);
		СтруктураПодбор.Вставить("is_enter_to_commit", Ложь);          		
		СтруктураПодбор.Вставить("is_send_row_to_server", Ложь);
		СтруктураПодбор.Вставить("print_label_mode", 0);
		СтруктураПодбор.Вставить("enter_cell_type", 0);
		СтруктураПодбор.Вставить("is_get_cells_from_server", Ложь);
		СтруктураПодбор.Вставить("is_use_unique_sn", Ложь);
		СтруктураПодбор.Вставить("is_use_photo_fixation", Ложь);
		СтруктураПодбор.Вставить("use_tare_mode", 0);
		СтруктураПодбор.Вставить("is_handle_whole_tare", Ложь);
		СтруктураПодбор.Вставить("is_handle_whole_cell", Ложь);
		СтруктураПодбор.Вставить("is_require_enter_sn", Ложь);
		СтруктураПодбор.Вставить("sn_data_type", 0);
		СтруктураПодбор.Вставить("is_check_pack_by_task", Ложь);
			
		СтруктураПриемка = Новый Структура;
		
		СтруктураПриемка.Вставить("is_use_operation", Ложь);
		СтруктураПриемка.Вставить("art_scan_action", 1);
		СтруктураПриемка.Вставить("task_exceed_action", 0);
		СтруктураПриемка.Вставить("limit_exceed_action", 0);
		СтруктураПриемка.Вставить("use_cell_mode", 0);
		СтруктураПриемка.Вставить("use_sn_mode", 0);
		СтруктураПриемка.Вставить("use_pack_mode", 0);
		СтруктураПриемка.Вставить("is_check_cell_by_task", Ложь);
		СтруктураПриемка.Вставить("is_check_sn_by_task", Ложь);
		СтруктураПриемка.Вставить("is_manual_quantity", Ложь);
		СтруктураПриемка.Вставить("is_enter_to_commit", Ложь);          		
		СтруктураПриемка.Вставить("is_send_row_to_server", Ложь);
		СтруктураПриемка.Вставить("print_label_mode", 0);
		СтруктураПриемка.Вставить("enter_cell_type", 0);
		СтруктураПриемка.Вставить("is_get_cells_from_server", Ложь);
		СтруктураПриемка.Вставить("is_use_unique_sn", Ложь);
		СтруктураПриемка.Вставить("is_use_photo_fixation", Ложь);
		СтруктураПриемка.Вставить("use_tare_mode", 0);
		СтруктураПриемка.Вставить("is_handle_whole_tare", Ложь);
		СтруктураПриемка.Вставить("is_handle_whole_cell", Ложь);
		СтруктураПриемка.Вставить("is_require_enter_sn", Ложь);
		СтруктураПриемка.Вставить("sn_data_type", 0);
		СтруктураПриемка.Вставить("is_check_pack_by_task", Ложь);
		
		СтруктураЕГАИС = Новый Структура;
		
		СтруктураЕГАИС.Вставить("is_egais_doc", Ложь);
		СтруктураЕГАИС.Вставить("enter_data_matrix_mode", 0);
		СтруктураЕГАИС.Вставить("is_use_bottling_date", Ложь);
		СтруктураЕГАИС.Вставить("is_compare", Ложь);
		СтруктураЕГАИС.Вставить("enter_pdf417_barcode_mode", 0);
		СтруктураЕГАИС.Вставить("is_check_mark_on_server", Ложь);
		СтруктураЕГАИС.Вставить("version", 0);
		СтруктураЕГАИС.Вставить("is_use_blank_a", Ложь);
		СтруктураЕГАИС.Вставить("is_use_blank_b", Ложь);
		СтруктураЕГАИС.Вставить("is_get_bottling_date_from_server", Ложь);
		
		СтруктураМаркировка = Новый Структура;
		
		СтруктураМаркировка.Вставить("is_marking_doc", Ложь);
		СтруктураМаркировка.Вставить("check_task_mode", 0);
		СтруктураМаркировка.Вставить("is_ean_equals_gtin", Ложь);
		СтруктураМаркировка.Вставить("is_ignore_art_mismatch_by_ean_km", Ложь);
		СтруктураМаркировка.Вставить("ean_scan_type", 0);
		СтруктураМаркировка.Вставить("is_search_by_km", Ложь);
		СтруктураМаркировка.Вставить("is_only_mark_art", Ложь);
		СтруктураМаркировка.Вставить("without_km_enter_type", 0);
		СтруктураМаркировка.Вставить("check_km_owner_action", 0);
		СтруктураМаркировка.Вставить("check_km_status_action", 0);
		СтруктураМаркировка.Вставить("is_use_sn", false);
		СтруктураМаркировка.Вставить("is_allow_qty", Ложь);
		
		СтруктураОбъекта.Вставить("select",  СтруктураПодбор);			
		СтруктураОбъекта.Вставить("insert",  СтруктураПриемка);
		СтруктураОбъекта.Вставить("egais",   СтруктураЕГАИС);
		СтруктураОбъекта.Вставить("marking", СтруктураМаркировка);
		
		Возврат СтруктураОбъекта;
		
	ИначеЕсли ТекущийОбъект = "doc" Тогда
		
		СтруктураОбъекта = Новый Структура;
		                                  
		СтруктураОбъекта.Вставить("id",  		    "");             
		СтруктураОбъекта.Вставить("number",        	"");
		СтруктураОбъекта.Вставить("date", 	        "");
		СтруктураОбъекта.Вставить("comment",	    "");
		СтруктураОбъекта.Вставить("barcode", 	    "");
		СтруктураОбъекта.Вставить("is_deleted",    	Ложь);
		СтруктураОбъекта.Вставить("is_loaded",     	Ложь);
		СтруктураОбъекта.Вставить("is_parent",     	Ложь);		
		СтруктураОбъекта.Вставить("is_finished",   	Ложь);
		СтруктураОбъекта.Вставить("parent_doc_id", 	"");
		СтруктураОбъекта.Вставить("priority",     	0);
		СтруктураОбъекта.Вставить("inn",           	"");		
		
		Возврат СтруктураОбъекта;
				
	ИначеЕсли ТекущийОбъект = "image" Тогда
		
		СтруктураОбъекта = Новый Структура;
		
		СтруктураОбъекта.Вставить("id",     "");            
		СтруктураОбъекта.Вставить("art_id", "");       
		СтруктураОбъекта.Вставить("data",   1);		  
		
		Возврат СтруктураОбъекта;

	ИначеЕсли ТекущийОбъект = "egais_art" Тогда
		
		Если  ТекущийТип = "id" Тогда
			
			СтруктураОбъекта = Новый Структура;
			
			СтруктураОбъекта.Вставить("id", 					"");
			
			Возврат СтруктураОбъекта;
			
		Иначе
			
			СтруктураОбъекта = Новый Структура;
			
			СтруктураОбъекта.Вставить("id", 					"");
			СтруктураОбъекта.Вставить("name", 				 	"");            
			СтруктураОбъекта.Вставить("alcocode", 			 	"");
			СтруктураОбъекта.Вставить("percent_alco", 		 	0);
			СтруктураОбъекта.Вставить("type_alco", 			 	0);			  	
			СтруктураОбъекта.Вставить("capacity", 			 	0);		  			 	
			СтруктураОбъекта.Вставить("importer", 			 	"");
			СтруктураОбъекта.Вставить("manufacturer", 		 	"");
			СтруктураОбъекта.Вставить("is_compared",     	    Ложь);
			СтруктураОбъекта.Вставить("box_coef", 			 	0);	
			
			Возврат СтруктураОбъекта;
			
		КонецЕсли;
		
	ИначеЕсли ТекущийОбъект = "egais_art_mark" Тогда
		
		СтруктураОбъекта = Новый Структура;
		
		СтруктураОбъекта.Вставить("art_id", ""); 
		СтруктураОбъекта.Вставить("mark",   "");		  	
		СтруктураОбъекта.Вставить("box",    "");
		СтруктураОбъекта.Вставить("pallet", "");
		
		Возврат СтруктураОбъекта;
		
	ИначеЕсли ТекущийОбъект = "egais" Тогда
		
		СтруктураОбъекта = Новый Структура;
		
		СтруктураОбъекта.Вставить("mark",          "");		 	
		
		Возврат СтруктураОбъекта;
	
	ИначеЕсли ТекущийОбъект = "art_mark" Тогда
		
		СтруктураОбъекта = Новый Структура;
		
		СтруктураОбъекта.Вставить("art_id", "");
		СтруктураОбъекта.Вставить("mark",   "");
		СтруктураОбъекта.Вставить("box",    "");         	  			  
		СтруктураОбъекта.Вставить("pallet", "");
		СтруктураОбъекта.Вставить("coef",   1);	
		
		Возврат СтруктураОбъекта;
	
	ИначеЕсли ТекущийОбъект = "marking" Тогда
		 
		СтруктураОбъекта = Новый Структура;
		
		СтруктураОбъекта.Вставить("mark", 		"");
	
		Возврат СтруктураОбъекта;
		
	ИначеЕсли ТекущийОбъект = "doc_form" Тогда
		
		Если  ТекущийТип = "doc" Тогда
			
			СтруктураОбъекта = Новый Структура;
			СтруктураОбъекта.Вставить("id",          "");             
			СтруктураОбъекта.Вставить("doc_id",      "");         		  	
			СтруктураОбъекта.Вставить("is_required", Ложь);		  
			СтруктураОбъекта.Вставить("form_type",   0);	
			
			Возврат СтруктураОбъекта;
			
		Иначе
			
			СтруктураОбъекта = Новый Структура;
			СтруктураОбъекта.Вставить("id",          "");                   
			СтруктураОбъекта.Вставить("template_id", "");		  	
			СтруктураОбъекта.Вставить("is_required", Ложь);		  
			СтруктураОбъекта.Вставить("form_type",   0);			 	
			
			Возврат СтруктураОбъекта;
		КонецЕсли;

	ИначеЕсли ТекущийОбъект = "step" Тогда
		
		СтруктураОбъекта = Новый Структура;
		СтруктураОбъекта.Вставить("id",          "");             
		СтруктураОбъекта.Вставить("name",        "");         
		СтруктураОбъекта.Вставить("type",        0);		  	
		СтруктураОбъекта.Вставить("parent_id",   "");
		СтруктураОбъекта.Вставить("is_required", Ложь);
		СтруктураОбъекта.Вставить("sort_number", 0);			 	
		
		Возврат СтруктураОбъекта;
		
	ИначеЕсли ТекущийОбъект = "form_content" Тогда
		
		СтруктураОбъекта = Новый Структура;
		СтруктураОбъекта.Вставить("id",      "");             
		СтруктураОбъекта.Вставить("name",    "");         
		СтруктураОбъекта.Вставить("form_id", 1);		  	
		СтруктураОбъекта.Вставить("barcode", "");		 	
		
		Возврат СтруктураОбъекта;
		
	ИначеЕсли ТекущийОбъект = "doc_steps" Тогда
		
		ОбъектDocSteps = Новый Структура;
		ОбъектDocSteps.Вставить("value",       "");             
		ОбъектDocSteps.Вставить("unit_name",   "");         
		ОбъектDocSteps.Вставить("unit_coef",   1);		  	
		ОбъектDocSteps.Вставить("is_deleted",  Ложь);		  
		ОбъектDocSteps.Вставить("use_sn_mode", 2);			 	
		
		Возврат ОбъектDocSteps;

	КонецЕсли;

КонецФункции

Функция ПодготовитьОтветJSON(СтруктураДанных = Неопределено, СтруктураОписанияОшибки = Неопределено, ContentType = Неопределено)
	

	Ответ = Новый Структура;
	
	Если СтруктураДанных <> Неопределено тогда 
		Ответ.Вставить("Result", СтруктураДанных);
	КонецЕсли;
	
	Если СтруктураОписанияОшибки <> Неопределено тогда 
		Ответ.Вставить("description", СтруктураОписанияОшибки.Описание);
	КонецЕсли;

	Если ContentType <> Неопределено тогда 
		Ответ.Вставить("ContentType", ContentType);
	КонецЕсли;
	
	Возврат Ответ;

КонецФункции

#КонецОбласти
