
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ПараметрыПисьма = Новый Структура;
	Текст= "В 1С оформлен документ:"+ Символы.ПС +
	ПолучениеДанных(ПараметрКоманды,"ссылка") + Символы.ПС +
	"Контрагент: " + ПолучениеДанных(ПараметрКоманды,"контрагент") + Символы.ПС +
	"Сумма: " + ПолучениеДанных(ПараметрКоманды,"СуммаДокумента") + Символы.ПС + 
	"Валюта: " + ПолучениеДанных(ПараметрКоманды,"Валюта") + Символы.ПС +
    "Статус: " + ПолучениеДанных(ПараметрКоманды,"статус") + Символы.ПС + 
	"Желательная дата платежа: " + ПолучениеДанных(ПараметрКоманды,"ЖелательнаяДатаПлатежа") + Символы.ПС +

	"Комментарий: " + ПолучениеДанных(ПараметрКоманды,"комментарий") + Символы.ПС +  
	//"Товары:" + Символы.ПС + ПолучениеТЧ(ПараметрКоманды) + Символы.ПС;  
	"Согласовал: " + ПолучениеДанных(ПараметрКоманды,"КтоРешил") + Символы.ПС +  
	"Заявил: " + ПолучениеДанных(ПараметрКоманды,"КтоЗаявил");
	
	ПараметрыПисьма.Вставить("УчетнаяЗапись", Неопределено);
	ПараметрыПисьма.Вставить("Получатель", "alla@gortorgsnab.ru");
	ПараметрыПисьма.Вставить("Тема", "Оповещение 1С: " + ПолучениеДанных(ПараметрКоманды,"ссылка"));
	
	ПараметрыПисьма.Вставить("Текст", Текст);
	//ПараметрыПисьма.Вставить("Вложения", СписокФайлов);
	//ПараметрыПисьма.Вставить("Предмет", ПараметрКоманды);
	
ОткрытьФорму("Документ.ЭлектронноеПисьмоИсходящее.Форма.ФормаДокумента", ПараметрыПисьма, , , , , );
КонецПроцедуры

Функция ПолучениеДанных(Документ,Параметр);

	Если параметр = "ссылка" тогда
		Возврат Документ.Ссылка;
	ИначеЕсли параметр = "склад" тогда
		Возврат Документ.Склад;
	ИначеЕсли параметр = "партнер" тогда
		Возврат Документ.Партнер;  
	ИначеЕсли параметр = "контрагент" тогда
		Возврат Документ.Контрагент;
	ИначеЕсли параметр = "ответственный" тогда
		Возврат Документ.Менеджер; 
	ИначеЕсли параметр = "автор" тогда
		Возврат Документ.автор;
    ИначеЕсли параметр = "КтоЗаявил" тогда
		Возврат Документ.КтоЗаявил;        
	ИначеЕсли параметр = "КтоРешил" тогда
		Возврат Документ.КтоРешил;
   ИначеЕсли параметр = "комментарий" тогда
		Возврат Документ.Комментарий;
	ИначеЕсли параметр = "статус" тогда
		Возврат Документ.Статус;  
	ИначеЕсли параметр = "СуммаДокумента" тогда
		Возврат Документ.СуммаДокумента;
	ИначеЕсли параметр = "ЖелательнаяДатаПлатежа" тогда
		Возврат Документ.ЖелательнаяДатаПлатежа;
     	ИначеЕсли параметр = "Валюта" тогда
		Возврат Документ.Валюта;
                                         	
	КонецЕсли;
	

	
КонецФункции

Функция ПолучениеТЧ(Документ)
	    Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.НомерСтроки КАК НомерСтроки,
	|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаказПоставщикуТовары.Количество КАК Количество,
	|	ЗаказПоставщикуТовары.Упаковка КАК Упаковка,
	|	ЗаказПоставщикуТовары.Назначение КАК Назначение,
	|	ЗаказПоставщикуТовары.ДатаПоступления КАК ДатаПоступления
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПоставщикуТовары.Номенклатура.Наименование";
	Запрос.УстановитьПараметр("Ссылка", Документ);

		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Текст= "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Текст= Текст + ВыборкаДетальныеЗаписи.Количество  + Символы.Таб + "шт." + Символы.Таб + ВыборкаДетальныеЗаписи.Номенклатура + Символы.Таб + ВыборкаДетальныеЗаписи.Назначение + Символы.Таб + Формат(ВыборкаДетальныеЗаписи.ДатаПоступления, "ДЛФ=Д") + Символы.ПС;
	КонецЦикла;
	
	
	Возврат Текст;
КонецФункции



Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт
	
	Массив = Новый Массив();
	СтруктураСтрокой = "";
	НужнаЗапятая = Ложь;
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая = Истина;
	КонецЦикла;
	Для Каждого Строка Из ТаблицаЗначений Цикл
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Массив.Добавить(НоваяСтрока);
	КонецЦикла;
	Возврат Массив;
	
КонецФункции
