
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();
	
	Источник = ПараметрыВыполненияКоманды.Источник;
	Если ТипЗнч(Источник) <> Тип("ФормаКлиентскогоПриложения") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = СервисДоставкиКлиент.НовыеПараметрыОткрытьФормуОбщиеНастройки();
	ПараметрыФормы.Вставить("ВладелецФормы", Источник);
	ПараметрыФормы.Вставить("ТипГрузоперевозки", Источник.ТипГрузоперевозки);
	ПараметрыФормы.Вставить("ВариантОтображения", "Шаблоны");
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ОрганизацияБизнесСети", Источник.ОрганизацияБизнесСетиСсылка);
	ПараметрыФормы.Вставить("ОписаниеОповещенияОЗакрытии",
		Новый ОписаниеОповещения("ПослеВыбораШаблона", Источник));
	
	СервисДоставкиКлиент.ОткрытьФормуОбщиеНастройкиСервисаДоставки(ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти