
&ИзменениеИКонтроль("СформироватьПечатнуюФормуУстановкиЦенНоменклатуры")
Функция асп_СформироватьПечатнуюФормуУстановкиЦенНоменклатуры(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УстановкаЦенНоменклатуры";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.УстановкаЦенНоменклатуры.ПФ_MXL_УстановкаЦенНоменклатуры");
	
	ВидыЦен = УстановкаЦенСервер.ИнициализироватьТаблицуВыбранныхЦен();
	ДеревоНастроек = ПолучитьИзВременногоХранилища(ПараметрыПечати.ДеревоНастроек);
	Для Каждого СтрокаДерева Из ДеревоНастроек.Строки Цикл
		Если СтрокаДерева.ВыводитьНаПечать Тогда
			СтрокаЦены = ВидыЦен.Добавить();
			СтрокаЦены.ВидЦены = СтрокаДерева.Параметр;
			СтрокаЦены.РеквизитДопУпорядочивания = ВидыЦен.Количество();
		КонецЕсли;
	КонецЦикла;
	
	ДанныеДляПечати = Неопределено;
	Если ЗначениеЗаполнено(ПараметрыПечати.АдресДанныеДляПечатиВоВременномХранилище) Тогда
		ДанныеДляПечати = ПолучитьИзВременногоХранилища(ПараметрыПечати.АдресДанныеДляПечатиВоВременномХранилище);
	КонецЕсли;

	Если ДанныеДляПечати = Неопределено Тогда

		ПервыйДокумент = Истина;
		Для Каждого УстановкаЦенНоменклатуры Из МассивОбъектов Цикл
			
			Если Не ПервыйДокумент Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ИспользуетсяЦенообразование25 = (УстановкаЦенНоменклатуры.Товары.Количество() = 0);
			
			ПервыйДокумент = Ложь;
			
			НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
			Если ИспользуетсяЦенообразование25 Тогда

				ТекстЗапроса =
				"ВЫБРАТЬ
				|	ВидыЦен.ВидЦены КАК ВидЦены,
				|	ВидыЦен.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
				|ПОМЕСТИТЬ ВидыЦен
				|ИЗ
				|	&ВидыЦен КАК ВидыЦен
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	УстановкаЦенНоменклатуры.Ссылка КАК Ссылка,
				|	УстановкаЦенНоменклатуры.Ссылка.Номер КАК Номер,
				|	УстановкаЦенНоменклатуры.Ссылка.Дата КАК Дата,
				|	ПРЕДСТАВЛЕНИЕ(УстановкаЦенНоменклатуры.Ссылка.Ответственный) КАК ОтветственныйПредставление
				|ИЗ
				|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
				|ГДЕ
				|	УстановкаЦенНоменклатуры.Ссылка = &УстановкаЦенНоменклатуры
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Товары.НомерСтроки КАК НомерСтроки,
				|	Товары.Номенклатура КАК Номенклатура,
				|	Товары.ХарактеристикаЦО КАК ХарактеристикаЦО,
				|	Товары.СерияЦО КАК СерияЦО,
				|	ВЫБОР
				|		КОГДА Товары.СерияЦО.Предопределенный
				|			ТОГДА ЗНАЧЕНИЕ(Справочник.СерииНоменклатурыДляЦенообразования.ПустаяСсылка)
				|		ИНАЧЕ Товары.СерияЦО
				|	КОНЕЦ КАК СерияЦОДляСвязи,
				|	Товары.УпаковкаЦО КАК УпаковкаЦО,
				|	ВЫБОР
				|		КОГДА Товары.УпаковкаЦО = Товары.Номенклатура.ЕдиницаИзмерения
				|			ТОГДА ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
				|		ИНАЧЕ Товары.УпаковкаЦО
				|	КОНЕЦ КАК УпаковкаЦОДляСвязи,
				|	Товары.Упаковка КАК Упаковка,
				|	Товары.Цена КАК Цена,
				|	Товары.ВидЦены КАК ВидЦены
				|ПОМЕСТИТЬ ТаблицаДанных
				|ИЗ
				|	Документ.УстановкаЦенНоменклатуры.Товары2_5 КАК Товары
				|ГДЕ
				|	Товары.Ссылка = &УстановкаЦенНоменклатуры
				|	И Товары.ВидЦены В
				|			(ВЫБРАТЬ
				|				ВидыЦен.ВидЦены
				|			ИЗ
				|				ВидыЦен КАК ВидыЦен)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Товары.НомерСтроки КАК НомерСтроки,
				|	Товары.Номенклатура КАК Номенклатура,
				|	Товары.ХарактеристикаЦО КАК ХарактеристикаЦО,
				|	Товары.СерияЦО КАК СерияЦО,
				|	Товары.СерияЦОДляСвязи КАК СерияЦОДляСвязи,
				|	Товары.УпаковкаЦО КАК УпаковкаЦО,
				|	Товары.УпаковкаЦОДляСвязи КАК УпаковкаЦОДляСвязи,
				|	Товары.Упаковка КАК Упаковка,
				|	Товары.Цена КАК Цена,
				|	Товары.ВидЦены КАК ВидЦены,
				|	ВЫБОР
				|		КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка
				|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
				|		ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
				|	КОНЕЦ КАК ДействующаяЦена,
				|	ВЫРАЗИТЬ(ВЫБОР
				|			КОГДА ЦеныНоменклатурыСрезПоследних.Цена <> 0
				|				ТОГДА 100 * (Товары.Цена - ВЫБОР
				|						КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка
				|							ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
				|						ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
				|					КОНЕЦ) / ВЫБОР
				|						КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка
				|							ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
				|						ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
				|					КОНЕЦ
				|			ИНАЧЕ 0
				|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ПроцентИзменения
				|ПОМЕСТИТЬ Товары
				|ИЗ
				|	ТаблицаДанных КАК Товары
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
				|				&ДатаСреза,
				|				(Номенклатура, ХарактеристикаЦО, СерияЦО, УпаковкаЦО, ВидЦены) В
				|					(ВЫБРАТЬ
				|						Т.Номенклатура,
				|						Т.ХарактеристикаЦО,
				|						Т.СерияЦОДляСвязи,
				|						Т.УпаковкаЦОДляСвязи,
				|						Т.ВидЦены
				|					ИЗ
				|						ТаблицаДанных КАК Т)) КАК ЦеныНоменклатурыСрезПоследних
				|		ПО Товары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			И Товары.ХарактеристикаЦО = ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО
				|			И Товары.СерияЦОДляСвязи = ЦеныНоменклатурыСрезПоследних.СерияЦО
				|			И Товары.УпаковкаЦОДляСвязи = ЦеныНоменклатурыСрезПоследних.УпаковкаЦО
				|			И Товары.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВидыЦен.ВидЦены КАК ВидЦены
				|ИЗ
				|	ВидыЦен КАК ВидыЦен
				|ГДЕ
				|	ВидыЦен.ВидЦены В
				|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|				Товары.ВидЦены
				|			ИЗ
				|				Товары КАК Товары
				|			ГДЕ
				|				(Товары.ПроцентИзменения <> 0
				|					ИЛИ &Все))
				|
				|УПОРЯДОЧИТЬ ПО
				|	ВидыЦен.РеквизитДопУпорядочивания
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Товары.Номенклатура КАК Номенклатура,
				|	Товары.ХарактеристикаЦО КАК ХарактеристикаЦО,
				|	Товары.СерияЦО КАК СерияЦО,
				|	Товары.УпаковкаЦО КАК УпаковкаЦО,
				|	Товары.Номенклатура.НаименованиеПолное КАК ПолноеНаименованиеНоменклатуры,
				|	ПРЕДСТАВЛЕНИЕ(Товары.ХарактеристикаЦО) КАК ПолноеНаименованиеХарактеристики,
				|	Товары.Номенклатура.Код КАК Код,
				|	Товары.Номенклатура.Артикул КАК Артикул,
				|	Товары.Упаковка КАК Упаковка,
				|	Товары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
				|	Товары.Цена КАК Цена,
				|	Товары.ВидЦены КАК ВидЦены,
				|	ЕСТЬNULL(Товары.ДействующаяЦена, 0) КАК СтараяЦена,
				|	Товары.ПроцентИзменения КАК ПроцентИзменения
				|ИЗ
				|	Товары КАК Товары
				|ГДЕ
				|	(Товары.ПроцентИзменения <> 0
				|			ИЛИ &Все)
				|
				|УПОРЯДОЧИТЬ ПО
				|	Товары.НомерСтроки
				|ИТОГИ ПО
				|	Номенклатура,
				|	ХарактеристикаЦО,
				|	СерияЦО,
				|	УпаковкаЦО";
			
			Иначе
					
				ТекстЗапроса =
				"ВЫБРАТЬ
				|	ВидыЦен.ВидЦены КАК ВидЦены,
				|	ВидыЦен.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
				|ПОМЕСТИТЬ ВидыЦен
				|ИЗ
				|	&ВидыЦен КАК ВидыЦен
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	УстановкаЦенНоменклатуры.Ссылка КАК Ссылка,
				|	УстановкаЦенНоменклатуры.Ссылка.Номер КАК Номер,
				|	УстановкаЦенНоменклатуры.Ссылка.Дата КАК Дата,
				|	ПРЕДСТАВЛЕНИЕ(УстановкаЦенНоменклатуры.Ссылка.Ответственный) КАК ОтветственныйПредставление
				|ИЗ
				|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
				|ГДЕ
				|	УстановкаЦенНоменклатуры.Ссылка = &УстановкаЦенНоменклатуры
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Товары.НомерСтроки КАК НомерСтроки,
				|	Товары.Номенклатура КАК Номенклатура,
				|	Товары.Характеристика КАК Характеристика,
				|	Товары.Упаковка КАК Упаковка,
				|	Товары.Цена КАК Цена,
				|	Товары.ВидЦены КАК ВидЦены
				|ПОМЕСТИТЬ ТаблицаДанных
				|ИЗ
				|	Документ.УстановкаЦенНоменклатуры.Товары КАК Товары
				|ГДЕ
				|	Товары.Ссылка = &УстановкаЦенНоменклатуры
				|	И Товары.ВидЦены В
				|			(ВЫБРАТЬ
				|				ВидыЦен.ВидЦены
				|			ИЗ
				|				ВидыЦен КАК ВидыЦен)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Товары.НомерСтроки КАК НомерСтроки,
				|	Товары.Номенклатура КАК Номенклатура,
				|	Товары.Характеристика КАК Характеристика,
				|	Товары.Упаковка КАК Упаковка,
				|	Товары.Цена КАК Цена,
				|	Товары.ВидЦены КАК ВидЦены,
				|	ВЫБОР
				|		КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка
				|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
				|		ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
				|	КОНЕЦ КАК ДействующаяЦена,
				|	ВЫРАЗИТЬ(ВЫБОР
				|			КОГДА ЦеныНоменклатурыСрезПоследних.Цена <> 0
				|				ТОГДА 100 * (Товары.Цена - ВЫБОР
				|						КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка
				|							ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
				|						ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
				|					КОНЕЦ) / ВЫБОР
				|						КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка
				|							ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
				|						ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
				|					КОНЕЦ
				|			ИНАЧЕ 0
				|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ПроцентИзменения
				|ПОМЕСТИТЬ Товары
				|ИЗ
				|	ТаблицаДанных КАК Товары
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
				|				&ДатаСреза,
				|				(Номенклатура, Характеристика, ВидЦены) В
				|					(ВЫБРАТЬ
				|						Т.Номенклатура,
				|						Т.Характеристика,
				|						Т.ВидЦены
				|					ИЗ
				|						ТаблицаДанных КАК Т)) КАК ЦеныНоменклатурыСрезПоследних
				|		ПО Товары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
				|			И Товары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
				|			И Товары.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
				|ГДЕ
				|	ВЫБОР
				|			КОГДА Товары.Номенклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
				|					И Товары.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
				|				ТОГДА ЛОЖЬ
				|			ИНАЧЕ ИСТИНА
				|		КОНЕЦ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВидыЦен.ВидЦены КАК ВидЦены
				|ИЗ
				|	ВидыЦен КАК ВидыЦен
				|ГДЕ
				|	ВидыЦен.ВидЦены В
				|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
				|				Товары.ВидЦены
				|			ИЗ
				|				Товары КАК Товары
				|			ГДЕ
				|				(Товары.ПроцентИзменения <> 0
				|					ИЛИ &Все))
				|
				|УПОРЯДОЧИТЬ ПО
				|	ВидыЦен.РеквизитДопУпорядочивания
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Товары.Номенклатура КАК Номенклатура,
				|	Товары.Характеристика КАК Характеристика,
				|	Товары.Номенклатура.НаименованиеПолное КАК ПолноеНаименованиеНоменклатуры,
				|	Товары.Характеристика.НаименованиеПолное КАК ПолноеНаименованиеХарактеристики,
				|	Товары.Номенклатура.Код КАК Код,
				|	Товары.Номенклатура.Артикул КАК Артикул,
				|	Товары.Упаковка КАК Упаковка,
				|	Товары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
				|	Товары.Цена КАК Цена,
				|	Товары.ВидЦены КАК ВидЦены,
				|	ЕСТЬNULL(Товары.ДействующаяЦена, 0) КАК СтараяЦена,
				|	Товары.ПроцентИзменения КАК ПроцентИзменения
				|ИЗ
				|	Товары КАК Товары
				|ГДЕ
				|	(Товары.ПроцентИзменения <> 0
				|			ИЛИ &Все)
				|
				|УПОРЯДОЧИТЬ ПО
				|	Товары.НомерСтроки
				|ИТОГИ ПО
				|	Номенклатура,
				|	Характеристика";

			КонецЕсли;
			
			Запрос = Новый Запрос();
			Запрос.Текст = ТекстЗапроса;
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки1",
				Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
					"ЦеныНоменклатурыСрезПоследних.Упаковка",
					"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки3",
				Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
					"Товары.Упаковка",
					"Товары.Номенклатура"));
			Запрос.УстановитьПараметр("УстановкаЦенНоменклатуры", УстановкаЦенНоменклатуры);
			Запрос.УстановитьПараметр("ДатаСреза",                УстановкаЦенНоменклатуры.Дата - 1);
			Запрос.УстановитьПараметр("ВидыЦен",                  ВидыЦен);
			Запрос.УстановитьПараметр("Все",                      Не ПараметрыПечати.ПечататьТолькоИзмененныеЦены);
			РезультатЗапроса = Запрос.ВыполнитьПакет();
			
			Параметры = НоваяСтруктураПараметровПечати();
			
			Параметры.НомерСтрокиНачало             = НомерСтрокиНачало;
			Параметры.ТабДокумент                   = ТабДокумент;
			Параметры.Макет                         = Макет;
			Параметры.ДеревоНастроек                = ДеревоНастроек;
			Параметры.УстановкаЦенНоменклатуры      = УстановкаЦенНоменклатуры;
			Параметры.ОбъектыПечати                 = ОбъектыПечати;
			Параметры.ПараметрыПечати               = ПараметрыПечати;
			
			Параметры.РезультатЗапроса.Шапка        = РезультатЗапроса[1];
			Параметры.РезультатЗапроса.ВидыЦен      = РезультатЗапроса[4];
			Параметры.РезультатЗапроса.Номенклатура = РезультатЗапроса[5];
			Параметры.ИспользуетсяЦенообразование25 = ИспользуетсяЦенообразование25;
			
			Шапка = Параметры.РезультатЗапроса.Шапка.Выбрать();
			Шапка.Следующий();
			
			Если Параметры.ПараметрыПечати.ВыводитьШапку Тогда
				ОбластьМакета = Параметры.Макет.ПолучитьОбласть("Заголовок");
				ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(
					Параметры.ТабДокумент, Параметры.Макет, ОбластьМакета, Шапка.Ссылка);
				ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(
					Шапка, НСтр("ru = 'Установка цен номенклатуры'", ОбщегоНазначения.КодОсновногоЯзыка()));
				Параметры.ТабДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
			
			ВывестиТабличнуюЧастьВПечатнуюФормуУстановкаЦенНоменклатуры(Параметры);
			
			Если Параметры.ПараметрыПечати.ВыводитьШапку Тогда
				ОбластьМакета = Параметры.Макет.ПолучитьОбласть("Подписи");
				ОбластьМакета.Параметры.Заполнить(Шапка);
				Параметры.ТабДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(Параметры.ТабДокумент, Параметры.НомерСтрокиНачало, Параметры.ОбъектыПечати, Параметры.УстановкаЦенНоменклатуры);
			
		КонецЦикла;
		
	Иначе
		
		Если ДанныеДляПечати.Свойство("ИспользуетсяЦенообразование25")
			И ТипЗнч(ДанныеДляПечати.ИспользуетсяЦенообразование25) = Тип("Булево") Тогда
			ИспользуетсяЦенообразование25 = ДанныеДляПечати.ИспользуетсяЦенообразование25;
		ИначеЕсли ДанныеДляПечати.Свойство("ДатаДействующихЦен")
			И ТипЗнч(ДанныеДляПечати.ИспользуетсяЦенообразование25) = Тип("Дата") Тогда
			
			ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25(
				ДанныеДляПечати.ДатаДействующихЦен + 1);
			
		Иначе
			ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25();
		КонецЕсли;
		
		ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ДанныеДляПечати.Товары, "НомерСтроки");
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Если ИспользуетсяЦенообразование25 Тогда

			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ВидыЦен.ВидЦены КАК ВидЦены,
			|	ВидыЦен.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
			|ПОМЕСТИТЬ ВидыЦен
			|ИЗ
			|	&ВидыЦен КАК ВидыЦен
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НЕОПРЕДЕЛЕНО КАК Ссылка,
			|	НЕОПРЕДЕЛЕНО КАК Номер,
			|	НЕОПРЕДЕЛЕНО КАК Дата,
			|	НЕОПРЕДЕЛЕНО КАК ОтветственныйПредставление
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.НомерСтроки КАК НомерСтроки,
			|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
			|	Товары.ХарактеристикаЦО КАК ХарактеристикаЦО,
			|	Товары.СерияЦО КАК СерияЦО,
			|	Товары.СерияЦОДляСвязи КАК СерияЦОДляСвязи,
			|	Товары.УпаковкаЦО КАК УпаковкаЦО,
			|	Товары.УпаковкаЦОДляСвязи КАК УпаковкаЦОДляСвязи,
			|	Товары.Упаковка КАК Упаковка,
			|	Товары.Цена КАК Цена,
			|	Товары.ВидЦены КАК ВидЦены
			|ПОМЕСТИТЬ ТаблицаДанных
			|ИЗ
			|	&Товары КАК Товары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.НомерСтроки КАК НомерСтроки,
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.ХарактеристикаЦО КАК ХарактеристикаЦО,
			|	Товары.СерияЦО КАК СерияЦО,
			|	Товары.УпаковкаЦО КАК УпаковкаЦО,
			|	Товары.Упаковка КАК Упаковка,
			|	Товары.Цена КАК Цена,
			|	Товары.ВидЦены КАК ВидЦены,
			|	ВЫБОР
			|		КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка
			|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
			|		ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
			|	КОНЕЦ КАК ДействующаяЦена,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ЦеныНоменклатурыСрезПоследних.Цена <> 0
			|				ТОГДА 100 * (Товары.Цена - ВЫБОР
			|						КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка
			|							ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
			|						ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
			|					КОНЕЦ) / ВЫБОР
			|						КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка
			|							ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
			|						ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
			|					КОНЕЦ
			|			ИНАЧЕ 0
			|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ПроцентИзменения
			|ПОМЕСТИТЬ Товары
			|ИЗ
			|	ТаблицаДанных КАК Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(
			|				&ДатаСреза,
			|				(Номенклатура, ХарактеристикаЦО, СерияЦО, УпаковкаЦО, ВидЦены) В
			|					(ВЫБРАТЬ
			|						Т.Номенклатура,
			|						Т.ХарактеристикаЦО,
			|						Т.СерияЦОДляСвязи,
			|						Т.УпаковкаЦОДляСвязи,
			|						Т.ВидЦены
			|					ИЗ
			|						ТаблицаДанных КАК Т
			|					ГДЕ
			|						Т.ВидЦены В
			|							(ВЫБРАТЬ
			|								ВидыЦен.ВидЦены
			|							ИЗ
			|								ВидыЦен КАК ВидыЦен))) КАК ЦеныНоменклатурыСрезПоследних
			|		ПО Товары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
			|			И Товары.ХарактеристикаЦО = ЦеныНоменклатурыСрезПоследних.ХарактеристикаЦО
			|			И Товары.СерияЦОДляСвязи = ЦеныНоменклатурыСрезПоследних.СерияЦО
			|			И Товары.УпаковкаЦОДляСвязи = ЦеныНоменклатурыСрезПоследних.УпаковкаЦО
			|			И Товары.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
			|ГДЕ
			|	Товары.ВидЦены В
			|			(ВЫБРАТЬ
			|				ВидыЦен.ВидЦены
			|			ИЗ
			|				ВидыЦен КАК ВидыЦен)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВидыЦен.ВидЦены КАК ВидЦены
			|ИЗ
			|	ВидыЦен КАК ВидыЦен
			|ГДЕ
			|	ВидыЦен.ВидЦены В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				Товары.ВидЦены
			|			ИЗ
			|				Товары КАК Товары
			|			ГДЕ
			|				(Товары.ПроцентИзменения <> 0
			|					ИЛИ &Все))
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВидыЦен.РеквизитДопУпорядочивания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.ХарактеристикаЦО КАК ХарактеристикаЦО,
			|	Товары.СерияЦО КАК СерияЦО,
			|	Товары.УпаковкаЦО КАК УпаковкаЦО,
			|	Товары.Номенклатура.НаименованиеПолное КАК ПолноеНаименованиеНоменклатуры,
			|	ПРЕДСТАВЛЕНИЕ(Товары.ХарактеристикаЦО) КАК ПолноеНаименованиеХарактеристики,
			|	Товары.Номенклатура.Код КАК Код,
			|	Товары.Номенклатура.Артикул КАК Артикул,
			|	Товары.Упаковка КАК Упаковка,
			|	Товары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	Товары.Цена КАК Цена,
			|	Товары.ВидЦены КАК ВидЦены,
			|	ЕСТЬNULL(Товары.ДействующаяЦена, 0) КАК СтараяЦена,
			|	Товары.ПроцентИзменения КАК ПроцентИзменения
			|ИЗ
			|	Товары КАК Товары
			|ГДЕ
			|	(Товары.ПроцентИзменения <> 0
			|			ИЛИ &Все)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Товары.НомерСтроки
			|ИТОГИ ПО
			|	Номенклатура,
			|	ХарактеристикаЦО,
			|	СерияЦО,
			|	УпаковкаЦО";
		
		Иначе
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ВидыЦен.ВидЦены КАК ВидЦены,
			|	ВидыЦен.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
			|ПОМЕСТИТЬ ВидыЦен
			|ИЗ
			|	&ВидыЦен КАК ВидыЦен
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НЕОПРЕДЕЛЕНО КАК Ссылка,
			|	НЕОПРЕДЕЛЕНО КАК Номер,
			|	НЕОПРЕДЕЛЕНО КАК Дата,
			|	НЕОПРЕДЕЛЕНО КАК ОтветственныйПредставление
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.НомерСтроки КАК НомерСтроки,
			|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
			|	ВЫРАЗИТЬ(Товары.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
		#Вставка
		|	&НоменклатураКлиентаСсылка
		#КонецВставки
			|	Товары.Упаковка КАК Упаковка,
			|	Товары.Цена КАК Цена,
			|	Товары.ВидЦены КАК ВидЦены
			|ПОМЕСТИТЬ ТаблицаДанных
			|ИЗ
			|	&Товары КАК Товары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.НомерСтроки КАК НомерСтроки,
			|	Товары.Номенклатура КАК Номенклатура,
		#Вставка
		|	&НоменклатураКлиентаСсылка
		#КонецВставки
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Упаковка КАК Упаковка,
			|	Товары.Цена КАК Цена,
			|	Товары.ВидЦены КАК ВидЦены,
			|	ВЫБОР
			|		КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка
			|			ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
			|		ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
			|	КОНЕЦ КАК ДействующаяЦена,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ЦеныНоменклатурыСрезПоследних.Цена <> 0
			|				ТОГДА 100 * (Товары.Цена - ВЫБОР
			|						КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка
			|							ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
			|						ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
			|					КОНЕЦ) / ВЫБОР
			|						КОГДА ЦеныНоменклатурыСрезПоследних.Упаковка = Товары.Упаковка
			|							ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
			|						ИНАЧЕ ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки3, 1)
			|					КОНЕЦ
			|			ИНАЧЕ 0
			|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ПроцентИзменения
			|ПОМЕСТИТЬ Товары
			|ИЗ
			|	ТаблицаДанных КАК Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
			|				&ДатаСреза,
			|				(Номенклатура, Характеристика, ВидЦены) В
			|					(ВЫБРАТЬ
			|						Т.Номенклатура,
			|						Т.Характеристика,
			|						Т.ВидЦены
			|					ИЗ
			|						ТаблицаДанных КАК Т
			|					ГДЕ
			|						Т.ВидЦены В
			|							(ВЫБРАТЬ
			|								ВидыЦен.ВидЦены
			|							ИЗ
			|								ВидыЦен КАК ВидыЦен))) КАК ЦеныНоменклатурыСрезПоследних
			|		ПО Товары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
			|			И Товары.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
			|			И Товары.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
			|ГДЕ
			|	Товары.ВидЦены В
			|			(ВЫБРАТЬ
			|				ВидыЦен.ВидЦены
			|			ИЗ
			|				ВидыЦен КАК ВидыЦен)
			|	И ВЫБОР
			|			КОГДА Товары.Номенклатура.ИспользованиеХарактеристик <> ЗНАЧЕНИЕ(Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать)
			|					И Товары.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
			|				ТОГДА ЛОЖЬ
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВидыЦен.ВидЦены КАК ВидЦены
			|ИЗ
			|	ВидыЦен КАК ВидыЦен
			|ГДЕ
			|	ВидыЦен.ВидЦены В
			|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|				Товары.ВидЦены
			|			ИЗ
			|				Товары КАК Товары
			|			ГДЕ
			|				(Товары.ПроцентИзменения <> 0
			|					ИЛИ &Все))
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВидыЦен.РеквизитДопУпорядочивания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.Номенклатура КАК Номенклатура,
		#Вставка
		|	&НоменклатураКлиентаСсылка
		#КонецВставки
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Номенклатура.НаименованиеПолное КАК ПолноеНаименованиеНоменклатуры,
		#Вставка
		|	&НоменклатураКлиентаНаименование
		#КонецВставки
			|	Товары.Характеристика.НаименованиеПолное КАК ПолноеНаименованиеХарактеристики,
			|	Товары.Номенклатура.Код КАК Код,
			|	Товары.Номенклатура.Артикул КАК Артикул,
			|	Товары.Упаковка КАК Упаковка,
			|	Товары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	Товары.Цена КАК Цена,
			|	Товары.ВидЦены КАК ВидЦены,
			|	ЕСТЬNULL(Товары.ДействующаяЦена, 0) КАК СтараяЦена,
			|	Товары.ПроцентИзменения КАК ПроцентИзменения
			|ИЗ
			|	Товары КАК Товары
			|ГДЕ
			|	(Товары.ПроцентИзменения <> 0
			|			ИЛИ &Все)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Товары.НомерСтроки
			|ИТОГИ ПО
			|	Номенклатура,
			|	Характеристика";

		КонецЕсли;
		
		Запрос = Новый Запрос();
		Запрос.Текст = ТекстЗапроса;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки1",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
				"ЦеныНоменклатурыСрезПоследних.Упаковка",
				"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки3",
				Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
					"Товары.Упаковка",
					"Товары.Номенклатура"));
		#Вставка 
		ТекстЗаменыНоменклатураКлиентаСсылка = ""; 
		ТекстЗаменыНоменклатураКлиентаНаименование = "";
		Если ДанныеДляПечати.Товары.Колонки.Найти("НоменклатураКлиента") <> Неопределено Тогда
			ТекстЗаменыНоменклатураКлиентаСсылка = " Товары.НоменклатураКлиента КАК НоменклатураКлиента, "; 
			ТекстЗаменыНоменклатураКлиентаНаименование = " Товары.НоменклатураКлиента.Наименование КАК НоменклатураКлиентаНаименование, ";
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НоменклатураКлиентаСсылка", ТекстЗаменыНоменклатураКлиентаСсылка);  
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИТОГИ ПО", "ИТОГИ МАКСИМУМ(Товары.НоменклатураКлиента), МАКСИМУМ(Товары.НоменклатураКлиента.Наименование) ПО");  
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НоменклатураКлиентаНаименование", ТекстЗаменыНоменклатураКлиентаНаименование);
		#КонецВставки
		Запрос.УстановитьПараметр("ДатаСреза",                ДанныеДляПечати.ДатаДействующихЦен);
		Запрос.УстановитьПараметр("ВидыЦен",                  ВидыЦен);
		Запрос.УстановитьПараметр("Товары",                   ДанныеДляПечати.Товары);
		Запрос.УстановитьПараметр("Все",                      Не ПараметрыПечати.ПечататьТолькоИзмененныеЦены);
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Параметры = НоваяСтруктураПараметровПечати();
		
		Параметры.НомерСтрокиНачало             = НомерСтрокиНачало;
		Параметры.ТабДокумент                   = ТабДокумент;
		Параметры.Макет                         = Макет;
		Параметры.ДеревоНастроек                = ДеревоНастроек;
		Параметры.УстановкаЦенНоменклатуры      = УстановкаЦенНоменклатуры;
		Параметры.ОбъектыПечати                 = ОбъектыПечати;
		Параметры.ПараметрыПечати               = ПараметрыПечати;
		Параметры.ИспользуетсяЦенообразование25 = ИспользуетсяЦенообразование25;
		
		Параметры.РезультатЗапроса.Шапка        = РезультатЗапроса[1];
		Параметры.РезультатЗапроса.ВидыЦен      = РезультатЗапроса[4];
		Параметры.РезультатЗапроса.Номенклатура = РезультатЗапроса[5];
		
		Если УстановкаЦенНоменклатуры = Неопределено Тогда
			Параметры.УстановкаЦенНоменклатуры = "ОбъектыПечатиНеЗаданы";
		КонецЕсли;
		
		Шапка = Параметры.РезультатЗапроса.Шапка.Выбрать();
		Шапка.Следующий();
		
		Если Параметры.ПараметрыПечати.ВыводитьШапку Тогда
			ОбластьМакета = Параметры.Макет.ПолучитьОбласть("Заголовок");
			ОбластьМакета.Параметры.ТекстЗаголовка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Изменение цен номенклатуры за %1'", ОбщегоНазначения.КодОсновногоЯзыка()),
				Формат(ДанныеДляПечати.ДатаДействующихЦен, "ДЛФ=D"));
			Параметры.ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		
		ВывестиТабличнуюЧастьВПечатнуюФормуУстановкаЦенНоменклатуры(Параметры);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(Параметры.ТабДокумент, Параметры.НомерСтрокиНачало, Параметры.ОбъектыПечати, Параметры.УстановкаЦенНоменклатуры);
		
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

&ИзменениеИКонтроль("ВывестиТабличнуюЧастьВПечатнуюФормуУстановкаЦенНоменклатуры")
Процедура асп_ВывестиТабличнуюЧастьВПечатнуюФормуУстановкаЦенНоменклатуры(Параметры)
	
	#Вставка
	ПечатьИзПрайса = Параметры.Свойство("УстановкаЦенНоменклатуры") и Не ТипЗнч(Параметры.УстановкаЦенНоменклатуры) = Тип("ДокументСсылка.УстановкаЦенНоменклатуры");
	#КонецВставки
	// Шапка таблицы
	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов();
	ИмяДополнительнойКолонки = КолонкаКодов.ИмяКолонки;
	ПредставлениеКолонкиКодов = КолонкаКодов.ПредставлениеКолонки;
	ВыводитьКоды = ?(ЗначениеЗаполнено(ИмяДополнительнойКолонки), Истина, Ложь);
	
	ШапкаНомера  = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|ОбластьНомера");
	ШапкаКодов   = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|ОбластьКодов");
	ШапкаТовар   = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|ОбластьТовар");
	#Вставка
	Если ПечатьИзПрайса Тогда
	ШапкаТоварКлиента   = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|ОбластьТоварКлиента");
	КонецЕсли;
	#КонецВставки
	ШапкаВидЦены = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|" + 
		?(Не Параметры.ПараметрыПечати.ВыводитьШапку,"ОбластьВидЦеныУникальныйИдентификатор","ОбластьВидЦены"));
	Если Параметры.ИспользуетсяЦенообразование25 Тогда
		ШапкаУникальныеИдентификаторы = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|УникальныеИдентификаторы25");
	Иначе
		ШапкаУникальныеИдентификаторы = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|УникальныеИдентификаторы");
	КонецЕсли;
	
	Параметры.ТабДокумент.Вывести(ШапкаНомера);
	Если ВыводитьКоды Тогда
		ШапкаКодов.Параметры.ИмяКолонкиКодов = ПредставлениеКолонкиКодов;
		Параметры.ТабДокумент.Присоединить(ШапкаКодов);
	КонецЕсли;
	Если Не Параметры.ПараметрыПечати.ВыводитьШапку Тогда
		Параметры.ТабДокумент.Присоединить(ШапкаУникальныеИдентификаторы);
	КонецЕсли;
	#Вставка
	Если ПечатьИзПрайса Тогда
	Параметры.ТабДокумент.Присоединить(ШапкаТоварКлиента);
	КонецЕсли;
	#КонецВставки
	Параметры.ТабДокумент.Присоединить(ШапкаТовар);
	
	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("ВидЦены");
	Табл.Колонки.Добавить("МакетОбласти");
	Табл.Колонки.Добавить("ВыводитьСуммуИзменения");
	Табл.Колонки.Добавить("ВыводитьПроцентИзменения");
	Табл.Колонки.Добавить("ВыводитьСтаруюЦену");
	
	ВыборкаПоВидамЦен = Параметры.РезультатЗапроса.ВидыЦен.Выбрать();
	Пока ВыборкаПоВидамЦен.Следующий() Цикл
		
		Новая                          = Табл.Добавить();
		Новая.ВидЦены                  = ВыборкаПоВидамЦен.ВидЦены;
		Новая.ВыводитьПроцентИзменения = Ложь;
		Новая.ВыводитьСуммуИзменения   = Ложь;
		Новая.ВыводитьСтаруюЦену       = Ложь;
		
		НайденныеСтроки = Параметры.ДеревоНастроек.Строки.НайтиСтроки(Новый Структура("Параметр", ВыборкаПоВидамЦен.ВидЦены), Ложь);
		Для Каждого ВидЦены Из НайденныеСтроки Цикл
			
			Для Каждого Колонка Из ВидЦены.Строки Цикл
				
				Если Колонка.Параметр = "СтараяЦена" И Колонка.ВыводитьНаПечать Тогда
					Новая.ВыводитьСтаруюЦену = Истина;
				КонецЕсли;
				
				Если Колонка.Параметр = "СуммаИзменения" И Колонка.ВыводитьНаПечать Тогда
					Новая.ВыводитьСуммуИзменения = Истина;
				КонецЕсли;
				
				Если Колонка.Параметр = "ПроцентИзменения" И Колонка.ВыводитьНаПечать Тогда
					Новая.ВыводитьПроцентИзменения = Истина;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если Новая.ВыводитьСуммуИзменения Тогда
			
			Если Новая.ВыводитьПроцентИзменения И Новая.ВыводитьСтаруюЦену Тогда
				ШапкаВидЦены       = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|" + 
					?(Не Параметры.ПараметрыПечати.ВыводитьШапку,
					"ОбластьВидЦеныСтараяЦенаПроцентИзмененияСуммаИзмененияУникальныйИдентификатор",
					"ОбластьВидЦеныСтараяЦенаПроцентИзмененияСуммаИзменения"));
				Новая.МакетОбласти = Параметры.Макет.ПолучитьОбласть("Строка|" + 
					?(Не Параметры.ПараметрыПечати.ВыводитьШапку,
					"ОбластьВидЦеныСтараяЦенаПроцентИзмененияСуммаИзмененияУникальныйИдентификатор",
					"ОбластьВидЦеныСтараяЦенаПроцентИзмененияСуммаИзменения"));
			ИначеЕсли Новая.ВыводитьПроцентИзменения И Не Новая.ВыводитьСтаруюЦену Тогда
				ШапкаВидЦены       = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|" + 
					?(Не Параметры.ПараметрыПечати.ВыводитьШапку,
					"ОбластьВидЦеныПроцентИзмененияСуммаИзмененияУникальныйИдентификатор",
					"ОбластьВидЦеныПроцентИзмененияСуммаИзменения"));
				Новая.МакетОбласти = Параметры.Макет.ПолучитьОбласть("Строка|ОбластьВидЦеныПроцентИзмененияСуммаИзменения");
			ИначеЕсли Не Новая.ВыводитьПроцентИзменения И Новая.ВыводитьСтаруюЦену Тогда
				ШапкаВидЦены       = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|" + 
					?(Не Параметры.ПараметрыПечати.ВыводитьШапку,
					"ОбластьВидЦеныСтараяЦенаСуммаИзмененияУникальныйИдентификатор",
					"ОбластьВидЦеныСтараяЦенаСуммаИзменения"));
				Новая.МакетОбласти = Параметры.Макет.ПолучитьОбласть("Строка|" + 
					?(Не Параметры.ПараметрыПечати.ВыводитьШапку,
					"ОбластьВидЦеныСтараяЦенаСуммаИзмененияУникальныйИдентификатор",
					"ОбластьВидЦеныСтараяЦенаСуммаИзменения"));
			ИначеЕсли Не Новая.ВыводитьПроцентИзменения И Не Новая.ВыводитьСтаруюЦену Тогда
				ШапкаВидЦены       = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|" + 
					?(Не Параметры.ПараметрыПечати.ВыводитьШапку,
					"ОбластьВидЦеныСуммаИзмененияУникальныйИдентификатор",
					"ОбластьВидЦеныСуммаИзменения"));
				Новая.МакетОбласти = Параметры.Макет.ПолучитьОбласть("Строка|" + 
					?(Не Параметры.ПараметрыПечати.ВыводитьШапку,
					"ОбластьВидЦеныСуммаИзмененияУникальныйИдентификатор",
					"ОбластьВидЦеныСуммаИзменения"));
			КонецЕсли;
			
		Иначе
			
			Если Новая.ВыводитьПроцентИзменения И Новая.ВыводитьСтаруюЦену Тогда
				ШапкаВидЦены       = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|" + 
					?(Не Параметры.ПараметрыПечати.ВыводитьШапку,
					"ОбластьВидЦеныСтараяЦенаПроцентИзмененияУникальныйИдентификатор",
					"ОбластьВидЦеныСтараяЦенаПроцентИзменения"));
				Новая.МакетОбласти = Параметры.Макет.ПолучитьОбласть("Строка|" + 
					?(Не Параметры.ПараметрыПечати.ВыводитьШапку,
					"ОбластьВидЦеныСтараяЦенаПроцентИзмененияУникальныйИдентификатор",
					"ОбластьВидЦеныСтараяЦенаПроцентИзменения"));
			ИначеЕсли Новая.ВыводитьПроцентИзменения И Не Новая.ВыводитьСтаруюЦену Тогда
				ШапкаВидЦены       = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|" + 
					?(Не Параметры.ПараметрыПечати.ВыводитьШапку,
					"ОбластьВидЦеныПроцентИзмененияУникальныйИдентификатор",
					"ОбластьВидЦеныПроцентИзменения"));
				Новая.МакетОбласти = Параметры.Макет.ПолучитьОбласть("Строка|ОбластьВидЦеныПроцентИзменения");
			ИначеЕсли Не Новая.ВыводитьПроцентИзменения И Новая.ВыводитьСтаруюЦену Тогда
				ШапкаВидЦены       = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|" + 
					?(Не Параметры.ПараметрыПечати.ВыводитьШапку,
					"ОбластьВидЦеныСтараяЦенаУникальныйИдентификатор",
					"ОбластьВидЦеныСтараяЦена"));
				Новая.МакетОбласти = Параметры.Макет.ПолучитьОбласть("Строка|" + 
					?(Не Параметры.ПараметрыПечати.ВыводитьШапку,
					"ОбластьВидЦеныСтараяЦенаУникальныйИдентификатор",
					"ОбластьВидЦеныСтараяЦена"));
			ИначеЕсли Не Новая.ВыводитьПроцентИзменения И Не Новая.ВыводитьСтаруюЦену Тогда
				ШапкаВидЦены       = Параметры.Макет.ПолучитьОбласть("ШапкаТаблицы|" + 
					?(Не Параметры.ПараметрыПечати.ВыводитьШапку,
					"ОбластьВидЦеныУникальныйИдентификатор",
					"ОбластьВидЦены"));
				Новая.МакетОбласти = Параметры.Макет.ПолучитьОбласть("Строка|" + 
					?(Не Параметры.ПараметрыПечати.ВыводитьШапку,
					"ОбластьВидЦеныУникальныйИдентификатор",
					"ОбластьВидЦены"));
			КонецЕсли;
			
		КонецЕсли;
		
		ШапкаВидЦены.Параметры.ВидЦены = ВыборкаПоВидамЦен.ВидЦены;
		Параметры.ТабДокумент.Присоединить(ШапкаВидЦены);
		
	КонецЦикла;
	
	Области = Новый Структура();
	Области.Вставить("ОбластьНомера", Параметры.Макет.ПолучитьОбласть("Строка|ОбластьНомера"));
	Области.Вставить("ОбластьКодов", Параметры.Макет.ПолучитьОбласть("Строка|ОбластьКодов"));
	#Вставка
	Если ПечатьИзПрайса Тогда
	ОбластьТоварКлиента  = Параметры.Макет.ПолучитьОбласть("Строка|ОбластьТоварКлиента");
	КонецЕсли;
	#КонецВставки
	Области.Вставить("ОбластьТовар", Параметры.Макет.ПолучитьОбласть("Строка|ОбластьТовар"));
	Если Параметры.ИспользуетсяЦенообразование25 Тогда
		Области.Вставить("ОбластьУникальныеИдентификаторы", Параметры.Макет.ПолучитьОбласть("Строка|УникальныеИдентификаторы25"));
	Иначе
		Области.Вставить("ОбластьУникальныеИдентификаторы", Параметры.Макет.ПолучитьОбласть("Строка|УникальныеИдентификаторы"));
	КонецЕсли;
	
	НомерСтроки = 0;
	
	ВыборкаПоНоменклатуре = Параметры.РезультатЗапроса.Номенклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоНоменклатуре.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаПоНоменклатуре.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		ВыборкаПоХарактеристикам = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоХарактеристикам.Следующий() Цикл
		
			Если Параметры.ИспользуетсяЦенообразование25 Тогда
				
				ВыборкаПоСериям = ВыборкаПоХарактеристикам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоСериям.Следующий() Цикл
					ВыборкаПоУпаковкам = ВыборкаПоСериям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаПоУпаковкам.Следующий() Цикл
						ФрагментВывестиТабличнуюЧастьВПечатнуюФормуУстановкаЦенНоменклатуры(Параметры, ВыборкаПоУпаковкам, ВыводитьКоды, Табл, ИмяДополнительнойКолонки, Области, НомерСтроки);
					КонецЦикла;
				КонецЦикла;
			#Вставка
			Если ПечатьИзПрайса Тогда
			ОбластьТоварКлиента.Параметры.ТоварКлиента = ВыборкаПоХарактеристикам.НоменклатураКлиентаНаименование; 
			Параметры.ТабДокумент.Присоединить(ОбластьТоварКлиента);
			КонецЕсли;
			#КонецВставки
				
			Иначе
				ФрагментВывестиТабличнуюЧастьВПечатнуюФормуУстановкаЦенНоменклатуры(Параметры, ВыборкаПоХарактеристикам, ВыводитьКоды, Табл, ИмяДополнительнойКолонки, Области, НомерСтроки);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры
