// @strict-types

#Область СлужебныеПроцедурыИФункции

// Возвращает список констант для сервиса.
//
// Параметры:
//   ВВерхнемРегистре - Булево - Истина, если получать строковые значения констант в верхнем регистре.
//
// Возвращаемое значение:
//   Соответствие Из КлючИЗначение:
//    * Ключ - Строка - имя константы.
//    * Значение - Число, Строка - значение константы.
//
Функция КонстантыСервиса(Знач ВВерхнемРегистре = Истина) Экспорт

	Результат = Новый Структура;
	
	Результат.Вставить("СпособОтраженияПродажРеализация", 0);
	Результат.Вставить("СпособОтраженияПродажКомиссия",   1);
	
	Результат.Вставить("УПД_Штрихкод",                    "штрихкод");	//@NON-NLS-1
	
	Если ВВерхнемРегистре Тогда
		Для Каждого КлючИЗначение Из Результат Цикл
			ЗначениеКонстанты = КлючИЗначение.Значение;
			Если ТипЗнч(ЗначениеКонстанты) = Тип("Строка") Тогда
				Результат.Вставить(КлючИЗначение.Ключ, ВРег(ЗначениеКонстанты));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти
