
&Перед("ПередЗаписью")
Процедура асп_ПередЗаписью(Отказ, Замещение)
	
	Если Не ПараметрыСеанса.ASP_ВыполняетсяЗаполненияСебестоимостиДляБ24 Тогда
		ЗаписьЖурналаРегистрации("Данные о себестоимости заказа клиента.Ошибка",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.ASP_Битрикс24ДанныеОСебестоимостиЗаказКлиента,
			ЭтотОбъект.Отбор.Регистратор,
			"Блокирована попытка добавления/изменения записей регистра вне регламентного задания");
		Отказ = Истина;
		ВызватьИсключение "Записывать данные о себестоимости заказа клиента для Б24 разрешено только соответствующим регл. заданием";
	КонецЕсли;
	
КонецПроцедуры
