&НаКлиенте
Процедура ТаблицаДокументовДобавить(Кнопка)
	Если Не Шаблон.Пустая() тогда		
		ПараметрыПодбора=Новый Структура;
		ПараметрыПодбора.Вставить("МножественныйВыбор", Истина);
		ПараметрыПодбора.Вставить("ЗакрыватьПривыборе", Ложь);
		ВидДокумента=ВидДокумента(Шаблон);	
		ОткрытьФорму("Документ."+ВидДокумента+".ФормаВыбора", ПараметрыПодбора, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Сообщить("Не выбран шаблон");
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидДокумента(Шаблон);
	ВидДокумента=Шаблон.ВидДокумента;
	Возврат ВидДокумента;
КонецФункции
	
&НаКлиенте
Процедура ТаблицаДокументовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	МассивДокументовПодбора = ВыбранноеЗначение.ТекущийЭлемент.ВыделенныеСтроки;
	
	Для каждого СтрокаДокумента Из МассивДокументовПодбора Цикл
		
		Если ЕстьДокументвТЧ(СтрокаДокумента) тогда
			Сообщить("Документ: "+СтрокаДокумента+" уже был добавлен в список. ");
		Иначе	
			СтрокаТЧ = ТаблицаДокументов.Добавить();
			СтрокаТЧ.Документ = СтрокаДокумента;
			СтрокаТЧ.Шаблон = Шаблон;
			СтрокаТЧ.ТСД = ТСД;
			СтрокаТЧ.Комментарий = Комментарий;
			Сообщить("Документ: "+СтрокаДокумента+" добавлен в список. ");
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЕстьДокументвТЧ(Документ)
Возврат ТаблицаДокументов.НайтиСтроки(Новый Структура("Документ", Документ )).Количество() > 0; 
КонецФункции

&НаКлиенте
Процедура Выгрузить(Кнопка)
n= ТаблицаДокументов.Количество()-1;
Для i=0 по n цикл
ТекСтрока=ТаблицаДокументов.Получить(i);
ИсходныйДокумент=ТекСтрока.Документ;
Шаблон=ТекСтрока.Шаблон;
ТСД=ТекСтрока.ТСД;
Комментарий=ТекСтрока.Комментарий;
СоздатьДок (ИсходныйДокумент,Шаблон,ТСД,Комментарий);
КонецЦикла;

ТаблицаДокументов.Очистить();
ФормаВыбора = ПолучитьФорму("Обработка.ДатаМобайл_АРМДиспетчера.Форма.Форма1"); 
ФормаВыбора.Закрыть()

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьДок (ИсходныйДокумент,Шаблон,ТСД,Комментарий)
	
НовыйДок=Справочники.ДатаМобайл_ДокументыТСД.СоздатьЭлемент();
НовыйДок.ИсходныйДокумент=ИсходныйДокумент;
НовыйДок.Шаблон=Шаблон;
НовыйДок.ТСД=ТСД;
НовыйДок.Комментарий=Комментарий;	
НовыйДок.Записать();

КонецПроцедуры	

&НаСервереБезКонтекста
Функция УжеЕсть(лИсходныйДокумент)
	Если лИсходныйДокумент<>Неопределено тогда
		Если не лИсходныйДокумент.Пустая() тогда
			Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДатаМобайл_ДокументыТСД.Ссылка
			|ИЗ
			|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
			|ГДЕ
			|	ДатаМобайл_ДокументыТСД.ИсходныйДокумент = &ИсходныйДокумент");
			Запрос.УстановитьПараметр("ИсходныйДокумент",лИсходныйДокумент);
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Возврат Ложь;
КонецФункции





