
&НаКлиенте
Процедура ТаблицаИнтерваловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Не Копирование и ТаблицаИнтервалов.Количество()>0 Тогда
	    Отказ=Истина;
	    ПоследняяСтрока=ТаблицаИнтервалов.Получить(ТаблицаИнтервалов.Количество()-1);
	    НоваяСтрока=ТаблицаИнтервалов.Добавить();
	    НоваяСтрока.Начало=ПоследняяСтрока.Конец+0.01;
	    Элементы.ТаблицаИнтервалов.ТекущаяСтрока=НоваяСтрока.ПолучитьИдентификатор();
	    Элементы.ТаблицаИнтервалов.ИзменитьСтроку();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНаименованиеСтроки(ТекСтр)
    Возврат "от "+ТекСтр.Начало+" до "+ТекСтр.Конец;
КонецФункции

Процедура ПроставитьГраницы()
	Сч=0;
	Пока Сч<(ТаблицаИнтервалов.Количество()-1) Цикл
		ТекСтр1=ТаблицаИнтервалов.Получить(Сч);
		ТекСтр2=ТаблицаИнтервалов.Получить(Сч+1);
		Если ТекСтр1.Начало>ТекСтр1.Конец Тогда
			ТекСтр1.Конец=ТекСтр1.Начало;
		КонецЕсли;
		//Если ТекСтр2.Начало<=ТекСтр1.Конец Тогда
		ТекСтр2.Начало=ТекСтр1.Конец+0.01;
		//КонецЕсли;
		Если ТекСтр2.Начало>ТекСтр2.Конец Тогда
			ТекСтр2.Конец=ТекСтр2.Начало;
		КонецЕсли;
		Сч=Сч+1;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьГраницы(СтрокаВставки=Неопределено)
	ТаблицаИнтервалов.Сортировать("Начало");
	Если СтрокаВставки<>Неопределено Тогда
	    СтрокаПеред=Неопределено;
	    Сч=0;
	    Для Каждого Стр из 	ТаблицаИнтервалов Цикл
            Если Стр.ПолучитьИдентификатор()=СтрокаВставки.ПолучитьИдентификатор() Тогда
				ИндексВставки=Сч;
				Прервать;
			КонецЕсли;
			Сч=Сч+1;
 		КонецЦикла;
		Для Каждого Стр из ТаблицаИнтервалов Цикл
			Если Стр.ПолучитьИдентификатор()=СтрокаВставки.ПолучитьИдентификатор() Тогда
				Продолжить;
			КонецЕсли;
			Если Стр.Конец<=СтрокаВставки.Начало Тогда
			    СтрокаПеред=Стр;
			    Прервать;
			КонецЕсли;
		КонецЦикла;
		Если СтрокаПеред=Неопределено Тогда
			Для Сч=-ТаблицаИнтервалов.Количество()+1 по -1 Цикл
				Стр=ТаблицаИнтервалов.Получить(-Сч);
				Если Стр.ПолучитьИдентификатор()=СтрокаВставки.ПолучитьИдентификатор() Тогда
					Продолжить;
				КонецЕсли;
				Если Стр.Начало>=СтрокаВставки.Конец Тогда
					СтрокаПеред=ТаблицаИнтервалов.Получить(ТаблицаИнтервалов.Индекс(Стр)-1);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если СтрокаПеред<>Неопределено и СтрокаПеред.ПолучитьИдентификатор()<>СтрокаВставки.ПолучитьИдентификатор() и (ТаблицаИнтервалов.Индекс(СтрокаПеред)-ИндексВставки+1)>0 Тогда
		    ИндексСмещения=ТаблицаИнтервалов.Индекс(СтрокаПеред)-ИндексВставки+1;
		    ТаблицаИнтервалов.Сдвинуть(ИндексВставки,ИндексСмещения);
		    ИндексВставки=ИндексВставки+ИндексСмещения;
		    СтрокаВставки=ТаблицаИнтервалов.Получить(ИндексВставки);
		КонецЕсли;
		Если ИндексВставки>0 Тогда
		    ТаблицаИнтервалов.Получить(ИндексВставки-1).Конец=СтрокаВставки.Начало-0.01;
		КонецЕсли;
		Если ИндексВставки<(ТаблицаИнтервалов.Количество()-1) Тогда
		    ТаблицаИнтервалов.Получить(ИндексВставки+1).Начало=СтрокаВставки.Начало+0.01;
		КонецЕсли;
	КонецЕсли;
	ПроставитьГраницы();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИнтерваловПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекСтр=ТаблицаИнтервалов.НайтиПоИдентификатору(Элементы.ТаблицаИнтервалов.ТекущаяСтрока);
	ПересчитатьГраницы(ТекСтр);
	Если ТекСтр.Наименование="" Тогда
	    ТекСтр=ТаблицаИнтервалов.НайтиПоИдентификатору(Элементы.ТаблицаИнтервалов.ТекущаяСтрока);
	    Если ТекСтр<>Неопределено Тогда
	    	ТекСтр.Наименование=ПолучитьНаименованиеСтроки(ТекСтр);
	    КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьНаименование(Команда)
	Для Каждого Стр из ТаблицаИнтервалов Цикл
	    Стр.Наименование=ПолучитьНаименованиеСтроки(Стр);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ТаблицуИнтерваловВМассив()
    Рез=Новый Массив();
    Для Каждого Стр из ТаблицаИнтервалов Цикл
        Рез.Добавить(Новый Структура("Наименование,Начало,Конец",Стр.Наименование,Стр.Начало,Стр.Конец));
    КонецЦикла;
    Возврат Рез;
КонецФункции

&НаКлиенте
Функция ПроверитьИнтервалы()
    Рез=Истина;
    Для Каждого Стр из ТаблицаИнтервалов Цикл
        Если Стр.Начало>Стр.Конец Тогда
            Сообщить("Интервал """+Стр.Наименование+""" имеет неверные границы",СтатусСообщения.Внимание);
            Рез=Ложь;
            Продолжить;
        КонецЕсли;
        Для Каждого Стр2 из ТаблицаИнтервалов Цикл
            Если Стр<>Стр2 и НЕ (Стр.Начало>Стр2.Конец или Стр.Конец<Стр2.Начало) Тогда
                Рез=Ложь;
                Сообщить("Интервал """+Стр.Наименование+""" пересекается с интервалом """+Стр2.Наименование+"""",СтатусСообщения.Внимание);
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
    Возврат Рез;
КонецФункции

&НаКлиенте
Процедура КомандаОК(Команда)
	Если ПроверитьИнтервалы() Тогда
		Мас=ТаблицуИнтерваловВМассив();
		ОповеститьОВыборе(Новый Структура("Команда,Данные","Интервал",Мас));
		//Закрыть(Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТаблицаИнтервалов.Очистить();
	Для Каждого Стр из Параметры.ТаблицаИнтервалов Цикл
	    ЗаполнитьЗначенияСвойств(ТаблицаИнтервалов.Добавить(),Стр);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИнтерваловПослеУдаления(Элемент)
	ПересчитатьГраницы();
КонецПроцедуры
