#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы

// Обработчик обновления УТ 11.1.2.0. 
// Устанавливает значение константы "ИспользоватьРолиПартнеровИКонтактныхЛицВСделкахИПроектах" в Истина,
// если в конфигурации указывались роли в сделках и проектах.
//
Процедура ЗаполнитьКонстантуИспользоватьРолиПартнеровИКонтактныхЛицВСделкахИПроектах() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() Тогда
		ЗначениеКонстанты = Ложь;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РолиПартнеровВСделкахИПроектах.Ссылка
		|ИЗ
		|	Справочник.РолиПартнеровВСделкахИПроектах КАК РолиПартнеровВСделкахИПроектах
		|ГДЕ
		|	НЕ РолиПартнеровВСделкахИПроектах.Предопределенный
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	РолиКонтактныхЛицВСделкахИПроектах.Ссылка
		|ИЗ
		|	Справочник.РолиКонтактныхЛицВСделкахИПроектах КАК РолиКонтактныхЛицВСделкахИПроектах
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТабличнаяЧасть.РольКонтактногоЛица
		|ИЗ
		|	Справочник.СделкиСКлиентами.ПартнерыИКонтактныеЛица КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.РольКонтактногоЛица <> ЗНАЧЕНИЕ(Справочник.РолиКонтактныхЛицВСделкахИПроектах.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТабличнаяЧасть.РольПартнера
		|ИЗ
		|	Справочник.СделкиСКлиентами.ПартнерыИКонтактныеЛица КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.РольПартнера <> ЗНАЧЕНИЕ(Справочник.РолиПартнеровВСделкахИПроектах.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТабличнаяЧасть.РольПартнера
		|ИЗ
		|	Справочник.МаркетинговыеМероприятия.ПартнерыИКонтактныеЛица КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.РольПартнера <> ЗНАЧЕНИЕ(Справочник.РолиПартнеровВСделкахИПроектах.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТабличнаяЧасть.РольПартнера
		|ИЗ
		|	Справочник.ПретензииКлиентов.ПартнерыИКонтактныеЛица КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.РольПартнера <> ЗНАЧЕНИЕ(Справочник.РолиПартнеровВСделкахИПроектах.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТабличнаяЧасть.РольПартнера
		|ИЗ
		|	Справочник.Проекты.ПартнерыИКонтактныеЛица КАК ТабличнаяЧасть
		|ГДЕ
		|	ТабличнаяЧасть.РольПартнера <> ЗНАЧЕНИЕ(Справочник.РолиПартнеровВСделкахИПроектах.ПустаяСсылка)";
		ЗначениеКонстанты = НЕ Запрос.Выполнить().Пустой();
	КонецЕсли;
	
	Константы.ИспользоватьРолиПартнеровИКонтактныхЛицВСделкахИПроектах.Установить(ЗначениеКонстанты);
	
КонецПроцедуры

#КонецЕсли

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)

	Результат = ПартнерыИКонтрагентыВызовСервера.РолиПартнеровВСделкахИПроектахДанныеВыбора(Параметры);
	
	Если Результат <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Результат;
	КонецЕсли;

КонецПроцедуры
