

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Доки = ПолучитьРеализации(ПараметрКоманды);
	//ASP_Dante 12/07/21 Задача 000011492 перенос доработок Исправление ошибки
	Если Доки.Количество() = 0 Тогда
		Сообщить("Таб часть документы не заполнен!");
		Возврат;
	КонецЕсли;
	//ASP_Dante 16/07/21
	Если ТипЗнч(Доки[0])=Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Документ.РеализацияТоваровУслуг",
			"Накладная",
			Доки,
			Неопределено,
			Новый Структура("ВыводитьКомплектующие", Истина)
		);
		ИначеЕсли ТипЗнч(Доки[0])=Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		//УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		//	"Документ.РеализацияТоваровУслуг",
		//	"Накладная",
		//	Доки,
		//	Неопределено,
		//	Новый Структура("ВыводитьКомплектующие", Истина)
		//);
		
		ВПФ = НайтиВПФ();
   		Если ВПФ.Пустая() Тогда
        Возврат;
    	КонецЕсли;
	    //ОбъектыНазначения = Новый Массив;
	    //ОбъектыНазначения.Добавить(ЭтотОбъект.Документ);
		ЭлементМассива=0;
		Пока ЭлементМассива < Доки.Количество() Цикл
	    ПараметрыОткрытия = Новый Структура("ИсточникДанных, ПараметрыИсточника");
	    ПараметрыОткрытия.ИсточникДанных = ВПФ;
	    ПараметрыОткрытия.ПараметрыИсточника = Новый Структура("ИдентификаторКоманды, ОбъектыНазначения");
	    ПараметрыОткрытия.ПараметрыИсточника.ИдентификаторКоманды = "ПеремещениеКомплект";
		Массив1 = Новый массив;
		Массив1.Добавить(Доки[ЭлементМассива]);
	    ПараметрыОткрытия.ПараметрыИсточника.ОбъектыНазначения = Массив1;
	    ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыОткрытия);    
		ЭлементМассива=ЭлементМассива+1;
		КонецЦикла;
		Иначе
		
	  	КонецЕсли;
			
			

КонецПроцедуры

&НаСервере
Функция ПолучитьРеализации(Заявка)
	Массив = Новый Массив;
	Для каждого Док из Заявка.Документы Цикл
		Массив.Добавить(Док.Документ);
	КонецЦикла;
	Возврат Массив;	
		
	
КонецФункции

&НаСервере
Функция НайтиВПФ()

   Возврат Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("Перемещение с комплектующими"); 
    
КонецФункции 