
&Вместо("ОбработатьЗаписьОбъектаВФорме")
Функция асп_ОбработатьЗаписьОбъектаВФорме(Форма, ПараметрыЗаписи, Отказ)

	ДействиеПослеЗаписи = Неопределено;
	Если ПараметрыЗаписи.Свойство("ДействиеПослеЗаписи", ДействиеПослеЗаписи) Тогда
		ПараметрыЗаписи.Удалить("ДействиеПослеЗаписи");
	КонецЕсли;

	Результат = Ложь;

	Если Отказ Тогда
		Возврат Результат;
	КонецЕсли;

	НачатьЗамерВремениЗаписиОбъекта(Форма, ПараметрыЗаписи);
	Форма.НеВыполнятьПроверкуПередЗаписью = Истина;

	Отказ = Истина;
	ПараметрыЗаписи.Вставить("ПринудительноЗакрытьФорму", Форма.ПринудительноЗакрытьФорму);
	ПараметрыЗаписи.Вставить("НовыйОбъект", Не ЗначениеЗаполнено(Форма.Объект.Ссылка));
	Попытка
	Результат = Форма.Записать(ПараметрыЗаписи);
    Исключение
	КонецПопытки;
	Форма.ПринудительноЗакрытьФорму = Ложь;
	Форма.НеВыполнятьПроверкуПередЗаписью = Ложь;

	Если Результат И ДействиеПослеЗаписи <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДействиеПослеЗаписи, Результат);
	КонецЕсли;

	Возврат Результат;

КонецФункции
