
&После("ОбработкаПроведения")
Процедура асп_ОбработкаПроведения(Отказ, РежимПроведения)
	//ASP_Lebedev_000020332_17/08/2023 Принудительная регистрация в узле обмена.
	ДатаКонтроля = Константы.ДатаКонтроляВыгрузкиДокументовВБП.Получить();
	ОбъектМодифицирован = ASP_Добавленный.СравнитьВерсииОбъекта(ЭтотОбъект); //000026792
	Если НЕ Отказ и ЭтотОбъект.Проведен и ЭтотОбъект.Дата > ДатаКонтроля и ОбъектМодифицирован Тогда         
		узел = ПланыОбмена.ОбменУправлениеТорговлейБухгалтерияПредприятия30.НайтиПоКоду("002");
		ПланыОбмена.ЗарегистрироватьИзменения(узел, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура асп_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Автор = Пользователи.ТекущийПользователь();
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);

	НеобходимаИнициализация = Истина;

	ПараметрыВыбораСтатейИАналитик = Документы.ЗаказПоставщику.ПараметрыВыбораСтатейИАналитик(ХозяйственнаяОперация);
	ДоходыИРасходыСервер.ОбработкаЗаполнения(ЭтотОбъект, ПараметрыВыбораСтатейИАналитик);

	Если ТипДанныхЗаполнения = Тип("Структура") Тогда

		Если ДанныеЗаполнения.Свойство("Основание") Тогда

			ТипОснования = ТипЗнч(ДанныеЗаполнения.Основание);

			#Удаление
			Если ТипОснования = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда

				ЗаполнитьДокументНаОснованииЗаявкиНаВозврат(ДанныеЗаполнения);
			#КонецУдаления	
			#Вставка
			//ASP_Crow 22.04.2026 000029567 Адаптация
			Если ТипОснования = Тип("ДокументСсылка.ЗаказКлиента") Тогда

				ЗаполнитьДокументНаОснованииЗаказаКлиента(ДанныеЗаполнения);
            ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда

				ЗаполнитьДокументНаОснованииЗаявкиНаВозврат(ДанныеЗаполнения);
			#КонецВставки	
			ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда

				ЗаполнитьДокументНаОснованииЗаказаНаПеремещение(ДанныеЗаполнения);

			ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказНаВнутреннееПотребление") Тогда

				ЗаполнитьДокументНаОснованииЗаказаНаВнутреннееПотребление(ДанныеЗаполнения);


			ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказНаСборку") Тогда

				ЗаполнитьДокументНаОснованииЗаказаНаСборку(ДанныеЗаполнения);

			КонецЕсли;

		Иначе

			ЗаполнитьДокументПоОтбору(ДанныеЗаполнения);

		КонецЕсли;


	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.Партнеры") Тогда

		ЗаполнитьДокументНаОснованииПартнера(ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.СоглашенияСПоставщиками") Тогда

		ЗаполнитьДокументНаОснованииСоглашенияСПоставщиком(ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда

		ЗаполнитьДокументНаОснованииДоговора(ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("СправочникСсылка.СделкиСКлиентами") Тогда

		ЗаполнитьДокументНаОснованииСделки(ДанныеЗаполнения);

	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ИзменениеАссортимента") Тогда

		ИнициализироватьДокумент(ДанныеЗаполнения);
		НеобходимаИнициализация = Ложь;
		ЗаполнитьДокументНаОснованииИзмененияАссортимента(ДанныеЗаполнения);

	КонецЕсли;

	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияКассыПриФОИспользоватьНесколькоКассЛожь", Ложь);
	ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияСчетаПриФОИспользоватьНесколькоСчетовЛожь", Ложь);

	ЗаказПоставщикуЛокализация.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);

	ЗначениеСклада = Склад;
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьРеквизитыОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	// При создании из ОбщаяФома.СозданиеНаОснованииУточнениеЗаказываемогоКоличества может осознанно быть пустым,
	// если в документ переносят данные по нескольким складам. Заполнение по статистике может заполнить это пустое значение,
	// нужно его очистить
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Основание") Тогда
		Склад = ЗначениеСклада;
	КонецЕсли;

	ОтветственныеЛицаСервер.УстановитьМенеджера(ЭтотОбъект);
	ЗаполнениеОбъектовПоСтатистике.ЗаполнитьПодчиненныеРеквизитыОбъекта(ЭтотОбъект, "Менеджер",, Истина);

	Если НеобходимаИнициализация Тогда
		ИнициализироватьДокумент(ДанныеЗаполнения);
	КонецЕсли;

	ВзаиморасчетыСервер.ОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения);

	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказКлиента") Или
		ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда

		Если ЗакупкаПодДеятельность <> НалогообложениеНДС Тогда

			СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ЭтотОбъект);

			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ЭтотОбъект, Истина));
			СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
			СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);

			ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Товары, СтруктураДействий, Неопределено);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
