
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресТаблицыОрганизаций = Параметры.АдресТаблицыОрганизаций;
	
	ТаблицаОрганизаций = ПолучитьИзВременногоХранилища(АдресТаблицыОрганизаций);
	Организации.Загрузить(ТаблицаОрганизаций);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ПеренестиВНастройку Тогда
		
		Результат = ПриЗакрытииНаСервере();
		
		Оповестить("ОрганизацииНастройки1ССверка", Результат, ЭтотОбъект.ВладелецФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПриЗакрытииНаСервере()
	
	ТаблицаОрганизаций = Новый ТаблицаЗначений();
	ТаблицаОрганизаций.Колонки.Добавить("Организация");
	Для Каждого ОрганизацияНастройки Из Организации Цикл
		Если ЗначениеЗаполнено(ОрганизацияНастройки.Организация) Тогда
			СтрокаТаблицы = ТаблицаОрганизаций.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ОрганизацияНастройки);
		КонецЕсли;
	КонецЦикла;
	
	АдресТаблицыОрганизаций = ПоместитьВоВременноеХранилище(ТаблицаОрганизаций, УникальныйИдентификатор);
	
	Возврат АдресТаблицыОрганизаций;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ПеренестиВНастройку = Истина;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти