Функция РасчетыВУсловныхЕдиницах(Соглашение) Экспорт
	
	Если ТипЗнч(Соглашение) = Тип("СправочникСсылка.СоглашенияСПоставщиками") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ИСТИНА КАК РасчетыВУсловныхЕдиницах
		                      |ИЗ
		                      |	Справочник.СоглашенияСПоставщиками КАК ДанныеСправочника
		                      |ГДЕ
		                      |	ДанныеСправочника.Ссылка = &Ссылка
		                      |	И ДанныеСправочника.ВалютаВзаиморасчетов.Код = ""643""");
		Запрос.УстановитьПараметр("Ссылка", Соглашение);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			РасчетыВУсловныхЕдиницах = Выборка.РасчетыВУсловныхЕдиницах;
		Иначе
			РасчетыВУсловныхЕдиницах = Ложь;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Соглашение) = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ИСТИНА КАК РасчетыВУсловныхЕдиницах
		                      |ИЗ
		                      |	Справочник.СоглашенияСКлиентами КАК ДанныеСправочника
		                      |ГДЕ
		                      |	ДанныеСправочника.Ссылка = &Ссылка
		                      |	И ДанныеСправочника.ВалютаВзаиморасчетов.Код = ""643""");
		Запрос.УстановитьПараметр("Ссылка", Соглашение);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			РасчетыВУсловныхЕдиницах = Выборка.РасчетыВУсловныхЕдиницах;
		Иначе
			РасчетыВУсловныхЕдиницах = Ложь;
		КонецЕсли;
		
	КонецЕсли;

	Возврат РасчетыВУсловныхЕдиницах;
	
КонецФункции

&ИзменениеИКонтроль("ВывестиПредупреждениеОЗавершенииПоддержкиОфлайнРасчетов")
Процедура асп_ВывестиПредупреждениеОЗавершенииПоддержкиОфлайнРасчетов(Макет)
	
	#Вставка
	Возврат;
	#КонецВставки
	
	Если Константы.НоваяАрхитектураВзаиморасчетов.Получить() Тогда
		Возврат;
	КонецЕсли;

	ТаблицаПредупреждение = Новый ТабличныйДокумент;
	ОбластьПредупреждение = ТаблицаПредупреждение.Область(1,1,1,1);

	МассивСтрок = Новый Массив;
	Если НЕ Пользователи.ЭтоПолноправныйПользователь() Тогда
		ТекстПредупреждения = НСтр("ru = 'В версии 2.5.27 завершена поддержка режима учета взаиморасчетов «офлайн».
		|При обновлении на 2.5.27 будет выполнен принудительный переход на новый режим учета взаиморасчетов «онлайн».
		|Рекомендуем выполнить переход заблаговременно, обратившись к администратору программы.
		|Режим взаиморасчетов «онлайн» содержит расширенные возможности, в нем выполнен ряд доработок. Подробнее можно ознакомиться'");
	Иначе
		ТекстПредупреждения = НСтр("ru = 'В версии 2.5.27 завершена поддержка режима учета взаиморасчетов «офлайн».
		|При обновлении на 2.5.27 будет выполнен принудительный переход на новый режим учета взаиморасчетов «онлайн». 
		|Рекомендуем выполнить переход заблаговременно по ссылке «НСИ и Администрирование» – «Казначейство и взаиморасчеты». 
		|Режим взаиморасчетов «онлайн» содержит расширенные возможности, в нем выполнен ряд доработок. Подробнее можно ознакомиться'");
	КонецЕсли;

	Если Константы.УправлениеТорговлей.Получить() Тогда
		ТекстПредупреждения = СтрЗаменить(ТекстПредупреждения, "2.5.27", "11.5.27");
	КонецЕсли;
	МассивСтрок.Добавить(ТекстПредупреждения);
	МассивСтрок.Добавить(" ");
	Если ПолучитьФункциональнуюОпцию("УправлениеТорговлей") Тогда
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("здесь",,,,"https://its.1c.ru/db/ut115doc#bookmark:Settlements:Modesofsettlement"));
	ИначеЕсли ПолучитьФункциональнуюОпцию("КомплекснаяАвтоматизация") Тогда
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("здесь",,,,"https://its.1c.ru/db/ka25doc/bookmark/Settlements/Settlements"));
	Иначе
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока("здесь",,,,"https://its.1c.ru/db/erp25doc#bookmark:Settlements:Modesofsettlement"));
	КонецЕсли;
	МассивСтрок.Добавить(".");

	ОбластьПредупреждение.Текст = Новый ФорматированнаяСтрока(МассивСтрок);
	ОбластьПредупреждение.ЦветТекста = ЦветаСтиля.ЦветОтрицательногоЧисла;
	Макет.ВставитьОбласть(ТаблицаПредупреждение.Область(1,1,1,1), Макет.Область(1,1,1,1), ТипСмещенияТабличногоДокумента.ПоВертикали);

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьДанныеВыбораОснованияПлатежа")
Процедура асп_ЗаполнитьДанныеВыбораОснованияПлатежа(ДанныеВыбора, СтруктураОтбора, ВводПоСтроке, ЭтоУИП)

	Запрос = Новый Запрос;

	ИспользоватьДоговорыМеждуОрганизациями = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыМеждуОрганизациями");
	ЭтоРасчетыСКлиентом = СтруктураОтбора.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;

	Запрос.УстановитьПараметр("Организация", СтруктураОтбора.Организация);
	Запрос.УстановитьПараметр("УчитыватьФилиалы", СтруктураОтбора.УчитыватьФилиалы);

	ОтборТиповРасчетовДляДоговоров = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтруктураОтбора.ТипРасчетов);
	ОтборТиповРасчетовДляДоговоров.Добавить(Перечисления.ТипыРасчетовСПартнерами.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипыРасчетовДоговоров", ОтборТиповРасчетовДляДоговоров);
	СписокТиповДоговоров = ?(ЭтоРасчетыСКлиентом, 
	ВзаиморасчетыКлиентСервер.ТипыДоговоровСКлиентом(),
	ВзаиморасчетыКлиентСервер.ТипыДоговоровСПоставщиком());
	Запрос.УстановитьПараметр("ТипыДоговоров", СписокТиповДоговоров.ВыгрузитьЗначения());

	ТекстЗапросаВтМеждуОрганизациями = "";
	Если ЗначениеЗаполнено(СтруктураОтбора.Контрагент) Тогда
		Запрос.УстановитьПараметр("Контрагент", СтруктураОтбора.Контрагент);
		Запрос.УстановитьПараметр("ПоВсемКонтрагентам", Ложь);
		Если ИспользоватьДоговорыМеждуОрганизациями Тогда
			ТекстЗапросаВтМеждуОрганизациями = "
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Организации.Ссылка КАК Ссылка
			|ПОМЕСТИТЬ ВтОтборМеждуОрганизациями
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.Ссылка В (&Контрагент)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Организации.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Организации КАК Организации
			|ГДЕ
			|	Организации.ГоловнаяОрганизация В (&Контрагент)
			|	И Организации.ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию
			|;
			|";
		КонецЕсли;
	КонецЕсли;
	
	#Удаление
	Если СтруктураОтбора.ТипыОснований.Количество() > 0 Тогда
		Запрос.УстановитьПараметр("ТипыОснований", СтруктураОтбора.ТипыОснований);
	КонецЕсли; 
	#КонецУдаления
	
	#Вставка 
	///++ASP_Куренков 000031060 20.07.2026 
	Если СтруктураОтбора.ТипыОснований.Количество() > 0 Тогда
		ТипыОснований = Новый Массив;
		Для Каждого ТипОснования Из СтруктураОтбора.ТипыОснований Цикл
			МетаданныеТипа = Метаданные.НайтиПоТипу(ТипОснования);
			Если МетаданныеТипа <> Неопределено Тогда
				ТипыОснований.Добавить(МетаданныеТипа.ПолноеИмя());
			КонецЕсли;
		КонецЦикла;
		Запрос.УстановитьПараметр("ТипыОснований", ИдентификаторыТиповПоПолнымИменам(ТипыОснований));
	КонецЕсли; 
	//--ASP_Куренков 000031060 20.07.2026 
	#КонецВставки

	Запрос.УстановитьПараметр("ПодборДебиторскойЗадолженности", СтруктураОтбора.ПодборДебиторскойЗадолженности);

	Если ЗначениеЗаполнено(СтруктураОтбора.Текст) Тогда
		Если ВводПоСтроке Тогда
			Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтруктураОтбора.Текст + "%");
		Иначе
			Запрос.УстановитьПараметр("СтрокаПоиска", СтруктураОтбора.Текст);
		КонецЕсли;
	КонецЕсли;

	ТекстыЗапросов = Новый Массив;

	// По реестру документов
	ТекстЗапроса = ТекстЗапросаВыбораОснованияПлатежа(ВводПоСтроке, СтруктураОтбора, Ложь, ЭтоРасчетыСКлиентом, ЭтоУИП, 0);
	ТекстыЗапросов.Добавить(ТекстЗапроса);

	// По договорам контрагентов
	ТекстЗапроса = ТекстЗапросаВыбораОснованияПлатежа(ВводПоСтроке, СтруктураОтбора, Ложь, ЭтоРасчетыСКлиентом, ЭтоУИП, 1);
	ТекстыЗапросов.Добавить(ТекстЗапроса);

	// По договорам между организациями
	Если ИспользоватьДоговорыМеждуОрганизациями Тогда
		ТекстЗапроса = ТекстЗапросаВыбораОснованияПлатежа(ВводПоСтроке, СтруктураОтбора, Ложь, ЭтоРасчетыСКлиентом, ЭтоУИП, 2);
		ТекстыЗапросов.Добавить(ТекстЗапроса);
	КонецЕсли;

	Запрос.Текст = ТекстЗапросаВременныхТаблицДанныхВыбора() 
	+ ТекстЗапросаВтМеждуОрганизациями
	+ СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ЗначениеВыбора = СтруктураЗначениеВыбора();
		ЗаполнитьЗначенияСвойств(ЗначениеВыбора, Выборка);
		Если Не ЗначениеЗаполнено(ЗначениеВыбора.ОбъектРасчетов) Тогда
			ДополнитьСтруктуруОбъектомРасчетовИВалютойВзаиморасчетов(ЗначениеВыбора);
		КонецЕсли;

		ДанныеВыбора.Добавить(
		Новый Структура("Значение, ПометкаУдаления", 
		ЗначениеВыбора, 
		Выборка.Состояние = 2),
		Строка(Выборка.ОснованиеПлатежа));

	КонецЦикла;

	Если ВводПоСтроке Тогда
		ДанныеВыбора.СортироватьПоПредставлению();
		Счетчик = ДанныеВыбора.Количество();
		Пока Счетчик > 10 Цикл
			Счетчик = Счетчик - 1;
			ДанныеВыбора.Удалить(Счетчик);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
