
&НаКлиенте
Перем ВключенаГрупповаяРабота;

&НаСервереБезКонтекста
Функция ПолучитьПустыеСсылки(лШаблон)
	Ответ=Новый Структура("Старый,Новый,Создавать");
	Ответ.Старый=Документы[лШаблон.ВидДокумента].Пустаяссылка();
	Ответ.Новый=Ответ.Старый;
	Если СокрЛП(лШаблон.ВидДокументаНового)<>"" тогда
		Ответ.Новый=Документы[лШаблон.ВидДокументаНового].Пустаяссылка();
		Ответ.Создавать=Истина;
	Иначе	
		Ответ.Создавать=Ложь;
	КонецЕсли;	
	Возврат Ответ;
КонецФункции	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ИсходныйДокумент.ТолькоПросмотр=Объект.Шаблон.Пустая();
	
	Элементы.грДокументы.Видимость = ЭтоШаблонНесколькоДокументов(Объект.Шаблон) И НЕ ЗначениеЗаполнено(Объект.РодительскийДокумент);
	Элементы.ИсходныйДокумент.Видимость = НЕ ЭтоШаблонНесколькоДокументов(Объект.Шаблон) ИЛИ ЗначениеЗаполнено(Объект.РодительскийДокумент);
	Элементы.НовыйДокумент.Видимость = НЕ ЭтоШаблонНесколькоДокументов(Объект.Шаблон) ИЛИ ЗначениеЗаполнено(Объект.РодительскийДокумент);
	
	
	Элементы.грДокументы2.Видимость = ЭтоШаблонМножествоДокументов(Объект.Шаблон);
	Если ЭтоШаблонМножествоДокументов(Объект.Шаблон) тогда
		Элементы.ИсходныйДокумент.Видимость = Ложь;
		Элементы.НовыйДокумент.Видимость = Ложь;		
	КонецЕсли;
	
	Элементы.СкладПолучатель.Видимость = ЭтоШаблонНесколькоСкладов(Объект.Шаблон); 
	
	ВключенаГрупповаяРабота = РеквизитГрупповаяРабота(Объект.Шаблон);
	ИзменитьВидимостьВкладокПодборРазмещение();
	
КонецПроцедуры

&НаКлиенте
Процедура ТСДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыОткрытияФормы = Новый Структура; 
	ПараметрыОткрытияФормы.Вставить("РежимВыбора", Истина);  
	ОткрытьФорму("ПланОбмена.ДатаМобайл_СписокТСД.Форма.ФормаСпискаУправляемая", ПараметрыОткрытияФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДатаМобайл_ВыборТСД" Тогда
		Объект.ТСД = ПолучитьТСДПоКоду(Параметр);
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТСДПоКоду(Код) 
	
	Возврат ПланыОбмена.ДатаМобайл_СписокТСД.НайтиПоКоду(Код);
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.ИсходныйДокумент=Неопределено тогда
		Если Не Объект.Шаблон.Пустая() тогда
			Объект.ИсходныйДокумент=Документы[Объект.Шаблон.ВидДокумента].Пустаяссылка();
		КонецЕсли;	
	КонецЕсли;
	
	Попытка
		Если СокрЛП(Объект.Шаблон.ВидДокументаНового)="" или Объект.Шаблон.БыстраяПриемка или Объект.Шаблон.БыстраяОтгрузка  тогда//старая схема
			Элементы.НовыйДокумент.ТолькоПросмотр=Истина; 
		Иначе	
			Элементы.НовыйДокумент.ТолькоПросмотр=Ложь;
			Если Объект.НовыйДокумент=Неопределено тогда
				Если Не Объект.Шаблон.Пустая() тогда
					Объект.НовыйДокумент=Документы[Объект.Шаблон.ВидДокументаНового].Пустаяссылка();
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	Исключение 
	КонецПопытки;

	
КонецПроцедуры

&НаСервере
Функция ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТЧ = ТекущийОбъект.СписокТерминалов.Выгрузить();
	
	Для каждого СтрокаТЧ из ТЧ цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ТСД) Тогда
			Сообщить("На закладке ""Список терминалов"" не указан конкретный терминал!");
			Отказ = истина;
		КонецЕсли;			
	КонецЦикла;	
		
	Возврат Отказ;

КонецФункции

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	
	Если Не Объект.Шаблон.Пустая() тогда
		ПустыеСсылки=ПолучитьПустыеСсылки(Объект.Шаблон);
		Если ТипЗнч(Объект.ИсходныйДокумент)<>ТипЗнч(ПустыеСсылки.Старый) тогда
			Объект.ИсходныйДокумент=ПустыеСсылки.Старый;
			Элементы.ИсходныйДокумент.ВыбиратьТип=Ложь;
		КонецЕсли;	
		Если ТипЗнч(Объект.НовыйДокумент)<>ТипЗнч(ПустыеСсылки.Новый) тогда
			Объект.НовыйДокумент=ПустыеСсылки.Новый;
			Элементы.НовыйДокумент.ВыбиратьТип=Ложь;
		КонецЕсли;	
		Элементы.НовыйДокумент.ТолькоПросмотр=Не ПустыеСсылки.Создавать;
	Иначе	
		Объект.ИсходныйДокумент=Неопределено;
		Объект.НовыйДокумент=Неопределено;
		Элементы.ИсходныйДокумент.ВыбиратьТип=Истина;
		Элементы.НовыйДокумент.ВыбиратьТип=Истина;
		Элементы.НовыйДокумент.ТолькоПросмотр=Ложь;
	КонецЕсли;	
	Элементы.ИсходныйДокумент.ТолькоПросмотр=Объект.Шаблон.Пустая();
	
	Элементы.грДокументы.Видимость = ЭтоШаблонНесколькоДокументов(Объект.Шаблон) И НЕ ЗначениеЗаполнено(Объект.РодительскийДокумент);
	Элементы.ИсходныйДокумент.Видимость = НЕ ЭтоШаблонНесколькоДокументов(Объект.Шаблон) ИЛИ ЗначениеЗаполнено(Объект.РодительскийДокумент);
	Элементы.НовыйДокумент.Видимость = НЕ ЭтоШаблонНесколькоДокументов(Объект.Шаблон) ИЛИ ЗначениеЗаполнено(Объект.РодительскийДокумент);

	Элементы.грДокументы2.Видимость = ЭтоШаблонМножествоДокументов(Объект.Шаблон);
	Если ЭтоШаблонМножествоДокументов(Объект.Шаблон) тогда
		Элементы.ИсходныйДокумент.Видимость = Ложь;
		Элементы.НовыйДокумент.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СкладПолучатель.Видимость = ЭтоШаблонНесколькоСкладов(Объект.Шаблон);
	
	ВключенаГрупповаяРабота = РеквизитГрупповаяРабота(Объект.Шаблон);
	ИзменитьВидимостьВкладокПодборРазмещение();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УжеЕсть(лСсылка,лИсходныйДокумент)
	Если лИсходныйДокумент<>Неопределено тогда
		Если не лИсходныйДокумент.Пустая() тогда
			Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДатаМобайл_ДокументыТСД.Ссылка
			|ИЗ
			|	Справочник.ДатаМобайл_ДокументыТСД КАК ДатаМобайл_ДокументыТСД
			|ГДЕ
			|	ДатаМобайл_ДокументыТСД.ИсходныйДокумент = &ИсходныйДокумент
			|	И ДатаМобайл_ДокументыТСД.Ссылка <> &Ссылка");
			Запрос.УстановитьПараметр("Ссылка",лСсылка);
			Запрос.УстановитьПараметр("ИсходныйДокумент",лИсходныйДокумент);
			Рез=Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Возврат Ложь;
КонецФункции

&НаСервереБезКонтекста
Функция ПомеченНаУдаление(лИсходныйДокумент)
	Если лИсходныйДокумент<>Неопределено тогда
		Если не лИсходныйДокумент.Пустая() тогда
			Если лИсходныйДокумент.ПометкаУдаления тогда
				Возврат Истина;
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура ЗаписатьФорму(Команда)
	Записать(Новый Структура("ЭтоЗапись"));
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если УжеЕсть(Объект.Ссылка,Объект.ИсходныйДокумент) тогда
		Если Не ПараметрыЗаписи.Свойство("ВопросЗадан") Тогда
			Отказ = Истина;
			Оповещение = Новый ОписаниеОповещения("ПоказатьВопросЗавершение", ЭтаФорма, ПараметрыЗаписи);
			ТекстВопроса = "Для документа "+Объект.ИсходныйДокумент+" уже создан документ ТСД. Продолжить?";
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
		КонецЕсли;
	КонецЕсли;
	
	Если ПомеченНаУдаление(Объект.ИсходныйДокумент) тогда
		Если Не ПараметрыЗаписи.Свойство("ВопросЗаданУдаление") Тогда
			Отказ = Истина;
			Оповещение = Новый ОписаниеОповещения("ПоказатьВопросУдалениеЗавершение", ЭтаФорма, ПараметрыЗаписи);
			ТекстВопроса = "Документ "+Объект.ИсходныйДокумент+" помечен на удаление. Продолжить?";
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
		КонецЕсли;
	КонецЕсли;

	//Запрос в ЦРПТ приёмка
	Попытка
		ПроверкаКлючаИЗапросВСервис();	
	Исключение
	КонецПопытки; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросЗавершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("ВопросЗадан", Истина);
		
		Если Записать(ПараметрыЗаписи) Тогда
			Если Не ПараметрыЗаписи.Свойство("ЭтоЗапись") Тогда
				Закрыть();
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросУдалениеЗавершение(Результат, ПараметрыЗаписи) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("ВопросЗаданУдаление", Истина);
		
		Если Записать(ПараметрыЗаписи) Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаКлючаИЗапросВСервис()
	
	СсылкаНаДокВСервис 	= Объект.ИсходныйДокумент;
	Шаблон 				= Объект.Шаблон;
	ЭтоТабак 			= Ложь;
	
	Если СсылкаНаДокВСервис.Пустая() Или Не ПроверитьТребуетсяВыгрузкаМарок(Объект.ИсходныйДокумент, Объект.Шаблон) Или Не ТребуетсяЗапросВЦРПТ(Шаблон) Тогда
		Возврат;	
	КонецЕсли; 
	
	ВидМаркируемойПродукцииДокументаМассив 	= ДатаМобайл_Маркировка.ПолучитьВидПродукцииИСДокумента(СсылкаНаДокВСервис);
	ВидМаркируемойПродукцииДокумента 		= ВидМаркируемойПродукцииДокументаМассив[0];
	
	Если ВидМаркируемойПродукцииДокумента = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	Организация = ПолучитьОрганизациюПоДокументу(СсылкаНаДокВСервис);
	
	Если ТребуетсяОбновлениеКлючаСессии(Организация, ЭтоТабак, ВидМаркируемойПродукцииДокумента) Тогда
		
		Модуь_ИнтерфейсАвторизацииИСМПКлиент = ОбщийМодуль("ИнтерфейсАвторизацииИСМПКлиент");
		Модуь_ИнтерфейсМОТПКлиентСервер = ?(ЭтоТабак, ОбщийМодуль("ИнтерфейсМОТПКлиентСервер"), ОбщийМодуль("ИнтерфейсИСМПКлиентСервер"));
		
		Модуь_ИнтерфейсАвторизацииИСМПКлиент.ЗапроситьКлючСессии(Модуь_ИнтерфейсМОТПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
		
		Сообщить("Не получилось обновить ключ сессии. Проверьте настройки подключения к ИС.", СтатусСообщения.ОченьВажное);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОбщийМодуль(Имя) Экспорт
	
	Модуль = Вычислить(Имя);
	
#Если Не ВебКлиент Тогда
	
	// В веб-клиенте не проверяется
	// т.к. при обращении к модулям с вызовом сервера типа такого модуля в веб-клиенте не существует.
	
	Если Имя <> "СтроковыеФункцииКлиентСервер" тогда
		Модуль_СтроковыеФункцииКлиентСервер = ОбщийМодуль("СтроковыеФункцииКлиентСервер");
	КонецЕсли;
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		Если Имя <> "СтроковыеФункцииКлиентСервер" тогда
			ВызватьИсключение Модуль_СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Общий модуль ""%1"" не найден.'"), 
			Имя);
		Иначе
			ВызватьИсключение НСтр("ru = 'Неизвестное имя общего модуля - СтроковыеФункцииКлиентСервер. Обратитесь к разработчикам программы.'");			
		КонецЕсли;	
	КонецЕсли;
	
#КонецЕсли
	
	Возврат Модуль;
	
КонецФункции


&НаСервере
Функция ПолучитьОрганизациюПоДокументу(СсылкаНаДокВСервис)
	
	Организация = Неопределено;
	
	Попытка
		Организация = СсылкаНаДокВСервис.Организация;	
	Исключение
	КонецПопытки;
	
	Возврат Организация;
	
КонецФункции
 
&НаСервере
Функция ТребуетсяОбновлениеКлючаСессии(Организация, ЭтоТабак, ВидМаркируемойПродукцииДокумента)
	
	ТребуетсяОбновлениеКлючаСессии = Истина;
	
	Модуь_ИнтерфейсАвторизацииИСМПВызовСервера = ДатаМобайл_Маркировка.ОбщийМодуль("ИнтерфейсАвторизацииИСМПВызовСервера");
	Модуь_ИнтерфейсИСМПКлиентСервер = ДатаМобайл_Маркировка.ОбщийМодуль("ИнтерфейсИСМПКлиентСервер");
	Модуь_ИнтерфейсМОТПКлиентСервер = ДатаМобайл_Маркировка.ОбщийМодуль("ИнтерфейсМОТПКлиентСервер");
	
	Если Модуь_ИнтерфейсАвторизацииИСМПВызовСервера = Неопределено Тогда
		Сообщить("Конфигурация 1С не поддерживает работу с Маркировкой", 
		СтатусСообщения.ОченьВажное);
		Возврат ТребуетсяОбновлениеКлючаСессии;
	КонецЕсли;
	
	//Табак
	Если ДатаМобайл_Маркировка.ЭтоТабакПоВидыПродукцииИС(ВидМаркируемойПродукцииДокумента) Тогда		
		ТребуетсяОбновлениеКлючаСессии = Модуь_ИнтерфейсАвторизацииИСМПВызовСервера.ТребуетсяОбновлениеКлючаСессии(
		Модуь_ИнтерфейсМОТПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));
		ЭтоТабак = Истина;
	Иначе
		ТребуетсяОбновлениеКлючаСессии = Модуь_ИнтерфейсАвторизацииИСМПВызовСервера.ТребуетсяОбновлениеКлючаСессии(
		Модуь_ИнтерфейсИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии(Организация));	
	КонецЕсли;
	
	Возврат ТребуетсяОбновлениеКлючаСессии;
	
КонецФункции
 
&НаСервере
Функция ТребуетсяЗапросВЦРПТ(Шаблон)
	
	Если Шаблон.МаркировкаЗапросВЦРПТ И Шаблон.ИспользоватьМаркировку Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьТребуетсяВыгрузкаМарок(ИсходныйДокумент, Шаблон)

	ВидДокумента = Шаблон.ВидДокумента;
	
	Если ВидДокумента = "ПриобретениеТоваровУслуг" 
		или ВидДокумента = "ПриемкаТоваровИСМП" Тогда
		
		Возврат Истина;

	ИначеЕсли ВидДокумента = "ВозвратТоваровОтКлиента"	Тогда
		
		МаркиУказаныПоставщиком = Ложь;

		Если ИсходныйДокумент.ШтрихкодыУпаковок.Количество()>0 Тогда
			МаркиУказаныПоставщиком = Истина;
		КонецЕсли;
		
		Если МаркиУказаныПоставщиком тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
		
	ИначеЕсли ВидДокумента = "УведомлениеОПриемкеМДЛП" Тогда
		ПрямойАкцепт = Ложь;
		Попытка 
			Если ИсходныйДокумент.СхемаАкцептования = Перечисления.СхемыАкцептованияМДЛП.ПрямойПорядок тогда
				ПрямойАкцепт = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		Если ПрямойАкцепт тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;	
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // ()

&НаКлиенте
Процедура СсылкаНаИзображениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Выбрать();

	Если Диалог.ПолноеИмяФайла <> "" Тогда
		Объект.СсылкаНаИзображение = Диалог.ПолноеИмяФайла;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаИзображениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	ЗапуститьПриложение(Объект.СсылкаНаИзображение);

КонецПроцедуры

&НаКлиенте
Процедура СобранныеДанныеПриемкаСсылкаНаИзображениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Выбрать();

	Если Диалог.ПолноеИмяФайла <> "" Тогда
		Элементы.СобранныеДанныеПриемка.ТекущиеДанные.СсылкаНаИзображение = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СобранныеДанныеПриемкаСсылкаНаИзображениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	ЗапуститьПриложение(Элементы.СобранныеДанныеПриемка.ТекущиеДанные.СсылкаНаИзображение);
	
КонецПроцедуры

&НаКлиенте
Процедура СобранныеДанныеПодборСсылкаНаИзображениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Выбрать();

	Если Диалог.ПолноеИмяФайла <> "" Тогда
		Элементы.СобранныеДанныеПодбор.ТекущиеДанные.СсылкаНаИзображение = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СобранныеДанныеПодборСсылкаНаИзображениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	ЗапуститьПриложение(Элементы.СобранныеДанныеПодбор.ТекущиеДанные.СсылкаНаИзображение);
	
КонецПроцедуры

&НаКлиенте
Процедура СобранныеДанныеПодборПередУдалением(Элемент, Отказ)
	ДатаМобайл_ОбщийМодуль.УдалитьЗначениеФормыПоСтроке(Объект.Ссылка, Элемент.ТекущиеДанные.ИдентификаторСтроки);
КонецПроцедуры

&НаКлиенте
Процедура СобранныеДанныеПриемкаПередУдалением(Элемент, Отказ)
	ДатаМобайл_ОбщийМодуль.УдалитьЗначениеФормыПоСтроке(Объект.Ссылка, Элемент.ТекущиеДанные.ИдентификаторСтроки);
КонецПроцедуры



//ГРУППОВОЙ ДОКУМЕНТ
&НаКлиенте
Процедура СписокДокументовПриАктивизацииЯчейки(Элемент)
	
	ТД=Элементы.СписокДокументов.ТекущиеДанные;
	ПустыеСсылки=ПолучитьПустыеСсылки(Объект.Шаблон);

	Если ТД=Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СписокДокументовИсходныйДокумент.ВыбиратьТип=Ложь;

	Если НЕ ЗначениеЗаполнено(ТД.ИсходныйДокумент) тогда
		ТД.ИсходныйДокумент=ПустыеСсылки.Старый;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоШаблонНесколькоДокументов(лШаблон)	
	Возврат лШаблон.ГрупповойДокумент;
КонецФункции	

&НаСервереБезКонтекста
Функция ЭтоШаблонМножествоДокументов(лШаблон)	
	Ответ = Ложь;
	
	Если лШаблон.ИспользоватьГрупповойДокумент И лШаблон.МножествоДокументовКакЗадание Тогда
		Ответ = Истина;			
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоШаблонНесколькоСкладов(лШаблон)	
	Возврат лШаблон.ИспользоватьВторойСклад;
КонецФункции


&НаКлиенте
Процедура СписокДокументовПередУдалением(Элемент, Отказ)
	
	УдалитьДочернийДокументНаСервере(Элемент.ТекущиеДанные.ДокументТСД);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДочернийДокументНаСервере(ДочернийДокумент)
	
	Если ЗначениеЗаполнено(ДочернийДокумент) тогда
		Попытка
			ДочернийДокументОбъект = ДочернийДокумент.ПолучитьОбъект();
			ДочернийДокументОбъект.Удалить();
		Исключение
		КонецПопытки;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовИсходныйДокументОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	

	Если ЕстьДокументвТЧ(ВыбранноеЗначение) тогда
		СтандартнаяОбработка=Ложь;
		Сообщить("Документ: "+ВыбранноеЗначение+" уже был добавлен в список ранее. ");
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(Элементы.СписокДокументов.ТекущиеДанные.ДокументТСД) тогда
		СтандартнаяОбработка=Ложь;
		Сообщить("Для документа: "+Элементы.СписокДокументов.ТекущиеДанные.ИсходныйДокумент+" уже создан документ ТСД, изменение невозможно ");
	КонецЕсли;	
	
	
КонецПроцедуры

&НаСервере
Функция ЕстьДокументвТЧ(лИсходныйДокумент)
	
	Возврат Объект.СписокДокументов.НайтиСтроки(Новый Структура("ИсходныйДокумент", лИсходныйДокумент)).Количество() > 0; 
	
КонецФункции

&НаСервере
Функция ЕстьДокументвТЧЗадания(лИсходныйДокумент)
	
	Возврат Объект.Задания.НайтиСтроки(Новый Структура("Задание", лИсходныйДокумент)).Количество() > 0; 
	
КонецФункции


&НаКлиенте
Процедура ДобавитьНесколько(Команда)
	
	Если ЗначениеЗаполнено(Объект.Шаблон) тогда		
		ПараметрыПодбора=Новый Структура;
		ПараметрыПодбора.Вставить("МножественныйВыбор", Истина);
		ПараметрыПодбора.Вставить("ЗакрыватьПриВыборе", Истина);

		ВидДокумента=ВидДокумента(Объект.Шаблон);
		ОткрытьФорму("Документ."+ВидДокумента+".ФормаВыбора",ПараметрыПодбора,Элементы.СписокДокументов);
	Иначе
		Сообщить("Не выбран шаблон");
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьМультиЗадание(Команда)
	
	Если ЗначениеЗаполнено(Объект.Шаблон) тогда		
		ПараметрыПодбора=Новый Структура;
		ПараметрыПодбора.Вставить("МножественныйВыбор", Истина);
		ПараметрыПодбора.Вставить("ЗакрыватьПриВыборе", Истина);

		ВидДокумента=ВидДокумента(Объект.Шаблон);
		ОткрытьФорму("Документ."+ВидДокумента+".ФормаВыбора",ПараметрыПодбора,Элементы.Задания);
	Иначе
		Сообщить("Не выбран шаблон");
		Возврат;
	КонецЕсли;

КонецПроцедуры


&НаСервереБезКонтекста
Функция ВидДокумента(Шаблон);
	ВидДокумента=Шаблон.ВидДокумента;
	Возврат ВидДокумента;
КонецФункции

&НаКлиенте
Процедура СписокДокументовОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	Для каждого лИсходныйДокумент из ВыбранноеЗначение цикл
		Если ЕстьДокументвТЧ(лИсходныйДокумент) тогда
			Сообщить("Документ: "+лИсходныйДокумент+" уже был добавлен в список ранее. ");
		Иначе	
			СтрокаТЧ = Объект.СписокДокументов.Добавить();
			СтрокаТЧ.ИсходныйДокумент = лИсходныйДокумент;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ЗаданияПриИзменении(Элемент)
	Попытка
		ЗаполнитьСкладыИКонтрагентыПоДокументам();
		Если Объект.Задания.Количество() > 0 Тогда
			Объект.Склад = Объект.Задания[0].Склад;
			Объект.Клиент = Объект.Задания[0].Контрагент;
		КонецЕсли;
		
	Исключение 
		Сообщить("Не удалось заполнить склады и контрагенты по вложенным документам. ");
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСкладыИКонтрагентыПоДокументам()
	
	ТЧ = Объект.Задания;
	
	Для каждого Стр из ТЧ Цикл
		
		ТекущийИсходныйДокумент = Стр.Задание;
	
		Попытка	
			
			попытка Стр.Контрагент=ТекущийИсходныйДокумент.Партнер;  Исключение КонецПопытки;

			Если Не ЗначениеЗаполнено(Стр.Контрагент) тогда
				попытка Стр.Контрагент=ТекущийИсходныйДокумент.Получатель;  Исключение КонецПопытки;
			КонецЕсли;

			Если Не ЗначениеЗаполнено(Стр.Контрагент) тогда
				попытка Стр.Контрагент=ТекущийИсходныйДокумент.Распоряжение.Партнер;  Исключение КонецПопытки;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Стр.Контрагент) тогда
				попытка Стр.Контрагент=ТекущийИсходныйДокумент.Распоряжение.Отправитель;  Исключение КонецПопытки;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Стр.Контрагент) тогда
				попытка Стр.Контрагент=ТекущийИсходныйДокумент.Распоряжение.Получатель;  Исключение КонецПопытки;
			КонецЕсли;
			
			
			Если Не ЗначениеЗаполнено(Стр.Контрагент) тогда
				попытка Стр.Контрагент=ТекущийИсходныйДокумент.Отправитель;  Исключение КонецПопытки;
			КонецЕсли;		
			
		Исключение
		КонецПопытки;
		
		Попытка
			Если ТипЗнч(ТекущийИсходныйДокумент) = Тип("ДокументСсылка.ПеремещениеТоваров") ИЛИ
				ТипЗнч(ТекущийИсходныйДокумент) = Тип("ДокументСсылка.ДвижениеПродукцииИМатериалов") Тогда					
				Если Не ЗначениеЗаполнено(Стр.Контрагент) тогда
					попытка Стр.Контрагент=ТекущийИсходныйДокумент.СкладПолучатель;  Исключение КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Стр.Контрагент) тогда
					попытка Стр.Контрагент=ТекущийИсходныйДокумент.Получатель;  Исключение КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Стр.Контрагент) тогда
					попытка Стр.Контрагент=ТекущийИсходныйДокумент.Получатель;  Исключение КонецПопытки;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Стр.Склад) тогда
					попытка Стр.Склад=ТекущийИсходныйДокумент.Отправитель;  Исключение КонецПопытки;
				КонецЕсли;		
			КонецЕсли;
		Исключение
		КонецПопытки;

		
		Попытка
			Попытка Стр.Склад=ТекущийИсходныйДокумент.Склад;  Исключение КонецПопытки;

			Если Не ЗначениеЗаполнено(Стр.Склад) тогда
				Попытка Стр.Склад=ТекущийИсходныйДокумент.ТорговыйОбъект;  Исключение КонецПопытки;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Стр.Склад) тогда
				Попытка Стр.Склад=ТекущийИсходныйДокумент.Помещение.Владелец;  Исключение КонецПопытки;
			КонецЕсли;
			
			
			Если Не ЗначениеЗаполнено(Стр.Склад) тогда
				Попытка Склад=ТекущийИсходныйДокумент.СкладОтправитель;  Исключение КонецПопытки;
			КонецЕсли;		
		Исключение
		КонецПопытки;
		
		Попытка
			//При создании группового документа ТСД с видом исходного документа «Расходный ордер на товары» 
			//необходимо изменять статус всех исходных документов с «К проверке» на «В процессе проверки».
			Если ТипЗнч(ТекущийИсходныйДокумент) = Тип("ДокументСсылка.РасходныйОрдерНаТовары") тогда	
				Если ТекущийИсходныйДокумент.Статус = Перечисления.СтатусыРасходныхОрдеров.КПроверке тогда
					ТекущийИсходныйДокументОбъект = ТекущийИсходныйДокумент.ПолучитьОбъект();
					ТекущийИсходныйДокументОбъект.Статус = Перечисления.СтатусыРасходныхОрдеров.ВПроцессеПроверки;
					ТекущийИсходныйДокументОбъект.Записать();
				КонецЕсли;
			КонецЕсли;			
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	
	
КонецПроцедуры

Функция ПолучитьРаспоряжение(ОбъектДок)  
	
	Ответ = Справочники.Контрагенты.ПустаяСсылка();
	
	Если ОбъектДок.ТоварыПоРаспоряжениям.Количество() > 0 Тогда
		
		Если ОбъектДок.ТоварыПоРаспоряжениям[0].Распоряжение.Метаданные().Реквизиты.Найти("Контрагент") <>  Неопределено Тогда			
			Ответ = ОбъектДок.ТоварыПоРаспоряжениям[0].Распоряжение.Контрагент; 				
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции


&НаКлиенте
Процедура ЗаданияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	
	Для каждого лИсходныйДокумент из ВыбранноеЗначение цикл
		Если ЕстьДокументвТЧЗадания(лИсходныйДокумент) тогда
			Сообщить("Документ: "+лИсходныйДокумент+" уже был добавлен в список ранее. ");
		Иначе	
			СтрокаТЧ = Объект.Задания.Добавить();
			СтрокаТЧ.Задание = лИсходныйДокумент;
			ЗаполнитьСкладыИКонтрагентыПоДокументам();
			
			Если Объект.Задания.Количество() > 0 Тогда
				Объект.Склад = Объект.Задания[0].Склад;
				Объект.Клиент = Объект.Задания[0].Контрагент;
			КонецЕсли;

		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ПомещениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ЗакрытиеВыбораПомещения", ЭтотОбъект),ПолучитьСписокПомещений(),Элементы.Помещение,0);	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПомещений() 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СкладскиеПомещения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладскиеПомещения КАК СкладскиеПомещения
	|ГДЕ
	|   1=1");
	
	Если ЗначениеЗаполнено(Объект.Склад) тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"1=1","СкладскиеПомещения.Владелец = &ТекущийСклад");
		Запрос.УстановитьПараметр("ТекущийСклад",Объект.Склад);
	КонецЕсли;
	
	
	СписокВозврата = Новый СписокЗначений;
	СписокВозврата.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Возврат СписокВозврата;
	
КонецФункции

&Наклиенте
Процедура ЗакрытиеВыбораПомещения(Результат, ДопПараметры) Экспорт
	
	Если Результат<>Неопределено тогда 
		Попытка Объект.Помещение = Результат.Значение; Исключение КонецПопытки;
	КонецЕсли;	
	
КонецПроцедуры

#Область ВкладкиПодборРазмещениеГрупповаяРабота

//механизм переключения видимости вкладок.
&НаСервереБезКонтекста
Функция РеквизитГрупповаяРабота(Шаблон)
	
	Возврат Шаблон.ГрупповаяРабота;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьВидимостьВкладокПодборРазмещение()   
	
	Если ЗначениеЗаполнено(Объект.ДатаЗавершения) Тогда
		ВключенаГрупповаяРабота = Ложь;
	КонецЕсли;	
	
	Элементы.ГрПодбор.Видимость = НЕ ВключенаГрупповаяРабота;
	Элементы.ГрРазмещение.Видимость = НЕ ВключенаГрупповаяРабота;
	Элементы.ГрПодборГрупповаяРабота.Видимость = ВключенаГрупповаяРабота;
	Элементы.ГрРазмещениеГрупповаяРабота.Видимость = ВключенаГрупповаяРабота;     
	
	УстановитьОтборыСписковСтрокГрупповойРаботы(ВключенаГрупповаяРабота);	              	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыСписковСтрокГрупповойРаботы(ВключенаГрупповаяРабота)
	
	Если ВключенаГрупповаяРабота Тогда
		СписокСтрокПодбораГрупповаяРабота.Параметры.УстановитьЗначениеПараметра("ДокументТСД", Объект.Ссылка);
		СписокСтрокРазмещенияГрупповаяРабота.Параметры.УстановитьЗначениеПараметра("ДокументТСД", Объект.Ссылка);
	Иначе
		СписокСтрокПодбораГрупповаяРабота.Параметры.УстановитьЗначениеПараметра("ДокументТСД", Справочники.ДатаМобайл_ДокументыТСД.ПустаяСсылка());
		СписокСтрокРазмещенияГрупповаяРабота.Параметры.УстановитьЗначениеПараметра("ДокументТСД", Справочники.ДатаМобайл_ДокументыТСД.ПустаяСсылка());   
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
