#Область СлужебныйПрограммныйИнтерфейс

Функция МожноПодключитьОбсуждения() Экспорт
	
	Возврат ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Обсуждения");
	
КонецФункции

Функция ОбсужденияПодключены() Экспорт
	
	Если МожноПодключитьОбсуждения() Тогда
		МодульОбсуждения = ОбщегоНазначения.ОбщийМодуль("Обсуждения");
		Возврат МодульОбсуждения.ОбсужденияДоступны();
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ДатаНачалаСверкиРасчетов() Экспорт
	
	Возврат СервисСверкиРасчетов.ДатаНачалаСверкиРасчетов();
	
КонецФункции

// Формирует отчет по переданным параметрам.
//
// Параметры:
//	ПараметрыОтчета - Структура - содержит ключи:
//		* ИдентификаторОтчета - Строка - Имя отчета, как оно указано в метаданных.
//		* СхемаКомпоновкиДанных - СхемаКомпоновкиДанных - Схема отчета.
//		* НастройкиКомпоновкиДанных - НастройкиКомпоновкиДанных - Настройки отчета.
//
// Возвращаемое значение:
//   Структура   - содержит ключи:
//      * Результат - ТабличныйДокумент - сформированный отчет.
//      * ДанныеРасшифровки - Строка - адрес во временном хранилище, куда помещены данные расшифровок.
//      * КонтрольноеСоотношениеИтоговВыполняется - Булево - Ложь, если проверка проводилась и была неуспешна; иначе Истина.
//
Функция ПодготовитьОтчет(ПараметрыОтчета) Экспорт
	
	Возврат СервисСверкиРасчетовПереопределяемый.ПодготовитьОтчет(ПараметрыОтчета);
	
КонецФункции

// Возвращает признак подключена сверка для организации или нет
//
// Входящие параметры:
// 	- Организация - СправочникСсылка.Организации
// 	- Дата - Дата
// Возвращаемое значение:
// 	Булево - Истина - для организации подключена сверка
// 	       - Ложь   - для организации не подключена сверка
//
Функция ОрганизацияПодключена(Организация, Дата) Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользуетсяСервисСверкиРасчетов")
		И БизнесСеть.ОрганизацияПодключена(Организация);
		
КонецФункции

Функция ТекстБаннераСервисСверкиРасчетовКнигаПокупок() Экспорт
	
	Возврат СервисСверкиРасчетов.ТекстБаннераСервисСверкиРасчетовКнигаПокупок();
	
КонецФункции

Функция ТекстБаннераСервисСверкиРасчетовКнигаПродаж() Экспорт
	
	Возврат СервисСверкиРасчетов.ТекстБаннераСервисСверкиРасчетовКнигаПродаж();
	
КонецФункции

Функция ТекстБаннераСервисСверкиРасчетовДекларацияПоНДС() Экспорт
	
	Возврат СервисСверкиРасчетов.ТекстБаннераСервисСверкиРасчетовДекларацияПоНДС();
	
КонецФункции

Функция ТекстБаннераСервисСверкиРасчетовПомощникРасчетаНДС() Экспорт
	
	Возврат СервисСверкиРасчетов.ТекстБаннераСервисСверкиРасчетовПомощникРасчетаНДС();
	
КонецФункции

Функция КартинкаБаннераСервисаСверкиРасчетов() Экспорт
	
	Возврат СервисСверкиРасчетовПереопределяемый.КартинкаЛоготипаПомощника();
	
КонецФункции

Функция ЦветФонаБаннеровСервисаСверкиРасчетов() Экспорт
	
	Возврат СервисСверкиРасчетов.ЦветФонаБаннеровСервисаСверкиРасчетов();
	
КонецФункции

Функция ОповещенияСверкиВключены() Экспорт
	
	Возврат ОбсужденияПодключены() 
		И Справочники.СервисСверкиРасчетовНастройкиОповещенийПользователей.ОповещенияВключены();
	
КонецФункции

Функция КлючНастройкиОповещенийТекущегоПользователя() Экспорт
	
	Возврат Справочники.СервисСверкиРасчетовНастройкиОповещенийПользователей.КлючНастройкиОповещенийТекущегоПользователя();
	
КонецФункции

Функция КлючГлобальнойНастройкиОповещений() Экспорт
	
	Возврат Справочники.СервисСверкиРасчетовНастройкиОповещенийПользователей.КлючГлобальнойНастройкиОповещений();
	
КонецФункции

Функция ВключитьОповещениеСверки() Экспорт
	
	Возврат Справочники.СервисСверкиРасчетовНастройкиОповещенийПользователей.ВключитьОповещения();
	
КонецФункции

Функция ВыключитьОповещениеСверки() Экспорт
	
	Возврат Справочники.СервисСверкиРасчетовНастройкиОповещенийПользователей.ВыключитьОповещения();
	
КонецФункции

#КонецОбласти
