
&После("ПередЗаписью")
Процедура асп_ПередЗаписью(Отказ)
	
	Если Отказ Или Не ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Партнер = Справочники.Партнеры.НеизвестныйПартнер
	 И Не ДополнительныеСвойства.Свойство("ОбменССайтамиУТ")
	 И Не ДополнительныеСвойства.Свойство("ЗагрузкаСБитрикс24") Тогда
		
		КомментарийКЗаписи = "Блокирована попытка записи контрагента \" + Наименование + "\ с привязкой к объекту Неизвестный партнер";
		ЗаписьЖурналаРегистрации("Обмен данными.Дополнительный контроль",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.Контрагенты,
			,
			КомментарийКЗаписи);
		
		ВызватьИсключение "Создание контрагентов (" + Наименование + ") с привязкой к объекту ""Неизвестный партнер"" запрещено";
		
	КонецЕсли;
	
	Если ЭтотОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ПустаяСсылка() Тогда
		ЭтотОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
	КонецЕсли;
	
	//+++ {{ ASP 19.08.2020 000008183 }}
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = НаименованиеПолное;
	КонецЕсли;
	//--- {{ ASP 19.08.2020 000008183 }}
	
КонецПроцедуры