
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ЗаписьРегистра Из ЭтотОбъект Цикл

		Если ЗаписьРегистра.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номенклатура не может быть услугой!");
		КонецЕсли;

		Если ЗаписьРегистра.Комплектующая.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Комплектующая не может быть услугой!");
		КонецЕсли;
		
		Если (ЗаписьРегистра.Комплектующая = ЗаписьРегистра.Номенклатура) И ЗначениеЗаполнено(ЗаписьРегистра.Номенклатура) Тогда
		   	Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Номенклатура не может совпадать с комплектующей!");
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры





