
&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПеренестиВДокумент = Истина;
	Закрыть(КодВозвратаДиалога.ОК);
КонецПроцедуры

&НаКлиенте
Процедура ДокументСписокЗаказыПокупателейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ДобавитьЗаказВВыбранные(ВыбраннаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаказВВыбранные(Ссылка)
	Выбрано.Добавить().ЗаказПокупателя = Ссылка;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Если НЕ ПеренестиВДокумент тогда возврат конецесли;
	
	АдресЗаказовВХранилище = ПеренестиЗаказыВХранилище();
	Структура = Новый Структура("АдресЗаказовВХранилище", АдресЗаказовВХранилище);
	
	ОповеститьОВыборе(Структура);
	
КонецПроцедуры

//
&НаСервере
Функция  ПеренестиЗаказыВХранилище()
	
	Заказы = Выбрано.Выгрузить();
	Адрес = ПоместитьВоВременноеХранилище(Заказы, УникальныйИдентификатор);
	
	возврат Адрес;
	
КонецФункции
